gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define SIO_INTERP1_CTRL_LANE1_MASK_LSB_ACCESS "RW"
#define SIO_INTERP1_CTRL_LANE1_SHIFT_RESET 0x00u
#define SIO_INTERP1_CTRL_LANE1_SHIFT_BITS 0x0000001fu
#define SIO_INTERP1_CTRL_LANE1_SHIFT_MSB 4u
#define SIO_INTERP1_CTRL_LANE1_SHIFT_LSB 0u
#define SIO_INTERP1_CTRL_LANE1_SHIFT_ACCESS "RW"
#define SIO_INTERP1_ACCUM0_ADD_OFFSET 0x000000f4u
#define SIO_INTERP1_ACCUM0_ADD_BITS 0x00ffffffu
#define SIO_INTERP1_ACCUM0_ADD_RESET 0x00000000u
#define SIO_INTERP1_ACCUM0_ADD_MSB 23u
#define SIO_INTERP1_ACCUM0_ADD_LSB 0u
#define SIO_INTERP1_ACCUM0_ADD_ACCESS "RW"
#define SIO_INTERP1_ACCUM1_ADD_OFFSET 0x000000f8u
#define SIO_INTERP1_ACCUM1_ADD_BITS 0x00ffffffu
#define SIO_INTERP1_ACCUM1_ADD_RESET 0x00000000u
#define SIO_INTERP1_ACCUM1_ADD_MSB 23u
#define SIO_INTERP1_ACCUM1_ADD_LSB 0u
#define SIO_INTERP1_ACCUM1_ADD_ACCESS "RW"
#define SIO_INTERP1_BASE_1AND0_OFFSET 0x000000fcu
#define SIO_INTERP1_BASE_1AND0_BITS 0xffffffffu
#define SIO_INTERP1_BASE_1AND0_RESET 0x00000000u
#define SIO_INTERP1_BASE_1AND0_MSB 31u
#define SIO_INTERP1_BASE_1AND0_LSB 0u
#define SIO_INTERP1_BASE_1AND0_ACCESS "WO"
#define SIO_SPINLOCK0_OFFSET 0x00000100u
#define SIO_SPINLOCK0_BITS 0xffffffffu
#define SIO_SPINLOCK0_RESET 0x00000000u
#define SIO_SPINLOCK0_MSB 31u
#define SIO_SPINLOCK0_LSB 0u
#define SIO_SPINLOCK0_ACCESS "RW"
#define SIO_SPINLOCK1_OFFSET 0x00000104u
#define SIO_SPINLOCK1_BITS 0xffffffffu
#define SIO_SPINLOCK1_RESET 0x00000000u
#define SIO_SPINLOCK1_MSB 31u
#define SIO_SPINLOCK1_LSB 0u
#define SIO_SPINLOCK1_ACCESS "RW"
#define SIO_SPINLOCK2_OFFSET 0x00000108u
#define SIO_SPINLOCK2_BITS 0xffffffffu
#define SIO_SPINLOCK2_RESET 0x00000000u
#define SIO_SPINLOCK2_MSB 31u
#define SIO_SPINLOCK2_LSB 0u
#define SIO_SPINLOCK2_ACCESS "RW"
#define SIO_SPINLOCK3_OFFSET 0x0000010cu
#define SIO_SPINLOCK3_BITS 0xffffffffu
#define SIO_SPINLOCK3_RESET 0x00000000u
#define SIO_SPINLOCK3_MSB 31u
#define SIO_SPINLOCK3_LSB 0u
#define SIO_SPINLOCK3_ACCESS "RW"
#define SIO_SPINLOCK4_OFFSET 0x00000110u
#define SIO_SPINLOCK4_BITS 0xffffffffu
#define SIO_SPINLOCK4_RESET 0x00000000u
#define SIO_SPINLOCK4_MSB 31u
#define SIO_SPINLOCK4_LSB 0u
#define SIO_SPINLOCK4_ACCESS "RW"
#define SIO_SPINLOCK5_OFFSET 0x00000114u
#define SIO_SPINLOCK5_BITS 0xffffffffu
#define SIO_SPINLOCK5_RESET 0x00000000u
#define SIO_SPINLOCK5_MSB 31u
#define SIO_SPINLOCK5_LSB 0u
#define SIO_SPINLOCK5_ACCESS "RW"
#define SIO_SPINLOCK6_OFFSET 0x00000118u
#define SIO_SPINLOCK6_BITS 0xffffffffu
#define SIO_SPINLOCK6_RESET 0x00000000u
#define SIO_SPINLOCK6_MSB 31u
#define SIO_SPINLOCK6_LSB 0u
#define SIO_SPINLOCK6_ACCESS "RW"
#define SIO_SPINLOCK7_OFFSET 0x0000011cu
#define SIO_SPINLOCK7_BITS 0xffffffffu
#define SIO_SPINLOCK7_RESET 0x00000000u
#define SIO_SPINLOCK7_MSB 31u
#define SIO_SPINLOCK7_LSB 0u
#define SIO_SPINLOCK7_ACCESS "RW"
#define SIO_SPINLOCK8_OFFSET 0x00000120u
#define SIO_SPINLOCK8_BITS 0xffffffffu
#define SIO_SPINLOCK8_RESET 0x00000000u
#define SIO_SPINLOCK8_MSB 31u
#define SIO_SPINLOCK8_LSB 0u
#define SIO_SPINLOCK8_ACCESS "RW"
#define SIO_SPINLOCK9_OFFSET 0x00000124u
#define SIO_SPINLOCK9_BITS 0xffffffffu
#define SIO_SPINLOCK9_RESET 0x00000000u
#define SIO_SPINLOCK9_MSB 31u
#define SIO_SPINLOCK9_LSB 0u
#define SIO_SPINLOCK9_ACCESS "RW"
#define SIO_SPINLOCK10_OFFSET 0x00000128u
#define SIO_SPINLOCK10_BITS 0xffffffffu
#define SIO_SPINLOCK10_RESET 0x00000000u
#define SIO_SPINLOCK10_MSB 31u
#define SIO_SPINLOCK10_LSB 0u
#define SIO_SPINLOCK10_ACCESS "RW"
#define SIO_SPINLOCK11_OFFSET 0x0000012cu
#define SIO_SPINLOCK11_BITS 0xffffffffu
#define SIO_SPINLOCK11_RESET 0x00000000u
#define SIO_SPINLOCK11_MSB 31u
#define SIO_SPINLOCK11_LSB 0u
#define SIO_SPINLOCK11_ACCESS "RW"
#define SIO_SPINLOCK12_OFFSET 0x00000130u
#define SIO_SPINLOCK12_BITS 0xffffffffu
#define SIO_SPINLOCK12_RESET 0x00000000u
#define SIO_SPINLOCK12_MSB 31u
#define SIO_SPINLOCK12_LSB 0u
#define SIO_SPINLOCK12_ACCESS "RW"
#define SIO_SPINLOCK13_OFFSET 0x00000134u
#define SIO_SPINLOCK13_BITS 0xffffffffu
#define SIO_SPINLOCK13_RESET 0x00000000u
#define SIO_SPINLOCK13_MSB 31u
#define SIO_SPINLOCK13_LSB 0u
#define SIO_SPINLOCK13_ACCESS "RW"
#define SIO_SPINLOCK14_OFFSET 0x00000138u
#define SIO_SPINLOCK14_BITS 0xffffffffu
#define SIO_SPINLOCK14_RESET 0x00000000u
#define SIO_SPINLOCK14_MSB 31u
#define SIO_SPINLOCK14_LSB 0u
#define SIO_SPINLOCK14_ACCESS "RW"
#define SIO_SPINLOCK15_OFFSET 0x0000013cu
#define SIO_SPINLOCK15_BITS 0xffffffffu
#define SIO_SPINLOCK15_RESET 0x00000000u
#define SIO_SPINLOCK15_MSB 31u
#define SIO_SPINLOCK15_LSB 0u
#define SIO_SPINLOCK15_ACCESS "RW"
#define SIO_SPINLOCK16_OFFSET 0x00000140u
#define SIO_SPINLOCK16_BITS 0xffffffffu
#define SIO_SPINLOCK16_RESET 0x00000000u
#define SIO_SPINLOCK16_MSB 31u
#define SIO_SPINLOCK16_LSB 0u
#define SIO_SPINLOCK16_ACCESS "RW"
#define SIO_SPINLOCK17_OFFSET 0x00000144u
#define SIO_SPINLOCK17_BITS 0xffffffffu
#define SIO_SPINLOCK17_RESET 0x00000000u
#define SIO_SPINLOCK17_MSB 31u
#define SIO_SPINLOCK17_LSB 0u
#define SIO_SPINLOCK17_ACCESS "RW"
#define SIO_SPINLOCK18_OFFSET 0x00000148u
#define SIO_SPINLOCK18_BITS 0xffffffffu
#define SIO_SPINLOCK18_RESET 0x00000000u
#define SIO_SPINLOCK18_MSB 31u
#define SIO_SPINLOCK18_LSB 0u
#define SIO_SPINLOCK18_ACCESS "RW"
#define SIO_SPINLOCK19_OFFSET 0x0000014cu
#define SIO_SPINLOCK19_BITS 0xffffffffu
#define SIO_SPINLOCK19_RESET 0x00000000u
#define SIO_SPINLOCK19_MSB 31u
#define SIO_SPINLOCK19_LSB 0u
#define SIO_SPINLOCK19_ACCESS "RW"
#define SIO_SPINLOCK20_OFFSET 0x00000150u
#define SIO_SPINLOCK20_BITS 0xffffffffu
#define SIO_SPINLOCK20_RESET 0x00000000u
#define SIO_SPINLOCK20_MSB 31u
#define SIO_SPINLOCK20_LSB 0u
#define SIO_SPINLOCK20_ACCESS "RW"
#define SIO_SPINLOCK21_OFFSET 0x00000154u
#define SIO_SPINLOCK21_BITS 0xffffffffu
#define SIO_SPINLOCK21_RESET 0x00000000u
#define SIO_SPINLOCK21_MSB 31u
#define SIO_SPINLOCK21_LSB 0u
#define SIO_SPINLOCK21_ACCESS "RW"
#define SIO_SPINLOCK22_OFFSET 0x00000158u
#define SIO_SPINLOCK22_BITS 0xffffffffu
#define SIO_SPINLOCK22_RESET 0x00000000u
#define SIO_SPINLOCK22_MSB 31u
#define SIO_SPINLOCK22_LSB 0u
#define SIO_SPINLOCK22_ACCESS "RW"
#define SIO_SPINLOCK23_OFFSET 0x0000015cu
#define SIO_SPINLOCK23_BITS 0xffffffffu
#define SIO_SPINLOCK23_RESET 0x00000000u
#define SIO_SPINLOCK23_MSB 31u
#define SIO_SPINLOCK23_LSB 0u
#define SIO_SPINLOCK23_ACCESS "RW"
#define SIO_SPINLOCK24_OFFSET 0x00000160u
#define SIO_SPINLOCK24_BITS 0xffffffffu
#define SIO_SPINLOCK24_RESET 0x00000000u
#define SIO_SPINLOCK24_MSB 31u
#define SIO_SPINLOCK24_LSB 0u
#define SIO_SPINLOCK24_ACCESS "RW"
#define SIO_SPINLOCK25_OFFSET 0x00000164u
#define SIO_SPINLOCK25_BITS 0xffffffffu
#define SIO_SPINLOCK25_RESET 0x00000000u
#define SIO_SPINLOCK25_MSB 31u
#define SIO_SPINLOCK25_LSB 0u
#define SIO_SPINLOCK25_ACCESS "RW"
#define SIO_SPINLOCK26_OFFSET 0x00000168u
#define SIO_SPINLOCK26_BITS 0xffffffffu
#define SIO_SPINLOCK26_RESET 0x00000000u
#define SIO_SPINLOCK26_MSB 31u
#define SIO_SPINLOCK26_LSB 0u
#define SIO_SPINLOCK26_ACCESS "RW"
#define SIO_SPINLOCK27_OFFSET 0x0000016cu
#define SIO_SPINLOCK27_BITS 0xffffffffu
#define SIO_SPINLOCK27_RESET 0x00000000u
#define SIO_SPINLOCK27_MSB 31u
#define SIO_SPINLOCK27_LSB 0u
#define SIO_SPINLOCK27_ACCESS "RW"
#define SIO_SPINLOCK28_OFFSET 0x00000170u
#define SIO_SPINLOCK28_BITS 0xffffffffu
#define SIO_SPINLOCK28_RESET 0x00000000u
#define SIO_SPINLOCK28_MSB 31u
#define SIO_SPINLOCK28_LSB 0u
#define SIO_SPINLOCK28_ACCESS "RW"
#define SIO_SPINLOCK29_OFFSET 0x00000174u
#define SIO_SPINLOCK29_BITS 0xffffffffu
#define SIO_SPINLOCK29_RESET 0x00000000u
#define SIO_SPINLOCK29_MSB 31u
#define SIO_SPINLOCK29_LSB 0u
#define SIO_SPINLOCK29_ACCESS "RW"
#define SIO_SPINLOCK30_OFFSET 0x00000178u
#define SIO_SPINLOCK30_BITS 0xffffffffu
#define SIO_SPINLOCK30_RESET 0x00000000u
#define SIO_SPINLOCK30_MSB 31u
#define SIO_SPINLOCK30_LSB 0u
#define SIO_SPINLOCK30_ACCESS "RW"
#define SIO_SPINLOCK31_OFFSET 0x0000017cu
#define SIO_SPINLOCK31_BITS 0xffffffffu
#define SIO_SPINLOCK31_RESET 0x00000000u
#define SIO_SPINLOCK31_MSB 31u
#define SIO_SPINLOCK31_LSB 0u
#define SIO_SPINLOCK31_ACCESS "RW"
#define SIO_DOORBELL_OUT_SET_OFFSET 0x00000180u
#define SIO_DOORBELL_OUT_SET_BITS 0x000000ffu
#define SIO_DOORBELL_OUT_SET_RESET 0x00000000u
#define SIO_DOORBELL_OUT_SET_MSB 7u
#define SIO_DOORBELL_OUT_SET_LSB 0u
#define SIO_DOORBELL_OUT_SET_ACCESS "RW"
#define SIO_DOORBELL_OUT_CLR_OFFSET 0x00000184u
#define SIO_DOORBELL_OUT_CLR_BITS 0x000000ffu
#define SIO_DOORBELL_OUT_CLR_RESET 0x00000000u
#define SIO_DOORBELL_OUT_CLR_MSB 7u
#define SIO_DOORBELL_OUT_CLR_LSB 0u
#define SIO_DOORBELL_OUT_CLR_ACCESS "WC"
#define SIO_DOORBELL_IN_SET_OFFSET 0x00000188u
#define SIO_DOORBELL_IN_SET_BITS 0x000000ffu
#define SIO_DOORBELL_IN_SET_RESET 0x00000000u
#define SIO_DOORBELL_IN_SET_MSB 7u
#define SIO_DOORBELL_IN_SET_LSB 0u
#define SIO_DOORBELL_IN_SET_ACCESS "RW"
#define SIO_DOORBELL_IN_CLR_OFFSET 0x0000018cu
#define SIO_DOORBELL_IN_CLR_BITS 0x000000ffu
#define SIO_DOORBELL_IN_CLR_RESET 0x00000000u
#define SIO_DOORBELL_IN_CLR_MSB 7u
#define SIO_DOORBELL_IN_CLR_LSB 0u
#define SIO_DOORBELL_IN_CLR_ACCESS "WC"
#define SIO_PERI_NONSEC_OFFSET 0x00000190u
#define SIO_PERI_NONSEC_BITS 0x00000023u
#define SIO_PERI_NONSEC_RESET 0x00000000u
#define SIO_PERI_NONSEC_TMDS_RESET 0x0u
#define SIO_PERI_NONSEC_TMDS_BITS 0x00000020u
#define SIO_PERI_NONSEC_TMDS_MSB 5u
#define SIO_PERI_NONSEC_TMDS_LSB 5u
#define SIO_PERI_NONSEC_TMDS_ACCESS "RW"
#define SIO_PERI_NONSEC_INTERP1_RESET 0x0u
#define SIO_PERI_NONSEC_INTERP1_BITS 0x00000002u
#define SIO_PERI_NONSEC_INTERP1_MSB 1u
#define SIO_PERI_NONSEC_INTERP1_LSB 1u
#define SIO_PERI_NONSEC_INTERP1_ACCESS "RW"
#define SIO_PERI_NONSEC_INTERP0_RESET 0x0u
#define SIO_PERI_NONSEC_INTERP0_BITS 0x00000001u
#define SIO_PERI_NONSEC_INTERP0_MSB 0u
#define SIO_PERI_NONSEC_INTERP0_LSB 0u
#define SIO_PERI_NONSEC_INTERP0_ACCESS "RW"
#define SIO_RISCV_SOFTIRQ_OFFSET 0x000001a0u
#define SIO_RISCV_SOFTIRQ_BITS 0x00000303u
#define SIO_RISCV_SOFTIRQ_RESET 0x00000000u
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_RESET 0x0u
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_BITS 0x00000200u
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_MSB 9u
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_LSB 9u
#define SIO_RISCV_SOFTIRQ_CORE1_CLR_ACCESS "RW"
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_RESET 0x0u
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_BITS 0x00000100u
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_MSB 8u
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_LSB 8u
#define SIO_RISCV_SOFTIRQ_CORE0_CLR_ACCESS "RW"
#define SIO_RISCV_SOFTIRQ_CORE1_SET_RESET 0x0u
#define SIO_RISCV_SOFTIRQ_CORE1_SET_BITS 0x00000002u
#define SIO_RISCV_SOFTIRQ_CORE1_SET_MSB 1u
#define SIO_RISCV_SOFTIRQ_CORE1_SET_LSB 1u
#define SIO_RISCV_SOFTIRQ_CORE1_SET_ACCESS "RW"
#define SIO_RISCV_SOFTIRQ_CORE0_SET_RESET 0x0u
#define SIO_RISCV_SOFTIRQ_CORE0_SET_BITS 0x00000001u
#define SIO_RISCV_SOFTIRQ_CORE0_SET_MSB 0u
#define SIO_RISCV_SOFTIRQ_CORE0_SET_LSB 0u
#define SIO_RISCV_SOFTIRQ_CORE0_SET_ACCESS "RW"
#define SIO_MTIME_CTRL_OFFSET 0x000001a4u
#define SIO_MTIME_CTRL_BITS 0x0000000fu
#define SIO_MTIME_CTRL_RESET 0x0000000du
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_RESET 0x1u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_BITS 0x00000008u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_MSB 3u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_LSB 3u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1_ACCESS "RW"
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_RESET 0x1u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_BITS 0x00000004u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_MSB 2u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_LSB 2u
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0_ACCESS "RW"
#define SIO_MTIME_CTRL_FULLSPEED_RESET 0x0u
#define SIO_MTIME_CTRL_FULLSPEED_BITS 0x00000002u
#define SIO_MTIME_CTRL_FULLSPEED_MSB 1u
#define SIO_MTIME_CTRL_FULLSPEED_LSB 1u
#define SIO_MTIME_CTRL_FULLSPEED_ACCESS "RW"
#define SIO_MTIME_CTRL_EN_RESET 0x1u
#define SIO_MTIME_CTRL_EN_BITS 0x00000001u
#define SIO_MTIME_CTRL_EN_MSB 0u
#define SIO_MTIME_CTRL_EN_LSB 0u
#define SIO_MTIME_CTRL_EN_ACCESS "RW"
#define SIO_MTIME_OFFSET 0x000001b0u
#define SIO_MTIME_BITS 0xffffffffu
#define SIO_MTIME_RESET 0x00000000u
#define SIO_MTIME_MSB 31u
#define SIO_MTIME_LSB 0u
#define SIO_MTIME_ACCESS "RW"
#define SIO_MTIMEH_OFFSET 0x000001b4u
#define SIO_MTIMEH_BITS 0xffffffffu
#define SIO_MTIMEH_RESET 0x00000000u
#define SIO_MTIMEH_MSB 31u
#define SIO_MTIMEH_LSB 0u
#define SIO_MTIMEH_ACCESS "RW"
#define SIO_MTIMECMP_OFFSET 0x000001b8u
#define SIO_MTIMECMP_BITS 0xffffffffu
#define SIO_MTIMECMP_RESET 0xffffffffu
#define SIO_MTIMECMP_MSB 31u
#define SIO_MTIMECMP_LSB 0u
#define SIO_MTIMECMP_ACCESS "RW"
#define SIO_MTIMECMPH_OFFSET 0x000001bcu
#define SIO_MTIMECMPH_BITS 0xffffffffu
#define SIO_MTIMECMPH_RESET 0xffffffffu
#define SIO_MTIMECMPH_MSB 31u
#define SIO_MTIMECMPH_LSB 0u
#define SIO_MTIMECMPH_ACCESS "RW"
#define SIO_TMDS_CTRL_OFFSET 0x000001c0u
#define SIO_TMDS_CTRL_BITS 0x1f9fffffu
#define SIO_TMDS_CTRL_RESET 0x00000000u
#define SIO_TMDS_CTRL_CLEAR_BALANCE_RESET 0x0u
#define SIO_TMDS_CTRL_CLEAR_BALANCE_BITS 0x10000000u
#define SIO_TMDS_CTRL_CLEAR_BALANCE_MSB 28u
#define SIO_TMDS_CTRL_CLEAR_BALANCE_LSB 28u
#define SIO_TMDS_CTRL_CLEAR_BALANCE_ACCESS "SC"
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_RESET 0x0u
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_BITS 0x08000000u
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_MSB 27u
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_LSB 27u
#define SIO_TMDS_CTRL_PIX2_NOSHIFT_ACCESS "RW"
#define SIO_TMDS_CTRL_PIX_SHIFT_RESET 0x0u
#define SIO_TMDS_CTRL_PIX_SHIFT_BITS 0x07000000u
#define SIO_TMDS_CTRL_PIX_SHIFT_MSB 26u
#define SIO_TMDS_CTRL_PIX_SHIFT_LSB 24u
#define SIO_TMDS_CTRL_PIX_SHIFT_ACCESS "RW"
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_0 0x0u
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_1 0x1u
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_2 0x2u
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_4 0x3u
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_8 0x4u
#define SIO_TMDS_CTRL_PIX_SHIFT_VALUE_16 0x5u
#define SIO_TMDS_CTRL_INTERLEAVE_RESET 0x0u
#define SIO_TMDS_CTRL_INTERLEAVE_BITS 0x00800000u
#define SIO_TMDS_CTRL_INTERLEAVE_MSB 23u
#define SIO_TMDS_CTRL_INTERLEAVE_LSB 23u
#define SIO_TMDS_CTRL_INTERLEAVE_ACCESS "RW"
#define SIO_TMDS_CTRL_L2_NBITS_RESET 0x0u
#define SIO_TMDS_CTRL_L2_NBITS_BITS 0x001c0000u
#define SIO_TMDS_CTRL_L2_NBITS_MSB 20u
#define SIO_TMDS_CTRL_L2_NBITS_LSB 18u
#define SIO_TMDS_CTRL_L2_NBITS_ACCESS "RW"
#define SIO_TMDS_CTRL_L1_NBITS_RESET 0x0u
#define SIO_TMDS_CTRL_L1_NBITS_BITS 0x00038000u
#define SIO_TMDS_CTRL_L1_NBITS_MSB 17u
#define SIO_TMDS_CTRL_L1_NBITS_LSB 15u
#define SIO_TMDS_CTRL_L1_NBITS_ACCESS "RW"
#define SIO_TMDS_CTRL_L0_NBITS_RESET 0x0u
#define SIO_TMDS_CTRL_L0_NBITS_BITS 0x00007000u
#define SIO_TMDS_CTRL_L0_NBITS_MSB 14u
#define SIO_TMDS_CTRL_L0_NBITS_LSB 12u
#define SIO_TMDS_CTRL_L0_NBITS_ACCESS "RW"
#define SIO_TMDS_CTRL_L2_ROT_RESET 0x0u
#define SIO_TMDS_CTRL_L2_ROT_BITS 0x00000f00u
#define SIO_TMDS_CTRL_L2_ROT_MSB 11u
#define SIO_TMDS_CTRL_L2_ROT_LSB 8u
#define SIO_TMDS_CTRL_L2_ROT_ACCESS "RW"
#define SIO_TMDS_CTRL_L1_ROT_RESET 0x0u
#define SIO_TMDS_CTRL_L1_ROT_BITS 0x000000f0u
#define SIO_TMDS_CTRL_L1_ROT_MSB 7u
#define SIO_TMDS_CTRL_L1_ROT_LSB 4u
#define SIO_TMDS_CTRL_L1_ROT_ACCESS "RW"
#define SIO_TMDS_CTRL_L0_ROT_RESET 0x0u
#define SIO_TMDS_CTRL_L0_ROT_BITS 0x0000000fu
#define SIO_TMDS_CTRL_L0_ROT_MSB 3u
#define SIO_TMDS_CTRL_L0_ROT_LSB 0u
#define SIO_TMDS_CTRL_L0_ROT_ACCESS "RW"
#define SIO_TMDS_WDATA_OFFSET 0x000001c4u
#define SIO_TMDS_WDATA_BITS 0xffffffffu
#define SIO_TMDS_WDATA_RESET 0x00000000u
#define SIO_TMDS_WDATA_MSB 31u
#define SIO_TMDS_WDATA_LSB 0u
#define SIO_TMDS_WDATA_ACCESS "WO"
#define SIO_TMDS_PEEK_SINGLE_OFFSET 0x000001c8u
#define SIO_TMDS_PEEK_SINGLE_BITS 0xffffffffu
#define SIO_TMDS_PEEK_SINGLE_RESET 0x00000000u
#define SIO_TMDS_PEEK_SINGLE_MSB 31u
#define SIO_TMDS_PEEK_SINGLE_LSB 0u
#define SIO_TMDS_PEEK_SINGLE_ACCESS "RF"
#define SIO_TMDS_POP_SINGLE_OFFSET 0x000001ccu
#define SIO_TMDS_POP_SINGLE_BITS 0xffffffffu
#define SIO_TMDS_POP_SINGLE_RESET 0x00000000u
#define SIO_TMDS_POP_SINGLE_MSB 31u
#define SIO_TMDS_POP_SINGLE_LSB 0u
#define SIO_TMDS_POP_SINGLE_ACCESS "RF"
#define SIO_TMDS_PEEK_DOUBLE_L0_OFFSET 0x000001d0u
#define SIO_TMDS_PEEK_DOUBLE_L0_BITS 0xffffffffu
#define SIO_TMDS_PEEK_DOUBLE_L0_RESET 0x00000000u
#define SIO_TMDS_PEEK_DOUBLE_L0_MSB 31u
#define SIO_TMDS_PEEK_DOUBLE_L0_LSB 0u
#define SIO_TMDS_PEEK_DOUBLE_L0_ACCESS "RF"
#define SIO_TMDS_POP_DOUBLE_L0_OFFSET 0x000001d4u
#define SIO_TMDS_POP_DOUBLE_L0_BITS 0xffffffffu
#define SIO_TMDS_POP_DOUBLE_L0_RESET 0x00000000u
#define SIO_TMDS_POP_DOUBLE_L0_MSB 31u
#define SIO_TMDS_POP_DOUBLE_L0_LSB 0u
#define SIO_TMDS_POP_DOUBLE_L0_ACCESS "RF"
#define SIO_TMDS_PEEK_DOUBLE_L1_OFFSET 0x000001d8u
#define SIO_TMDS_PEEK_DOUBLE_L1_BITS 0xffffffffu
#define SIO_TMDS_PEEK_DOUBLE_L1_RESET 0x00000000u
#define SIO_TMDS_PEEK_DOUBLE_L1_MSB 31u
#define SIO_TMDS_PEEK_DOUBLE_L1_LSB 0u
#define SIO_TMDS_PEEK_DOUBLE_L1_ACCESS "RF"
#define SIO_TMDS_POP_DOUBLE_L1_OFFSET 0x000001dcu
#define SIO_TMDS_POP_DOUBLE_L1_BITS 0xffffffffu
#define SIO_TMDS_POP_DOUBLE_L1_RESET 0x00000000u
#define SIO_TMDS_POP_DOUBLE_L1_MSB 31u
#define SIO_TMDS_POP_DOUBLE_L1_LSB 0u
#define SIO_TMDS_POP_DOUBLE_L1_ACCESS "RF"
#define SIO_TMDS_PEEK_DOUBLE_L2_OFFSET 0x000001e0u
#define SIO_TMDS_PEEK_DOUBLE_L2_BITS 0xffffffffu
#define SIO_TMDS_PEEK_DOUBLE_L2_RESET 0x00000000u
#define SIO_TMDS_PEEK_DOUBLE_L2_MSB 31u
#define SIO_TMDS_PEEK_DOUBLE_L2_LSB 0u
#define SIO_TMDS_PEEK_DOUBLE_L2_ACCESS "RF"
#define SIO_TMDS_POP_DOUBLE_L2_OFFSET 0x000001e4u
#define SIO_TMDS_POP_DOUBLE_L2_BITS 0xffffffffu
#define SIO_TMDS_POP_DOUBLE_L2_RESET 0x00000000u
#define SIO_TMDS_POP_DOUBLE_L2_MSB 31u
#define SIO_TMDS_POP_DOUBLE_L2_LSB 0u
#define SIO_TMDS_POP_DOUBLE_L2_ACCESS "RF"
#define PICO_STACK_SIZE 0x800u
#define PICO_HEAP_SIZE 0x800u
#define PICO_NO_RAM_VECTOR_TABLE 0
#define PICO_USE_STACK_GUARDS 0
#define PICO_CLKDIV_ROUND_NEAREST 1
static inline void busy_wait_at_least_cycles(uint32_t minimum_cycles) {
    __asm volatile (".syntax unified\n" "1: subs %0, #3\n" "bcs 1b\n" : "+r" (minimum_cycles) : : "cc", "memory");
}
static __inline__ __attribute__((__always_inline__)) void __breakpoint(void) {
    __asm volatile (".syntax unified\n" "bkpt #0" : : : "memory");
}
__inline__ __attribute__((__always_inline__)) static uint get_core_num(void) {
    return (*(uint32_t *) (0xd0000000u + 0x00000000u));
}
static __inline__ __attribute__((__always_inline__)) uint __get_current_exception(void) {
    uint exception;
    __asm volatile (".syntax unified\n" "mrs %0, ipsr\n" "uxtb %0, %0\n" : "=l" (exception));
    return exception;
}
__inline__ __attribute__((__always_inline__)) static _Bool pico_processor_state_is_nonsecure(void) {
    uint32_t tt;
    __asm volatile (".syntax unified\n" "movs %0, #0\n" "tt %0, %0\n" : "=r" (tt) : : "cc");
    return !(tt & (1u << 22));
}
uint8_t rp2350_chip_version(void);
static inline uint8_t rp2040_chip_version(void) {
    return 2;
}
static inline uint8_t rp2040_rom_version(void) {
    
#pragma GCC diagnostic push
    
