gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define ACCESSCTRL_SRAM7_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM7_SP_MSB 3u
#define ACCESSCTRL_SRAM7_SP_LSB 3u
#define ACCESSCTRL_SRAM7_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM7_SU_RESET 0x1u
#define ACCESSCTRL_SRAM7_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM7_SU_MSB 2u
#define ACCESSCTRL_SRAM7_SU_LSB 2u
#define ACCESSCTRL_SRAM7_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM7_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM7_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM7_NSP_MSB 1u
#define ACCESSCTRL_SRAM7_NSP_LSB 1u
#define ACCESSCTRL_SRAM7_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM7_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM7_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM7_NSU_MSB 0u
#define ACCESSCTRL_SRAM7_NSU_LSB 0u
#define ACCESSCTRL_SRAM7_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM8_OFFSET 0x0000003cu
#define ACCESSCTRL_SRAM8_BITS 0x000000ffu
#define ACCESSCTRL_SRAM8_RESET 0x000000ffu
#define ACCESSCTRL_SRAM8_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM8_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM8_DBG_MSB 7u
#define ACCESSCTRL_SRAM8_DBG_LSB 7u
#define ACCESSCTRL_SRAM8_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM8_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM8_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM8_DMA_MSB 6u
#define ACCESSCTRL_SRAM8_DMA_LSB 6u
#define ACCESSCTRL_SRAM8_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM8_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM8_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM8_CORE1_MSB 5u
#define ACCESSCTRL_SRAM8_CORE1_LSB 5u
#define ACCESSCTRL_SRAM8_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM8_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM8_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM8_CORE0_MSB 4u
#define ACCESSCTRL_SRAM8_CORE0_LSB 4u
#define ACCESSCTRL_SRAM8_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM8_SP_RESET 0x1u
#define ACCESSCTRL_SRAM8_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM8_SP_MSB 3u
#define ACCESSCTRL_SRAM8_SP_LSB 3u
#define ACCESSCTRL_SRAM8_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM8_SU_RESET 0x1u
#define ACCESSCTRL_SRAM8_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM8_SU_MSB 2u
#define ACCESSCTRL_SRAM8_SU_LSB 2u
#define ACCESSCTRL_SRAM8_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM8_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM8_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM8_NSP_MSB 1u
#define ACCESSCTRL_SRAM8_NSP_LSB 1u
#define ACCESSCTRL_SRAM8_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM8_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM8_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM8_NSU_MSB 0u
#define ACCESSCTRL_SRAM8_NSU_LSB 0u
#define ACCESSCTRL_SRAM8_NSU_ACCESS "RW"
#define ACCESSCTRL_SRAM9_OFFSET 0x00000040u
#define ACCESSCTRL_SRAM9_BITS 0x000000ffu
#define ACCESSCTRL_SRAM9_RESET 0x000000ffu
#define ACCESSCTRL_SRAM9_DBG_RESET 0x1u
#define ACCESSCTRL_SRAM9_DBG_BITS 0x00000080u
#define ACCESSCTRL_SRAM9_DBG_MSB 7u
#define ACCESSCTRL_SRAM9_DBG_LSB 7u
#define ACCESSCTRL_SRAM9_DBG_ACCESS "RW"
#define ACCESSCTRL_SRAM9_DMA_RESET 0x1u
#define ACCESSCTRL_SRAM9_DMA_BITS 0x00000040u
#define ACCESSCTRL_SRAM9_DMA_MSB 6u
#define ACCESSCTRL_SRAM9_DMA_LSB 6u
#define ACCESSCTRL_SRAM9_DMA_ACCESS "RW"
#define ACCESSCTRL_SRAM9_CORE1_RESET 0x1u
#define ACCESSCTRL_SRAM9_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SRAM9_CORE1_MSB 5u
#define ACCESSCTRL_SRAM9_CORE1_LSB 5u
#define ACCESSCTRL_SRAM9_CORE1_ACCESS "RW"
#define ACCESSCTRL_SRAM9_CORE0_RESET 0x1u
#define ACCESSCTRL_SRAM9_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SRAM9_CORE0_MSB 4u
#define ACCESSCTRL_SRAM9_CORE0_LSB 4u
#define ACCESSCTRL_SRAM9_CORE0_ACCESS "RW"
#define ACCESSCTRL_SRAM9_SP_RESET 0x1u
#define ACCESSCTRL_SRAM9_SP_BITS 0x00000008u
#define ACCESSCTRL_SRAM9_SP_MSB 3u
#define ACCESSCTRL_SRAM9_SP_LSB 3u
#define ACCESSCTRL_SRAM9_SP_ACCESS "RW"
#define ACCESSCTRL_SRAM9_SU_RESET 0x1u
#define ACCESSCTRL_SRAM9_SU_BITS 0x00000004u
#define ACCESSCTRL_SRAM9_SU_MSB 2u
#define ACCESSCTRL_SRAM9_SU_LSB 2u
#define ACCESSCTRL_SRAM9_SU_ACCESS "RW"
#define ACCESSCTRL_SRAM9_NSP_RESET 0x1u
#define ACCESSCTRL_SRAM9_NSP_BITS 0x00000002u
#define ACCESSCTRL_SRAM9_NSP_MSB 1u
#define ACCESSCTRL_SRAM9_NSP_LSB 1u
#define ACCESSCTRL_SRAM9_NSP_ACCESS "RW"
#define ACCESSCTRL_SRAM9_NSU_RESET 0x1u
#define ACCESSCTRL_SRAM9_NSU_BITS 0x00000001u
#define ACCESSCTRL_SRAM9_NSU_MSB 0u
#define ACCESSCTRL_SRAM9_NSU_LSB 0u
#define ACCESSCTRL_SRAM9_NSU_ACCESS "RW"
#define ACCESSCTRL_DMA_OFFSET 0x00000044u
#define ACCESSCTRL_DMA_BITS 0x000000ffu
#define ACCESSCTRL_DMA_RESET 0x000000fcu
#define ACCESSCTRL_DMA_DBG_RESET 0x1u
#define ACCESSCTRL_DMA_DBG_BITS 0x00000080u
#define ACCESSCTRL_DMA_DBG_MSB 7u
#define ACCESSCTRL_DMA_DBG_LSB 7u
#define ACCESSCTRL_DMA_DBG_ACCESS "RW"
#define ACCESSCTRL_DMA_DMA_RESET 0x1u
#define ACCESSCTRL_DMA_DMA_BITS 0x00000040u
#define ACCESSCTRL_DMA_DMA_MSB 6u
#define ACCESSCTRL_DMA_DMA_LSB 6u
#define ACCESSCTRL_DMA_DMA_ACCESS "RW"
#define ACCESSCTRL_DMA_CORE1_RESET 0x1u
#define ACCESSCTRL_DMA_CORE1_BITS 0x00000020u
#define ACCESSCTRL_DMA_CORE1_MSB 5u
#define ACCESSCTRL_DMA_CORE1_LSB 5u
#define ACCESSCTRL_DMA_CORE1_ACCESS "RW"
#define ACCESSCTRL_DMA_CORE0_RESET 0x1u
#define ACCESSCTRL_DMA_CORE0_BITS 0x00000010u
#define ACCESSCTRL_DMA_CORE0_MSB 4u
#define ACCESSCTRL_DMA_CORE0_LSB 4u
#define ACCESSCTRL_DMA_CORE0_ACCESS "RW"
#define ACCESSCTRL_DMA_SP_RESET 0x1u
#define ACCESSCTRL_DMA_SP_BITS 0x00000008u
#define ACCESSCTRL_DMA_SP_MSB 3u
#define ACCESSCTRL_DMA_SP_LSB 3u
#define ACCESSCTRL_DMA_SP_ACCESS "RW"
#define ACCESSCTRL_DMA_SU_RESET 0x1u
#define ACCESSCTRL_DMA_SU_BITS 0x00000004u
#define ACCESSCTRL_DMA_SU_MSB 2u
#define ACCESSCTRL_DMA_SU_LSB 2u
#define ACCESSCTRL_DMA_SU_ACCESS "RW"
#define ACCESSCTRL_DMA_NSP_RESET 0x0u
#define ACCESSCTRL_DMA_NSP_BITS 0x00000002u
#define ACCESSCTRL_DMA_NSP_MSB 1u
#define ACCESSCTRL_DMA_NSP_LSB 1u
#define ACCESSCTRL_DMA_NSP_ACCESS "RW"
#define ACCESSCTRL_DMA_NSU_RESET 0x0u
#define ACCESSCTRL_DMA_NSU_BITS 0x00000001u
#define ACCESSCTRL_DMA_NSU_MSB 0u
#define ACCESSCTRL_DMA_NSU_LSB 0u
#define ACCESSCTRL_DMA_NSU_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_OFFSET 0x00000048u
#define ACCESSCTRL_USBCTRL_BITS 0x000000ffu
#define ACCESSCTRL_USBCTRL_RESET 0x000000fcu
#define ACCESSCTRL_USBCTRL_DBG_RESET 0x1u
#define ACCESSCTRL_USBCTRL_DBG_BITS 0x00000080u
#define ACCESSCTRL_USBCTRL_DBG_MSB 7u
#define ACCESSCTRL_USBCTRL_DBG_LSB 7u
#define ACCESSCTRL_USBCTRL_DBG_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_DMA_RESET 0x1u
#define ACCESSCTRL_USBCTRL_DMA_BITS 0x00000040u
#define ACCESSCTRL_USBCTRL_DMA_MSB 6u
#define ACCESSCTRL_USBCTRL_DMA_LSB 6u
#define ACCESSCTRL_USBCTRL_DMA_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_CORE1_RESET 0x1u
#define ACCESSCTRL_USBCTRL_CORE1_BITS 0x00000020u
#define ACCESSCTRL_USBCTRL_CORE1_MSB 5u
#define ACCESSCTRL_USBCTRL_CORE1_LSB 5u
#define ACCESSCTRL_USBCTRL_CORE1_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_CORE0_RESET 0x1u
#define ACCESSCTRL_USBCTRL_CORE0_BITS 0x00000010u
#define ACCESSCTRL_USBCTRL_CORE0_MSB 4u
#define ACCESSCTRL_USBCTRL_CORE0_LSB 4u
#define ACCESSCTRL_USBCTRL_CORE0_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_SP_RESET 0x1u
#define ACCESSCTRL_USBCTRL_SP_BITS 0x00000008u
#define ACCESSCTRL_USBCTRL_SP_MSB 3u
#define ACCESSCTRL_USBCTRL_SP_LSB 3u
#define ACCESSCTRL_USBCTRL_SP_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_SU_RESET 0x1u
#define ACCESSCTRL_USBCTRL_SU_BITS 0x00000004u
#define ACCESSCTRL_USBCTRL_SU_MSB 2u
#define ACCESSCTRL_USBCTRL_SU_LSB 2u
#define ACCESSCTRL_USBCTRL_SU_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_NSP_RESET 0x0u
#define ACCESSCTRL_USBCTRL_NSP_BITS 0x00000002u
#define ACCESSCTRL_USBCTRL_NSP_MSB 1u
#define ACCESSCTRL_USBCTRL_NSP_LSB 1u
#define ACCESSCTRL_USBCTRL_NSP_ACCESS "RW"
#define ACCESSCTRL_USBCTRL_NSU_RESET 0x0u
#define ACCESSCTRL_USBCTRL_NSU_BITS 0x00000001u
#define ACCESSCTRL_USBCTRL_NSU_MSB 0u
#define ACCESSCTRL_USBCTRL_NSU_LSB 0u
#define ACCESSCTRL_USBCTRL_NSU_ACCESS "RW"
#define ACCESSCTRL_PIO0_OFFSET 0x0000004cu
#define ACCESSCTRL_PIO0_BITS 0x000000ffu
#define ACCESSCTRL_PIO0_RESET 0x000000fcu
#define ACCESSCTRL_PIO0_DBG_RESET 0x1u
#define ACCESSCTRL_PIO0_DBG_BITS 0x00000080u
#define ACCESSCTRL_PIO0_DBG_MSB 7u
#define ACCESSCTRL_PIO0_DBG_LSB 7u
#define ACCESSCTRL_PIO0_DBG_ACCESS "RW"
#define ACCESSCTRL_PIO0_DMA_RESET 0x1u
#define ACCESSCTRL_PIO0_DMA_BITS 0x00000040u
#define ACCESSCTRL_PIO0_DMA_MSB 6u
#define ACCESSCTRL_PIO0_DMA_LSB 6u
#define ACCESSCTRL_PIO0_DMA_ACCESS "RW"
#define ACCESSCTRL_PIO0_CORE1_RESET 0x1u
#define ACCESSCTRL_PIO0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PIO0_CORE1_MSB 5u
#define ACCESSCTRL_PIO0_CORE1_LSB 5u
#define ACCESSCTRL_PIO0_CORE1_ACCESS "RW"
#define ACCESSCTRL_PIO0_CORE0_RESET 0x1u
#define ACCESSCTRL_PIO0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PIO0_CORE0_MSB 4u
#define ACCESSCTRL_PIO0_CORE0_LSB 4u
#define ACCESSCTRL_PIO0_CORE0_ACCESS "RW"
#define ACCESSCTRL_PIO0_SP_RESET 0x1u
#define ACCESSCTRL_PIO0_SP_BITS 0x00000008u
#define ACCESSCTRL_PIO0_SP_MSB 3u
#define ACCESSCTRL_PIO0_SP_LSB 3u
#define ACCESSCTRL_PIO0_SP_ACCESS "RW"
#define ACCESSCTRL_PIO0_SU_RESET 0x1u
#define ACCESSCTRL_PIO0_SU_BITS 0x00000004u
#define ACCESSCTRL_PIO0_SU_MSB 2u
#define ACCESSCTRL_PIO0_SU_LSB 2u
#define ACCESSCTRL_PIO0_SU_ACCESS "RW"
#define ACCESSCTRL_PIO0_NSP_RESET 0x0u
#define ACCESSCTRL_PIO0_NSP_BITS 0x00000002u
#define ACCESSCTRL_PIO0_NSP_MSB 1u
#define ACCESSCTRL_PIO0_NSP_LSB 1u
#define ACCESSCTRL_PIO0_NSP_ACCESS "RW"
#define ACCESSCTRL_PIO0_NSU_RESET 0x0u
#define ACCESSCTRL_PIO0_NSU_BITS 0x00000001u
#define ACCESSCTRL_PIO0_NSU_MSB 0u
#define ACCESSCTRL_PIO0_NSU_LSB 0u
#define ACCESSCTRL_PIO0_NSU_ACCESS "RW"
#define ACCESSCTRL_PIO1_OFFSET 0x00000050u
#define ACCESSCTRL_PIO1_BITS 0x000000ffu
#define ACCESSCTRL_PIO1_RESET 0x000000fcu
#define ACCESSCTRL_PIO1_DBG_RESET 0x1u
#define ACCESSCTRL_PIO1_DBG_BITS 0x00000080u
#define ACCESSCTRL_PIO1_DBG_MSB 7u
#define ACCESSCTRL_PIO1_DBG_LSB 7u
#define ACCESSCTRL_PIO1_DBG_ACCESS "RW"
#define ACCESSCTRL_PIO1_DMA_RESET 0x1u
#define ACCESSCTRL_PIO1_DMA_BITS 0x00000040u
#define ACCESSCTRL_PIO1_DMA_MSB 6u
#define ACCESSCTRL_PIO1_DMA_LSB 6u
#define ACCESSCTRL_PIO1_DMA_ACCESS "RW"
#define ACCESSCTRL_PIO1_CORE1_RESET 0x1u
#define ACCESSCTRL_PIO1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PIO1_CORE1_MSB 5u
#define ACCESSCTRL_PIO1_CORE1_LSB 5u
#define ACCESSCTRL_PIO1_CORE1_ACCESS "RW"
#define ACCESSCTRL_PIO1_CORE0_RESET 0x1u
#define ACCESSCTRL_PIO1_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PIO1_CORE0_MSB 4u
#define ACCESSCTRL_PIO1_CORE0_LSB 4u
#define ACCESSCTRL_PIO1_CORE0_ACCESS "RW"
#define ACCESSCTRL_PIO1_SP_RESET 0x1u
#define ACCESSCTRL_PIO1_SP_BITS 0x00000008u
#define ACCESSCTRL_PIO1_SP_MSB 3u
#define ACCESSCTRL_PIO1_SP_LSB 3u
#define ACCESSCTRL_PIO1_SP_ACCESS "RW"
#define ACCESSCTRL_PIO1_SU_RESET 0x1u
#define ACCESSCTRL_PIO1_SU_BITS 0x00000004u
#define ACCESSCTRL_PIO1_SU_MSB 2u
#define ACCESSCTRL_PIO1_SU_LSB 2u
#define ACCESSCTRL_PIO1_SU_ACCESS "RW"
#define ACCESSCTRL_PIO1_NSP_RESET 0x0u
#define ACCESSCTRL_PIO1_NSP_BITS 0x00000002u
#define ACCESSCTRL_PIO1_NSP_MSB 1u
#define ACCESSCTRL_PIO1_NSP_LSB 1u
#define ACCESSCTRL_PIO1_NSP_ACCESS "RW"
#define ACCESSCTRL_PIO1_NSU_RESET 0x0u
#define ACCESSCTRL_PIO1_NSU_BITS 0x00000001u
#define ACCESSCTRL_PIO1_NSU_MSB 0u
#define ACCESSCTRL_PIO1_NSU_LSB 0u
#define ACCESSCTRL_PIO1_NSU_ACCESS "RW"
#define ACCESSCTRL_PIO2_OFFSET 0x00000054u
#define ACCESSCTRL_PIO2_BITS 0x000000ffu
#define ACCESSCTRL_PIO2_RESET 0x000000fcu
#define ACCESSCTRL_PIO2_DBG_RESET 0x1u
#define ACCESSCTRL_PIO2_DBG_BITS 0x00000080u
#define ACCESSCTRL_PIO2_DBG_MSB 7u
#define ACCESSCTRL_PIO2_DBG_LSB 7u
#define ACCESSCTRL_PIO2_DBG_ACCESS "RW"
#define ACCESSCTRL_PIO2_DMA_RESET 0x1u
#define ACCESSCTRL_PIO2_DMA_BITS 0x00000040u
#define ACCESSCTRL_PIO2_DMA_MSB 6u
#define ACCESSCTRL_PIO2_DMA_LSB 6u
#define ACCESSCTRL_PIO2_DMA_ACCESS "RW"
#define ACCESSCTRL_PIO2_CORE1_RESET 0x1u
#define ACCESSCTRL_PIO2_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PIO2_CORE1_MSB 5u
#define ACCESSCTRL_PIO2_CORE1_LSB 5u
#define ACCESSCTRL_PIO2_CORE1_ACCESS "RW"
#define ACCESSCTRL_PIO2_CORE0_RESET 0x1u
#define ACCESSCTRL_PIO2_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PIO2_CORE0_MSB 4u
#define ACCESSCTRL_PIO2_CORE0_LSB 4u
#define ACCESSCTRL_PIO2_CORE0_ACCESS "RW"
#define ACCESSCTRL_PIO2_SP_RESET 0x1u
#define ACCESSCTRL_PIO2_SP_BITS 0x00000008u
#define ACCESSCTRL_PIO2_SP_MSB 3u
#define ACCESSCTRL_PIO2_SP_LSB 3u
#define ACCESSCTRL_PIO2_SP_ACCESS "RW"
#define ACCESSCTRL_PIO2_SU_RESET 0x1u
#define ACCESSCTRL_PIO2_SU_BITS 0x00000004u
#define ACCESSCTRL_PIO2_SU_MSB 2u
#define ACCESSCTRL_PIO2_SU_LSB 2u
#define ACCESSCTRL_PIO2_SU_ACCESS "RW"
#define ACCESSCTRL_PIO2_NSP_RESET 0x0u
#define ACCESSCTRL_PIO2_NSP_BITS 0x00000002u
#define ACCESSCTRL_PIO2_NSP_MSB 1u
#define ACCESSCTRL_PIO2_NSP_LSB 1u
#define ACCESSCTRL_PIO2_NSP_ACCESS "RW"
#define ACCESSCTRL_PIO2_NSU_RESET 0x0u
#define ACCESSCTRL_PIO2_NSU_BITS 0x00000001u
#define ACCESSCTRL_PIO2_NSU_MSB 0u
#define ACCESSCTRL_PIO2_NSU_LSB 0u
#define ACCESSCTRL_PIO2_NSU_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_OFFSET 0x00000058u
#define ACCESSCTRL_CORESIGHT_TRACE_BITS 0x000000ffu
#define ACCESSCTRL_CORESIGHT_TRACE_RESET 0x000000b8u
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_BITS 0x00000080u
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_MSB 7u
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_LSB 7u
#define ACCESSCTRL_CORESIGHT_TRACE_DBG_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_BITS 0x00000040u
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_MSB 6u
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_LSB 6u
#define ACCESSCTRL_CORESIGHT_TRACE_DMA_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_BITS 0x00000020u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_MSB 5u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_LSB 5u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_BITS 0x00000010u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_MSB 4u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_LSB 4u
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_SP_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_TRACE_SP_BITS 0x00000008u
#define ACCESSCTRL_CORESIGHT_TRACE_SP_MSB 3u
#define ACCESSCTRL_CORESIGHT_TRACE_SP_LSB 3u
#define ACCESSCTRL_CORESIGHT_TRACE_SP_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_SU_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_TRACE_SU_BITS 0x00000004u
#define ACCESSCTRL_CORESIGHT_TRACE_SU_MSB 2u
#define ACCESSCTRL_CORESIGHT_TRACE_SU_LSB 2u
#define ACCESSCTRL_CORESIGHT_TRACE_SU_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_BITS 0x00000002u
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_MSB 1u
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_LSB 1u
#define ACCESSCTRL_CORESIGHT_TRACE_NSP_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_BITS 0x00000001u
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_MSB 0u
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_LSB 0u
#define ACCESSCTRL_CORESIGHT_TRACE_NSU_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_OFFSET 0x0000005cu
#define ACCESSCTRL_CORESIGHT_PERIPH_BITS 0x000000ffu
#define ACCESSCTRL_CORESIGHT_PERIPH_RESET 0x000000b8u
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_BITS 0x00000080u
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_MSB 7u
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_LSB 7u
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_BITS 0x00000040u
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_MSB 6u
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_LSB 6u
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_BITS 0x00000020u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_MSB 5u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_LSB 5u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_BITS 0x00000010u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_MSB 4u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_LSB 4u
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_RESET 0x1u
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_BITS 0x00000008u
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_MSB 3u
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_LSB 3u
#define ACCESSCTRL_CORESIGHT_PERIPH_SP_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_BITS 0x00000004u
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_MSB 2u
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_LSB 2u
#define ACCESSCTRL_CORESIGHT_PERIPH_SU_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_BITS 0x00000002u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_MSB 1u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_LSB 1u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP_ACCESS "RW"
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_RESET 0x0u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_BITS 0x00000001u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_MSB 0u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_LSB 0u
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_OFFSET 0x00000060u
#define ACCESSCTRL_SYSINFO_BITS 0x000000ffu
#define ACCESSCTRL_SYSINFO_RESET 0x000000ffu
#define ACCESSCTRL_SYSINFO_DBG_RESET 0x1u
#define ACCESSCTRL_SYSINFO_DBG_BITS 0x00000080u
#define ACCESSCTRL_SYSINFO_DBG_MSB 7u
#define ACCESSCTRL_SYSINFO_DBG_LSB 7u
#define ACCESSCTRL_SYSINFO_DBG_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_DMA_RESET 0x1u
#define ACCESSCTRL_SYSINFO_DMA_BITS 0x00000040u
#define ACCESSCTRL_SYSINFO_DMA_MSB 6u
#define ACCESSCTRL_SYSINFO_DMA_LSB 6u
#define ACCESSCTRL_SYSINFO_DMA_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_CORE1_RESET 0x1u
#define ACCESSCTRL_SYSINFO_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SYSINFO_CORE1_MSB 5u
#define ACCESSCTRL_SYSINFO_CORE1_LSB 5u
#define ACCESSCTRL_SYSINFO_CORE1_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_CORE0_RESET 0x1u
#define ACCESSCTRL_SYSINFO_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SYSINFO_CORE0_MSB 4u
#define ACCESSCTRL_SYSINFO_CORE0_LSB 4u
#define ACCESSCTRL_SYSINFO_CORE0_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_SP_RESET 0x1u
#define ACCESSCTRL_SYSINFO_SP_BITS 0x00000008u
#define ACCESSCTRL_SYSINFO_SP_MSB 3u
#define ACCESSCTRL_SYSINFO_SP_LSB 3u
#define ACCESSCTRL_SYSINFO_SP_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_SU_RESET 0x1u
#define ACCESSCTRL_SYSINFO_SU_BITS 0x00000004u
#define ACCESSCTRL_SYSINFO_SU_MSB 2u
#define ACCESSCTRL_SYSINFO_SU_LSB 2u
#define ACCESSCTRL_SYSINFO_SU_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_NSP_RESET 0x1u
#define ACCESSCTRL_SYSINFO_NSP_BITS 0x00000002u
#define ACCESSCTRL_SYSINFO_NSP_MSB 1u
#define ACCESSCTRL_SYSINFO_NSP_LSB 1u
#define ACCESSCTRL_SYSINFO_NSP_ACCESS "RW"
#define ACCESSCTRL_SYSINFO_NSU_RESET 0x1u
#define ACCESSCTRL_SYSINFO_NSU_BITS 0x00000001u
#define ACCESSCTRL_SYSINFO_NSU_MSB 0u
#define ACCESSCTRL_SYSINFO_NSU_LSB 0u
#define ACCESSCTRL_SYSINFO_NSU_ACCESS "RW"
#define ACCESSCTRL_RESETS_OFFSET 0x00000064u
#define ACCESSCTRL_RESETS_BITS 0x000000ffu
#define ACCESSCTRL_RESETS_RESET 0x000000fcu
#define ACCESSCTRL_RESETS_DBG_RESET 0x1u
#define ACCESSCTRL_RESETS_DBG_BITS 0x00000080u
#define ACCESSCTRL_RESETS_DBG_MSB 7u
#define ACCESSCTRL_RESETS_DBG_LSB 7u
#define ACCESSCTRL_RESETS_DBG_ACCESS "RW"
#define ACCESSCTRL_RESETS_DMA_RESET 0x1u
#define ACCESSCTRL_RESETS_DMA_BITS 0x00000040u
#define ACCESSCTRL_RESETS_DMA_MSB 6u
#define ACCESSCTRL_RESETS_DMA_LSB 6u
#define ACCESSCTRL_RESETS_DMA_ACCESS "RW"
#define ACCESSCTRL_RESETS_CORE1_RESET 0x1u
#define ACCESSCTRL_RESETS_CORE1_BITS 0x00000020u
#define ACCESSCTRL_RESETS_CORE1_MSB 5u
#define ACCESSCTRL_RESETS_CORE1_LSB 5u
#define ACCESSCTRL_RESETS_CORE1_ACCESS "RW"
#define ACCESSCTRL_RESETS_CORE0_RESET 0x1u
#define ACCESSCTRL_RESETS_CORE0_BITS 0x00000010u
#define ACCESSCTRL_RESETS_CORE0_MSB 4u
#define ACCESSCTRL_RESETS_CORE0_LSB 4u
#define ACCESSCTRL_RESETS_CORE0_ACCESS "RW"
#define ACCESSCTRL_RESETS_SP_RESET 0x1u
#define ACCESSCTRL_RESETS_SP_BITS 0x00000008u
#define ACCESSCTRL_RESETS_SP_MSB 3u
#define ACCESSCTRL_RESETS_SP_LSB 3u
#define ACCESSCTRL_RESETS_SP_ACCESS "RW"
#define ACCESSCTRL_RESETS_SU_RESET 0x1u
#define ACCESSCTRL_RESETS_SU_BITS 0x00000004u
#define ACCESSCTRL_RESETS_SU_MSB 2u
#define ACCESSCTRL_RESETS_SU_LSB 2u
#define ACCESSCTRL_RESETS_SU_ACCESS "RW"
#define ACCESSCTRL_RESETS_NSP_RESET 0x0u
#define ACCESSCTRL_RESETS_NSP_BITS 0x00000002u
#define ACCESSCTRL_RESETS_NSP_MSB 1u
#define ACCESSCTRL_RESETS_NSP_LSB 1u
#define ACCESSCTRL_RESETS_NSP_ACCESS "RW"
#define ACCESSCTRL_RESETS_NSU_RESET 0x0u
#define ACCESSCTRL_RESETS_NSU_BITS 0x00000001u
#define ACCESSCTRL_RESETS_NSU_MSB 0u
#define ACCESSCTRL_RESETS_NSU_LSB 0u
#define ACCESSCTRL_RESETS_NSU_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_OFFSET 0x00000068u
#define ACCESSCTRL_IO_BANK0_BITS 0x000000ffu
#define ACCESSCTRL_IO_BANK0_RESET 0x000000fcu
#define ACCESSCTRL_IO_BANK0_DBG_RESET 0x1u
#define ACCESSCTRL_IO_BANK0_DBG_BITS 0x00000080u
#define ACCESSCTRL_IO_BANK0_DBG_MSB 7u
#define ACCESSCTRL_IO_BANK0_DBG_LSB 7u
#define ACCESSCTRL_IO_BANK0_DBG_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_DMA_RESET 0x1u
#define ACCESSCTRL_IO_BANK0_DMA_BITS 0x00000040u
#define ACCESSCTRL_IO_BANK0_DMA_MSB 6u
#define ACCESSCTRL_IO_BANK0_DMA_LSB 6u
#define ACCESSCTRL_IO_BANK0_DMA_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_CORE1_RESET 0x1u
#define ACCESSCTRL_IO_BANK0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_IO_BANK0_CORE1_MSB 5u
#define ACCESSCTRL_IO_BANK0_CORE1_LSB 5u
#define ACCESSCTRL_IO_BANK0_CORE1_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_CORE0_RESET 0x1u
#define ACCESSCTRL_IO_BANK0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_IO_BANK0_CORE0_MSB 4u
#define ACCESSCTRL_IO_BANK0_CORE0_LSB 4u
#define ACCESSCTRL_IO_BANK0_CORE0_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_SP_RESET 0x1u
#define ACCESSCTRL_IO_BANK0_SP_BITS 0x00000008u
#define ACCESSCTRL_IO_BANK0_SP_MSB 3u
#define ACCESSCTRL_IO_BANK0_SP_LSB 3u
#define ACCESSCTRL_IO_BANK0_SP_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_SU_RESET 0x1u
#define ACCESSCTRL_IO_BANK0_SU_BITS 0x00000004u
#define ACCESSCTRL_IO_BANK0_SU_MSB 2u
#define ACCESSCTRL_IO_BANK0_SU_LSB 2u
#define ACCESSCTRL_IO_BANK0_SU_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_NSP_RESET 0x0u
#define ACCESSCTRL_IO_BANK0_NSP_BITS 0x00000002u
#define ACCESSCTRL_IO_BANK0_NSP_MSB 1u
#define ACCESSCTRL_IO_BANK0_NSP_LSB 1u
#define ACCESSCTRL_IO_BANK0_NSP_ACCESS "RW"
#define ACCESSCTRL_IO_BANK0_NSU_RESET 0x0u
#define ACCESSCTRL_IO_BANK0_NSU_BITS 0x00000001u
#define ACCESSCTRL_IO_BANK0_NSU_MSB 0u
#define ACCESSCTRL_IO_BANK0_NSU_LSB 0u
#define ACCESSCTRL_IO_BANK0_NSU_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_OFFSET 0x0000006cu
#define ACCESSCTRL_IO_BANK1_BITS 0x000000ffu
#define ACCESSCTRL_IO_BANK1_RESET 0x000000fcu
#define ACCESSCTRL_IO_BANK1_DBG_RESET 0x1u
#define ACCESSCTRL_IO_BANK1_DBG_BITS 0x00000080u
#define ACCESSCTRL_IO_BANK1_DBG_MSB 7u
#define ACCESSCTRL_IO_BANK1_DBG_LSB 7u
#define ACCESSCTRL_IO_BANK1_DBG_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_DMA_RESET 0x1u
#define ACCESSCTRL_IO_BANK1_DMA_BITS 0x00000040u
#define ACCESSCTRL_IO_BANK1_DMA_MSB 6u
#define ACCESSCTRL_IO_BANK1_DMA_LSB 6u
#define ACCESSCTRL_IO_BANK1_DMA_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_CORE1_RESET 0x1u
#define ACCESSCTRL_IO_BANK1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_IO_BANK1_CORE1_MSB 5u
#define ACCESSCTRL_IO_BANK1_CORE1_LSB 5u
#define ACCESSCTRL_IO_BANK1_CORE1_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_CORE0_RESET 0x1u
#define ACCESSCTRL_IO_BANK1_CORE0_BITS 0x00000010u
#define ACCESSCTRL_IO_BANK1_CORE0_MSB 4u
#define ACCESSCTRL_IO_BANK1_CORE0_LSB 4u
#define ACCESSCTRL_IO_BANK1_CORE0_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_SP_RESET 0x1u
#define ACCESSCTRL_IO_BANK1_SP_BITS 0x00000008u
#define ACCESSCTRL_IO_BANK1_SP_MSB 3u
#define ACCESSCTRL_IO_BANK1_SP_LSB 3u
#define ACCESSCTRL_IO_BANK1_SP_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_SU_RESET 0x1u
#define ACCESSCTRL_IO_BANK1_SU_BITS 0x00000004u
#define ACCESSCTRL_IO_BANK1_SU_MSB 2u
#define ACCESSCTRL_IO_BANK1_SU_LSB 2u
#define ACCESSCTRL_IO_BANK1_SU_ACCESS "RW"
