gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define ACCESSCTRL_IO_BANK1_NSP_RESET 0x0u
#define ACCESSCTRL_IO_BANK1_NSP_BITS 0x00000002u
#define ACCESSCTRL_IO_BANK1_NSP_MSB 1u
#define ACCESSCTRL_IO_BANK1_NSP_LSB 1u
#define ACCESSCTRL_IO_BANK1_NSP_ACCESS "RW"
#define ACCESSCTRL_IO_BANK1_NSU_RESET 0x0u
#define ACCESSCTRL_IO_BANK1_NSU_BITS 0x00000001u
#define ACCESSCTRL_IO_BANK1_NSU_MSB 0u
#define ACCESSCTRL_IO_BANK1_NSU_LSB 0u
#define ACCESSCTRL_IO_BANK1_NSU_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_OFFSET 0x00000070u
#define ACCESSCTRL_PADS_BANK0_BITS 0x000000ffu
#define ACCESSCTRL_PADS_BANK0_RESET 0x000000fcu
#define ACCESSCTRL_PADS_BANK0_DBG_RESET 0x1u
#define ACCESSCTRL_PADS_BANK0_DBG_BITS 0x00000080u
#define ACCESSCTRL_PADS_BANK0_DBG_MSB 7u
#define ACCESSCTRL_PADS_BANK0_DBG_LSB 7u
#define ACCESSCTRL_PADS_BANK0_DBG_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_DMA_RESET 0x1u
#define ACCESSCTRL_PADS_BANK0_DMA_BITS 0x00000040u
#define ACCESSCTRL_PADS_BANK0_DMA_MSB 6u
#define ACCESSCTRL_PADS_BANK0_DMA_LSB 6u
#define ACCESSCTRL_PADS_BANK0_DMA_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_CORE1_RESET 0x1u
#define ACCESSCTRL_PADS_BANK0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PADS_BANK0_CORE1_MSB 5u
#define ACCESSCTRL_PADS_BANK0_CORE1_LSB 5u
#define ACCESSCTRL_PADS_BANK0_CORE1_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_CORE0_RESET 0x1u
#define ACCESSCTRL_PADS_BANK0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PADS_BANK0_CORE0_MSB 4u
#define ACCESSCTRL_PADS_BANK0_CORE0_LSB 4u
#define ACCESSCTRL_PADS_BANK0_CORE0_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_SP_RESET 0x1u
#define ACCESSCTRL_PADS_BANK0_SP_BITS 0x00000008u
#define ACCESSCTRL_PADS_BANK0_SP_MSB 3u
#define ACCESSCTRL_PADS_BANK0_SP_LSB 3u
#define ACCESSCTRL_PADS_BANK0_SP_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_SU_RESET 0x1u
#define ACCESSCTRL_PADS_BANK0_SU_BITS 0x00000004u
#define ACCESSCTRL_PADS_BANK0_SU_MSB 2u
#define ACCESSCTRL_PADS_BANK0_SU_LSB 2u
#define ACCESSCTRL_PADS_BANK0_SU_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_NSP_RESET 0x0u
#define ACCESSCTRL_PADS_BANK0_NSP_BITS 0x00000002u
#define ACCESSCTRL_PADS_BANK0_NSP_MSB 1u
#define ACCESSCTRL_PADS_BANK0_NSP_LSB 1u
#define ACCESSCTRL_PADS_BANK0_NSP_ACCESS "RW"
#define ACCESSCTRL_PADS_BANK0_NSU_RESET 0x0u
#define ACCESSCTRL_PADS_BANK0_NSU_BITS 0x00000001u
#define ACCESSCTRL_PADS_BANK0_NSU_MSB 0u
#define ACCESSCTRL_PADS_BANK0_NSU_LSB 0u
#define ACCESSCTRL_PADS_BANK0_NSU_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_OFFSET 0x00000074u
#define ACCESSCTRL_PADS_QSPI_BITS 0x000000ffu
#define ACCESSCTRL_PADS_QSPI_RESET 0x000000fcu
#define ACCESSCTRL_PADS_QSPI_DBG_RESET 0x1u
#define ACCESSCTRL_PADS_QSPI_DBG_BITS 0x00000080u
#define ACCESSCTRL_PADS_QSPI_DBG_MSB 7u
#define ACCESSCTRL_PADS_QSPI_DBG_LSB 7u
#define ACCESSCTRL_PADS_QSPI_DBG_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_DMA_RESET 0x1u
#define ACCESSCTRL_PADS_QSPI_DMA_BITS 0x00000040u
#define ACCESSCTRL_PADS_QSPI_DMA_MSB 6u
#define ACCESSCTRL_PADS_QSPI_DMA_LSB 6u
#define ACCESSCTRL_PADS_QSPI_DMA_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_CORE1_RESET 0x1u
#define ACCESSCTRL_PADS_QSPI_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PADS_QSPI_CORE1_MSB 5u
#define ACCESSCTRL_PADS_QSPI_CORE1_LSB 5u
#define ACCESSCTRL_PADS_QSPI_CORE1_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_CORE0_RESET 0x1u
#define ACCESSCTRL_PADS_QSPI_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PADS_QSPI_CORE0_MSB 4u
#define ACCESSCTRL_PADS_QSPI_CORE0_LSB 4u
#define ACCESSCTRL_PADS_QSPI_CORE0_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_SP_RESET 0x1u
#define ACCESSCTRL_PADS_QSPI_SP_BITS 0x00000008u
#define ACCESSCTRL_PADS_QSPI_SP_MSB 3u
#define ACCESSCTRL_PADS_QSPI_SP_LSB 3u
#define ACCESSCTRL_PADS_QSPI_SP_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_SU_RESET 0x1u
#define ACCESSCTRL_PADS_QSPI_SU_BITS 0x00000004u
#define ACCESSCTRL_PADS_QSPI_SU_MSB 2u
#define ACCESSCTRL_PADS_QSPI_SU_LSB 2u
#define ACCESSCTRL_PADS_QSPI_SU_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_NSP_RESET 0x0u
#define ACCESSCTRL_PADS_QSPI_NSP_BITS 0x00000002u
#define ACCESSCTRL_PADS_QSPI_NSP_MSB 1u
#define ACCESSCTRL_PADS_QSPI_NSP_LSB 1u
#define ACCESSCTRL_PADS_QSPI_NSP_ACCESS "RW"
#define ACCESSCTRL_PADS_QSPI_NSU_RESET 0x0u
#define ACCESSCTRL_PADS_QSPI_NSU_BITS 0x00000001u
#define ACCESSCTRL_PADS_QSPI_NSU_MSB 0u
#define ACCESSCTRL_PADS_QSPI_NSU_LSB 0u
#define ACCESSCTRL_PADS_QSPI_NSU_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_OFFSET 0x00000078u
#define ACCESSCTRL_BUSCTRL_BITS 0x000000ffu
#define ACCESSCTRL_BUSCTRL_RESET 0x000000fcu
#define ACCESSCTRL_BUSCTRL_DBG_RESET 0x1u
#define ACCESSCTRL_BUSCTRL_DBG_BITS 0x00000080u
#define ACCESSCTRL_BUSCTRL_DBG_MSB 7u
#define ACCESSCTRL_BUSCTRL_DBG_LSB 7u
#define ACCESSCTRL_BUSCTRL_DBG_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_DMA_RESET 0x1u
#define ACCESSCTRL_BUSCTRL_DMA_BITS 0x00000040u
#define ACCESSCTRL_BUSCTRL_DMA_MSB 6u
#define ACCESSCTRL_BUSCTRL_DMA_LSB 6u
#define ACCESSCTRL_BUSCTRL_DMA_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_CORE1_RESET 0x1u
#define ACCESSCTRL_BUSCTRL_CORE1_BITS 0x00000020u
#define ACCESSCTRL_BUSCTRL_CORE1_MSB 5u
#define ACCESSCTRL_BUSCTRL_CORE1_LSB 5u
#define ACCESSCTRL_BUSCTRL_CORE1_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_CORE0_RESET 0x1u
#define ACCESSCTRL_BUSCTRL_CORE0_BITS 0x00000010u
#define ACCESSCTRL_BUSCTRL_CORE0_MSB 4u
#define ACCESSCTRL_BUSCTRL_CORE0_LSB 4u
#define ACCESSCTRL_BUSCTRL_CORE0_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_SP_RESET 0x1u
#define ACCESSCTRL_BUSCTRL_SP_BITS 0x00000008u
#define ACCESSCTRL_BUSCTRL_SP_MSB 3u
#define ACCESSCTRL_BUSCTRL_SP_LSB 3u
#define ACCESSCTRL_BUSCTRL_SP_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_SU_RESET 0x1u
#define ACCESSCTRL_BUSCTRL_SU_BITS 0x00000004u
#define ACCESSCTRL_BUSCTRL_SU_MSB 2u
#define ACCESSCTRL_BUSCTRL_SU_LSB 2u
#define ACCESSCTRL_BUSCTRL_SU_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_NSP_RESET 0x0u
#define ACCESSCTRL_BUSCTRL_NSP_BITS 0x00000002u
#define ACCESSCTRL_BUSCTRL_NSP_MSB 1u
#define ACCESSCTRL_BUSCTRL_NSP_LSB 1u
#define ACCESSCTRL_BUSCTRL_NSP_ACCESS "RW"
#define ACCESSCTRL_BUSCTRL_NSU_RESET 0x0u
#define ACCESSCTRL_BUSCTRL_NSU_BITS 0x00000001u
#define ACCESSCTRL_BUSCTRL_NSU_MSB 0u
#define ACCESSCTRL_BUSCTRL_NSU_LSB 0u
#define ACCESSCTRL_BUSCTRL_NSU_ACCESS "RW"
#define ACCESSCTRL_ADC0_OFFSET 0x0000007cu
#define ACCESSCTRL_ADC0_BITS 0x000000ffu
#define ACCESSCTRL_ADC0_RESET 0x000000fcu
#define ACCESSCTRL_ADC0_DBG_RESET 0x1u
#define ACCESSCTRL_ADC0_DBG_BITS 0x00000080u
#define ACCESSCTRL_ADC0_DBG_MSB 7u
#define ACCESSCTRL_ADC0_DBG_LSB 7u
#define ACCESSCTRL_ADC0_DBG_ACCESS "RW"
#define ACCESSCTRL_ADC0_DMA_RESET 0x1u
#define ACCESSCTRL_ADC0_DMA_BITS 0x00000040u
#define ACCESSCTRL_ADC0_DMA_MSB 6u
#define ACCESSCTRL_ADC0_DMA_LSB 6u
#define ACCESSCTRL_ADC0_DMA_ACCESS "RW"
#define ACCESSCTRL_ADC0_CORE1_RESET 0x1u
#define ACCESSCTRL_ADC0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_ADC0_CORE1_MSB 5u
#define ACCESSCTRL_ADC0_CORE1_LSB 5u
#define ACCESSCTRL_ADC0_CORE1_ACCESS "RW"
#define ACCESSCTRL_ADC0_CORE0_RESET 0x1u
#define ACCESSCTRL_ADC0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_ADC0_CORE0_MSB 4u
#define ACCESSCTRL_ADC0_CORE0_LSB 4u
#define ACCESSCTRL_ADC0_CORE0_ACCESS "RW"
#define ACCESSCTRL_ADC0_SP_RESET 0x1u
#define ACCESSCTRL_ADC0_SP_BITS 0x00000008u
#define ACCESSCTRL_ADC0_SP_MSB 3u
#define ACCESSCTRL_ADC0_SP_LSB 3u
#define ACCESSCTRL_ADC0_SP_ACCESS "RW"
#define ACCESSCTRL_ADC0_SU_RESET 0x1u
#define ACCESSCTRL_ADC0_SU_BITS 0x00000004u
#define ACCESSCTRL_ADC0_SU_MSB 2u
#define ACCESSCTRL_ADC0_SU_LSB 2u
#define ACCESSCTRL_ADC0_SU_ACCESS "RW"
#define ACCESSCTRL_ADC0_NSP_RESET 0x0u
#define ACCESSCTRL_ADC0_NSP_BITS 0x00000002u
#define ACCESSCTRL_ADC0_NSP_MSB 1u
#define ACCESSCTRL_ADC0_NSP_LSB 1u
#define ACCESSCTRL_ADC0_NSP_ACCESS "RW"
#define ACCESSCTRL_ADC0_NSU_RESET 0x0u
#define ACCESSCTRL_ADC0_NSU_BITS 0x00000001u
#define ACCESSCTRL_ADC0_NSU_MSB 0u
#define ACCESSCTRL_ADC0_NSU_LSB 0u
#define ACCESSCTRL_ADC0_NSU_ACCESS "RW"
#define ACCESSCTRL_HSTX_OFFSET 0x00000080u
#define ACCESSCTRL_HSTX_BITS 0x000000ffu
#define ACCESSCTRL_HSTX_RESET 0x000000fcu
#define ACCESSCTRL_HSTX_DBG_RESET 0x1u
#define ACCESSCTRL_HSTX_DBG_BITS 0x00000080u
#define ACCESSCTRL_HSTX_DBG_MSB 7u
#define ACCESSCTRL_HSTX_DBG_LSB 7u
#define ACCESSCTRL_HSTX_DBG_ACCESS "RW"
#define ACCESSCTRL_HSTX_DMA_RESET 0x1u
#define ACCESSCTRL_HSTX_DMA_BITS 0x00000040u
#define ACCESSCTRL_HSTX_DMA_MSB 6u
#define ACCESSCTRL_HSTX_DMA_LSB 6u
#define ACCESSCTRL_HSTX_DMA_ACCESS "RW"
#define ACCESSCTRL_HSTX_CORE1_RESET 0x1u
#define ACCESSCTRL_HSTX_CORE1_BITS 0x00000020u
#define ACCESSCTRL_HSTX_CORE1_MSB 5u
#define ACCESSCTRL_HSTX_CORE1_LSB 5u
#define ACCESSCTRL_HSTX_CORE1_ACCESS "RW"
#define ACCESSCTRL_HSTX_CORE0_RESET 0x1u
#define ACCESSCTRL_HSTX_CORE0_BITS 0x00000010u
#define ACCESSCTRL_HSTX_CORE0_MSB 4u
#define ACCESSCTRL_HSTX_CORE0_LSB 4u
#define ACCESSCTRL_HSTX_CORE0_ACCESS "RW"
#define ACCESSCTRL_HSTX_SP_RESET 0x1u
#define ACCESSCTRL_HSTX_SP_BITS 0x00000008u
#define ACCESSCTRL_HSTX_SP_MSB 3u
#define ACCESSCTRL_HSTX_SP_LSB 3u
#define ACCESSCTRL_HSTX_SP_ACCESS "RW"
#define ACCESSCTRL_HSTX_SU_RESET 0x1u
#define ACCESSCTRL_HSTX_SU_BITS 0x00000004u
#define ACCESSCTRL_HSTX_SU_MSB 2u
#define ACCESSCTRL_HSTX_SU_LSB 2u
#define ACCESSCTRL_HSTX_SU_ACCESS "RW"
#define ACCESSCTRL_HSTX_NSP_RESET 0x0u
#define ACCESSCTRL_HSTX_NSP_BITS 0x00000002u
#define ACCESSCTRL_HSTX_NSP_MSB 1u
#define ACCESSCTRL_HSTX_NSP_LSB 1u
#define ACCESSCTRL_HSTX_NSP_ACCESS "RW"
#define ACCESSCTRL_HSTX_NSU_RESET 0x0u
#define ACCESSCTRL_HSTX_NSU_BITS 0x00000001u
#define ACCESSCTRL_HSTX_NSU_MSB 0u
#define ACCESSCTRL_HSTX_NSU_LSB 0u
#define ACCESSCTRL_HSTX_NSU_ACCESS "RW"
#define ACCESSCTRL_I2C0_OFFSET 0x00000084u
#define ACCESSCTRL_I2C0_BITS 0x000000ffu
#define ACCESSCTRL_I2C0_RESET 0x000000fcu
#define ACCESSCTRL_I2C0_DBG_RESET 0x1u
#define ACCESSCTRL_I2C0_DBG_BITS 0x00000080u
#define ACCESSCTRL_I2C0_DBG_MSB 7u
#define ACCESSCTRL_I2C0_DBG_LSB 7u
#define ACCESSCTRL_I2C0_DBG_ACCESS "RW"
#define ACCESSCTRL_I2C0_DMA_RESET 0x1u
#define ACCESSCTRL_I2C0_DMA_BITS 0x00000040u
#define ACCESSCTRL_I2C0_DMA_MSB 6u
#define ACCESSCTRL_I2C0_DMA_LSB 6u
#define ACCESSCTRL_I2C0_DMA_ACCESS "RW"
#define ACCESSCTRL_I2C0_CORE1_RESET 0x1u
#define ACCESSCTRL_I2C0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_I2C0_CORE1_MSB 5u
#define ACCESSCTRL_I2C0_CORE1_LSB 5u
#define ACCESSCTRL_I2C0_CORE1_ACCESS "RW"
#define ACCESSCTRL_I2C0_CORE0_RESET 0x1u
#define ACCESSCTRL_I2C0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_I2C0_CORE0_MSB 4u
#define ACCESSCTRL_I2C0_CORE0_LSB 4u
#define ACCESSCTRL_I2C0_CORE0_ACCESS "RW"
#define ACCESSCTRL_I2C0_SP_RESET 0x1u
#define ACCESSCTRL_I2C0_SP_BITS 0x00000008u
#define ACCESSCTRL_I2C0_SP_MSB 3u
#define ACCESSCTRL_I2C0_SP_LSB 3u
#define ACCESSCTRL_I2C0_SP_ACCESS "RW"
#define ACCESSCTRL_I2C0_SU_RESET 0x1u
#define ACCESSCTRL_I2C0_SU_BITS 0x00000004u
#define ACCESSCTRL_I2C0_SU_MSB 2u
#define ACCESSCTRL_I2C0_SU_LSB 2u
#define ACCESSCTRL_I2C0_SU_ACCESS "RW"
#define ACCESSCTRL_I2C0_NSP_RESET 0x0u
#define ACCESSCTRL_I2C0_NSP_BITS 0x00000002u
#define ACCESSCTRL_I2C0_NSP_MSB 1u
#define ACCESSCTRL_I2C0_NSP_LSB 1u
#define ACCESSCTRL_I2C0_NSP_ACCESS "RW"
#define ACCESSCTRL_I2C0_NSU_RESET 0x0u
#define ACCESSCTRL_I2C0_NSU_BITS 0x00000001u
#define ACCESSCTRL_I2C0_NSU_MSB 0u
#define ACCESSCTRL_I2C0_NSU_LSB 0u
#define ACCESSCTRL_I2C0_NSU_ACCESS "RW"
#define ACCESSCTRL_I2C1_OFFSET 0x00000088u
#define ACCESSCTRL_I2C1_BITS 0x000000ffu
#define ACCESSCTRL_I2C1_RESET 0x000000fcu
#define ACCESSCTRL_I2C1_DBG_RESET 0x1u
#define ACCESSCTRL_I2C1_DBG_BITS 0x00000080u
#define ACCESSCTRL_I2C1_DBG_MSB 7u
#define ACCESSCTRL_I2C1_DBG_LSB 7u
#define ACCESSCTRL_I2C1_DBG_ACCESS "RW"
#define ACCESSCTRL_I2C1_DMA_RESET 0x1u
#define ACCESSCTRL_I2C1_DMA_BITS 0x00000040u
#define ACCESSCTRL_I2C1_DMA_MSB 6u
#define ACCESSCTRL_I2C1_DMA_LSB 6u
#define ACCESSCTRL_I2C1_DMA_ACCESS "RW"
#define ACCESSCTRL_I2C1_CORE1_RESET 0x1u
#define ACCESSCTRL_I2C1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_I2C1_CORE1_MSB 5u
#define ACCESSCTRL_I2C1_CORE1_LSB 5u
#define ACCESSCTRL_I2C1_CORE1_ACCESS "RW"
#define ACCESSCTRL_I2C1_CORE0_RESET 0x1u
#define ACCESSCTRL_I2C1_CORE0_BITS 0x00000010u
#define ACCESSCTRL_I2C1_CORE0_MSB 4u
#define ACCESSCTRL_I2C1_CORE0_LSB 4u
#define ACCESSCTRL_I2C1_CORE0_ACCESS "RW"
#define ACCESSCTRL_I2C1_SP_RESET 0x1u
#define ACCESSCTRL_I2C1_SP_BITS 0x00000008u
#define ACCESSCTRL_I2C1_SP_MSB 3u
#define ACCESSCTRL_I2C1_SP_LSB 3u
#define ACCESSCTRL_I2C1_SP_ACCESS "RW"
#define ACCESSCTRL_I2C1_SU_RESET 0x1u
#define ACCESSCTRL_I2C1_SU_BITS 0x00000004u
#define ACCESSCTRL_I2C1_SU_MSB 2u
#define ACCESSCTRL_I2C1_SU_LSB 2u
#define ACCESSCTRL_I2C1_SU_ACCESS "RW"
#define ACCESSCTRL_I2C1_NSP_RESET 0x0u
#define ACCESSCTRL_I2C1_NSP_BITS 0x00000002u
#define ACCESSCTRL_I2C1_NSP_MSB 1u
#define ACCESSCTRL_I2C1_NSP_LSB 1u
#define ACCESSCTRL_I2C1_NSP_ACCESS "RW"
#define ACCESSCTRL_I2C1_NSU_RESET 0x0u
#define ACCESSCTRL_I2C1_NSU_BITS 0x00000001u
#define ACCESSCTRL_I2C1_NSU_MSB 0u
#define ACCESSCTRL_I2C1_NSU_LSB 0u
#define ACCESSCTRL_I2C1_NSU_ACCESS "RW"
#define ACCESSCTRL_PWM_OFFSET 0x0000008cu
#define ACCESSCTRL_PWM_BITS 0x000000ffu
#define ACCESSCTRL_PWM_RESET 0x000000fcu
#define ACCESSCTRL_PWM_DBG_RESET 0x1u
#define ACCESSCTRL_PWM_DBG_BITS 0x00000080u
#define ACCESSCTRL_PWM_DBG_MSB 7u
#define ACCESSCTRL_PWM_DBG_LSB 7u
#define ACCESSCTRL_PWM_DBG_ACCESS "RW"
#define ACCESSCTRL_PWM_DMA_RESET 0x1u
#define ACCESSCTRL_PWM_DMA_BITS 0x00000040u
#define ACCESSCTRL_PWM_DMA_MSB 6u
#define ACCESSCTRL_PWM_DMA_LSB 6u
#define ACCESSCTRL_PWM_DMA_ACCESS "RW"
#define ACCESSCTRL_PWM_CORE1_RESET 0x1u
#define ACCESSCTRL_PWM_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PWM_CORE1_MSB 5u
#define ACCESSCTRL_PWM_CORE1_LSB 5u
#define ACCESSCTRL_PWM_CORE1_ACCESS "RW"
#define ACCESSCTRL_PWM_CORE0_RESET 0x1u
#define ACCESSCTRL_PWM_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PWM_CORE0_MSB 4u
#define ACCESSCTRL_PWM_CORE0_LSB 4u
#define ACCESSCTRL_PWM_CORE0_ACCESS "RW"
#define ACCESSCTRL_PWM_SP_RESET 0x1u
#define ACCESSCTRL_PWM_SP_BITS 0x00000008u
#define ACCESSCTRL_PWM_SP_MSB 3u
#define ACCESSCTRL_PWM_SP_LSB 3u
#define ACCESSCTRL_PWM_SP_ACCESS "RW"
#define ACCESSCTRL_PWM_SU_RESET 0x1u
#define ACCESSCTRL_PWM_SU_BITS 0x00000004u
#define ACCESSCTRL_PWM_SU_MSB 2u
#define ACCESSCTRL_PWM_SU_LSB 2u
#define ACCESSCTRL_PWM_SU_ACCESS "RW"
#define ACCESSCTRL_PWM_NSP_RESET 0x0u
#define ACCESSCTRL_PWM_NSP_BITS 0x00000002u
#define ACCESSCTRL_PWM_NSP_MSB 1u
#define ACCESSCTRL_PWM_NSP_LSB 1u
#define ACCESSCTRL_PWM_NSP_ACCESS "RW"
#define ACCESSCTRL_PWM_NSU_RESET 0x0u
#define ACCESSCTRL_PWM_NSU_BITS 0x00000001u
#define ACCESSCTRL_PWM_NSU_MSB 0u
#define ACCESSCTRL_PWM_NSU_LSB 0u
#define ACCESSCTRL_PWM_NSU_ACCESS "RW"
#define ACCESSCTRL_SPI0_OFFSET 0x00000090u
#define ACCESSCTRL_SPI0_BITS 0x000000ffu
#define ACCESSCTRL_SPI0_RESET 0x000000fcu
#define ACCESSCTRL_SPI0_DBG_RESET 0x1u
#define ACCESSCTRL_SPI0_DBG_BITS 0x00000080u
#define ACCESSCTRL_SPI0_DBG_MSB 7u
#define ACCESSCTRL_SPI0_DBG_LSB 7u
#define ACCESSCTRL_SPI0_DBG_ACCESS "RW"
#define ACCESSCTRL_SPI0_DMA_RESET 0x1u
#define ACCESSCTRL_SPI0_DMA_BITS 0x00000040u
#define ACCESSCTRL_SPI0_DMA_MSB 6u
#define ACCESSCTRL_SPI0_DMA_LSB 6u
#define ACCESSCTRL_SPI0_DMA_ACCESS "RW"
#define ACCESSCTRL_SPI0_CORE1_RESET 0x1u
#define ACCESSCTRL_SPI0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SPI0_CORE1_MSB 5u
#define ACCESSCTRL_SPI0_CORE1_LSB 5u
#define ACCESSCTRL_SPI0_CORE1_ACCESS "RW"
#define ACCESSCTRL_SPI0_CORE0_RESET 0x1u
#define ACCESSCTRL_SPI0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SPI0_CORE0_MSB 4u
#define ACCESSCTRL_SPI0_CORE0_LSB 4u
#define ACCESSCTRL_SPI0_CORE0_ACCESS "RW"
#define ACCESSCTRL_SPI0_SP_RESET 0x1u
#define ACCESSCTRL_SPI0_SP_BITS 0x00000008u
#define ACCESSCTRL_SPI0_SP_MSB 3u
#define ACCESSCTRL_SPI0_SP_LSB 3u
#define ACCESSCTRL_SPI0_SP_ACCESS "RW"
#define ACCESSCTRL_SPI0_SU_RESET 0x1u
#define ACCESSCTRL_SPI0_SU_BITS 0x00000004u
#define ACCESSCTRL_SPI0_SU_MSB 2u
#define ACCESSCTRL_SPI0_SU_LSB 2u
#define ACCESSCTRL_SPI0_SU_ACCESS "RW"
#define ACCESSCTRL_SPI0_NSP_RESET 0x0u
#define ACCESSCTRL_SPI0_NSP_BITS 0x00000002u
#define ACCESSCTRL_SPI0_NSP_MSB 1u
#define ACCESSCTRL_SPI0_NSP_LSB 1u
#define ACCESSCTRL_SPI0_NSP_ACCESS "RW"
#define ACCESSCTRL_SPI0_NSU_RESET 0x0u
#define ACCESSCTRL_SPI0_NSU_BITS 0x00000001u
#define ACCESSCTRL_SPI0_NSU_MSB 0u
#define ACCESSCTRL_SPI0_NSU_LSB 0u
#define ACCESSCTRL_SPI0_NSU_ACCESS "RW"
#define ACCESSCTRL_SPI1_OFFSET 0x00000094u
#define ACCESSCTRL_SPI1_BITS 0x000000ffu
#define ACCESSCTRL_SPI1_RESET 0x000000fcu
#define ACCESSCTRL_SPI1_DBG_RESET 0x1u
#define ACCESSCTRL_SPI1_DBG_BITS 0x00000080u
#define ACCESSCTRL_SPI1_DBG_MSB 7u
#define ACCESSCTRL_SPI1_DBG_LSB 7u
#define ACCESSCTRL_SPI1_DBG_ACCESS "RW"
#define ACCESSCTRL_SPI1_DMA_RESET 0x1u
#define ACCESSCTRL_SPI1_DMA_BITS 0x00000040u
#define ACCESSCTRL_SPI1_DMA_MSB 6u
#define ACCESSCTRL_SPI1_DMA_LSB 6u
#define ACCESSCTRL_SPI1_DMA_ACCESS "RW"
#define ACCESSCTRL_SPI1_CORE1_RESET 0x1u
#define ACCESSCTRL_SPI1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SPI1_CORE1_MSB 5u
#define ACCESSCTRL_SPI1_CORE1_LSB 5u
#define ACCESSCTRL_SPI1_CORE1_ACCESS "RW"
#define ACCESSCTRL_SPI1_CORE0_RESET 0x1u
#define ACCESSCTRL_SPI1_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SPI1_CORE0_MSB 4u
#define ACCESSCTRL_SPI1_CORE0_LSB 4u
#define ACCESSCTRL_SPI1_CORE0_ACCESS "RW"
#define ACCESSCTRL_SPI1_SP_RESET 0x1u
#define ACCESSCTRL_SPI1_SP_BITS 0x00000008u
#define ACCESSCTRL_SPI1_SP_MSB 3u
#define ACCESSCTRL_SPI1_SP_LSB 3u
#define ACCESSCTRL_SPI1_SP_ACCESS "RW"
#define ACCESSCTRL_SPI1_SU_RESET 0x1u
#define ACCESSCTRL_SPI1_SU_BITS 0x00000004u
#define ACCESSCTRL_SPI1_SU_MSB 2u
#define ACCESSCTRL_SPI1_SU_LSB 2u
#define ACCESSCTRL_SPI1_SU_ACCESS "RW"
#define ACCESSCTRL_SPI1_NSP_RESET 0x0u
#define ACCESSCTRL_SPI1_NSP_BITS 0x00000002u
#define ACCESSCTRL_SPI1_NSP_MSB 1u
#define ACCESSCTRL_SPI1_NSP_LSB 1u
#define ACCESSCTRL_SPI1_NSP_ACCESS "RW"
#define ACCESSCTRL_SPI1_NSU_RESET 0x0u
#define ACCESSCTRL_SPI1_NSU_BITS 0x00000001u
#define ACCESSCTRL_SPI1_NSU_MSB 0u
#define ACCESSCTRL_SPI1_NSU_LSB 0u
#define ACCESSCTRL_SPI1_NSU_ACCESS "RW"
#define ACCESSCTRL_TIMER0_OFFSET 0x00000098u
#define ACCESSCTRL_TIMER0_BITS 0x000000ffu
#define ACCESSCTRL_TIMER0_RESET 0x000000fcu
#define ACCESSCTRL_TIMER0_DBG_RESET 0x1u
#define ACCESSCTRL_TIMER0_DBG_BITS 0x00000080u
#define ACCESSCTRL_TIMER0_DBG_MSB 7u
#define ACCESSCTRL_TIMER0_DBG_LSB 7u
#define ACCESSCTRL_TIMER0_DBG_ACCESS "RW"
#define ACCESSCTRL_TIMER0_DMA_RESET 0x1u
#define ACCESSCTRL_TIMER0_DMA_BITS 0x00000040u
#define ACCESSCTRL_TIMER0_DMA_MSB 6u
#define ACCESSCTRL_TIMER0_DMA_LSB 6u
#define ACCESSCTRL_TIMER0_DMA_ACCESS "RW"
#define ACCESSCTRL_TIMER0_CORE1_RESET 0x1u
#define ACCESSCTRL_TIMER0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_TIMER0_CORE1_MSB 5u
#define ACCESSCTRL_TIMER0_CORE1_LSB 5u
#define ACCESSCTRL_TIMER0_CORE1_ACCESS "RW"
#define ACCESSCTRL_TIMER0_CORE0_RESET 0x1u
#define ACCESSCTRL_TIMER0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_TIMER0_CORE0_MSB 4u
#define ACCESSCTRL_TIMER0_CORE0_LSB 4u
#define ACCESSCTRL_TIMER0_CORE0_ACCESS "RW"
#define ACCESSCTRL_TIMER0_SP_RESET 0x1u
#define ACCESSCTRL_TIMER0_SP_BITS 0x00000008u
#define ACCESSCTRL_TIMER0_SP_MSB 3u
#define ACCESSCTRL_TIMER0_SP_LSB 3u
#define ACCESSCTRL_TIMER0_SP_ACCESS "RW"
#define ACCESSCTRL_TIMER0_SU_RESET 0x1u
#define ACCESSCTRL_TIMER0_SU_BITS 0x00000004u
#define ACCESSCTRL_TIMER0_SU_MSB 2u
#define ACCESSCTRL_TIMER0_SU_LSB 2u
#define ACCESSCTRL_TIMER0_SU_ACCESS "RW"
#define ACCESSCTRL_TIMER0_NSP_RESET 0x0u
#define ACCESSCTRL_TIMER0_NSP_BITS 0x00000002u
#define ACCESSCTRL_TIMER0_NSP_MSB 1u
#define ACCESSCTRL_TIMER0_NSP_LSB 1u
#define ACCESSCTRL_TIMER0_NSP_ACCESS "RW"
#define ACCESSCTRL_TIMER0_NSU_RESET 0x0u
#define ACCESSCTRL_TIMER0_NSU_BITS 0x00000001u
#define ACCESSCTRL_TIMER0_NSU_MSB 0u
#define ACCESSCTRL_TIMER0_NSU_LSB 0u
#define ACCESSCTRL_TIMER0_NSU_ACCESS "RW"
#define ACCESSCTRL_TIMER1_OFFSET 0x0000009cu
#define ACCESSCTRL_TIMER1_BITS 0x000000ffu
#define ACCESSCTRL_TIMER1_RESET 0x000000fcu
#define ACCESSCTRL_TIMER1_DBG_RESET 0x1u
#define ACCESSCTRL_TIMER1_DBG_BITS 0x00000080u
#define ACCESSCTRL_TIMER1_DBG_MSB 7u
#define ACCESSCTRL_TIMER1_DBG_LSB 7u
#define ACCESSCTRL_TIMER1_DBG_ACCESS "RW"
#define ACCESSCTRL_TIMER1_DMA_RESET 0x1u
#define ACCESSCTRL_TIMER1_DMA_BITS 0x00000040u
#define ACCESSCTRL_TIMER1_DMA_MSB 6u
#define ACCESSCTRL_TIMER1_DMA_LSB 6u
#define ACCESSCTRL_TIMER1_DMA_ACCESS "RW"
#define ACCESSCTRL_TIMER1_CORE1_RESET 0x1u
#define ACCESSCTRL_TIMER1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_TIMER1_CORE1_MSB 5u
#define ACCESSCTRL_TIMER1_CORE1_LSB 5u
#define ACCESSCTRL_TIMER1_CORE1_ACCESS "RW"
#define ACCESSCTRL_TIMER1_CORE0_RESET 0x1u
#define ACCESSCTRL_TIMER1_CORE0_BITS 0x00000010u
#define ACCESSCTRL_TIMER1_CORE0_MSB 4u
#define ACCESSCTRL_TIMER1_CORE0_LSB 4u
#define ACCESSCTRL_TIMER1_CORE0_ACCESS "RW"
#define ACCESSCTRL_TIMER1_SP_RESET 0x1u
#define ACCESSCTRL_TIMER1_SP_BITS 0x00000008u
#define ACCESSCTRL_TIMER1_SP_MSB 3u
#define ACCESSCTRL_TIMER1_SP_LSB 3u
#define ACCESSCTRL_TIMER1_SP_ACCESS "RW"
#define ACCESSCTRL_TIMER1_SU_RESET 0x1u
#define ACCESSCTRL_TIMER1_SU_BITS 0x00000004u
#define ACCESSCTRL_TIMER1_SU_MSB 2u
#define ACCESSCTRL_TIMER1_SU_LSB 2u
#define ACCESSCTRL_TIMER1_SU_ACCESS "RW"
#define ACCESSCTRL_TIMER1_NSP_RESET 0x0u
#define ACCESSCTRL_TIMER1_NSP_BITS 0x00000002u
#define ACCESSCTRL_TIMER1_NSP_MSB 1u
#define ACCESSCTRL_TIMER1_NSP_LSB 1u
#define ACCESSCTRL_TIMER1_NSP_ACCESS "RW"
#define ACCESSCTRL_TIMER1_NSU_RESET 0x0u
#define ACCESSCTRL_TIMER1_NSU_BITS 0x00000001u
#define ACCESSCTRL_TIMER1_NSU_MSB 0u
#define ACCESSCTRL_TIMER1_NSU_LSB 0u
#define ACCESSCTRL_TIMER1_NSU_ACCESS "RW"
#define ACCESSCTRL_UART0_OFFSET 0x000000a0u
#define ACCESSCTRL_UART0_BITS 0x000000ffu
#define ACCESSCTRL_UART0_RESET 0x000000fcu
#define ACCESSCTRL_UART0_DBG_RESET 0x1u
#define ACCESSCTRL_UART0_DBG_BITS 0x00000080u
#define ACCESSCTRL_UART0_DBG_MSB 7u
#define ACCESSCTRL_UART0_DBG_LSB 7u
#define ACCESSCTRL_UART0_DBG_ACCESS "RW"
#define ACCESSCTRL_UART0_DMA_RESET 0x1u
#define ACCESSCTRL_UART0_DMA_BITS 0x00000040u
#define ACCESSCTRL_UART0_DMA_MSB 6u
#define ACCESSCTRL_UART0_DMA_LSB 6u
#define ACCESSCTRL_UART0_DMA_ACCESS "RW"
#define ACCESSCTRL_UART0_CORE1_RESET 0x1u
#define ACCESSCTRL_UART0_CORE1_BITS 0x00000020u
#define ACCESSCTRL_UART0_CORE1_MSB 5u
#define ACCESSCTRL_UART0_CORE1_LSB 5u
#define ACCESSCTRL_UART0_CORE1_ACCESS "RW"
#define ACCESSCTRL_UART0_CORE0_RESET 0x1u
#define ACCESSCTRL_UART0_CORE0_BITS 0x00000010u
#define ACCESSCTRL_UART0_CORE0_MSB 4u
#define ACCESSCTRL_UART0_CORE0_LSB 4u
#define ACCESSCTRL_UART0_CORE0_ACCESS "RW"
#define ACCESSCTRL_UART0_SP_RESET 0x1u
#define ACCESSCTRL_UART0_SP_BITS 0x00000008u
#define ACCESSCTRL_UART0_SP_MSB 3u
#define ACCESSCTRL_UART0_SP_LSB 3u
#define ACCESSCTRL_UART0_SP_ACCESS "RW"
#define ACCESSCTRL_UART0_SU_RESET 0x1u
#define ACCESSCTRL_UART0_SU_BITS 0x00000004u
#define ACCESSCTRL_UART0_SU_MSB 2u
#define ACCESSCTRL_UART0_SU_LSB 2u
#define ACCESSCTRL_UART0_SU_ACCESS "RW"
#define ACCESSCTRL_UART0_NSP_RESET 0x0u
#define ACCESSCTRL_UART0_NSP_BITS 0x00000002u
#define ACCESSCTRL_UART0_NSP_MSB 1u
#define ACCESSCTRL_UART0_NSP_LSB 1u
#define ACCESSCTRL_UART0_NSP_ACCESS "RW"
#define ACCESSCTRL_UART0_NSU_RESET 0x0u
#define ACCESSCTRL_UART0_NSU_BITS 0x00000001u
#define ACCESSCTRL_UART0_NSU_MSB 0u
#define ACCESSCTRL_UART0_NSU_LSB 0u
#define ACCESSCTRL_UART0_NSU_ACCESS "RW"
#define ACCESSCTRL_UART1_OFFSET 0x000000a4u
#define ACCESSCTRL_UART1_BITS 0x000000ffu
#define ACCESSCTRL_UART1_RESET 0x000000fcu
#define ACCESSCTRL_UART1_DBG_RESET 0x1u
#define ACCESSCTRL_UART1_DBG_BITS 0x00000080u
#define ACCESSCTRL_UART1_DBG_MSB 7u
#define ACCESSCTRL_UART1_DBG_LSB 7u
#define ACCESSCTRL_UART1_DBG_ACCESS "RW"
#define ACCESSCTRL_UART1_DMA_RESET 0x1u
#define ACCESSCTRL_UART1_DMA_BITS 0x00000040u
#define ACCESSCTRL_UART1_DMA_MSB 6u
#define ACCESSCTRL_UART1_DMA_LSB 6u
#define ACCESSCTRL_UART1_DMA_ACCESS "RW"
#define ACCESSCTRL_UART1_CORE1_RESET 0x1u
#define ACCESSCTRL_UART1_CORE1_BITS 0x00000020u
#define ACCESSCTRL_UART1_CORE1_MSB 5u
#define ACCESSCTRL_UART1_CORE1_LSB 5u
#define ACCESSCTRL_UART1_CORE1_ACCESS "RW"
#define ACCESSCTRL_UART1_CORE0_RESET 0x1u
#define ACCESSCTRL_UART1_CORE0_BITS 0x00000010u
