gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define ACCESSCTRL_UART1_CORE0_MSB 4u
#define ACCESSCTRL_UART1_CORE0_LSB 4u
#define ACCESSCTRL_UART1_CORE0_ACCESS "RW"
#define ACCESSCTRL_UART1_SP_RESET 0x1u
#define ACCESSCTRL_UART1_SP_BITS 0x00000008u
#define ACCESSCTRL_UART1_SP_MSB 3u
#define ACCESSCTRL_UART1_SP_LSB 3u
#define ACCESSCTRL_UART1_SP_ACCESS "RW"
#define ACCESSCTRL_UART1_SU_RESET 0x1u
#define ACCESSCTRL_UART1_SU_BITS 0x00000004u
#define ACCESSCTRL_UART1_SU_MSB 2u
#define ACCESSCTRL_UART1_SU_LSB 2u
#define ACCESSCTRL_UART1_SU_ACCESS "RW"
#define ACCESSCTRL_UART1_NSP_RESET 0x0u
#define ACCESSCTRL_UART1_NSP_BITS 0x00000002u
#define ACCESSCTRL_UART1_NSP_MSB 1u
#define ACCESSCTRL_UART1_NSP_LSB 1u
#define ACCESSCTRL_UART1_NSP_ACCESS "RW"
#define ACCESSCTRL_UART1_NSU_RESET 0x0u
#define ACCESSCTRL_UART1_NSU_BITS 0x00000001u
#define ACCESSCTRL_UART1_NSU_MSB 0u
#define ACCESSCTRL_UART1_NSU_LSB 0u
#define ACCESSCTRL_UART1_NSU_ACCESS "RW"
#define ACCESSCTRL_OTP_OFFSET 0x000000a8u
#define ACCESSCTRL_OTP_BITS 0x000000ffu
#define ACCESSCTRL_OTP_RESET 0x000000fcu
#define ACCESSCTRL_OTP_DBG_RESET 0x1u
#define ACCESSCTRL_OTP_DBG_BITS 0x00000080u
#define ACCESSCTRL_OTP_DBG_MSB 7u
#define ACCESSCTRL_OTP_DBG_LSB 7u
#define ACCESSCTRL_OTP_DBG_ACCESS "RW"
#define ACCESSCTRL_OTP_DMA_RESET 0x1u
#define ACCESSCTRL_OTP_DMA_BITS 0x00000040u
#define ACCESSCTRL_OTP_DMA_MSB 6u
#define ACCESSCTRL_OTP_DMA_LSB 6u
#define ACCESSCTRL_OTP_DMA_ACCESS "RW"
#define ACCESSCTRL_OTP_CORE1_RESET 0x1u
#define ACCESSCTRL_OTP_CORE1_BITS 0x00000020u
#define ACCESSCTRL_OTP_CORE1_MSB 5u
#define ACCESSCTRL_OTP_CORE1_LSB 5u
#define ACCESSCTRL_OTP_CORE1_ACCESS "RW"
#define ACCESSCTRL_OTP_CORE0_RESET 0x1u
#define ACCESSCTRL_OTP_CORE0_BITS 0x00000010u
#define ACCESSCTRL_OTP_CORE0_MSB 4u
#define ACCESSCTRL_OTP_CORE0_LSB 4u
#define ACCESSCTRL_OTP_CORE0_ACCESS "RW"
#define ACCESSCTRL_OTP_SP_RESET 0x1u
#define ACCESSCTRL_OTP_SP_BITS 0x00000008u
#define ACCESSCTRL_OTP_SP_MSB 3u
#define ACCESSCTRL_OTP_SP_LSB 3u
#define ACCESSCTRL_OTP_SP_ACCESS "RW"
#define ACCESSCTRL_OTP_SU_RESET 0x1u
#define ACCESSCTRL_OTP_SU_BITS 0x00000004u
#define ACCESSCTRL_OTP_SU_MSB 2u
#define ACCESSCTRL_OTP_SU_LSB 2u
#define ACCESSCTRL_OTP_SU_ACCESS "RW"
#define ACCESSCTRL_OTP_NSP_RESET 0x0u
#define ACCESSCTRL_OTP_NSP_BITS 0x00000002u
#define ACCESSCTRL_OTP_NSP_MSB 1u
#define ACCESSCTRL_OTP_NSP_LSB 1u
#define ACCESSCTRL_OTP_NSP_ACCESS "RW"
#define ACCESSCTRL_OTP_NSU_RESET 0x0u
#define ACCESSCTRL_OTP_NSU_BITS 0x00000001u
#define ACCESSCTRL_OTP_NSU_MSB 0u
#define ACCESSCTRL_OTP_NSU_LSB 0u
#define ACCESSCTRL_OTP_NSU_ACCESS "RW"
#define ACCESSCTRL_TBMAN_OFFSET 0x000000acu
#define ACCESSCTRL_TBMAN_BITS 0x000000ffu
#define ACCESSCTRL_TBMAN_RESET 0x000000fcu
#define ACCESSCTRL_TBMAN_DBG_RESET 0x1u
#define ACCESSCTRL_TBMAN_DBG_BITS 0x00000080u
#define ACCESSCTRL_TBMAN_DBG_MSB 7u
#define ACCESSCTRL_TBMAN_DBG_LSB 7u
#define ACCESSCTRL_TBMAN_DBG_ACCESS "RW"
#define ACCESSCTRL_TBMAN_DMA_RESET 0x1u
#define ACCESSCTRL_TBMAN_DMA_BITS 0x00000040u
#define ACCESSCTRL_TBMAN_DMA_MSB 6u
#define ACCESSCTRL_TBMAN_DMA_LSB 6u
#define ACCESSCTRL_TBMAN_DMA_ACCESS "RW"
#define ACCESSCTRL_TBMAN_CORE1_RESET 0x1u
#define ACCESSCTRL_TBMAN_CORE1_BITS 0x00000020u
#define ACCESSCTRL_TBMAN_CORE1_MSB 5u
#define ACCESSCTRL_TBMAN_CORE1_LSB 5u
#define ACCESSCTRL_TBMAN_CORE1_ACCESS "RW"
#define ACCESSCTRL_TBMAN_CORE0_RESET 0x1u
#define ACCESSCTRL_TBMAN_CORE0_BITS 0x00000010u
#define ACCESSCTRL_TBMAN_CORE0_MSB 4u
#define ACCESSCTRL_TBMAN_CORE0_LSB 4u
#define ACCESSCTRL_TBMAN_CORE0_ACCESS "RW"
#define ACCESSCTRL_TBMAN_SP_RESET 0x1u
#define ACCESSCTRL_TBMAN_SP_BITS 0x00000008u
#define ACCESSCTRL_TBMAN_SP_MSB 3u
#define ACCESSCTRL_TBMAN_SP_LSB 3u
#define ACCESSCTRL_TBMAN_SP_ACCESS "RW"
#define ACCESSCTRL_TBMAN_SU_RESET 0x1u
#define ACCESSCTRL_TBMAN_SU_BITS 0x00000004u
#define ACCESSCTRL_TBMAN_SU_MSB 2u
#define ACCESSCTRL_TBMAN_SU_LSB 2u
#define ACCESSCTRL_TBMAN_SU_ACCESS "RW"
#define ACCESSCTRL_TBMAN_NSP_RESET 0x0u
#define ACCESSCTRL_TBMAN_NSP_BITS 0x00000002u
#define ACCESSCTRL_TBMAN_NSP_MSB 1u
#define ACCESSCTRL_TBMAN_NSP_LSB 1u
#define ACCESSCTRL_TBMAN_NSP_ACCESS "RW"
#define ACCESSCTRL_TBMAN_NSU_RESET 0x0u
#define ACCESSCTRL_TBMAN_NSU_BITS 0x00000001u
#define ACCESSCTRL_TBMAN_NSU_MSB 0u
#define ACCESSCTRL_TBMAN_NSU_LSB 0u
#define ACCESSCTRL_TBMAN_NSU_ACCESS "RW"
#define ACCESSCTRL_POWMAN_OFFSET 0x000000b0u
#define ACCESSCTRL_POWMAN_BITS 0x000000ffu
#define ACCESSCTRL_POWMAN_RESET 0x000000b8u
#define ACCESSCTRL_POWMAN_DBG_RESET 0x1u
#define ACCESSCTRL_POWMAN_DBG_BITS 0x00000080u
#define ACCESSCTRL_POWMAN_DBG_MSB 7u
#define ACCESSCTRL_POWMAN_DBG_LSB 7u
#define ACCESSCTRL_POWMAN_DBG_ACCESS "RW"
#define ACCESSCTRL_POWMAN_DMA_RESET 0x0u
#define ACCESSCTRL_POWMAN_DMA_BITS 0x00000040u
#define ACCESSCTRL_POWMAN_DMA_MSB 6u
#define ACCESSCTRL_POWMAN_DMA_LSB 6u
#define ACCESSCTRL_POWMAN_DMA_ACCESS "RW"
#define ACCESSCTRL_POWMAN_CORE1_RESET 0x1u
#define ACCESSCTRL_POWMAN_CORE1_BITS 0x00000020u
#define ACCESSCTRL_POWMAN_CORE1_MSB 5u
#define ACCESSCTRL_POWMAN_CORE1_LSB 5u
#define ACCESSCTRL_POWMAN_CORE1_ACCESS "RW"
#define ACCESSCTRL_POWMAN_CORE0_RESET 0x1u
#define ACCESSCTRL_POWMAN_CORE0_BITS 0x00000010u
#define ACCESSCTRL_POWMAN_CORE0_MSB 4u
#define ACCESSCTRL_POWMAN_CORE0_LSB 4u
#define ACCESSCTRL_POWMAN_CORE0_ACCESS "RW"
#define ACCESSCTRL_POWMAN_SP_RESET 0x1u
#define ACCESSCTRL_POWMAN_SP_BITS 0x00000008u
#define ACCESSCTRL_POWMAN_SP_MSB 3u
#define ACCESSCTRL_POWMAN_SP_LSB 3u
#define ACCESSCTRL_POWMAN_SP_ACCESS "RW"
#define ACCESSCTRL_POWMAN_SU_RESET 0x0u
#define ACCESSCTRL_POWMAN_SU_BITS 0x00000004u
#define ACCESSCTRL_POWMAN_SU_MSB 2u
#define ACCESSCTRL_POWMAN_SU_LSB 2u
#define ACCESSCTRL_POWMAN_SU_ACCESS "RW"
#define ACCESSCTRL_POWMAN_NSP_RESET 0x0u
#define ACCESSCTRL_POWMAN_NSP_BITS 0x00000002u
#define ACCESSCTRL_POWMAN_NSP_MSB 1u
#define ACCESSCTRL_POWMAN_NSP_LSB 1u
#define ACCESSCTRL_POWMAN_NSP_ACCESS "RW"
#define ACCESSCTRL_POWMAN_NSU_RESET 0x0u
#define ACCESSCTRL_POWMAN_NSU_BITS 0x00000001u
#define ACCESSCTRL_POWMAN_NSU_MSB 0u
#define ACCESSCTRL_POWMAN_NSU_LSB 0u
#define ACCESSCTRL_POWMAN_NSU_ACCESS "RW"
#define ACCESSCTRL_TRNG_OFFSET 0x000000b4u
#define ACCESSCTRL_TRNG_BITS 0x000000ffu
#define ACCESSCTRL_TRNG_RESET 0x000000b8u
#define ACCESSCTRL_TRNG_DBG_RESET 0x1u
#define ACCESSCTRL_TRNG_DBG_BITS 0x00000080u
#define ACCESSCTRL_TRNG_DBG_MSB 7u
#define ACCESSCTRL_TRNG_DBG_LSB 7u
#define ACCESSCTRL_TRNG_DBG_ACCESS "RW"
#define ACCESSCTRL_TRNG_DMA_RESET 0x0u
#define ACCESSCTRL_TRNG_DMA_BITS 0x00000040u
#define ACCESSCTRL_TRNG_DMA_MSB 6u
#define ACCESSCTRL_TRNG_DMA_LSB 6u
#define ACCESSCTRL_TRNG_DMA_ACCESS "RW"
#define ACCESSCTRL_TRNG_CORE1_RESET 0x1u
#define ACCESSCTRL_TRNG_CORE1_BITS 0x00000020u
#define ACCESSCTRL_TRNG_CORE1_MSB 5u
#define ACCESSCTRL_TRNG_CORE1_LSB 5u
#define ACCESSCTRL_TRNG_CORE1_ACCESS "RW"
#define ACCESSCTRL_TRNG_CORE0_RESET 0x1u
#define ACCESSCTRL_TRNG_CORE0_BITS 0x00000010u
#define ACCESSCTRL_TRNG_CORE0_MSB 4u
#define ACCESSCTRL_TRNG_CORE0_LSB 4u
#define ACCESSCTRL_TRNG_CORE0_ACCESS "RW"
#define ACCESSCTRL_TRNG_SP_RESET 0x1u
#define ACCESSCTRL_TRNG_SP_BITS 0x00000008u
#define ACCESSCTRL_TRNG_SP_MSB 3u
#define ACCESSCTRL_TRNG_SP_LSB 3u
#define ACCESSCTRL_TRNG_SP_ACCESS "RW"
#define ACCESSCTRL_TRNG_SU_RESET 0x0u
#define ACCESSCTRL_TRNG_SU_BITS 0x00000004u
#define ACCESSCTRL_TRNG_SU_MSB 2u
#define ACCESSCTRL_TRNG_SU_LSB 2u
#define ACCESSCTRL_TRNG_SU_ACCESS "RW"
#define ACCESSCTRL_TRNG_NSP_RESET 0x0u
#define ACCESSCTRL_TRNG_NSP_BITS 0x00000002u
#define ACCESSCTRL_TRNG_NSP_MSB 1u
#define ACCESSCTRL_TRNG_NSP_LSB 1u
#define ACCESSCTRL_TRNG_NSP_ACCESS "RW"
#define ACCESSCTRL_TRNG_NSU_RESET 0x0u
#define ACCESSCTRL_TRNG_NSU_BITS 0x00000001u
#define ACCESSCTRL_TRNG_NSU_MSB 0u
#define ACCESSCTRL_TRNG_NSU_LSB 0u
#define ACCESSCTRL_TRNG_NSU_ACCESS "RW"
#define ACCESSCTRL_SHA256_OFFSET 0x000000b8u
#define ACCESSCTRL_SHA256_BITS 0x000000ffu
#define ACCESSCTRL_SHA256_RESET 0x000000f8u
#define ACCESSCTRL_SHA256_DBG_RESET 0x1u
#define ACCESSCTRL_SHA256_DBG_BITS 0x00000080u
#define ACCESSCTRL_SHA256_DBG_MSB 7u
#define ACCESSCTRL_SHA256_DBG_LSB 7u
#define ACCESSCTRL_SHA256_DBG_ACCESS "RW"
#define ACCESSCTRL_SHA256_DMA_RESET 0x1u
#define ACCESSCTRL_SHA256_DMA_BITS 0x00000040u
#define ACCESSCTRL_SHA256_DMA_MSB 6u
#define ACCESSCTRL_SHA256_DMA_LSB 6u
#define ACCESSCTRL_SHA256_DMA_ACCESS "RW"
#define ACCESSCTRL_SHA256_CORE1_RESET 0x1u
#define ACCESSCTRL_SHA256_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SHA256_CORE1_MSB 5u
#define ACCESSCTRL_SHA256_CORE1_LSB 5u
#define ACCESSCTRL_SHA256_CORE1_ACCESS "RW"
#define ACCESSCTRL_SHA256_CORE0_RESET 0x1u
#define ACCESSCTRL_SHA256_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SHA256_CORE0_MSB 4u
#define ACCESSCTRL_SHA256_CORE0_LSB 4u
#define ACCESSCTRL_SHA256_CORE0_ACCESS "RW"
#define ACCESSCTRL_SHA256_SP_RESET 0x1u
#define ACCESSCTRL_SHA256_SP_BITS 0x00000008u
#define ACCESSCTRL_SHA256_SP_MSB 3u
#define ACCESSCTRL_SHA256_SP_LSB 3u
#define ACCESSCTRL_SHA256_SP_ACCESS "RW"
#define ACCESSCTRL_SHA256_SU_RESET 0x0u
#define ACCESSCTRL_SHA256_SU_BITS 0x00000004u
#define ACCESSCTRL_SHA256_SU_MSB 2u
#define ACCESSCTRL_SHA256_SU_LSB 2u
#define ACCESSCTRL_SHA256_SU_ACCESS "RW"
#define ACCESSCTRL_SHA256_NSP_RESET 0x0u
#define ACCESSCTRL_SHA256_NSP_BITS 0x00000002u
#define ACCESSCTRL_SHA256_NSP_MSB 1u
#define ACCESSCTRL_SHA256_NSP_LSB 1u
#define ACCESSCTRL_SHA256_NSP_ACCESS "RW"
#define ACCESSCTRL_SHA256_NSU_RESET 0x0u
#define ACCESSCTRL_SHA256_NSU_BITS 0x00000001u
#define ACCESSCTRL_SHA256_NSU_MSB 0u
#define ACCESSCTRL_SHA256_NSU_LSB 0u
#define ACCESSCTRL_SHA256_NSU_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_OFFSET 0x000000bcu
#define ACCESSCTRL_SYSCFG_BITS 0x000000ffu
#define ACCESSCTRL_SYSCFG_RESET 0x000000b8u
#define ACCESSCTRL_SYSCFG_DBG_RESET 0x1u
#define ACCESSCTRL_SYSCFG_DBG_BITS 0x00000080u
#define ACCESSCTRL_SYSCFG_DBG_MSB 7u
#define ACCESSCTRL_SYSCFG_DBG_LSB 7u
#define ACCESSCTRL_SYSCFG_DBG_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_DMA_RESET 0x0u
#define ACCESSCTRL_SYSCFG_DMA_BITS 0x00000040u
#define ACCESSCTRL_SYSCFG_DMA_MSB 6u
#define ACCESSCTRL_SYSCFG_DMA_LSB 6u
#define ACCESSCTRL_SYSCFG_DMA_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_CORE1_RESET 0x1u
#define ACCESSCTRL_SYSCFG_CORE1_BITS 0x00000020u
#define ACCESSCTRL_SYSCFG_CORE1_MSB 5u
#define ACCESSCTRL_SYSCFG_CORE1_LSB 5u
#define ACCESSCTRL_SYSCFG_CORE1_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_CORE0_RESET 0x1u
#define ACCESSCTRL_SYSCFG_CORE0_BITS 0x00000010u
#define ACCESSCTRL_SYSCFG_CORE0_MSB 4u
#define ACCESSCTRL_SYSCFG_CORE0_LSB 4u
#define ACCESSCTRL_SYSCFG_CORE0_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_SP_RESET 0x1u
#define ACCESSCTRL_SYSCFG_SP_BITS 0x00000008u
#define ACCESSCTRL_SYSCFG_SP_MSB 3u
#define ACCESSCTRL_SYSCFG_SP_LSB 3u
#define ACCESSCTRL_SYSCFG_SP_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_SU_RESET 0x0u
#define ACCESSCTRL_SYSCFG_SU_BITS 0x00000004u
#define ACCESSCTRL_SYSCFG_SU_MSB 2u
#define ACCESSCTRL_SYSCFG_SU_LSB 2u
#define ACCESSCTRL_SYSCFG_SU_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_NSP_RESET 0x0u
#define ACCESSCTRL_SYSCFG_NSP_BITS 0x00000002u
#define ACCESSCTRL_SYSCFG_NSP_MSB 1u
#define ACCESSCTRL_SYSCFG_NSP_LSB 1u
#define ACCESSCTRL_SYSCFG_NSP_ACCESS "RW"
#define ACCESSCTRL_SYSCFG_NSU_RESET 0x0u
#define ACCESSCTRL_SYSCFG_NSU_BITS 0x00000001u
#define ACCESSCTRL_SYSCFG_NSU_MSB 0u
#define ACCESSCTRL_SYSCFG_NSU_LSB 0u
#define ACCESSCTRL_SYSCFG_NSU_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_OFFSET 0x000000c0u
#define ACCESSCTRL_CLOCKS_BITS 0x000000ffu
#define ACCESSCTRL_CLOCKS_RESET 0x000000b8u
#define ACCESSCTRL_CLOCKS_DBG_RESET 0x1u
#define ACCESSCTRL_CLOCKS_DBG_BITS 0x00000080u
#define ACCESSCTRL_CLOCKS_DBG_MSB 7u
#define ACCESSCTRL_CLOCKS_DBG_LSB 7u
#define ACCESSCTRL_CLOCKS_DBG_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_DMA_RESET 0x0u
#define ACCESSCTRL_CLOCKS_DMA_BITS 0x00000040u
#define ACCESSCTRL_CLOCKS_DMA_MSB 6u
#define ACCESSCTRL_CLOCKS_DMA_LSB 6u
#define ACCESSCTRL_CLOCKS_DMA_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_CORE1_RESET 0x1u
#define ACCESSCTRL_CLOCKS_CORE1_BITS 0x00000020u
#define ACCESSCTRL_CLOCKS_CORE1_MSB 5u
#define ACCESSCTRL_CLOCKS_CORE1_LSB 5u
#define ACCESSCTRL_CLOCKS_CORE1_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_CORE0_RESET 0x1u
#define ACCESSCTRL_CLOCKS_CORE0_BITS 0x00000010u
#define ACCESSCTRL_CLOCKS_CORE0_MSB 4u
#define ACCESSCTRL_CLOCKS_CORE0_LSB 4u
#define ACCESSCTRL_CLOCKS_CORE0_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_SP_RESET 0x1u
#define ACCESSCTRL_CLOCKS_SP_BITS 0x00000008u
#define ACCESSCTRL_CLOCKS_SP_MSB 3u
#define ACCESSCTRL_CLOCKS_SP_LSB 3u
#define ACCESSCTRL_CLOCKS_SP_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_SU_RESET 0x0u
#define ACCESSCTRL_CLOCKS_SU_BITS 0x00000004u
#define ACCESSCTRL_CLOCKS_SU_MSB 2u
#define ACCESSCTRL_CLOCKS_SU_LSB 2u
#define ACCESSCTRL_CLOCKS_SU_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_NSP_RESET 0x0u
#define ACCESSCTRL_CLOCKS_NSP_BITS 0x00000002u
#define ACCESSCTRL_CLOCKS_NSP_MSB 1u
#define ACCESSCTRL_CLOCKS_NSP_LSB 1u
#define ACCESSCTRL_CLOCKS_NSP_ACCESS "RW"
#define ACCESSCTRL_CLOCKS_NSU_RESET 0x0u
#define ACCESSCTRL_CLOCKS_NSU_BITS 0x00000001u
#define ACCESSCTRL_CLOCKS_NSU_MSB 0u
#define ACCESSCTRL_CLOCKS_NSU_LSB 0u
#define ACCESSCTRL_CLOCKS_NSU_ACCESS "RW"
#define ACCESSCTRL_XOSC_OFFSET 0x000000c4u
#define ACCESSCTRL_XOSC_BITS 0x000000ffu
#define ACCESSCTRL_XOSC_RESET 0x000000b8u
#define ACCESSCTRL_XOSC_DBG_RESET 0x1u
#define ACCESSCTRL_XOSC_DBG_BITS 0x00000080u
#define ACCESSCTRL_XOSC_DBG_MSB 7u
#define ACCESSCTRL_XOSC_DBG_LSB 7u
#define ACCESSCTRL_XOSC_DBG_ACCESS "RW"
#define ACCESSCTRL_XOSC_DMA_RESET 0x0u
#define ACCESSCTRL_XOSC_DMA_BITS 0x00000040u
#define ACCESSCTRL_XOSC_DMA_MSB 6u
#define ACCESSCTRL_XOSC_DMA_LSB 6u
#define ACCESSCTRL_XOSC_DMA_ACCESS "RW"
#define ACCESSCTRL_XOSC_CORE1_RESET 0x1u
#define ACCESSCTRL_XOSC_CORE1_BITS 0x00000020u
#define ACCESSCTRL_XOSC_CORE1_MSB 5u
#define ACCESSCTRL_XOSC_CORE1_LSB 5u
#define ACCESSCTRL_XOSC_CORE1_ACCESS "RW"
#define ACCESSCTRL_XOSC_CORE0_RESET 0x1u
#define ACCESSCTRL_XOSC_CORE0_BITS 0x00000010u
#define ACCESSCTRL_XOSC_CORE0_MSB 4u
#define ACCESSCTRL_XOSC_CORE0_LSB 4u
#define ACCESSCTRL_XOSC_CORE0_ACCESS "RW"
#define ACCESSCTRL_XOSC_SP_RESET 0x1u
#define ACCESSCTRL_XOSC_SP_BITS 0x00000008u
#define ACCESSCTRL_XOSC_SP_MSB 3u
#define ACCESSCTRL_XOSC_SP_LSB 3u
#define ACCESSCTRL_XOSC_SP_ACCESS "RW"
#define ACCESSCTRL_XOSC_SU_RESET 0x0u
#define ACCESSCTRL_XOSC_SU_BITS 0x00000004u
#define ACCESSCTRL_XOSC_SU_MSB 2u
#define ACCESSCTRL_XOSC_SU_LSB 2u
#define ACCESSCTRL_XOSC_SU_ACCESS "RW"
#define ACCESSCTRL_XOSC_NSP_RESET 0x0u
#define ACCESSCTRL_XOSC_NSP_BITS 0x00000002u
#define ACCESSCTRL_XOSC_NSP_MSB 1u
#define ACCESSCTRL_XOSC_NSP_LSB 1u
#define ACCESSCTRL_XOSC_NSP_ACCESS "RW"
#define ACCESSCTRL_XOSC_NSU_RESET 0x0u
#define ACCESSCTRL_XOSC_NSU_BITS 0x00000001u
#define ACCESSCTRL_XOSC_NSU_MSB 0u
#define ACCESSCTRL_XOSC_NSU_LSB 0u
#define ACCESSCTRL_XOSC_NSU_ACCESS "RW"
#define ACCESSCTRL_ROSC_OFFSET 0x000000c8u
#define ACCESSCTRL_ROSC_BITS 0x000000ffu
#define ACCESSCTRL_ROSC_RESET 0x000000b8u
#define ACCESSCTRL_ROSC_DBG_RESET 0x1u
#define ACCESSCTRL_ROSC_DBG_BITS 0x00000080u
#define ACCESSCTRL_ROSC_DBG_MSB 7u
#define ACCESSCTRL_ROSC_DBG_LSB 7u
#define ACCESSCTRL_ROSC_DBG_ACCESS "RW"
#define ACCESSCTRL_ROSC_DMA_RESET 0x0u
#define ACCESSCTRL_ROSC_DMA_BITS 0x00000040u
#define ACCESSCTRL_ROSC_DMA_MSB 6u
#define ACCESSCTRL_ROSC_DMA_LSB 6u
#define ACCESSCTRL_ROSC_DMA_ACCESS "RW"
#define ACCESSCTRL_ROSC_CORE1_RESET 0x1u
#define ACCESSCTRL_ROSC_CORE1_BITS 0x00000020u
#define ACCESSCTRL_ROSC_CORE1_MSB 5u
#define ACCESSCTRL_ROSC_CORE1_LSB 5u
#define ACCESSCTRL_ROSC_CORE1_ACCESS "RW"
#define ACCESSCTRL_ROSC_CORE0_RESET 0x1u
#define ACCESSCTRL_ROSC_CORE0_BITS 0x00000010u
#define ACCESSCTRL_ROSC_CORE0_MSB 4u
#define ACCESSCTRL_ROSC_CORE0_LSB 4u
#define ACCESSCTRL_ROSC_CORE0_ACCESS "RW"
#define ACCESSCTRL_ROSC_SP_RESET 0x1u
#define ACCESSCTRL_ROSC_SP_BITS 0x00000008u
#define ACCESSCTRL_ROSC_SP_MSB 3u
#define ACCESSCTRL_ROSC_SP_LSB 3u
#define ACCESSCTRL_ROSC_SP_ACCESS "RW"
#define ACCESSCTRL_ROSC_SU_RESET 0x0u
#define ACCESSCTRL_ROSC_SU_BITS 0x00000004u
#define ACCESSCTRL_ROSC_SU_MSB 2u
#define ACCESSCTRL_ROSC_SU_LSB 2u
#define ACCESSCTRL_ROSC_SU_ACCESS "RW"
#define ACCESSCTRL_ROSC_NSP_RESET 0x0u
#define ACCESSCTRL_ROSC_NSP_BITS 0x00000002u
#define ACCESSCTRL_ROSC_NSP_MSB 1u
#define ACCESSCTRL_ROSC_NSP_LSB 1u
#define ACCESSCTRL_ROSC_NSP_ACCESS "RW"
#define ACCESSCTRL_ROSC_NSU_RESET 0x0u
#define ACCESSCTRL_ROSC_NSU_BITS 0x00000001u
#define ACCESSCTRL_ROSC_NSU_MSB 0u
#define ACCESSCTRL_ROSC_NSU_LSB 0u
#define ACCESSCTRL_ROSC_NSU_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_OFFSET 0x000000ccu
#define ACCESSCTRL_PLL_SYS_BITS 0x000000ffu
#define ACCESSCTRL_PLL_SYS_RESET 0x000000b8u
#define ACCESSCTRL_PLL_SYS_DBG_RESET 0x1u
#define ACCESSCTRL_PLL_SYS_DBG_BITS 0x00000080u
#define ACCESSCTRL_PLL_SYS_DBG_MSB 7u
#define ACCESSCTRL_PLL_SYS_DBG_LSB 7u
#define ACCESSCTRL_PLL_SYS_DBG_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_DMA_RESET 0x0u
#define ACCESSCTRL_PLL_SYS_DMA_BITS 0x00000040u
#define ACCESSCTRL_PLL_SYS_DMA_MSB 6u
#define ACCESSCTRL_PLL_SYS_DMA_LSB 6u
#define ACCESSCTRL_PLL_SYS_DMA_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_CORE1_RESET 0x1u
#define ACCESSCTRL_PLL_SYS_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PLL_SYS_CORE1_MSB 5u
#define ACCESSCTRL_PLL_SYS_CORE1_LSB 5u
#define ACCESSCTRL_PLL_SYS_CORE1_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_CORE0_RESET 0x1u
#define ACCESSCTRL_PLL_SYS_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PLL_SYS_CORE0_MSB 4u
#define ACCESSCTRL_PLL_SYS_CORE0_LSB 4u
#define ACCESSCTRL_PLL_SYS_CORE0_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_SP_RESET 0x1u
#define ACCESSCTRL_PLL_SYS_SP_BITS 0x00000008u
#define ACCESSCTRL_PLL_SYS_SP_MSB 3u
#define ACCESSCTRL_PLL_SYS_SP_LSB 3u
#define ACCESSCTRL_PLL_SYS_SP_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_SU_RESET 0x0u
#define ACCESSCTRL_PLL_SYS_SU_BITS 0x00000004u
#define ACCESSCTRL_PLL_SYS_SU_MSB 2u
#define ACCESSCTRL_PLL_SYS_SU_LSB 2u
#define ACCESSCTRL_PLL_SYS_SU_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_NSP_RESET 0x0u
#define ACCESSCTRL_PLL_SYS_NSP_BITS 0x00000002u
#define ACCESSCTRL_PLL_SYS_NSP_MSB 1u
#define ACCESSCTRL_PLL_SYS_NSP_LSB 1u
#define ACCESSCTRL_PLL_SYS_NSP_ACCESS "RW"
#define ACCESSCTRL_PLL_SYS_NSU_RESET 0x0u
#define ACCESSCTRL_PLL_SYS_NSU_BITS 0x00000001u
#define ACCESSCTRL_PLL_SYS_NSU_MSB 0u
#define ACCESSCTRL_PLL_SYS_NSU_LSB 0u
#define ACCESSCTRL_PLL_SYS_NSU_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_OFFSET 0x000000d0u
#define ACCESSCTRL_PLL_USB_BITS 0x000000ffu
#define ACCESSCTRL_PLL_USB_RESET 0x000000b8u
#define ACCESSCTRL_PLL_USB_DBG_RESET 0x1u
#define ACCESSCTRL_PLL_USB_DBG_BITS 0x00000080u
#define ACCESSCTRL_PLL_USB_DBG_MSB 7u
#define ACCESSCTRL_PLL_USB_DBG_LSB 7u
#define ACCESSCTRL_PLL_USB_DBG_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_DMA_RESET 0x0u
#define ACCESSCTRL_PLL_USB_DMA_BITS 0x00000040u
#define ACCESSCTRL_PLL_USB_DMA_MSB 6u
#define ACCESSCTRL_PLL_USB_DMA_LSB 6u
#define ACCESSCTRL_PLL_USB_DMA_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_CORE1_RESET 0x1u
#define ACCESSCTRL_PLL_USB_CORE1_BITS 0x00000020u
#define ACCESSCTRL_PLL_USB_CORE1_MSB 5u
#define ACCESSCTRL_PLL_USB_CORE1_LSB 5u
#define ACCESSCTRL_PLL_USB_CORE1_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_CORE0_RESET 0x1u
#define ACCESSCTRL_PLL_USB_CORE0_BITS 0x00000010u
#define ACCESSCTRL_PLL_USB_CORE0_MSB 4u
#define ACCESSCTRL_PLL_USB_CORE0_LSB 4u
#define ACCESSCTRL_PLL_USB_CORE0_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_SP_RESET 0x1u
#define ACCESSCTRL_PLL_USB_SP_BITS 0x00000008u
#define ACCESSCTRL_PLL_USB_SP_MSB 3u
#define ACCESSCTRL_PLL_USB_SP_LSB 3u
#define ACCESSCTRL_PLL_USB_SP_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_SU_RESET 0x0u
#define ACCESSCTRL_PLL_USB_SU_BITS 0x00000004u
#define ACCESSCTRL_PLL_USB_SU_MSB 2u
#define ACCESSCTRL_PLL_USB_SU_LSB 2u
#define ACCESSCTRL_PLL_USB_SU_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_NSP_RESET 0x0u
#define ACCESSCTRL_PLL_USB_NSP_BITS 0x00000002u
#define ACCESSCTRL_PLL_USB_NSP_MSB 1u
#define ACCESSCTRL_PLL_USB_NSP_LSB 1u
#define ACCESSCTRL_PLL_USB_NSP_ACCESS "RW"
#define ACCESSCTRL_PLL_USB_NSU_RESET 0x0u
#define ACCESSCTRL_PLL_USB_NSU_BITS 0x00000001u
#define ACCESSCTRL_PLL_USB_NSU_MSB 0u
#define ACCESSCTRL_PLL_USB_NSU_LSB 0u
#define ACCESSCTRL_PLL_USB_NSU_ACCESS "RW"
#define ACCESSCTRL_TICKS_OFFSET 0x000000d4u
#define ACCESSCTRL_TICKS_BITS 0x000000ffu
#define ACCESSCTRL_TICKS_RESET 0x000000b8u
#define ACCESSCTRL_TICKS_DBG_RESET 0x1u
#define ACCESSCTRL_TICKS_DBG_BITS 0x00000080u
#define ACCESSCTRL_TICKS_DBG_MSB 7u
#define ACCESSCTRL_TICKS_DBG_LSB 7u
#define ACCESSCTRL_TICKS_DBG_ACCESS "RW"
#define ACCESSCTRL_TICKS_DMA_RESET 0x0u
#define ACCESSCTRL_TICKS_DMA_BITS 0x00000040u
#define ACCESSCTRL_TICKS_DMA_MSB 6u
#define ACCESSCTRL_TICKS_DMA_LSB 6u
#define ACCESSCTRL_TICKS_DMA_ACCESS "RW"
#define ACCESSCTRL_TICKS_CORE1_RESET 0x1u
#define ACCESSCTRL_TICKS_CORE1_BITS 0x00000020u
#define ACCESSCTRL_TICKS_CORE1_MSB 5u
#define ACCESSCTRL_TICKS_CORE1_LSB 5u
#define ACCESSCTRL_TICKS_CORE1_ACCESS "RW"
#define ACCESSCTRL_TICKS_CORE0_RESET 0x1u
#define ACCESSCTRL_TICKS_CORE0_BITS 0x00000010u
#define ACCESSCTRL_TICKS_CORE0_MSB 4u
#define ACCESSCTRL_TICKS_CORE0_LSB 4u
#define ACCESSCTRL_TICKS_CORE0_ACCESS "RW"
#define ACCESSCTRL_TICKS_SP_RESET 0x1u
#define ACCESSCTRL_TICKS_SP_BITS 0x00000008u
#define ACCESSCTRL_TICKS_SP_MSB 3u
#define ACCESSCTRL_TICKS_SP_LSB 3u
#define ACCESSCTRL_TICKS_SP_ACCESS "RW"
#define ACCESSCTRL_TICKS_SU_RESET 0x0u
#define ACCESSCTRL_TICKS_SU_BITS 0x00000004u
#define ACCESSCTRL_TICKS_SU_MSB 2u
#define ACCESSCTRL_TICKS_SU_LSB 2u
#define ACCESSCTRL_TICKS_SU_ACCESS "RW"
#define ACCESSCTRL_TICKS_NSP_RESET 0x0u
#define ACCESSCTRL_TICKS_NSP_BITS 0x00000002u
#define ACCESSCTRL_TICKS_NSP_MSB 1u
#define ACCESSCTRL_TICKS_NSP_LSB 1u
#define ACCESSCTRL_TICKS_NSP_ACCESS "RW"
#define ACCESSCTRL_TICKS_NSU_RESET 0x0u
#define ACCESSCTRL_TICKS_NSU_BITS 0x00000001u
#define ACCESSCTRL_TICKS_NSU_MSB 0u
#define ACCESSCTRL_TICKS_NSU_LSB 0u
#define ACCESSCTRL_TICKS_NSU_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_OFFSET 0x000000d8u
#define ACCESSCTRL_WATCHDOG_BITS 0x000000ffu
#define ACCESSCTRL_WATCHDOG_RESET 0x000000b8u
#define ACCESSCTRL_WATCHDOG_DBG_RESET 0x1u
#define ACCESSCTRL_WATCHDOG_DBG_BITS 0x00000080u
#define ACCESSCTRL_WATCHDOG_DBG_MSB 7u
#define ACCESSCTRL_WATCHDOG_DBG_LSB 7u
#define ACCESSCTRL_WATCHDOG_DBG_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_DMA_RESET 0x0u
#define ACCESSCTRL_WATCHDOG_DMA_BITS 0x00000040u
#define ACCESSCTRL_WATCHDOG_DMA_MSB 6u
#define ACCESSCTRL_WATCHDOG_DMA_LSB 6u
#define ACCESSCTRL_WATCHDOG_DMA_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_CORE1_RESET 0x1u
#define ACCESSCTRL_WATCHDOG_CORE1_BITS 0x00000020u
#define ACCESSCTRL_WATCHDOG_CORE1_MSB 5u
#define ACCESSCTRL_WATCHDOG_CORE1_LSB 5u
#define ACCESSCTRL_WATCHDOG_CORE1_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_CORE0_RESET 0x1u
#define ACCESSCTRL_WATCHDOG_CORE0_BITS 0x00000010u
#define ACCESSCTRL_WATCHDOG_CORE0_MSB 4u
#define ACCESSCTRL_WATCHDOG_CORE0_LSB 4u
#define ACCESSCTRL_WATCHDOG_CORE0_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_SP_RESET 0x1u
#define ACCESSCTRL_WATCHDOG_SP_BITS 0x00000008u
#define ACCESSCTRL_WATCHDOG_SP_MSB 3u
#define ACCESSCTRL_WATCHDOG_SP_LSB 3u
#define ACCESSCTRL_WATCHDOG_SP_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_SU_RESET 0x0u
#define ACCESSCTRL_WATCHDOG_SU_BITS 0x00000004u
#define ACCESSCTRL_WATCHDOG_SU_MSB 2u
#define ACCESSCTRL_WATCHDOG_SU_LSB 2u
#define ACCESSCTRL_WATCHDOG_SU_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_NSP_RESET 0x0u
#define ACCESSCTRL_WATCHDOG_NSP_BITS 0x00000002u
#define ACCESSCTRL_WATCHDOG_NSP_MSB 1u
#define ACCESSCTRL_WATCHDOG_NSP_LSB 1u
#define ACCESSCTRL_WATCHDOG_NSP_ACCESS "RW"
#define ACCESSCTRL_WATCHDOG_NSU_RESET 0x0u
#define ACCESSCTRL_WATCHDOG_NSU_BITS 0x00000001u
#define ACCESSCTRL_WATCHDOG_NSU_MSB 0u
#define ACCESSCTRL_WATCHDOG_NSU_LSB 0u
#define ACCESSCTRL_WATCHDOG_NSU_ACCESS "RW"
#define ACCESSCTRL_RSM_OFFSET 0x000000dcu
#define ACCESSCTRL_RSM_BITS 0x000000ffu
#define ACCESSCTRL_RSM_RESET 0x000000b8u
#define ACCESSCTRL_RSM_DBG_RESET 0x1u
#define ACCESSCTRL_RSM_DBG_BITS 0x00000080u
#define ACCESSCTRL_RSM_DBG_MSB 7u
#define ACCESSCTRL_RSM_DBG_LSB 7u
#define ACCESSCTRL_RSM_DBG_ACCESS "RW"
