gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define ACCESSCTRL_RSM_DMA_RESET 0x0u
#define ACCESSCTRL_RSM_DMA_BITS 0x00000040u
#define ACCESSCTRL_RSM_DMA_MSB 6u
#define ACCESSCTRL_RSM_DMA_LSB 6u
#define ACCESSCTRL_RSM_DMA_ACCESS "RW"
#define ACCESSCTRL_RSM_CORE1_RESET 0x1u
#define ACCESSCTRL_RSM_CORE1_BITS 0x00000020u
#define ACCESSCTRL_RSM_CORE1_MSB 5u
#define ACCESSCTRL_RSM_CORE1_LSB 5u
#define ACCESSCTRL_RSM_CORE1_ACCESS "RW"
#define ACCESSCTRL_RSM_CORE0_RESET 0x1u
#define ACCESSCTRL_RSM_CORE0_BITS 0x00000010u
#define ACCESSCTRL_RSM_CORE0_MSB 4u
#define ACCESSCTRL_RSM_CORE0_LSB 4u
#define ACCESSCTRL_RSM_CORE0_ACCESS "RW"
#define ACCESSCTRL_RSM_SP_RESET 0x1u
#define ACCESSCTRL_RSM_SP_BITS 0x00000008u
#define ACCESSCTRL_RSM_SP_MSB 3u
#define ACCESSCTRL_RSM_SP_LSB 3u
#define ACCESSCTRL_RSM_SP_ACCESS "RW"
#define ACCESSCTRL_RSM_SU_RESET 0x0u
#define ACCESSCTRL_RSM_SU_BITS 0x00000004u
#define ACCESSCTRL_RSM_SU_MSB 2u
#define ACCESSCTRL_RSM_SU_LSB 2u
#define ACCESSCTRL_RSM_SU_ACCESS "RW"
#define ACCESSCTRL_RSM_NSP_RESET 0x0u
#define ACCESSCTRL_RSM_NSP_BITS 0x00000002u
#define ACCESSCTRL_RSM_NSP_MSB 1u
#define ACCESSCTRL_RSM_NSP_LSB 1u
#define ACCESSCTRL_RSM_NSP_ACCESS "RW"
#define ACCESSCTRL_RSM_NSU_RESET 0x0u
#define ACCESSCTRL_RSM_NSU_BITS 0x00000001u
#define ACCESSCTRL_RSM_NSU_MSB 0u
#define ACCESSCTRL_RSM_NSU_LSB 0u
#define ACCESSCTRL_RSM_NSU_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_OFFSET 0x000000e0u
#define ACCESSCTRL_XIP_CTRL_BITS 0x000000ffu
#define ACCESSCTRL_XIP_CTRL_RESET 0x000000b8u
#define ACCESSCTRL_XIP_CTRL_DBG_RESET 0x1u
#define ACCESSCTRL_XIP_CTRL_DBG_BITS 0x00000080u
#define ACCESSCTRL_XIP_CTRL_DBG_MSB 7u
#define ACCESSCTRL_XIP_CTRL_DBG_LSB 7u
#define ACCESSCTRL_XIP_CTRL_DBG_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_DMA_RESET 0x0u
#define ACCESSCTRL_XIP_CTRL_DMA_BITS 0x00000040u
#define ACCESSCTRL_XIP_CTRL_DMA_MSB 6u
#define ACCESSCTRL_XIP_CTRL_DMA_LSB 6u
#define ACCESSCTRL_XIP_CTRL_DMA_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_CORE1_RESET 0x1u
#define ACCESSCTRL_XIP_CTRL_CORE1_BITS 0x00000020u
#define ACCESSCTRL_XIP_CTRL_CORE1_MSB 5u
#define ACCESSCTRL_XIP_CTRL_CORE1_LSB 5u
#define ACCESSCTRL_XIP_CTRL_CORE1_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_CORE0_RESET 0x1u
#define ACCESSCTRL_XIP_CTRL_CORE0_BITS 0x00000010u
#define ACCESSCTRL_XIP_CTRL_CORE0_MSB 4u
#define ACCESSCTRL_XIP_CTRL_CORE0_LSB 4u
#define ACCESSCTRL_XIP_CTRL_CORE0_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_SP_RESET 0x1u
#define ACCESSCTRL_XIP_CTRL_SP_BITS 0x00000008u
#define ACCESSCTRL_XIP_CTRL_SP_MSB 3u
#define ACCESSCTRL_XIP_CTRL_SP_LSB 3u
#define ACCESSCTRL_XIP_CTRL_SP_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_SU_RESET 0x0u
#define ACCESSCTRL_XIP_CTRL_SU_BITS 0x00000004u
#define ACCESSCTRL_XIP_CTRL_SU_MSB 2u
#define ACCESSCTRL_XIP_CTRL_SU_LSB 2u
#define ACCESSCTRL_XIP_CTRL_SU_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_NSP_RESET 0x0u
#define ACCESSCTRL_XIP_CTRL_NSP_BITS 0x00000002u
#define ACCESSCTRL_XIP_CTRL_NSP_MSB 1u
#define ACCESSCTRL_XIP_CTRL_NSP_LSB 1u
#define ACCESSCTRL_XIP_CTRL_NSP_ACCESS "RW"
#define ACCESSCTRL_XIP_CTRL_NSU_RESET 0x0u
#define ACCESSCTRL_XIP_CTRL_NSU_BITS 0x00000001u
#define ACCESSCTRL_XIP_CTRL_NSU_MSB 0u
#define ACCESSCTRL_XIP_CTRL_NSU_LSB 0u
#define ACCESSCTRL_XIP_CTRL_NSU_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_OFFSET 0x000000e4u
#define ACCESSCTRL_XIP_QMI_BITS 0x000000ffu
#define ACCESSCTRL_XIP_QMI_RESET 0x000000b8u
#define ACCESSCTRL_XIP_QMI_DBG_RESET 0x1u
#define ACCESSCTRL_XIP_QMI_DBG_BITS 0x00000080u
#define ACCESSCTRL_XIP_QMI_DBG_MSB 7u
#define ACCESSCTRL_XIP_QMI_DBG_LSB 7u
#define ACCESSCTRL_XIP_QMI_DBG_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_DMA_RESET 0x0u
#define ACCESSCTRL_XIP_QMI_DMA_BITS 0x00000040u
#define ACCESSCTRL_XIP_QMI_DMA_MSB 6u
#define ACCESSCTRL_XIP_QMI_DMA_LSB 6u
#define ACCESSCTRL_XIP_QMI_DMA_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_CORE1_RESET 0x1u
#define ACCESSCTRL_XIP_QMI_CORE1_BITS 0x00000020u
#define ACCESSCTRL_XIP_QMI_CORE1_MSB 5u
#define ACCESSCTRL_XIP_QMI_CORE1_LSB 5u
#define ACCESSCTRL_XIP_QMI_CORE1_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_CORE0_RESET 0x1u
#define ACCESSCTRL_XIP_QMI_CORE0_BITS 0x00000010u
#define ACCESSCTRL_XIP_QMI_CORE0_MSB 4u
#define ACCESSCTRL_XIP_QMI_CORE0_LSB 4u
#define ACCESSCTRL_XIP_QMI_CORE0_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_SP_RESET 0x1u
#define ACCESSCTRL_XIP_QMI_SP_BITS 0x00000008u
#define ACCESSCTRL_XIP_QMI_SP_MSB 3u
#define ACCESSCTRL_XIP_QMI_SP_LSB 3u
#define ACCESSCTRL_XIP_QMI_SP_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_SU_RESET 0x0u
#define ACCESSCTRL_XIP_QMI_SU_BITS 0x00000004u
#define ACCESSCTRL_XIP_QMI_SU_MSB 2u
#define ACCESSCTRL_XIP_QMI_SU_LSB 2u
#define ACCESSCTRL_XIP_QMI_SU_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_NSP_RESET 0x0u
#define ACCESSCTRL_XIP_QMI_NSP_BITS 0x00000002u
#define ACCESSCTRL_XIP_QMI_NSP_MSB 1u
#define ACCESSCTRL_XIP_QMI_NSP_LSB 1u
#define ACCESSCTRL_XIP_QMI_NSP_ACCESS "RW"
#define ACCESSCTRL_XIP_QMI_NSU_RESET 0x0u
#define ACCESSCTRL_XIP_QMI_NSU_BITS 0x00000001u
#define ACCESSCTRL_XIP_QMI_NSU_MSB 0u
#define ACCESSCTRL_XIP_QMI_NSU_LSB 0u
#define ACCESSCTRL_XIP_QMI_NSU_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_OFFSET 0x000000e8u
#define ACCESSCTRL_XIP_AUX_BITS 0x000000ffu
#define ACCESSCTRL_XIP_AUX_RESET 0x000000f8u
#define ACCESSCTRL_XIP_AUX_DBG_RESET 0x1u
#define ACCESSCTRL_XIP_AUX_DBG_BITS 0x00000080u
#define ACCESSCTRL_XIP_AUX_DBG_MSB 7u
#define ACCESSCTRL_XIP_AUX_DBG_LSB 7u
#define ACCESSCTRL_XIP_AUX_DBG_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_DMA_RESET 0x1u
#define ACCESSCTRL_XIP_AUX_DMA_BITS 0x00000040u
#define ACCESSCTRL_XIP_AUX_DMA_MSB 6u
#define ACCESSCTRL_XIP_AUX_DMA_LSB 6u
#define ACCESSCTRL_XIP_AUX_DMA_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_CORE1_RESET 0x1u
#define ACCESSCTRL_XIP_AUX_CORE1_BITS 0x00000020u
#define ACCESSCTRL_XIP_AUX_CORE1_MSB 5u
#define ACCESSCTRL_XIP_AUX_CORE1_LSB 5u
#define ACCESSCTRL_XIP_AUX_CORE1_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_CORE0_RESET 0x1u
#define ACCESSCTRL_XIP_AUX_CORE0_BITS 0x00000010u
#define ACCESSCTRL_XIP_AUX_CORE0_MSB 4u
#define ACCESSCTRL_XIP_AUX_CORE0_LSB 4u
#define ACCESSCTRL_XIP_AUX_CORE0_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_SP_RESET 0x1u
#define ACCESSCTRL_XIP_AUX_SP_BITS 0x00000008u
#define ACCESSCTRL_XIP_AUX_SP_MSB 3u
#define ACCESSCTRL_XIP_AUX_SP_LSB 3u
#define ACCESSCTRL_XIP_AUX_SP_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_SU_RESET 0x0u
#define ACCESSCTRL_XIP_AUX_SU_BITS 0x00000004u
#define ACCESSCTRL_XIP_AUX_SU_MSB 2u
#define ACCESSCTRL_XIP_AUX_SU_LSB 2u
#define ACCESSCTRL_XIP_AUX_SU_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_NSP_RESET 0x0u
#define ACCESSCTRL_XIP_AUX_NSP_BITS 0x00000002u
#define ACCESSCTRL_XIP_AUX_NSP_MSB 1u
#define ACCESSCTRL_XIP_AUX_NSP_LSB 1u
#define ACCESSCTRL_XIP_AUX_NSP_ACCESS "RW"
#define ACCESSCTRL_XIP_AUX_NSU_RESET 0x0u
#define ACCESSCTRL_XIP_AUX_NSU_BITS 0x00000001u
#define ACCESSCTRL_XIP_AUX_NSU_MSB 0u
#define ACCESSCTRL_XIP_AUX_NSU_LSB 0u
#define ACCESSCTRL_XIP_AUX_NSU_ACCESS "RW"
typedef struct {
   
    io_rw_32 lock;
   
