gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 force_core_ns;
   
    io_wo_32 cfgreset;
   
    io_rw_32 gpio_nsmask[2];
   
    io_rw_32 rom;
   
    io_rw_32 xip_main;
   
    io_rw_32 sram[10];
   
    io_rw_32 dma;
   
    io_rw_32 usbctrl;
   
    io_rw_32 pio[3];
   
    io_rw_32 coresight_trace;
   
    io_rw_32 coresight_periph;
   
    io_rw_32 sysinfo;
   
    io_rw_32 resets;
   
    io_rw_32 io_bank[2];
   
    io_rw_32 pads_bank0;
   
    io_rw_32 pads_qspi;
   
    io_rw_32 busctrl;
   
    io_rw_32 adc0;
   
    io_rw_32 hstx;
   
    io_rw_32 i2c[2];
   
    io_rw_32 pwm;
   
    io_rw_32 spi[2];
   
    io_rw_32 timer[2];
   
    io_rw_32 uart[2];
   
    io_rw_32 otp;
   
    io_rw_32 tbman;
   
    io_rw_32 powman;
   
    io_rw_32 trng;
   
    io_rw_32 sha256;
   
    io_rw_32 syscfg;
   
    io_rw_32 clocks;
   
    io_rw_32 xosc;
   
    io_rw_32 rosc;
   
    io_rw_32 pll_sys;
   
    io_rw_32 pll_usb;
   
    io_rw_32 ticks;
   
    io_rw_32 watchdog;
   
    io_rw_32 rsm;
   
    io_rw_32 xip_ctrl;
   
    io_rw_32 xip_qmi;
   
    io_rw_32 xip_aux;
} accessctrl_hw_t;
static accessctrl_hw_t * const accessctrl_hw = (accessctrl_hw_t *)ACCESSCTRL_BASE; // ORIGINAL: #define accessctrl_hw ((accessctrl_hw_t *)ACCESSCTRL_BASE)
_Static_assert(sizeof (accessctrl_hw_t) == 0x00ec, "");
#define _HARDWARE_REGS_TIMER_H 
#define TIMER_TIMEHW_OFFSET 0x00000000u
#define TIMER_TIMEHW_BITS 0xffffffffu
#define TIMER_TIMEHW_RESET 0x00000000u
#define TIMER_TIMEHW_MSB 31u
#define TIMER_TIMEHW_LSB 0u
#define TIMER_TIMEHW_ACCESS "WF"
#define TIMER_TIMELW_OFFSET 0x00000004u
#define TIMER_TIMELW_BITS 0xffffffffu
#define TIMER_TIMELW_RESET 0x00000000u
#define TIMER_TIMELW_MSB 31u
#define TIMER_TIMELW_LSB 0u
#define TIMER_TIMELW_ACCESS "WF"
#define TIMER_TIMEHR_OFFSET 0x00000008u
#define TIMER_TIMEHR_BITS 0xffffffffu
#define TIMER_TIMEHR_RESET 0x00000000u
#define TIMER_TIMEHR_MSB 31u
#define TIMER_TIMEHR_LSB 0u
#define TIMER_TIMEHR_ACCESS "RO"
#define TIMER_TIMELR_OFFSET 0x0000000cu
#define TIMER_TIMELR_BITS 0xffffffffu
#define TIMER_TIMELR_RESET 0x00000000u
#define TIMER_TIMELR_MSB 31u
#define TIMER_TIMELR_LSB 0u
#define TIMER_TIMELR_ACCESS "RO"
#define TIMER_ALARM0_OFFSET 0x00000010u
#define TIMER_ALARM0_BITS 0xffffffffu
#define TIMER_ALARM0_RESET 0x00000000u
#define TIMER_ALARM0_MSB 31u
#define TIMER_ALARM0_LSB 0u
#define TIMER_ALARM0_ACCESS "RW"
#define TIMER_ALARM1_OFFSET 0x00000014u
#define TIMER_ALARM1_BITS 0xffffffffu
#define TIMER_ALARM1_RESET 0x00000000u
#define TIMER_ALARM1_MSB 31u
#define TIMER_ALARM1_LSB 0u
#define TIMER_ALARM1_ACCESS "RW"
#define TIMER_ALARM2_OFFSET 0x00000018u
#define TIMER_ALARM2_BITS 0xffffffffu
#define TIMER_ALARM2_RESET 0x00000000u
#define TIMER_ALARM2_MSB 31u
#define TIMER_ALARM2_LSB 0u
#define TIMER_ALARM2_ACCESS "RW"
#define TIMER_ALARM3_OFFSET 0x0000001cu
#define TIMER_ALARM3_BITS 0xffffffffu
#define TIMER_ALARM3_RESET 0x00000000u
#define TIMER_ALARM3_MSB 31u
#define TIMER_ALARM3_LSB 0u
#define TIMER_ALARM3_ACCESS "RW"
#define TIMER_ARMED_OFFSET 0x00000020u
#define TIMER_ARMED_BITS 0x0000000fu
#define TIMER_ARMED_RESET 0x00000000u
#define TIMER_ARMED_MSB 3u
#define TIMER_ARMED_LSB 0u
#define TIMER_ARMED_ACCESS "WC"
#define TIMER_TIMERAWH_OFFSET 0x00000024u
#define TIMER_TIMERAWH_BITS 0xffffffffu
#define TIMER_TIMERAWH_RESET 0x00000000u
#define TIMER_TIMERAWH_MSB 31u
#define TIMER_TIMERAWH_LSB 0u
#define TIMER_TIMERAWH_ACCESS "RO"
#define TIMER_TIMERAWL_OFFSET 0x00000028u
#define TIMER_TIMERAWL_BITS 0xffffffffu
#define TIMER_TIMERAWL_RESET 0x00000000u
#define TIMER_TIMERAWL_MSB 31u
#define TIMER_TIMERAWL_LSB 0u
#define TIMER_TIMERAWL_ACCESS "RO"
#define TIMER_DBGPAUSE_OFFSET 0x0000002cu
#define TIMER_DBGPAUSE_BITS 0x00000006u
#define TIMER_DBGPAUSE_RESET 0x00000007u
#define TIMER_DBGPAUSE_DBG1_RESET 0x1u
#define TIMER_DBGPAUSE_DBG1_BITS 0x00000004u
#define TIMER_DBGPAUSE_DBG1_MSB 2u
#define TIMER_DBGPAUSE_DBG1_LSB 2u
#define TIMER_DBGPAUSE_DBG1_ACCESS "RW"
#define TIMER_DBGPAUSE_DBG0_RESET 0x1u
#define TIMER_DBGPAUSE_DBG0_BITS 0x00000002u
#define TIMER_DBGPAUSE_DBG0_MSB 1u
#define TIMER_DBGPAUSE_DBG0_LSB 1u
#define TIMER_DBGPAUSE_DBG0_ACCESS "RW"
#define TIMER_PAUSE_OFFSET 0x00000030u
#define TIMER_PAUSE_BITS 0x00000001u
#define TIMER_PAUSE_RESET 0x00000000u
#define TIMER_PAUSE_MSB 0u
#define TIMER_PAUSE_LSB 0u
#define TIMER_PAUSE_ACCESS "RW"
#define TIMER_LOCKED_OFFSET 0x00000034u
#define TIMER_LOCKED_BITS 0x00000001u
#define TIMER_LOCKED_RESET 0x00000000u
#define TIMER_LOCKED_MSB 0u
#define TIMER_LOCKED_LSB 0u
#define TIMER_LOCKED_ACCESS "RW"
#define TIMER_SOURCE_OFFSET 0x00000038u
#define TIMER_SOURCE_BITS 0x00000001u
#define TIMER_SOURCE_RESET 0x00000000u
#define TIMER_SOURCE_CLK_SYS_RESET 0x0u
#define TIMER_SOURCE_CLK_SYS_BITS 0x00000001u
#define TIMER_SOURCE_CLK_SYS_MSB 0u
#define TIMER_SOURCE_CLK_SYS_LSB 0u
#define TIMER_SOURCE_CLK_SYS_ACCESS "RW"
#define TIMER_SOURCE_CLK_SYS_VALUE_TICK 0x0u
#define TIMER_SOURCE_CLK_SYS_VALUE_CLK_SYS 0x1u
#define TIMER_INTR_OFFSET 0x0000003cu
#define TIMER_INTR_BITS 0x0000000fu
#define TIMER_INTR_RESET 0x00000000u
#define TIMER_INTR_ALARM_3_RESET 0x0u
#define TIMER_INTR_ALARM_3_BITS 0x00000008u
#define TIMER_INTR_ALARM_3_MSB 3u
#define TIMER_INTR_ALARM_3_LSB 3u
#define TIMER_INTR_ALARM_3_ACCESS "WC"
#define TIMER_INTR_ALARM_2_RESET 0x0u
#define TIMER_INTR_ALARM_2_BITS 0x00000004u
#define TIMER_INTR_ALARM_2_MSB 2u
#define TIMER_INTR_ALARM_2_LSB 2u
#define TIMER_INTR_ALARM_2_ACCESS "WC"
#define TIMER_INTR_ALARM_1_RESET 0x0u
#define TIMER_INTR_ALARM_1_BITS 0x00000002u
#define TIMER_INTR_ALARM_1_MSB 1u
#define TIMER_INTR_ALARM_1_LSB 1u
#define TIMER_INTR_ALARM_1_ACCESS "WC"
#define TIMER_INTR_ALARM_0_RESET 0x0u
#define TIMER_INTR_ALARM_0_BITS 0x00000001u
#define TIMER_INTR_ALARM_0_MSB 0u
#define TIMER_INTR_ALARM_0_LSB 0u
#define TIMER_INTR_ALARM_0_ACCESS "WC"
#define TIMER_INTE_OFFSET 0x00000040u
#define TIMER_INTE_BITS 0x0000000fu
#define TIMER_INTE_RESET 0x00000000u
#define TIMER_INTE_ALARM_3_RESET 0x0u
#define TIMER_INTE_ALARM_3_BITS 0x00000008u
#define TIMER_INTE_ALARM_3_MSB 3u
#define TIMER_INTE_ALARM_3_LSB 3u
#define TIMER_INTE_ALARM_3_ACCESS "RW"
#define TIMER_INTE_ALARM_2_RESET 0x0u
#define TIMER_INTE_ALARM_2_BITS 0x00000004u
#define TIMER_INTE_ALARM_2_MSB 2u
#define TIMER_INTE_ALARM_2_LSB 2u
#define TIMER_INTE_ALARM_2_ACCESS "RW"
#define TIMER_INTE_ALARM_1_RESET 0x0u
#define TIMER_INTE_ALARM_1_BITS 0x00000002u
#define TIMER_INTE_ALARM_1_MSB 1u
#define TIMER_INTE_ALARM_1_LSB 1u
#define TIMER_INTE_ALARM_1_ACCESS "RW"
#define TIMER_INTE_ALARM_0_RESET 0x0u
#define TIMER_INTE_ALARM_0_BITS 0x00000001u
#define TIMER_INTE_ALARM_0_MSB 0u
#define TIMER_INTE_ALARM_0_LSB 0u
#define TIMER_INTE_ALARM_0_ACCESS "RW"
#define TIMER_INTF_OFFSET 0x00000044u
#define TIMER_INTF_BITS 0x0000000fu
#define TIMER_INTF_RESET 0x00000000u
#define TIMER_INTF_ALARM_3_RESET 0x0u
#define TIMER_INTF_ALARM_3_BITS 0x00000008u
#define TIMER_INTF_ALARM_3_MSB 3u
#define TIMER_INTF_ALARM_3_LSB 3u
#define TIMER_INTF_ALARM_3_ACCESS "RW"
#define TIMER_INTF_ALARM_2_RESET 0x0u
#define TIMER_INTF_ALARM_2_BITS 0x00000004u
#define TIMER_INTF_ALARM_2_MSB 2u
#define TIMER_INTF_ALARM_2_LSB 2u
#define TIMER_INTF_ALARM_2_ACCESS "RW"
#define TIMER_INTF_ALARM_1_RESET 0x0u
#define TIMER_INTF_ALARM_1_BITS 0x00000002u
#define TIMER_INTF_ALARM_1_MSB 1u
#define TIMER_INTF_ALARM_1_LSB 1u
#define TIMER_INTF_ALARM_1_ACCESS "RW"
#define TIMER_INTF_ALARM_0_RESET 0x0u
#define TIMER_INTF_ALARM_0_BITS 0x00000001u
#define TIMER_INTF_ALARM_0_MSB 0u
#define TIMER_INTF_ALARM_0_LSB 0u
#define TIMER_INTF_ALARM_0_ACCESS "RW"
#define TIMER_INTS_OFFSET 0x00000048u
#define TIMER_INTS_BITS 0x0000000fu
#define TIMER_INTS_RESET 0x00000000u
#define TIMER_INTS_ALARM_3_RESET 0x0u
#define TIMER_INTS_ALARM_3_BITS 0x00000008u
#define TIMER_INTS_ALARM_3_MSB 3u
#define TIMER_INTS_ALARM_3_LSB 3u
#define TIMER_INTS_ALARM_3_ACCESS "RO"
#define TIMER_INTS_ALARM_2_RESET 0x0u
#define TIMER_INTS_ALARM_2_BITS 0x00000004u
#define TIMER_INTS_ALARM_2_MSB 2u
#define TIMER_INTS_ALARM_2_LSB 2u
#define TIMER_INTS_ALARM_2_ACCESS "RO"
#define TIMER_INTS_ALARM_1_RESET 0x0u
#define TIMER_INTS_ALARM_1_BITS 0x00000002u
#define TIMER_INTS_ALARM_1_MSB 1u
#define TIMER_INTS_ALARM_1_LSB 1u
#define TIMER_INTS_ALARM_1_ACCESS "RO"
#define TIMER_INTS_ALARM_0_RESET 0x0u
#define TIMER_INTS_ALARM_0_BITS 0x00000001u
#define TIMER_INTS_ALARM_0_MSB 0u
#define TIMER_INTS_ALARM_0_LSB 0u
#define TIMER_INTS_ALARM_0_ACCESS "RO"
typedef struct {
   
    io_wo_32 timehw;
   
    io_wo_32 timelw;
   
    io_ro_32 timehr;
   
    io_ro_32 timelr;
   
    io_rw_32 alarm[4];
   
    io_rw_32 armed;
   
