gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
_Bool alarm_pool_add_repeating_timer_us(alarm_pool_t *pool, int64_t delay_us, repeating_timer_callback_t callback, void *user_data, repeating_timer_t *out);
static inline _Bool alarm_pool_add_repeating_timer_ms(alarm_pool_t *pool, int32_t delay_ms, repeating_timer_callback_t callback, void *user_data, repeating_timer_t *out) {
    return alarm_pool_add_repeating_timer_us(pool, delay_ms * (int64_t)1000, callback, user_data, out);
}
static inline _Bool add_repeating_timer_us(int64_t delay_us, repeating_timer_callback_t callback, void *user_data, repeating_timer_t *out) {
    return alarm_pool_add_repeating_timer_us(alarm_pool_get_default(), delay_us, callback, user_data, out);
}
static inline _Bool add_repeating_timer_ms(int32_t delay_ms, repeating_timer_callback_t callback, void *user_data, repeating_timer_t *out) {
    return alarm_pool_add_repeating_timer_us(alarm_pool_get_default(), delay_ms * (int64_t)1000, callback, user_data, out);
}
_Bool cancel_repeating_timer(repeating_timer_t *timer);
enum {
    ASYNC_CONTEXT_POLL = 1,
    ASYNC_CONTEXT_THREADSAFE_BACKGROUND = 2,
    ASYNC_CONTEXT_FREERTOS = 3,
};
typedef struct async_context async_context_t;
typedef struct async_work_on_timeout {
    struct async_work_on_timeout *next;
    void (*do_work)(async_context_t *context, struct async_work_on_timeout *timeout);
    absolute_time_t next_time;
    void *user_data;
} async_at_time_worker_t;
typedef struct async_when_pending_worker {
    struct async_when_pending_worker *next;
    void (*do_work)(async_context_t *context, struct async_when_pending_worker *worker);
    _Bool work_pending;
    void *user_data;
} async_when_pending_worker_t;
#define ASYNC_CONTEXT_FLAG_CALLBACK_FROM_NON_IRQ 0x1
#define ASYNC_CONTEXT_FLAG_CALLBACK_FROM_IRQ 0x2
#define ASYNC_CONTEXT_FLAG_POLLED 0x4
typedef struct async_context_type {
    uint16_t type;
    void (*acquire_lock_blocking)(async_context_t *self);
    void (*release_lock)(async_context_t *self);
    void (*lock_check)(async_context_t *self);
    uint32_t (*execute_sync)(async_context_t *context, uint32_t (*func)(void *param), void *param);
    _Bool (*add_at_time_worker)(async_context_t *self, async_at_time_worker_t *worker);
    _Bool (*remove_at_time_worker)(async_context_t *self, async_at_time_worker_t *worker);
    _Bool (*add_when_pending_worker)(async_context_t *self, async_when_pending_worker_t *worker);
    _Bool (*remove_when_pending_worker)(async_context_t *self, async_when_pending_worker_t *worker);
    void (*set_work_pending)(async_context_t *self, async_when_pending_worker_t *worker);
    void (*poll)(async_context_t *self);
    void (*wait_until)(async_context_t *self, absolute_time_t until);
    void (*wait_for_work_until)(async_context_t *self, absolute_time_t until);
    void (*deinit)(async_context_t *self);
} async_context_type_t;
struct async_context {
    const async_context_type_t *type;
    async_when_pending_worker_t *when_pending_list;
    async_at_time_worker_t *at_time_list;
    absolute_time_t next_time;
    uint16_t flags;
    uint8_t core_num;
};
static inline void async_context_acquire_lock_blocking(async_context_t *context) {
    context->type->acquire_lock_blocking(context);
}
static inline void async_context_release_lock(async_context_t *context) {
    context->type->release_lock(context);
}
static inline void async_context_lock_check(async_context_t *context) {
    context->type->lock_check(context);
}
static inline uint32_t async_context_execute_sync(async_context_t *context, uint32_t (*func)(void *param), void *param) {
    return context->type->execute_sync(context, func, param);
}
static inline _Bool async_context_add_at_time_worker(async_context_t *context, async_at_time_worker_t *worker) {
    return context->type->add_at_time_worker(context, worker);
}
static inline _Bool async_context_add_at_time_worker_at(async_context_t *context, async_at_time_worker_t *worker, absolute_time_t at) {
    worker->next_time = at;
    return context->type->add_at_time_worker(context, worker);
}
static inline _Bool async_context_add_at_time_worker_in_ms(async_context_t *context, async_at_time_worker_t *worker, uint32_t ms) {
    worker->next_time = make_timeout_time_ms(ms);
    return context->type->add_at_time_worker(context, worker);
}
static inline _Bool async_context_remove_at_time_worker(async_context_t *context, async_at_time_worker_t *worker) {
    return context->type->remove_at_time_worker(context, worker);
}
static inline _Bool async_context_add_when_pending_worker(async_context_t *context, async_when_pending_worker_t *worker) {
    return context->type->add_when_pending_worker(context, worker);
}
static inline _Bool async_context_remove_when_pending_worker(async_context_t *context, async_when_pending_worker_t *worker) {
    return context->type->remove_when_pending_worker(context, worker);
}
static inline void async_context_set_work_pending(async_context_t *context, async_when_pending_worker_t *worker) {
    context->type->set_work_pending(context, worker);
}
static inline void async_context_poll(async_context_t *context) {
    if (context->type->poll) context->type->poll(context);
}
static inline void async_context_wait_until(async_context_t *context, absolute_time_t until) {
    context->type->wait_until(context, until);
}
static inline void async_context_wait_for_work_until(async_context_t *context, absolute_time_t until) {
    context->type->wait_for_work_until(context, until);
}
static inline void async_context_wait_for_work_ms(async_context_t *context, uint32_t ms) {
    async_context_wait_for_work_until(context, make_timeout_time_ms(ms));
}
static inline uint async_context_core_num(const async_context_t *context) {
    return context->core_num;
}
static inline void async_context_deinit(async_context_t *context) {
    context->type->deinit(context);
}
#define _PICO_ASYNC_CONTEXT_POLL_H 
#define _PICO_SEM_H 
#define _PICO_LOCK_CORE_H 
#define _HARDWARE_SYNC_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_SYNC 0
__inline__ __attribute__((__always_inline__)) static void __nop(void) {
    __asm volatile ("nop.w");
}
__inline__ __attribute__((__always_inline__)) static void __sev(void) {
    __asm volatile (".syntax unified\n" "sev");
}
__inline__ __attribute__((__always_inline__)) static void __wfe(void) {
    __asm volatile (".syntax unified\n" "wfe");
}
__inline__ __attribute__((__always_inline__)) static void __wfi(void) {
    __asm volatile (".syntax unified\n" "wfi");
}
__inline__ __attribute__((__always_inline__)) static void __dmb(void) {
    __asm volatile (".syntax unified\n" "dmb" : : : "memory");
}
__inline__ __attribute__((__always_inline__)) static void __dsb(void) {
    __asm volatile (".syntax unified\n" "dsb" : : : "memory");
}
__inline__ __attribute__((__always_inline__)) static void __isb(void) {
    __asm volatile (".syntax unified\n" "isb" ::: "memory");
}
__inline__ __attribute__((__always_inline__)) static void __mem_fence_acquire(void) {
    __dmb();
}
__inline__ __attribute__((__always_inline__)) static void __mem_fence_release(void) {
    __dmb();
}
__inline__ __attribute__((__always_inline__)) static void disable_interrupts(void) {
    __asm volatile (".syntax unified\n" "cpsid i" : : : "memory");
}
__inline__ __attribute__((__always_inline__)) static void enable_interrupts(void) {
    __asm volatile (".syntax unified\n" "cpsie i" : : : "memory");
}
__inline__ __attribute__((__always_inline__)) static uint32_t save_and_disable_interrupts(void) {
    uint32_t status;
    __asm volatile (".syntax unified\n" "mrs %0, PRIMASK\n" "cpsid i" : "=r" (status) :: "memory");
    return status;
}
__inline__ __attribute__((__always_inline__)) static void restore_interrupts(uint32_t status) {
    __asm volatile (".syntax unified\n" "msr PRIMASK,%0"::"r" (status) : "memory");
}
__inline__ __attribute__((__always_inline__)) static void restore_interrupts_from_disabled(uint32_t status) {
    __asm volatile (".syntax unified\n" "msr PRIMASK,%0"::"r" (status) : "memory");
}
#define _HARDWARE_SYNC_SPIN_LOCK_H 
#define PICO_USE_SW_SPIN_LOCKS 1
#define PICO_SPINLOCK_ID_IRQ 9
#define PICO_SPINLOCK_ID_TIMER 10
#define PICO_SPINLOCK_ID_HARDWARE_CLAIM 11
#define PICO_SPINLOCK_ID_RAND 12
#define PICO_SPINLOCK_ID_ATOMIC 13
#define PICO_SPINLOCK_ID_OS1 14
#define PICO_SPINLOCK_ID_OS2 15
#define PICO_SPINLOCK_ID_STRIPED_FIRST 16
#define PICO_SPINLOCK_ID_STRIPED_LAST 23
#define PICO_SPINLOCK_ID_CLAIM_FREE_FIRST 24
#define PICO_SPINLOCK_ID_CLAIM_FREE_LAST 31
#define SW_SPIN_LOCK_TYPE volatile uint8_t
typedef volatile uint8_t spin_lock_t;
#define SW_SPIN_LOCK_INSTANCE(lock_num) ({ extern spin_lock_t _sw_spin_locks[NUM_SPIN_LOCKS]; &_sw_spin_locks[lock_num]; })
#define SW_SPIN_LOCK_NUM(lock) ({ extern spin_lock_t _sw_spin_locks[NUM_SPIN_LOCKS]; (lock) - _sw_spin_locks; })
#define SW_SPIN_LOCK_IS_LOCKED(lock) ((bool) *(lock))
#define SW_SPIN_LOCK_LOCK(lock) ({ uint32_t _tmp0, _tmp1; pico_default_asm_volatile ( "1:\n" "ldaexb %1, [%2]\n" "movs %0, #1\n" "cmp %1, #0\n" "bne 1b\n" "strexb %1, %0, [%2]\n" "cmp %1, #0\n" "bne 1b\n" : "=&r" (_tmp0), "=&r" (_tmp1) : "r" (lock) ); __mem_fence_acquire(); })
#define SW_SPIN_TRY_LOCK(lock) ({ uint32_t _tmp0, _tmp1; pico_default_asm_volatile ( "ldaexb %1, [%2]\n" "movs %0, #1\n" "cmp %1, #0\n" "bne 1f\n" "strexb %1, %0, [%2]\n" "1:\n" : "=&r" (_tmp0), "=&r" (_tmp1) : "r" (lock) ); __mem_fence_acquire(); !_tmp1; })
#define SW_SPIN_LOCK_UNLOCK(lock) ({ uint32_t zero = 0; pico_default_asm_volatile( "stlb %0, [%1]\n" : : "r" (zero), "r" (lock) ); })
__inline__ __attribute__((__always_inline__)) static spin_lock_t *spin_lock_instance(uint lock_num) {
    ({if (((0 || 0) && !0)) ((!(lock_num >= 32u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_sync_spin_lock/include/hardware/sync/spin_lock.h", 226, __func__, "!(lock_num >= 32u)"));});
    return ({ extern spin_lock_t _sw_spin_locks[32u]; &_sw_spin_locks[lock_num]; });
}
__inline__ __attribute__((__always_inline__)) static uint spin_lock_get_num(spin_lock_t *lock) {
    uint lock_num = ({ extern spin_lock_t _sw_spin_locks[32u]; (lock) - _sw_spin_locks; });
    ({if (((0 || 0) && !0)) ((!(lock_num >= (uint)32u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_sync_spin_lock/include/hardware/sync/spin_lock.h", 243, __func__, "!(lock_num >= (uint)32u)"));});
    return lock_num;
}
__inline__ __attribute__((__always_inline__)) static void spin_lock_unsafe_blocking(spin_lock_t *lock) {
    ({ uint32_t _tmp0, _tmp1; __asm volatile (".syntax unified\n" "1:\n" "ldaexb %1, [%2]\n" "movs %0, #1\n" "cmp %1, #0\n" "bne 1b\n" "strexb %1, %0, [%2]\n" "cmp %1, #0\n" "bne 1b\n" : "=&r" (_tmp0), "=&r" (_tmp1) : "r" (lock)); __mem_fence_acquire(); });
}
__inline__ __attribute__((__always_inline__)) static _Bool spin_try_lock_unsafe(spin_lock_t *lock) {
    return ({ uint32_t _tmp0, _tmp1; __asm volatile (".syntax unified\n" "ldaexb %1, [%2]\n" "movs %0, #1\n" "cmp %1, #0\n" "bne 1f\n" "strexb %1, %0, [%2]\n" "1:\n" : "=&r" (_tmp0), "=&r" (_tmp1) : "r" (lock)); __mem_fence_acquire(); !_tmp1; });
}
__inline__ __attribute__((__always_inline__)) static void spin_unlock_unsafe(spin_lock_t *lock) {
    ({ uint32_t zero = 0; __asm volatile (".syntax unified\n" "stlb %0, [%1]\n" : : "r" (zero), "r" (lock)); });
}
__inline__ __attribute__((__always_inline__)) static uint32_t spin_lock_blocking(spin_lock_t *lock) {
    uint32_t save = save_and_disable_interrupts();
    spin_lock_unsafe_blocking(lock);
    return save;
}
inline static _Bool is_spin_locked(spin_lock_t *lock) {
    return ((_Bool) *(lock));
}
__inline__ __attribute__((__always_inline__)) static void spin_unlock(spin_lock_t *lock, uint32_t saved_irq) {
    spin_unlock_unsafe(lock);
    restore_interrupts_from_disabled(saved_irq);
}
spin_lock_t *spin_lock_init(uint lock_num);
void spin_locks_reset(void);
uint next_striped_spin_lock_num(void);
void spin_lock_claim(uint lock_num);
void spin_lock_claim_mask(uint32_t lock_num_mask);
void spin_lock_unclaim(uint lock_num);
int spin_lock_claim_unused(_Bool required);
_Bool spin_lock_is_claimed(uint lock_num);
#define remove_volatile_cast(t,x) (t)(x)
#define remove_volatile_cast_no_barrier(t,x) (t)(x)
#define PARAM_ASSERTIONS_ENABLED_LOCK_CORE 0
struct lock_core {
    spin_lock_t *spin_lock;
};
typedef struct lock_core lock_core_t;
void lock_init(lock_core_t *core, uint lock_num);
#define lock_owner_id_t int8_t
#define LOCK_INVALID_OWNER_ID ((lock_owner_id_t)-1)
#define lock_get_caller_owner_id() ((lock_owner_id_t)get_core_num())
#define lock_is_owner_id_valid(id) ((id)>=0)
#define lock_internal_spin_unlock_with_wait(lock,save) spin_unlock((lock)->spin_lock, save), __wfe()
#define lock_internal_spin_unlock_with_notify(lock,save) spin_unlock((lock)->spin_lock, save), __sev()
#define lock_internal_spin_unlock_with_best_effort_wait_or_timeout(lock,save,until) ({ spin_unlock((lock)->spin_lock, save); best_effort_wfe_or_timeout(until); })
#define sync_internal_yield_until_before(until) ((void)0)
typedef struct semaphore {
    struct lock_core core;
    int16_t permits;
    int16_t max_permits;
} semaphore_t;
