gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
void sem_init(semaphore_t *sem, int16_t initial_permits, int16_t max_permits);
int sem_available(semaphore_t *sem);
_Bool sem_release(semaphore_t *sem);
void sem_reset(semaphore_t *sem, int16_t permits);
void sem_acquire_blocking(semaphore_t *sem);
_Bool sem_acquire_timeout_ms(semaphore_t *sem, uint32_t timeout_ms);
_Bool sem_acquire_timeout_us(semaphore_t *sem, uint32_t timeout_us);
_Bool sem_acquire_block_until(semaphore_t *sem, absolute_time_t until);
_Bool sem_try_acquire(semaphore_t *sem);
typedef struct async_context_poll {
    async_context_t core;
    semaphore_t sem;
} async_context_poll_t;
_Bool async_context_poll_init_with_defaults(async_context_poll_t *self);
#define _HARDWARE_ADC_H 
#define _HARDWARE_STRUCTS_ADC_H 
#define _HARDWARE_REGS_ADC_H 
#define ADC_CS_OFFSET 0x00000000u
#define ADC_CS_BITS 0x01fff70fu
#define ADC_CS_RESET 0x00000000u
#define ADC_CS_RROBIN_RESET 0x000u
#define ADC_CS_RROBIN_BITS 0x01ff0000u
#define ADC_CS_RROBIN_MSB 24u
#define ADC_CS_RROBIN_LSB 16u
#define ADC_CS_RROBIN_ACCESS "RW"
#define ADC_CS_AINSEL_RESET 0x0u
#define ADC_CS_AINSEL_BITS 0x0000f000u
#define ADC_CS_AINSEL_MSB 15u
#define ADC_CS_AINSEL_LSB 12u
#define ADC_CS_AINSEL_ACCESS "RW"
#define ADC_CS_ERR_STICKY_RESET 0x0u
#define ADC_CS_ERR_STICKY_BITS 0x00000400u
#define ADC_CS_ERR_STICKY_MSB 10u
#define ADC_CS_ERR_STICKY_LSB 10u
#define ADC_CS_ERR_STICKY_ACCESS "WC"
#define ADC_CS_ERR_RESET 0x0u
#define ADC_CS_ERR_BITS 0x00000200u
#define ADC_CS_ERR_MSB 9u
#define ADC_CS_ERR_LSB 9u
#define ADC_CS_ERR_ACCESS "RO"
#define ADC_CS_READY_RESET 0x0u
#define ADC_CS_READY_BITS 0x00000100u
#define ADC_CS_READY_MSB 8u
#define ADC_CS_READY_LSB 8u
#define ADC_CS_READY_ACCESS "RO"
#define ADC_CS_START_MANY_RESET 0x0u
#define ADC_CS_START_MANY_BITS 0x00000008u
#define ADC_CS_START_MANY_MSB 3u
#define ADC_CS_START_MANY_LSB 3u
#define ADC_CS_START_MANY_ACCESS "RW"
#define ADC_CS_START_ONCE_RESET 0x0u
#define ADC_CS_START_ONCE_BITS 0x00000004u
#define ADC_CS_START_ONCE_MSB 2u
#define ADC_CS_START_ONCE_LSB 2u
#define ADC_CS_START_ONCE_ACCESS "SC"
#define ADC_CS_TS_EN_RESET 0x0u
#define ADC_CS_TS_EN_BITS 0x00000002u
#define ADC_CS_TS_EN_MSB 1u
#define ADC_CS_TS_EN_LSB 1u
#define ADC_CS_TS_EN_ACCESS "RW"
#define ADC_CS_EN_RESET 0x0u
#define ADC_CS_EN_BITS 0x00000001u
#define ADC_CS_EN_MSB 0u
#define ADC_CS_EN_LSB 0u
#define ADC_CS_EN_ACCESS "RW"
#define ADC_RESULT_OFFSET 0x00000004u
#define ADC_RESULT_BITS 0x00000fffu
#define ADC_RESULT_RESET 0x00000000u
#define ADC_RESULT_MSB 11u
#define ADC_RESULT_LSB 0u
#define ADC_RESULT_ACCESS "RO"
#define ADC_FCS_OFFSET 0x00000008u
#define ADC_FCS_BITS 0x0f0f0f0fu
#define ADC_FCS_RESET 0x00000000u
#define ADC_FCS_THRESH_RESET 0x0u
#define ADC_FCS_THRESH_BITS 0x0f000000u
#define ADC_FCS_THRESH_MSB 27u
#define ADC_FCS_THRESH_LSB 24u
#define ADC_FCS_THRESH_ACCESS "RW"
#define ADC_FCS_LEVEL_RESET 0x0u
#define ADC_FCS_LEVEL_BITS 0x000f0000u
#define ADC_FCS_LEVEL_MSB 19u
#define ADC_FCS_LEVEL_LSB 16u
#define ADC_FCS_LEVEL_ACCESS "RO"
#define ADC_FCS_OVER_RESET 0x0u
#define ADC_FCS_OVER_BITS 0x00000800u
#define ADC_FCS_OVER_MSB 11u
#define ADC_FCS_OVER_LSB 11u
#define ADC_FCS_OVER_ACCESS "WC"
#define ADC_FCS_UNDER_RESET 0x0u
#define ADC_FCS_UNDER_BITS 0x00000400u
#define ADC_FCS_UNDER_MSB 10u
#define ADC_FCS_UNDER_LSB 10u
#define ADC_FCS_UNDER_ACCESS "WC"
#define ADC_FCS_FULL_RESET 0x0u
#define ADC_FCS_FULL_BITS 0x00000200u
#define ADC_FCS_FULL_MSB 9u
#define ADC_FCS_FULL_LSB 9u
#define ADC_FCS_FULL_ACCESS "RO"
#define ADC_FCS_EMPTY_RESET 0x0u
#define ADC_FCS_EMPTY_BITS 0x00000100u
#define ADC_FCS_EMPTY_MSB 8u
#define ADC_FCS_EMPTY_LSB 8u
#define ADC_FCS_EMPTY_ACCESS "RO"
#define ADC_FCS_DREQ_EN_RESET 0x0u
#define ADC_FCS_DREQ_EN_BITS 0x00000008u
#define ADC_FCS_DREQ_EN_MSB 3u
#define ADC_FCS_DREQ_EN_LSB 3u
#define ADC_FCS_DREQ_EN_ACCESS "RW"
#define ADC_FCS_ERR_RESET 0x0u
#define ADC_FCS_ERR_BITS 0x00000004u
#define ADC_FCS_ERR_MSB 2u
#define ADC_FCS_ERR_LSB 2u
#define ADC_FCS_ERR_ACCESS "RW"
#define ADC_FCS_SHIFT_RESET 0x0u
#define ADC_FCS_SHIFT_BITS 0x00000002u
#define ADC_FCS_SHIFT_MSB 1u
#define ADC_FCS_SHIFT_LSB 1u
#define ADC_FCS_SHIFT_ACCESS "RW"
#define ADC_FCS_EN_RESET 0x0u
#define ADC_FCS_EN_BITS 0x00000001u
#define ADC_FCS_EN_MSB 0u
#define ADC_FCS_EN_LSB 0u
#define ADC_FCS_EN_ACCESS "RW"
#define ADC_FIFO_OFFSET 0x0000000cu
#define ADC_FIFO_BITS 0x00008fffu
#define ADC_FIFO_RESET 0x00000000u
#define ADC_FIFO_ERR_RESET "-"
#define ADC_FIFO_ERR_BITS 0x00008000u
#define ADC_FIFO_ERR_MSB 15u
#define ADC_FIFO_ERR_LSB 15u
#define ADC_FIFO_ERR_ACCESS "RF"
#define ADC_FIFO_VAL_RESET "-"
#define ADC_FIFO_VAL_BITS 0x00000fffu
#define ADC_FIFO_VAL_MSB 11u
#define ADC_FIFO_VAL_LSB 0u
#define ADC_FIFO_VAL_ACCESS "RF"
#define ADC_DIV_OFFSET 0x00000010u
#define ADC_DIV_BITS 0x00ffffffu
#define ADC_DIV_RESET 0x00000000u
#define ADC_DIV_INT_RESET 0x0000u
#define ADC_DIV_INT_BITS 0x00ffff00u
#define ADC_DIV_INT_MSB 23u
#define ADC_DIV_INT_LSB 8u
#define ADC_DIV_INT_ACCESS "RW"
#define ADC_DIV_FRAC_RESET 0x00u
#define ADC_DIV_FRAC_BITS 0x000000ffu
#define ADC_DIV_FRAC_MSB 7u
#define ADC_DIV_FRAC_LSB 0u
#define ADC_DIV_FRAC_ACCESS "RW"
#define ADC_INTR_OFFSET 0x00000014u
#define ADC_INTR_BITS 0x00000001u
#define ADC_INTR_RESET 0x00000000u
#define ADC_INTR_FIFO_RESET 0x0u
#define ADC_INTR_FIFO_BITS 0x00000001u
#define ADC_INTR_FIFO_MSB 0u
#define ADC_INTR_FIFO_LSB 0u
#define ADC_INTR_FIFO_ACCESS "RO"
#define ADC_INTE_OFFSET 0x00000018u
#define ADC_INTE_BITS 0x00000001u
#define ADC_INTE_RESET 0x00000000u
#define ADC_INTE_FIFO_RESET 0x0u
#define ADC_INTE_FIFO_BITS 0x00000001u
#define ADC_INTE_FIFO_MSB 0u
#define ADC_INTE_FIFO_LSB 0u
#define ADC_INTE_FIFO_ACCESS "RW"
#define ADC_INTF_OFFSET 0x0000001cu
#define ADC_INTF_BITS 0x00000001u
#define ADC_INTF_RESET 0x00000000u
#define ADC_INTF_FIFO_RESET 0x0u
#define ADC_INTF_FIFO_BITS 0x00000001u
#define ADC_INTF_FIFO_MSB 0u
#define ADC_INTF_FIFO_LSB 0u
#define ADC_INTF_FIFO_ACCESS "RW"
#define ADC_INTS_OFFSET 0x00000020u
#define ADC_INTS_BITS 0x00000001u
#define ADC_INTS_RESET 0x00000000u
#define ADC_INTS_FIFO_RESET 0x0u
#define ADC_INTS_FIFO_BITS 0x00000001u
#define ADC_INTS_FIFO_MSB 0u
#define ADC_INTS_FIFO_LSB 0u
#define ADC_INTS_FIFO_ACCESS "RO"
typedef struct {
   
    io_rw_32 cs;
   
