gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_ro_32 result;
   
    io_rw_32 fcs;
   
    io_ro_32 fifo;
   
    io_rw_32 div;
   
    io_ro_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} adc_hw_t;
static adc_hw_t * const adc_hw = (adc_hw_t *)ADC_BASE; // ORIGINAL: #define adc_hw ((adc_hw_t *)ADC_BASE)
_Static_assert(sizeof (adc_hw_t) == 0x0024, "");
#define _HARDWARE_GPIO_H 
#define _HARDWARE_STRUCTS_SIO_H 
#define _HARDWARE_STRUCTS_INTERP_H 
typedef struct {
   
    io_rw_32 accum[2];
   
    io_rw_32 base[3];
   
    io_ro_32 pop[3];
   
    io_ro_32 peek[3];
   
    io_rw_32 ctrl[2];
   
    io_rw_32 add_raw[2];
   
    io_wo_32 base01;
} interp_hw_t;
static interp_hw_t * const interp_hw_array = (interp_hw_t *)(SIO_BASE + SIO_INTERP0_ACCUM0_OFFSET); // ORIGINAL: #define interp_hw_array ((interp_hw_t *)(SIO_BASE + SIO_INTERP0_ACCUM0_OFFSET))
static interp_hw_t * const interp_hw_array_ns = (interp_hw_t *)(SIO_NONSEC_BASE + SIO_INTERP0_ACCUM0_OFFSET); // ORIGINAL: #define interp_hw_array_ns ((interp_hw_t *)(SIO_NONSEC_BASE + SIO_INTERP0_ACCUM0_OFFSET))
_Static_assert(sizeof (interp_hw_t) == 0x0040, "");
static __typeof__((&interp_hw_array[0])) const interp0_hw = (&interp_hw_array[0]); // ORIGINAL: #define interp0_hw (&interp_hw_array[0])
static __typeof__((&interp_hw_array[1])) const interp1_hw = (&interp_hw_array[1]); // ORIGINAL: #define interp1_hw (&interp_hw_array[1])
typedef struct {
   
    io_ro_32 cpuid;
   
    io_ro_32 gpio_in;
   
    io_ro_32 gpio_hi_in;
    uint32_t _pad0;
   
    io_rw_32 gpio_out;
   
    io_rw_32 gpio_hi_out;
   
    io_wo_32 gpio_set;
   
    io_wo_32 gpio_hi_set;
   
    io_wo_32 gpio_clr;
   
    io_wo_32 gpio_hi_clr;
   
    io_wo_32 gpio_togl;
   
    io_wo_32 gpio_hi_togl;
   
    io_rw_32 gpio_oe;
   
    io_rw_32 gpio_hi_oe;
   
    io_wo_32 gpio_oe_set;
   
    io_wo_32 gpio_hi_oe_set;
   
    io_wo_32 gpio_oe_clr;
   
    io_wo_32 gpio_hi_oe_clr;
   
    io_wo_32 gpio_oe_togl;
   
    io_wo_32 gpio_hi_oe_togl;
   
    io_rw_32 fifo_st;
   
    io_wo_32 fifo_wr;
   
    io_ro_32 fifo_rd;
   
    io_ro_32 spinlock_st;
    uint32_t _pad1[8];
    interp_hw_t interp[2];
   
    io_rw_32 spinlock[32];
   
    io_rw_32 doorbell_out_set;
   
    io_rw_32 doorbell_out_clr;
   
    io_rw_32 doorbell_in_set;
   
    io_rw_32 doorbell_in_clr;
   
    io_rw_32 peri_nonsec;
    uint32_t _pad2[3];
   
    io_rw_32 riscv_softirq;
   
    io_rw_32 mtime_ctrl;
    uint32_t _pad3[2];
   
    io_rw_32 mtime;
   
    io_rw_32 mtimeh;
   
    io_rw_32 mtimecmp;
   
    io_rw_32 mtimecmph;
   
    io_rw_32 tmds_ctrl;
   
    io_wo_32 tmds_wdata;
   
    io_ro_32 tmds_peek_single;
   
    io_ro_32 tmds_pop_single;
   
    io_ro_32 tmds_peek_double_l0;
   
    io_ro_32 tmds_pop_double_l0;
   
    io_ro_32 tmds_peek_double_l1;
   
    io_ro_32 tmds_pop_double_l1;
   
    io_ro_32 tmds_peek_double_l2;
   
    io_ro_32 tmds_pop_double_l2;
} sio_hw_t;
static sio_hw_t * const sio_hw = (sio_hw_t *)SIO_BASE; // ORIGINAL: #define sio_hw ((sio_hw_t *)SIO_BASE)
static sio_hw_t * const sio_ns_hw = (sio_hw_t *)SIO_NONSEC_BASE; // ORIGINAL: #define sio_ns_hw ((sio_hw_t *)SIO_NONSEC_BASE)
_Static_assert(sizeof (sio_hw_t) == 0x01e8, "");
#define _HARDWARE_STRUCTS_PADS_BANK0_H 
#define _HARDWARE_REGS_PADS_BANK0_H 
#define PADS_BANK0_VOLTAGE_SELECT_OFFSET 0x00000000u
#define PADS_BANK0_VOLTAGE_SELECT_BITS 0x00000001u
#define PADS_BANK0_VOLTAGE_SELECT_RESET 0x00000000u
#define PADS_BANK0_VOLTAGE_SELECT_MSB 0u
#define PADS_BANK0_VOLTAGE_SELECT_LSB 0u
#define PADS_BANK0_VOLTAGE_SELECT_ACCESS "RW"
#define PADS_BANK0_VOLTAGE_SELECT_VALUE_3V3 0x0u
#define PADS_BANK0_VOLTAGE_SELECT_VALUE_1V8 0x1u
#define PADS_BANK0_GPIO0_OFFSET 0x00000004u
#define PADS_BANK0_GPIO0_BITS 0x000001ffu
#define PADS_BANK0_GPIO0_RESET 0x00000116u
#define PADS_BANK0_GPIO0_ISO_RESET 0x1u
#define PADS_BANK0_GPIO0_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO0_ISO_MSB 8u
#define PADS_BANK0_GPIO0_ISO_LSB 8u
#define PADS_BANK0_GPIO0_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO0_OD_RESET 0x0u
#define PADS_BANK0_GPIO0_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO0_OD_MSB 7u
#define PADS_BANK0_GPIO0_OD_LSB 7u
#define PADS_BANK0_GPIO0_OD_ACCESS "RW"
#define PADS_BANK0_GPIO0_IE_RESET 0x0u
#define PADS_BANK0_GPIO0_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO0_IE_MSB 6u
#define PADS_BANK0_GPIO0_IE_LSB 6u
#define PADS_BANK0_GPIO0_IE_ACCESS "RW"
#define PADS_BANK0_GPIO0_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO0_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO0_DRIVE_MSB 5u
#define PADS_BANK0_GPIO0_DRIVE_LSB 4u
#define PADS_BANK0_GPIO0_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO0_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO0_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO0_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO0_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO0_PUE_RESET 0x0u
#define PADS_BANK0_GPIO0_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO0_PUE_MSB 3u
#define PADS_BANK0_GPIO0_PUE_LSB 3u
#define PADS_BANK0_GPIO0_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO0_PDE_RESET 0x1u
#define PADS_BANK0_GPIO0_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO0_PDE_MSB 2u
#define PADS_BANK0_GPIO0_PDE_LSB 2u
#define PADS_BANK0_GPIO0_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO0_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO0_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO0_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO0_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO0_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO0_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO0_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO0_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO0_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO0_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO1_OFFSET 0x00000008u
#define PADS_BANK0_GPIO1_BITS 0x000001ffu
#define PADS_BANK0_GPIO1_RESET 0x00000116u
#define PADS_BANK0_GPIO1_ISO_RESET 0x1u
#define PADS_BANK0_GPIO1_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO1_ISO_MSB 8u
#define PADS_BANK0_GPIO1_ISO_LSB 8u
#define PADS_BANK0_GPIO1_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO1_OD_RESET 0x0u
#define PADS_BANK0_GPIO1_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO1_OD_MSB 7u
#define PADS_BANK0_GPIO1_OD_LSB 7u
#define PADS_BANK0_GPIO1_OD_ACCESS "RW"
#define PADS_BANK0_GPIO1_IE_RESET 0x0u
#define PADS_BANK0_GPIO1_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO1_IE_MSB 6u
#define PADS_BANK0_GPIO1_IE_LSB 6u
#define PADS_BANK0_GPIO1_IE_ACCESS "RW"
#define PADS_BANK0_GPIO1_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO1_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO1_DRIVE_MSB 5u
#define PADS_BANK0_GPIO1_DRIVE_LSB 4u
#define PADS_BANK0_GPIO1_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO1_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO1_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO1_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO1_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO1_PUE_RESET 0x0u
#define PADS_BANK0_GPIO1_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO1_PUE_MSB 3u
#define PADS_BANK0_GPIO1_PUE_LSB 3u
#define PADS_BANK0_GPIO1_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO1_PDE_RESET 0x1u
#define PADS_BANK0_GPIO1_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO1_PDE_MSB 2u
#define PADS_BANK0_GPIO1_PDE_LSB 2u
#define PADS_BANK0_GPIO1_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO1_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO1_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO1_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO1_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO1_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO1_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO1_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO1_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO1_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO1_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO2_OFFSET 0x0000000cu
#define PADS_BANK0_GPIO2_BITS 0x000001ffu
#define PADS_BANK0_GPIO2_RESET 0x00000116u
#define PADS_BANK0_GPIO2_ISO_RESET 0x1u
#define PADS_BANK0_GPIO2_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO2_ISO_MSB 8u
#define PADS_BANK0_GPIO2_ISO_LSB 8u
#define PADS_BANK0_GPIO2_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO2_OD_RESET 0x0u
#define PADS_BANK0_GPIO2_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO2_OD_MSB 7u
#define PADS_BANK0_GPIO2_OD_LSB 7u
#define PADS_BANK0_GPIO2_OD_ACCESS "RW"
#define PADS_BANK0_GPIO2_IE_RESET 0x0u
#define PADS_BANK0_GPIO2_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO2_IE_MSB 6u
#define PADS_BANK0_GPIO2_IE_LSB 6u
#define PADS_BANK0_GPIO2_IE_ACCESS "RW"
#define PADS_BANK0_GPIO2_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO2_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO2_DRIVE_MSB 5u
#define PADS_BANK0_GPIO2_DRIVE_LSB 4u
#define PADS_BANK0_GPIO2_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO2_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO2_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO2_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO2_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO2_PUE_RESET 0x0u
#define PADS_BANK0_GPIO2_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO2_PUE_MSB 3u
#define PADS_BANK0_GPIO2_PUE_LSB 3u
#define PADS_BANK0_GPIO2_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO2_PDE_RESET 0x1u
#define PADS_BANK0_GPIO2_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO2_PDE_MSB 2u
#define PADS_BANK0_GPIO2_PDE_LSB 2u
#define PADS_BANK0_GPIO2_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO2_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO2_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO2_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO2_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO2_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO2_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO2_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO2_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO2_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO2_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO3_OFFSET 0x00000010u
#define PADS_BANK0_GPIO3_BITS 0x000001ffu
#define PADS_BANK0_GPIO3_RESET 0x00000116u
#define PADS_BANK0_GPIO3_ISO_RESET 0x1u
#define PADS_BANK0_GPIO3_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO3_ISO_MSB 8u
#define PADS_BANK0_GPIO3_ISO_LSB 8u
#define PADS_BANK0_GPIO3_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO3_OD_RESET 0x0u
#define PADS_BANK0_GPIO3_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO3_OD_MSB 7u
#define PADS_BANK0_GPIO3_OD_LSB 7u
#define PADS_BANK0_GPIO3_OD_ACCESS "RW"
#define PADS_BANK0_GPIO3_IE_RESET 0x0u
#define PADS_BANK0_GPIO3_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO3_IE_MSB 6u
#define PADS_BANK0_GPIO3_IE_LSB 6u
#define PADS_BANK0_GPIO3_IE_ACCESS "RW"
#define PADS_BANK0_GPIO3_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO3_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO3_DRIVE_MSB 5u
#define PADS_BANK0_GPIO3_DRIVE_LSB 4u
#define PADS_BANK0_GPIO3_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO3_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO3_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO3_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO3_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO3_PUE_RESET 0x0u
#define PADS_BANK0_GPIO3_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO3_PUE_MSB 3u
#define PADS_BANK0_GPIO3_PUE_LSB 3u
#define PADS_BANK0_GPIO3_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO3_PDE_RESET 0x1u
#define PADS_BANK0_GPIO3_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO3_PDE_MSB 2u
#define PADS_BANK0_GPIO3_PDE_LSB 2u
#define PADS_BANK0_GPIO3_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO3_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO3_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO3_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO3_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO3_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO3_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO3_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO3_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO3_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO3_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO4_OFFSET 0x00000014u
#define PADS_BANK0_GPIO4_BITS 0x000001ffu
#define PADS_BANK0_GPIO4_RESET 0x00000116u
#define PADS_BANK0_GPIO4_ISO_RESET 0x1u
#define PADS_BANK0_GPIO4_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO4_ISO_MSB 8u
#define PADS_BANK0_GPIO4_ISO_LSB 8u
#define PADS_BANK0_GPIO4_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO4_OD_RESET 0x0u
#define PADS_BANK0_GPIO4_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO4_OD_MSB 7u
#define PADS_BANK0_GPIO4_OD_LSB 7u
#define PADS_BANK0_GPIO4_OD_ACCESS "RW"
#define PADS_BANK0_GPIO4_IE_RESET 0x0u
#define PADS_BANK0_GPIO4_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO4_IE_MSB 6u
#define PADS_BANK0_GPIO4_IE_LSB 6u
#define PADS_BANK0_GPIO4_IE_ACCESS "RW"
#define PADS_BANK0_GPIO4_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO4_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO4_DRIVE_MSB 5u
#define PADS_BANK0_GPIO4_DRIVE_LSB 4u
#define PADS_BANK0_GPIO4_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO4_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO4_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO4_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO4_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO4_PUE_RESET 0x0u
#define PADS_BANK0_GPIO4_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO4_PUE_MSB 3u
#define PADS_BANK0_GPIO4_PUE_LSB 3u
#define PADS_BANK0_GPIO4_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO4_PDE_RESET 0x1u
#define PADS_BANK0_GPIO4_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO4_PDE_MSB 2u
#define PADS_BANK0_GPIO4_PDE_LSB 2u
#define PADS_BANK0_GPIO4_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO4_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO4_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO4_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO4_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO4_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO4_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO4_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO4_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO4_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO4_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO5_OFFSET 0x00000018u
#define PADS_BANK0_GPIO5_BITS 0x000001ffu
#define PADS_BANK0_GPIO5_RESET 0x00000116u
#define PADS_BANK0_GPIO5_ISO_RESET 0x1u
#define PADS_BANK0_GPIO5_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO5_ISO_MSB 8u
#define PADS_BANK0_GPIO5_ISO_LSB 8u
#define PADS_BANK0_GPIO5_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO5_OD_RESET 0x0u
#define PADS_BANK0_GPIO5_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO5_OD_MSB 7u
#define PADS_BANK0_GPIO5_OD_LSB 7u
#define PADS_BANK0_GPIO5_OD_ACCESS "RW"
#define PADS_BANK0_GPIO5_IE_RESET 0x0u
#define PADS_BANK0_GPIO5_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO5_IE_MSB 6u
#define PADS_BANK0_GPIO5_IE_LSB 6u
#define PADS_BANK0_GPIO5_IE_ACCESS "RW"
#define PADS_BANK0_GPIO5_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO5_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO5_DRIVE_MSB 5u
#define PADS_BANK0_GPIO5_DRIVE_LSB 4u
#define PADS_BANK0_GPIO5_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO5_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO5_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO5_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO5_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO5_PUE_RESET 0x0u
#define PADS_BANK0_GPIO5_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO5_PUE_MSB 3u
#define PADS_BANK0_GPIO5_PUE_LSB 3u
#define PADS_BANK0_GPIO5_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO5_PDE_RESET 0x1u
#define PADS_BANK0_GPIO5_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO5_PDE_MSB 2u
#define PADS_BANK0_GPIO5_PDE_LSB 2u
#define PADS_BANK0_GPIO5_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO5_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO5_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO5_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO5_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO5_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO5_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO5_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO5_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO5_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO5_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO6_OFFSET 0x0000001cu
#define PADS_BANK0_GPIO6_BITS 0x000001ffu
#define PADS_BANK0_GPIO6_RESET 0x00000116u
#define PADS_BANK0_GPIO6_ISO_RESET 0x1u
#define PADS_BANK0_GPIO6_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO6_ISO_MSB 8u
#define PADS_BANK0_GPIO6_ISO_LSB 8u
#define PADS_BANK0_GPIO6_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO6_OD_RESET 0x0u
#define PADS_BANK0_GPIO6_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO6_OD_MSB 7u
#define PADS_BANK0_GPIO6_OD_LSB 7u
#define PADS_BANK0_GPIO6_OD_ACCESS "RW"
#define PADS_BANK0_GPIO6_IE_RESET 0x0u
#define PADS_BANK0_GPIO6_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO6_IE_MSB 6u
#define PADS_BANK0_GPIO6_IE_LSB 6u
#define PADS_BANK0_GPIO6_IE_ACCESS "RW"
#define PADS_BANK0_GPIO6_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO6_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO6_DRIVE_MSB 5u
#define PADS_BANK0_GPIO6_DRIVE_LSB 4u
#define PADS_BANK0_GPIO6_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO6_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO6_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO6_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO6_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO6_PUE_RESET 0x0u
#define PADS_BANK0_GPIO6_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO6_PUE_MSB 3u
#define PADS_BANK0_GPIO6_PUE_LSB 3u
#define PADS_BANK0_GPIO6_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO6_PDE_RESET 0x1u
#define PADS_BANK0_GPIO6_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO6_PDE_MSB 2u
#define PADS_BANK0_GPIO6_PDE_LSB 2u
#define PADS_BANK0_GPIO6_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO6_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO6_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO6_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO6_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO6_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO6_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO6_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO6_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO6_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO6_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO7_OFFSET 0x00000020u
#define PADS_BANK0_GPIO7_BITS 0x000001ffu
#define PADS_BANK0_GPIO7_RESET 0x00000116u
#define PADS_BANK0_GPIO7_ISO_RESET 0x1u
#define PADS_BANK0_GPIO7_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO7_ISO_MSB 8u
#define PADS_BANK0_GPIO7_ISO_LSB 8u
#define PADS_BANK0_GPIO7_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO7_OD_RESET 0x0u
#define PADS_BANK0_GPIO7_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO7_OD_MSB 7u
#define PADS_BANK0_GPIO7_OD_LSB 7u
#define PADS_BANK0_GPIO7_OD_ACCESS "RW"
#define PADS_BANK0_GPIO7_IE_RESET 0x0u
#define PADS_BANK0_GPIO7_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO7_IE_MSB 6u
#define PADS_BANK0_GPIO7_IE_LSB 6u
#define PADS_BANK0_GPIO7_IE_ACCESS "RW"
#define PADS_BANK0_GPIO7_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO7_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO7_DRIVE_MSB 5u
#define PADS_BANK0_GPIO7_DRIVE_LSB 4u
#define PADS_BANK0_GPIO7_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO7_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO7_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO7_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO7_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO7_PUE_RESET 0x0u
#define PADS_BANK0_GPIO7_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO7_PUE_MSB 3u
#define PADS_BANK0_GPIO7_PUE_LSB 3u
#define PADS_BANK0_GPIO7_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO7_PDE_RESET 0x1u
#define PADS_BANK0_GPIO7_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO7_PDE_MSB 2u
#define PADS_BANK0_GPIO7_PDE_LSB 2u
#define PADS_BANK0_GPIO7_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO7_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO7_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO7_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO7_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO7_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO7_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO7_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO7_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO7_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO7_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO8_OFFSET 0x00000024u
#define PADS_BANK0_GPIO8_BITS 0x000001ffu
#define PADS_BANK0_GPIO8_RESET 0x00000116u
#define PADS_BANK0_GPIO8_ISO_RESET 0x1u
#define PADS_BANK0_GPIO8_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO8_ISO_MSB 8u
#define PADS_BANK0_GPIO8_ISO_LSB 8u
#define PADS_BANK0_GPIO8_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO8_OD_RESET 0x0u
#define PADS_BANK0_GPIO8_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO8_OD_MSB 7u
#define PADS_BANK0_GPIO8_OD_LSB 7u
#define PADS_BANK0_GPIO8_OD_ACCESS "RW"
#define PADS_BANK0_GPIO8_IE_RESET 0x0u
#define PADS_BANK0_GPIO8_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO8_IE_MSB 6u
#define PADS_BANK0_GPIO8_IE_LSB 6u
#define PADS_BANK0_GPIO8_IE_ACCESS "RW"
#define PADS_BANK0_GPIO8_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO8_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO8_DRIVE_MSB 5u
#define PADS_BANK0_GPIO8_DRIVE_LSB 4u
#define PADS_BANK0_GPIO8_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO8_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO8_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO8_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO8_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO8_PUE_RESET 0x0u
#define PADS_BANK0_GPIO8_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO8_PUE_MSB 3u
#define PADS_BANK0_GPIO8_PUE_LSB 3u
#define PADS_BANK0_GPIO8_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO8_PDE_RESET 0x1u
#define PADS_BANK0_GPIO8_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO8_PDE_MSB 2u
#define PADS_BANK0_GPIO8_PDE_LSB 2u
#define PADS_BANK0_GPIO8_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO8_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO8_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO8_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO8_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO8_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO8_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO8_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO8_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO8_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO8_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO9_OFFSET 0x00000028u
#define PADS_BANK0_GPIO9_BITS 0x000001ffu
#define PADS_BANK0_GPIO9_RESET 0x00000116u
#define PADS_BANK0_GPIO9_ISO_RESET 0x1u
#define PADS_BANK0_GPIO9_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO9_ISO_MSB 8u
#define PADS_BANK0_GPIO9_ISO_LSB 8u
#define PADS_BANK0_GPIO9_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO9_OD_RESET 0x0u
#define PADS_BANK0_GPIO9_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO9_OD_MSB 7u
#define PADS_BANK0_GPIO9_OD_LSB 7u
#define PADS_BANK0_GPIO9_OD_ACCESS "RW"
#define PADS_BANK0_GPIO9_IE_RESET 0x0u
#define PADS_BANK0_GPIO9_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO9_IE_MSB 6u
#define PADS_BANK0_GPIO9_IE_LSB 6u
#define PADS_BANK0_GPIO9_IE_ACCESS "RW"
#define PADS_BANK0_GPIO9_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO9_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO9_DRIVE_MSB 5u
#define PADS_BANK0_GPIO9_DRIVE_LSB 4u
#define PADS_BANK0_GPIO9_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO9_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO9_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO9_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO9_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO9_PUE_RESET 0x0u
#define PADS_BANK0_GPIO9_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO9_PUE_MSB 3u
#define PADS_BANK0_GPIO9_PUE_LSB 3u
#define PADS_BANK0_GPIO9_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO9_PDE_RESET 0x1u
#define PADS_BANK0_GPIO9_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO9_PDE_MSB 2u
#define PADS_BANK0_GPIO9_PDE_LSB 2u
#define PADS_BANK0_GPIO9_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO9_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO9_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO9_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO9_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO9_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO9_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO9_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO9_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO9_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO9_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO10_OFFSET 0x0000002cu
#define PADS_BANK0_GPIO10_BITS 0x000001ffu
#define PADS_BANK0_GPIO10_RESET 0x00000116u
#define PADS_BANK0_GPIO10_ISO_RESET 0x1u
#define PADS_BANK0_GPIO10_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO10_ISO_MSB 8u
#define PADS_BANK0_GPIO10_ISO_LSB 8u
#define PADS_BANK0_GPIO10_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO10_OD_RESET 0x0u
#define PADS_BANK0_GPIO10_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO10_OD_MSB 7u
#define PADS_BANK0_GPIO10_OD_LSB 7u
#define PADS_BANK0_GPIO10_OD_ACCESS "RW"
#define PADS_BANK0_GPIO10_IE_RESET 0x0u
#define PADS_BANK0_GPIO10_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO10_IE_MSB 6u
#define PADS_BANK0_GPIO10_IE_LSB 6u
#define PADS_BANK0_GPIO10_IE_ACCESS "RW"
#define PADS_BANK0_GPIO10_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO10_DRIVE_BITS 0x00000030u
