gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PADS_BANK0_GPIO10_DRIVE_MSB 5u
#define PADS_BANK0_GPIO10_DRIVE_LSB 4u
#define PADS_BANK0_GPIO10_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO10_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO10_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO10_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO10_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO10_PUE_RESET 0x0u
#define PADS_BANK0_GPIO10_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO10_PUE_MSB 3u
#define PADS_BANK0_GPIO10_PUE_LSB 3u
#define PADS_BANK0_GPIO10_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO10_PDE_RESET 0x1u
#define PADS_BANK0_GPIO10_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO10_PDE_MSB 2u
#define PADS_BANK0_GPIO10_PDE_LSB 2u
#define PADS_BANK0_GPIO10_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO10_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO10_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO10_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO10_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO10_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO10_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO10_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO10_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO10_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO10_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO11_OFFSET 0x00000030u
#define PADS_BANK0_GPIO11_BITS 0x000001ffu
#define PADS_BANK0_GPIO11_RESET 0x00000116u
#define PADS_BANK0_GPIO11_ISO_RESET 0x1u
#define PADS_BANK0_GPIO11_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO11_ISO_MSB 8u
#define PADS_BANK0_GPIO11_ISO_LSB 8u
#define PADS_BANK0_GPIO11_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO11_OD_RESET 0x0u
#define PADS_BANK0_GPIO11_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO11_OD_MSB 7u
#define PADS_BANK0_GPIO11_OD_LSB 7u
#define PADS_BANK0_GPIO11_OD_ACCESS "RW"
#define PADS_BANK0_GPIO11_IE_RESET 0x0u
#define PADS_BANK0_GPIO11_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO11_IE_MSB 6u
#define PADS_BANK0_GPIO11_IE_LSB 6u
#define PADS_BANK0_GPIO11_IE_ACCESS "RW"
#define PADS_BANK0_GPIO11_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO11_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO11_DRIVE_MSB 5u
#define PADS_BANK0_GPIO11_DRIVE_LSB 4u
#define PADS_BANK0_GPIO11_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO11_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO11_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO11_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO11_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO11_PUE_RESET 0x0u
#define PADS_BANK0_GPIO11_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO11_PUE_MSB 3u
#define PADS_BANK0_GPIO11_PUE_LSB 3u
#define PADS_BANK0_GPIO11_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO11_PDE_RESET 0x1u
#define PADS_BANK0_GPIO11_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO11_PDE_MSB 2u
#define PADS_BANK0_GPIO11_PDE_LSB 2u
#define PADS_BANK0_GPIO11_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO11_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO11_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO11_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO11_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO11_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO11_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO11_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO11_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO11_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO11_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO12_OFFSET 0x00000034u
#define PADS_BANK0_GPIO12_BITS 0x000001ffu
#define PADS_BANK0_GPIO12_RESET 0x00000116u
#define PADS_BANK0_GPIO12_ISO_RESET 0x1u
#define PADS_BANK0_GPIO12_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO12_ISO_MSB 8u
#define PADS_BANK0_GPIO12_ISO_LSB 8u
#define PADS_BANK0_GPIO12_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO12_OD_RESET 0x0u
#define PADS_BANK0_GPIO12_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO12_OD_MSB 7u
#define PADS_BANK0_GPIO12_OD_LSB 7u
#define PADS_BANK0_GPIO12_OD_ACCESS "RW"
#define PADS_BANK0_GPIO12_IE_RESET 0x0u
#define PADS_BANK0_GPIO12_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO12_IE_MSB 6u
#define PADS_BANK0_GPIO12_IE_LSB 6u
#define PADS_BANK0_GPIO12_IE_ACCESS "RW"
#define PADS_BANK0_GPIO12_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO12_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO12_DRIVE_MSB 5u
#define PADS_BANK0_GPIO12_DRIVE_LSB 4u
#define PADS_BANK0_GPIO12_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO12_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO12_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO12_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO12_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO12_PUE_RESET 0x0u
#define PADS_BANK0_GPIO12_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO12_PUE_MSB 3u
#define PADS_BANK0_GPIO12_PUE_LSB 3u
#define PADS_BANK0_GPIO12_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO12_PDE_RESET 0x1u
#define PADS_BANK0_GPIO12_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO12_PDE_MSB 2u
#define PADS_BANK0_GPIO12_PDE_LSB 2u
#define PADS_BANK0_GPIO12_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO12_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO12_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO12_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO12_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO12_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO12_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO12_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO12_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO12_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO12_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO13_OFFSET 0x00000038u
#define PADS_BANK0_GPIO13_BITS 0x000001ffu
#define PADS_BANK0_GPIO13_RESET 0x00000116u
#define PADS_BANK0_GPIO13_ISO_RESET 0x1u
#define PADS_BANK0_GPIO13_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO13_ISO_MSB 8u
#define PADS_BANK0_GPIO13_ISO_LSB 8u
#define PADS_BANK0_GPIO13_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO13_OD_RESET 0x0u
#define PADS_BANK0_GPIO13_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO13_OD_MSB 7u
#define PADS_BANK0_GPIO13_OD_LSB 7u
#define PADS_BANK0_GPIO13_OD_ACCESS "RW"
#define PADS_BANK0_GPIO13_IE_RESET 0x0u
#define PADS_BANK0_GPIO13_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO13_IE_MSB 6u
#define PADS_BANK0_GPIO13_IE_LSB 6u
#define PADS_BANK0_GPIO13_IE_ACCESS "RW"
#define PADS_BANK0_GPIO13_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO13_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO13_DRIVE_MSB 5u
#define PADS_BANK0_GPIO13_DRIVE_LSB 4u
#define PADS_BANK0_GPIO13_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO13_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO13_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO13_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO13_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO13_PUE_RESET 0x0u
#define PADS_BANK0_GPIO13_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO13_PUE_MSB 3u
#define PADS_BANK0_GPIO13_PUE_LSB 3u
#define PADS_BANK0_GPIO13_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO13_PDE_RESET 0x1u
#define PADS_BANK0_GPIO13_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO13_PDE_MSB 2u
#define PADS_BANK0_GPIO13_PDE_LSB 2u
#define PADS_BANK0_GPIO13_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO13_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO13_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO13_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO13_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO13_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO13_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO13_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO13_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO13_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO13_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO14_OFFSET 0x0000003cu
#define PADS_BANK0_GPIO14_BITS 0x000001ffu
#define PADS_BANK0_GPIO14_RESET 0x00000116u
#define PADS_BANK0_GPIO14_ISO_RESET 0x1u
#define PADS_BANK0_GPIO14_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO14_ISO_MSB 8u
#define PADS_BANK0_GPIO14_ISO_LSB 8u
#define PADS_BANK0_GPIO14_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO14_OD_RESET 0x0u
#define PADS_BANK0_GPIO14_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO14_OD_MSB 7u
#define PADS_BANK0_GPIO14_OD_LSB 7u
#define PADS_BANK0_GPIO14_OD_ACCESS "RW"
#define PADS_BANK0_GPIO14_IE_RESET 0x0u
#define PADS_BANK0_GPIO14_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO14_IE_MSB 6u
#define PADS_BANK0_GPIO14_IE_LSB 6u
#define PADS_BANK0_GPIO14_IE_ACCESS "RW"
#define PADS_BANK0_GPIO14_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO14_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO14_DRIVE_MSB 5u
#define PADS_BANK0_GPIO14_DRIVE_LSB 4u
#define PADS_BANK0_GPIO14_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO14_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO14_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO14_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO14_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO14_PUE_RESET 0x0u
#define PADS_BANK0_GPIO14_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO14_PUE_MSB 3u
#define PADS_BANK0_GPIO14_PUE_LSB 3u
#define PADS_BANK0_GPIO14_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO14_PDE_RESET 0x1u
#define PADS_BANK0_GPIO14_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO14_PDE_MSB 2u
#define PADS_BANK0_GPIO14_PDE_LSB 2u
#define PADS_BANK0_GPIO14_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO14_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO14_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO14_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO14_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO14_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO14_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO14_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO14_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO14_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO14_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO15_OFFSET 0x00000040u
#define PADS_BANK0_GPIO15_BITS 0x000001ffu
#define PADS_BANK0_GPIO15_RESET 0x00000116u
#define PADS_BANK0_GPIO15_ISO_RESET 0x1u
#define PADS_BANK0_GPIO15_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO15_ISO_MSB 8u
#define PADS_BANK0_GPIO15_ISO_LSB 8u
#define PADS_BANK0_GPIO15_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO15_OD_RESET 0x0u
#define PADS_BANK0_GPIO15_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO15_OD_MSB 7u
#define PADS_BANK0_GPIO15_OD_LSB 7u
#define PADS_BANK0_GPIO15_OD_ACCESS "RW"
#define PADS_BANK0_GPIO15_IE_RESET 0x0u
#define PADS_BANK0_GPIO15_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO15_IE_MSB 6u
#define PADS_BANK0_GPIO15_IE_LSB 6u
#define PADS_BANK0_GPIO15_IE_ACCESS "RW"
#define PADS_BANK0_GPIO15_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO15_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO15_DRIVE_MSB 5u
#define PADS_BANK0_GPIO15_DRIVE_LSB 4u
#define PADS_BANK0_GPIO15_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO15_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO15_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO15_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO15_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO15_PUE_RESET 0x0u
#define PADS_BANK0_GPIO15_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO15_PUE_MSB 3u
#define PADS_BANK0_GPIO15_PUE_LSB 3u
#define PADS_BANK0_GPIO15_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO15_PDE_RESET 0x1u
#define PADS_BANK0_GPIO15_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO15_PDE_MSB 2u
#define PADS_BANK0_GPIO15_PDE_LSB 2u
#define PADS_BANK0_GPIO15_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO15_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO15_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO15_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO15_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO15_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO15_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO15_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO15_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO15_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO15_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO16_OFFSET 0x00000044u
#define PADS_BANK0_GPIO16_BITS 0x000001ffu
#define PADS_BANK0_GPIO16_RESET 0x00000116u
#define PADS_BANK0_GPIO16_ISO_RESET 0x1u
#define PADS_BANK0_GPIO16_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO16_ISO_MSB 8u
#define PADS_BANK0_GPIO16_ISO_LSB 8u
#define PADS_BANK0_GPIO16_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO16_OD_RESET 0x0u
#define PADS_BANK0_GPIO16_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO16_OD_MSB 7u
#define PADS_BANK0_GPIO16_OD_LSB 7u
#define PADS_BANK0_GPIO16_OD_ACCESS "RW"
#define PADS_BANK0_GPIO16_IE_RESET 0x0u
#define PADS_BANK0_GPIO16_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO16_IE_MSB 6u
#define PADS_BANK0_GPIO16_IE_LSB 6u
#define PADS_BANK0_GPIO16_IE_ACCESS "RW"
#define PADS_BANK0_GPIO16_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO16_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO16_DRIVE_MSB 5u
#define PADS_BANK0_GPIO16_DRIVE_LSB 4u
#define PADS_BANK0_GPIO16_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO16_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO16_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO16_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO16_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO16_PUE_RESET 0x0u
#define PADS_BANK0_GPIO16_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO16_PUE_MSB 3u
#define PADS_BANK0_GPIO16_PUE_LSB 3u
#define PADS_BANK0_GPIO16_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO16_PDE_RESET 0x1u
#define PADS_BANK0_GPIO16_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO16_PDE_MSB 2u
#define PADS_BANK0_GPIO16_PDE_LSB 2u
#define PADS_BANK0_GPIO16_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO16_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO16_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO16_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO16_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO16_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO16_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO16_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO16_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO16_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO16_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO17_OFFSET 0x00000048u
#define PADS_BANK0_GPIO17_BITS 0x000001ffu
#define PADS_BANK0_GPIO17_RESET 0x00000116u
#define PADS_BANK0_GPIO17_ISO_RESET 0x1u
#define PADS_BANK0_GPIO17_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO17_ISO_MSB 8u
#define PADS_BANK0_GPIO17_ISO_LSB 8u
#define PADS_BANK0_GPIO17_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO17_OD_RESET 0x0u
#define PADS_BANK0_GPIO17_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO17_OD_MSB 7u
#define PADS_BANK0_GPIO17_OD_LSB 7u
#define PADS_BANK0_GPIO17_OD_ACCESS "RW"
#define PADS_BANK0_GPIO17_IE_RESET 0x0u
#define PADS_BANK0_GPIO17_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO17_IE_MSB 6u
#define PADS_BANK0_GPIO17_IE_LSB 6u
#define PADS_BANK0_GPIO17_IE_ACCESS "RW"
#define PADS_BANK0_GPIO17_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO17_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO17_DRIVE_MSB 5u
#define PADS_BANK0_GPIO17_DRIVE_LSB 4u
#define PADS_BANK0_GPIO17_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO17_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO17_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO17_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO17_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO17_PUE_RESET 0x0u
#define PADS_BANK0_GPIO17_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO17_PUE_MSB 3u
#define PADS_BANK0_GPIO17_PUE_LSB 3u
#define PADS_BANK0_GPIO17_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO17_PDE_RESET 0x1u
#define PADS_BANK0_GPIO17_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO17_PDE_MSB 2u
#define PADS_BANK0_GPIO17_PDE_LSB 2u
#define PADS_BANK0_GPIO17_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO17_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO17_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO17_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO17_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO17_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO17_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO17_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO17_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO17_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO17_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO18_OFFSET 0x0000004cu
#define PADS_BANK0_GPIO18_BITS 0x000001ffu
#define PADS_BANK0_GPIO18_RESET 0x00000116u
#define PADS_BANK0_GPIO18_ISO_RESET 0x1u
#define PADS_BANK0_GPIO18_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO18_ISO_MSB 8u
#define PADS_BANK0_GPIO18_ISO_LSB 8u
#define PADS_BANK0_GPIO18_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO18_OD_RESET 0x0u
#define PADS_BANK0_GPIO18_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO18_OD_MSB 7u
#define PADS_BANK0_GPIO18_OD_LSB 7u
#define PADS_BANK0_GPIO18_OD_ACCESS "RW"
#define PADS_BANK0_GPIO18_IE_RESET 0x0u
#define PADS_BANK0_GPIO18_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO18_IE_MSB 6u
#define PADS_BANK0_GPIO18_IE_LSB 6u
#define PADS_BANK0_GPIO18_IE_ACCESS "RW"
#define PADS_BANK0_GPIO18_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO18_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO18_DRIVE_MSB 5u
#define PADS_BANK0_GPIO18_DRIVE_LSB 4u
#define PADS_BANK0_GPIO18_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO18_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO18_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO18_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO18_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO18_PUE_RESET 0x0u
#define PADS_BANK0_GPIO18_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO18_PUE_MSB 3u
#define PADS_BANK0_GPIO18_PUE_LSB 3u
#define PADS_BANK0_GPIO18_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO18_PDE_RESET 0x1u
#define PADS_BANK0_GPIO18_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO18_PDE_MSB 2u
#define PADS_BANK0_GPIO18_PDE_LSB 2u
#define PADS_BANK0_GPIO18_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO18_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO18_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO18_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO18_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO18_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO18_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO18_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO18_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO18_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO18_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO19_OFFSET 0x00000050u
#define PADS_BANK0_GPIO19_BITS 0x000001ffu
#define PADS_BANK0_GPIO19_RESET 0x00000116u
#define PADS_BANK0_GPIO19_ISO_RESET 0x1u
#define PADS_BANK0_GPIO19_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO19_ISO_MSB 8u
#define PADS_BANK0_GPIO19_ISO_LSB 8u
#define PADS_BANK0_GPIO19_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO19_OD_RESET 0x0u
#define PADS_BANK0_GPIO19_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO19_OD_MSB 7u
#define PADS_BANK0_GPIO19_OD_LSB 7u
#define PADS_BANK0_GPIO19_OD_ACCESS "RW"
#define PADS_BANK0_GPIO19_IE_RESET 0x0u
#define PADS_BANK0_GPIO19_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO19_IE_MSB 6u
#define PADS_BANK0_GPIO19_IE_LSB 6u
#define PADS_BANK0_GPIO19_IE_ACCESS "RW"
#define PADS_BANK0_GPIO19_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO19_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO19_DRIVE_MSB 5u
#define PADS_BANK0_GPIO19_DRIVE_LSB 4u
#define PADS_BANK0_GPIO19_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO19_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO19_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO19_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO19_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO19_PUE_RESET 0x0u
#define PADS_BANK0_GPIO19_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO19_PUE_MSB 3u
#define PADS_BANK0_GPIO19_PUE_LSB 3u
#define PADS_BANK0_GPIO19_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO19_PDE_RESET 0x1u
#define PADS_BANK0_GPIO19_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO19_PDE_MSB 2u
#define PADS_BANK0_GPIO19_PDE_LSB 2u
#define PADS_BANK0_GPIO19_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO19_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO19_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO19_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO19_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO19_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO19_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO19_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO19_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO19_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO19_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO20_OFFSET 0x00000054u
#define PADS_BANK0_GPIO20_BITS 0x000001ffu
#define PADS_BANK0_GPIO20_RESET 0x00000116u
#define PADS_BANK0_GPIO20_ISO_RESET 0x1u
#define PADS_BANK0_GPIO20_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO20_ISO_MSB 8u
#define PADS_BANK0_GPIO20_ISO_LSB 8u
#define PADS_BANK0_GPIO20_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO20_OD_RESET 0x0u
#define PADS_BANK0_GPIO20_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO20_OD_MSB 7u
#define PADS_BANK0_GPIO20_OD_LSB 7u
#define PADS_BANK0_GPIO20_OD_ACCESS "RW"
#define PADS_BANK0_GPIO20_IE_RESET 0x0u
#define PADS_BANK0_GPIO20_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO20_IE_MSB 6u
#define PADS_BANK0_GPIO20_IE_LSB 6u
#define PADS_BANK0_GPIO20_IE_ACCESS "RW"
#define PADS_BANK0_GPIO20_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO20_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO20_DRIVE_MSB 5u
#define PADS_BANK0_GPIO20_DRIVE_LSB 4u
#define PADS_BANK0_GPIO20_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO20_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO20_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO20_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO20_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO20_PUE_RESET 0x0u
#define PADS_BANK0_GPIO20_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO20_PUE_MSB 3u
#define PADS_BANK0_GPIO20_PUE_LSB 3u
#define PADS_BANK0_GPIO20_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO20_PDE_RESET 0x1u
#define PADS_BANK0_GPIO20_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO20_PDE_MSB 2u
#define PADS_BANK0_GPIO20_PDE_LSB 2u
#define PADS_BANK0_GPIO20_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO20_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO20_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO20_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO20_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO20_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO20_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO20_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO20_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO20_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO20_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO21_OFFSET 0x00000058u
#define PADS_BANK0_GPIO21_BITS 0x000001ffu
#define PADS_BANK0_GPIO21_RESET 0x00000116u
#define PADS_BANK0_GPIO21_ISO_RESET 0x1u
#define PADS_BANK0_GPIO21_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO21_ISO_MSB 8u
#define PADS_BANK0_GPIO21_ISO_LSB 8u
#define PADS_BANK0_GPIO21_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO21_OD_RESET 0x0u
#define PADS_BANK0_GPIO21_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO21_OD_MSB 7u
#define PADS_BANK0_GPIO21_OD_LSB 7u
#define PADS_BANK0_GPIO21_OD_ACCESS "RW"
#define PADS_BANK0_GPIO21_IE_RESET 0x0u
#define PADS_BANK0_GPIO21_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO21_IE_MSB 6u
#define PADS_BANK0_GPIO21_IE_LSB 6u
#define PADS_BANK0_GPIO21_IE_ACCESS "RW"
#define PADS_BANK0_GPIO21_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO21_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO21_DRIVE_MSB 5u
#define PADS_BANK0_GPIO21_DRIVE_LSB 4u
#define PADS_BANK0_GPIO21_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO21_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO21_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO21_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO21_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO21_PUE_RESET 0x0u
#define PADS_BANK0_GPIO21_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO21_PUE_MSB 3u
#define PADS_BANK0_GPIO21_PUE_LSB 3u
#define PADS_BANK0_GPIO21_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO21_PDE_RESET 0x1u
#define PADS_BANK0_GPIO21_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO21_PDE_MSB 2u
#define PADS_BANK0_GPIO21_PDE_LSB 2u
#define PADS_BANK0_GPIO21_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO21_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO21_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO21_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO21_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO21_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO21_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO21_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO21_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO21_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO21_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO22_OFFSET 0x0000005cu
#define PADS_BANK0_GPIO22_BITS 0x000001ffu
#define PADS_BANK0_GPIO22_RESET 0x00000116u
#define PADS_BANK0_GPIO22_ISO_RESET 0x1u
#define PADS_BANK0_GPIO22_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO22_ISO_MSB 8u
#define PADS_BANK0_GPIO22_ISO_LSB 8u
#define PADS_BANK0_GPIO22_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO22_OD_RESET 0x0u
#define PADS_BANK0_GPIO22_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO22_OD_MSB 7u
#define PADS_BANK0_GPIO22_OD_LSB 7u
#define PADS_BANK0_GPIO22_OD_ACCESS "RW"
#define PADS_BANK0_GPIO22_IE_RESET 0x0u
#define PADS_BANK0_GPIO22_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO22_IE_MSB 6u
#define PADS_BANK0_GPIO22_IE_LSB 6u
#define PADS_BANK0_GPIO22_IE_ACCESS "RW"
#define PADS_BANK0_GPIO22_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO22_DRIVE_BITS 0x00000030u
