gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PADS_BANK0_GPIO22_DRIVE_MSB 5u
#define PADS_BANK0_GPIO22_DRIVE_LSB 4u
#define PADS_BANK0_GPIO22_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO22_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO22_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO22_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO22_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO22_PUE_RESET 0x0u
#define PADS_BANK0_GPIO22_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO22_PUE_MSB 3u
#define PADS_BANK0_GPIO22_PUE_LSB 3u
#define PADS_BANK0_GPIO22_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO22_PDE_RESET 0x1u
#define PADS_BANK0_GPIO22_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO22_PDE_MSB 2u
#define PADS_BANK0_GPIO22_PDE_LSB 2u
#define PADS_BANK0_GPIO22_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO22_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO22_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO22_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO22_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO22_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO22_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO22_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO22_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO22_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO22_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO23_OFFSET 0x00000060u
#define PADS_BANK0_GPIO23_BITS 0x000001ffu
#define PADS_BANK0_GPIO23_RESET 0x00000116u
#define PADS_BANK0_GPIO23_ISO_RESET 0x1u
#define PADS_BANK0_GPIO23_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO23_ISO_MSB 8u
#define PADS_BANK0_GPIO23_ISO_LSB 8u
#define PADS_BANK0_GPIO23_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO23_OD_RESET 0x0u
#define PADS_BANK0_GPIO23_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO23_OD_MSB 7u
#define PADS_BANK0_GPIO23_OD_LSB 7u
#define PADS_BANK0_GPIO23_OD_ACCESS "RW"
#define PADS_BANK0_GPIO23_IE_RESET 0x0u
#define PADS_BANK0_GPIO23_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO23_IE_MSB 6u
#define PADS_BANK0_GPIO23_IE_LSB 6u
#define PADS_BANK0_GPIO23_IE_ACCESS "RW"
#define PADS_BANK0_GPIO23_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO23_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO23_DRIVE_MSB 5u
#define PADS_BANK0_GPIO23_DRIVE_LSB 4u
#define PADS_BANK0_GPIO23_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO23_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO23_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO23_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO23_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO23_PUE_RESET 0x0u
#define PADS_BANK0_GPIO23_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO23_PUE_MSB 3u
#define PADS_BANK0_GPIO23_PUE_LSB 3u
#define PADS_BANK0_GPIO23_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO23_PDE_RESET 0x1u
#define PADS_BANK0_GPIO23_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO23_PDE_MSB 2u
#define PADS_BANK0_GPIO23_PDE_LSB 2u
#define PADS_BANK0_GPIO23_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO23_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO23_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO23_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO23_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO23_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO23_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO23_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO23_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO23_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO23_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO24_OFFSET 0x00000064u
#define PADS_BANK0_GPIO24_BITS 0x000001ffu
#define PADS_BANK0_GPIO24_RESET 0x00000116u
#define PADS_BANK0_GPIO24_ISO_RESET 0x1u
#define PADS_BANK0_GPIO24_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO24_ISO_MSB 8u
#define PADS_BANK0_GPIO24_ISO_LSB 8u
#define PADS_BANK0_GPIO24_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO24_OD_RESET 0x0u
#define PADS_BANK0_GPIO24_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO24_OD_MSB 7u
#define PADS_BANK0_GPIO24_OD_LSB 7u
#define PADS_BANK0_GPIO24_OD_ACCESS "RW"
#define PADS_BANK0_GPIO24_IE_RESET 0x0u
#define PADS_BANK0_GPIO24_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO24_IE_MSB 6u
#define PADS_BANK0_GPIO24_IE_LSB 6u
#define PADS_BANK0_GPIO24_IE_ACCESS "RW"
#define PADS_BANK0_GPIO24_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO24_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO24_DRIVE_MSB 5u
#define PADS_BANK0_GPIO24_DRIVE_LSB 4u
#define PADS_BANK0_GPIO24_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO24_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO24_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO24_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO24_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO24_PUE_RESET 0x0u
#define PADS_BANK0_GPIO24_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO24_PUE_MSB 3u
#define PADS_BANK0_GPIO24_PUE_LSB 3u
#define PADS_BANK0_GPIO24_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO24_PDE_RESET 0x1u
#define PADS_BANK0_GPIO24_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO24_PDE_MSB 2u
#define PADS_BANK0_GPIO24_PDE_LSB 2u
#define PADS_BANK0_GPIO24_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO24_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO24_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO24_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO24_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO24_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO24_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO24_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO24_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO24_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO24_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO25_OFFSET 0x00000068u
#define PADS_BANK0_GPIO25_BITS 0x000001ffu
#define PADS_BANK0_GPIO25_RESET 0x00000116u
#define PADS_BANK0_GPIO25_ISO_RESET 0x1u
#define PADS_BANK0_GPIO25_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO25_ISO_MSB 8u
#define PADS_BANK0_GPIO25_ISO_LSB 8u
#define PADS_BANK0_GPIO25_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO25_OD_RESET 0x0u
#define PADS_BANK0_GPIO25_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO25_OD_MSB 7u
#define PADS_BANK0_GPIO25_OD_LSB 7u
#define PADS_BANK0_GPIO25_OD_ACCESS "RW"
#define PADS_BANK0_GPIO25_IE_RESET 0x0u
#define PADS_BANK0_GPIO25_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO25_IE_MSB 6u
#define PADS_BANK0_GPIO25_IE_LSB 6u
#define PADS_BANK0_GPIO25_IE_ACCESS "RW"
#define PADS_BANK0_GPIO25_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO25_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO25_DRIVE_MSB 5u
#define PADS_BANK0_GPIO25_DRIVE_LSB 4u
#define PADS_BANK0_GPIO25_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO25_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO25_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO25_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO25_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO25_PUE_RESET 0x0u
#define PADS_BANK0_GPIO25_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO25_PUE_MSB 3u
#define PADS_BANK0_GPIO25_PUE_LSB 3u
#define PADS_BANK0_GPIO25_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO25_PDE_RESET 0x1u
#define PADS_BANK0_GPIO25_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO25_PDE_MSB 2u
#define PADS_BANK0_GPIO25_PDE_LSB 2u
#define PADS_BANK0_GPIO25_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO25_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO25_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO25_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO25_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO25_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO25_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO25_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO25_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO25_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO25_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO26_OFFSET 0x0000006cu
#define PADS_BANK0_GPIO26_BITS 0x000001ffu
#define PADS_BANK0_GPIO26_RESET 0x00000116u
#define PADS_BANK0_GPIO26_ISO_RESET 0x1u
#define PADS_BANK0_GPIO26_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO26_ISO_MSB 8u
#define PADS_BANK0_GPIO26_ISO_LSB 8u
#define PADS_BANK0_GPIO26_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO26_OD_RESET 0x0u
#define PADS_BANK0_GPIO26_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO26_OD_MSB 7u
#define PADS_BANK0_GPIO26_OD_LSB 7u
#define PADS_BANK0_GPIO26_OD_ACCESS "RW"
#define PADS_BANK0_GPIO26_IE_RESET 0x0u
#define PADS_BANK0_GPIO26_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO26_IE_MSB 6u
#define PADS_BANK0_GPIO26_IE_LSB 6u
#define PADS_BANK0_GPIO26_IE_ACCESS "RW"
#define PADS_BANK0_GPIO26_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO26_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO26_DRIVE_MSB 5u
#define PADS_BANK0_GPIO26_DRIVE_LSB 4u
#define PADS_BANK0_GPIO26_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO26_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO26_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO26_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO26_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO26_PUE_RESET 0x0u
#define PADS_BANK0_GPIO26_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO26_PUE_MSB 3u
#define PADS_BANK0_GPIO26_PUE_LSB 3u
#define PADS_BANK0_GPIO26_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO26_PDE_RESET 0x1u
#define PADS_BANK0_GPIO26_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO26_PDE_MSB 2u
#define PADS_BANK0_GPIO26_PDE_LSB 2u
#define PADS_BANK0_GPIO26_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO26_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO26_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO26_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO26_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO26_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO26_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO26_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO26_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO26_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO26_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO27_OFFSET 0x00000070u
#define PADS_BANK0_GPIO27_BITS 0x000001ffu
#define PADS_BANK0_GPIO27_RESET 0x00000116u
#define PADS_BANK0_GPIO27_ISO_RESET 0x1u
#define PADS_BANK0_GPIO27_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO27_ISO_MSB 8u
#define PADS_BANK0_GPIO27_ISO_LSB 8u
#define PADS_BANK0_GPIO27_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO27_OD_RESET 0x0u
#define PADS_BANK0_GPIO27_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO27_OD_MSB 7u
#define PADS_BANK0_GPIO27_OD_LSB 7u
#define PADS_BANK0_GPIO27_OD_ACCESS "RW"
#define PADS_BANK0_GPIO27_IE_RESET 0x0u
#define PADS_BANK0_GPIO27_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO27_IE_MSB 6u
#define PADS_BANK0_GPIO27_IE_LSB 6u
#define PADS_BANK0_GPIO27_IE_ACCESS "RW"
#define PADS_BANK0_GPIO27_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO27_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO27_DRIVE_MSB 5u
#define PADS_BANK0_GPIO27_DRIVE_LSB 4u
#define PADS_BANK0_GPIO27_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO27_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO27_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO27_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO27_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO27_PUE_RESET 0x0u
#define PADS_BANK0_GPIO27_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO27_PUE_MSB 3u
#define PADS_BANK0_GPIO27_PUE_LSB 3u
#define PADS_BANK0_GPIO27_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO27_PDE_RESET 0x1u
#define PADS_BANK0_GPIO27_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO27_PDE_MSB 2u
#define PADS_BANK0_GPIO27_PDE_LSB 2u
#define PADS_BANK0_GPIO27_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO27_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO27_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO27_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO27_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO27_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO27_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO27_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO27_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO27_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO27_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO28_OFFSET 0x00000074u
#define PADS_BANK0_GPIO28_BITS 0x000001ffu
#define PADS_BANK0_GPIO28_RESET 0x00000116u
#define PADS_BANK0_GPIO28_ISO_RESET 0x1u
#define PADS_BANK0_GPIO28_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO28_ISO_MSB 8u
#define PADS_BANK0_GPIO28_ISO_LSB 8u
#define PADS_BANK0_GPIO28_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO28_OD_RESET 0x0u
#define PADS_BANK0_GPIO28_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO28_OD_MSB 7u
#define PADS_BANK0_GPIO28_OD_LSB 7u
#define PADS_BANK0_GPIO28_OD_ACCESS "RW"
#define PADS_BANK0_GPIO28_IE_RESET 0x0u
#define PADS_BANK0_GPIO28_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO28_IE_MSB 6u
#define PADS_BANK0_GPIO28_IE_LSB 6u
#define PADS_BANK0_GPIO28_IE_ACCESS "RW"
#define PADS_BANK0_GPIO28_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO28_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO28_DRIVE_MSB 5u
#define PADS_BANK0_GPIO28_DRIVE_LSB 4u
#define PADS_BANK0_GPIO28_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO28_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO28_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO28_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO28_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO28_PUE_RESET 0x0u
#define PADS_BANK0_GPIO28_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO28_PUE_MSB 3u
#define PADS_BANK0_GPIO28_PUE_LSB 3u
#define PADS_BANK0_GPIO28_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO28_PDE_RESET 0x1u
#define PADS_BANK0_GPIO28_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO28_PDE_MSB 2u
#define PADS_BANK0_GPIO28_PDE_LSB 2u
#define PADS_BANK0_GPIO28_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO28_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO28_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO28_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO28_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO28_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO28_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO28_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO28_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO28_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO28_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO29_OFFSET 0x00000078u
#define PADS_BANK0_GPIO29_BITS 0x000001ffu
#define PADS_BANK0_GPIO29_RESET 0x00000116u
#define PADS_BANK0_GPIO29_ISO_RESET 0x1u
#define PADS_BANK0_GPIO29_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO29_ISO_MSB 8u
#define PADS_BANK0_GPIO29_ISO_LSB 8u
#define PADS_BANK0_GPIO29_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO29_OD_RESET 0x0u
#define PADS_BANK0_GPIO29_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO29_OD_MSB 7u
#define PADS_BANK0_GPIO29_OD_LSB 7u
#define PADS_BANK0_GPIO29_OD_ACCESS "RW"
#define PADS_BANK0_GPIO29_IE_RESET 0x0u
#define PADS_BANK0_GPIO29_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO29_IE_MSB 6u
#define PADS_BANK0_GPIO29_IE_LSB 6u
#define PADS_BANK0_GPIO29_IE_ACCESS "RW"
#define PADS_BANK0_GPIO29_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO29_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO29_DRIVE_MSB 5u
#define PADS_BANK0_GPIO29_DRIVE_LSB 4u
#define PADS_BANK0_GPIO29_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO29_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO29_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO29_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO29_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO29_PUE_RESET 0x0u
#define PADS_BANK0_GPIO29_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO29_PUE_MSB 3u
#define PADS_BANK0_GPIO29_PUE_LSB 3u
#define PADS_BANK0_GPIO29_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO29_PDE_RESET 0x1u
#define PADS_BANK0_GPIO29_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO29_PDE_MSB 2u
#define PADS_BANK0_GPIO29_PDE_LSB 2u
#define PADS_BANK0_GPIO29_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO29_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO29_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO29_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO29_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO29_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO29_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO29_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO29_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO29_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO29_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO30_OFFSET 0x0000007cu
#define PADS_BANK0_GPIO30_BITS 0x000001ffu
#define PADS_BANK0_GPIO30_RESET 0x00000116u
#define PADS_BANK0_GPIO30_ISO_RESET 0x1u
#define PADS_BANK0_GPIO30_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO30_ISO_MSB 8u
#define PADS_BANK0_GPIO30_ISO_LSB 8u
#define PADS_BANK0_GPIO30_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO30_OD_RESET 0x0u
#define PADS_BANK0_GPIO30_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO30_OD_MSB 7u
#define PADS_BANK0_GPIO30_OD_LSB 7u
#define PADS_BANK0_GPIO30_OD_ACCESS "RW"
#define PADS_BANK0_GPIO30_IE_RESET 0x0u
#define PADS_BANK0_GPIO30_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO30_IE_MSB 6u
#define PADS_BANK0_GPIO30_IE_LSB 6u
#define PADS_BANK0_GPIO30_IE_ACCESS "RW"
#define PADS_BANK0_GPIO30_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO30_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO30_DRIVE_MSB 5u
#define PADS_BANK0_GPIO30_DRIVE_LSB 4u
#define PADS_BANK0_GPIO30_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO30_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO30_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO30_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO30_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO30_PUE_RESET 0x0u
#define PADS_BANK0_GPIO30_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO30_PUE_MSB 3u
#define PADS_BANK0_GPIO30_PUE_LSB 3u
#define PADS_BANK0_GPIO30_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO30_PDE_RESET 0x1u
#define PADS_BANK0_GPIO30_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO30_PDE_MSB 2u
#define PADS_BANK0_GPIO30_PDE_LSB 2u
#define PADS_BANK0_GPIO30_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO30_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO30_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO30_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO30_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO30_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO30_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO30_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO30_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO30_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO30_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO31_OFFSET 0x00000080u
#define PADS_BANK0_GPIO31_BITS 0x000001ffu
#define PADS_BANK0_GPIO31_RESET 0x00000116u
#define PADS_BANK0_GPIO31_ISO_RESET 0x1u
#define PADS_BANK0_GPIO31_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO31_ISO_MSB 8u
#define PADS_BANK0_GPIO31_ISO_LSB 8u
#define PADS_BANK0_GPIO31_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO31_OD_RESET 0x0u
#define PADS_BANK0_GPIO31_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO31_OD_MSB 7u
#define PADS_BANK0_GPIO31_OD_LSB 7u
#define PADS_BANK0_GPIO31_OD_ACCESS "RW"
#define PADS_BANK0_GPIO31_IE_RESET 0x0u
#define PADS_BANK0_GPIO31_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO31_IE_MSB 6u
#define PADS_BANK0_GPIO31_IE_LSB 6u
#define PADS_BANK0_GPIO31_IE_ACCESS "RW"
#define PADS_BANK0_GPIO31_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO31_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO31_DRIVE_MSB 5u
#define PADS_BANK0_GPIO31_DRIVE_LSB 4u
#define PADS_BANK0_GPIO31_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO31_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO31_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO31_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO31_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO31_PUE_RESET 0x0u
#define PADS_BANK0_GPIO31_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO31_PUE_MSB 3u
#define PADS_BANK0_GPIO31_PUE_LSB 3u
#define PADS_BANK0_GPIO31_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO31_PDE_RESET 0x1u
#define PADS_BANK0_GPIO31_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO31_PDE_MSB 2u
#define PADS_BANK0_GPIO31_PDE_LSB 2u
#define PADS_BANK0_GPIO31_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO31_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO31_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO31_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO31_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO31_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO31_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO31_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO31_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO31_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO31_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO32_OFFSET 0x00000084u
#define PADS_BANK0_GPIO32_BITS 0x000001ffu
#define PADS_BANK0_GPIO32_RESET 0x00000116u
#define PADS_BANK0_GPIO32_ISO_RESET 0x1u
#define PADS_BANK0_GPIO32_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO32_ISO_MSB 8u
#define PADS_BANK0_GPIO32_ISO_LSB 8u
#define PADS_BANK0_GPIO32_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO32_OD_RESET 0x0u
#define PADS_BANK0_GPIO32_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO32_OD_MSB 7u
#define PADS_BANK0_GPIO32_OD_LSB 7u
#define PADS_BANK0_GPIO32_OD_ACCESS "RW"
#define PADS_BANK0_GPIO32_IE_RESET 0x0u
#define PADS_BANK0_GPIO32_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO32_IE_MSB 6u
#define PADS_BANK0_GPIO32_IE_LSB 6u
#define PADS_BANK0_GPIO32_IE_ACCESS "RW"
#define PADS_BANK0_GPIO32_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO32_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO32_DRIVE_MSB 5u
#define PADS_BANK0_GPIO32_DRIVE_LSB 4u
#define PADS_BANK0_GPIO32_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO32_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO32_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO32_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO32_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO32_PUE_RESET 0x0u
#define PADS_BANK0_GPIO32_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO32_PUE_MSB 3u
#define PADS_BANK0_GPIO32_PUE_LSB 3u
#define PADS_BANK0_GPIO32_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO32_PDE_RESET 0x1u
#define PADS_BANK0_GPIO32_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO32_PDE_MSB 2u
#define PADS_BANK0_GPIO32_PDE_LSB 2u
#define PADS_BANK0_GPIO32_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO32_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO32_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO32_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO32_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO32_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO32_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO32_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO32_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO32_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO32_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO33_OFFSET 0x00000088u
#define PADS_BANK0_GPIO33_BITS 0x000001ffu
#define PADS_BANK0_GPIO33_RESET 0x00000116u
#define PADS_BANK0_GPIO33_ISO_RESET 0x1u
#define PADS_BANK0_GPIO33_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO33_ISO_MSB 8u
#define PADS_BANK0_GPIO33_ISO_LSB 8u
#define PADS_BANK0_GPIO33_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO33_OD_RESET 0x0u
#define PADS_BANK0_GPIO33_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO33_OD_MSB 7u
#define PADS_BANK0_GPIO33_OD_LSB 7u
#define PADS_BANK0_GPIO33_OD_ACCESS "RW"
#define PADS_BANK0_GPIO33_IE_RESET 0x0u
#define PADS_BANK0_GPIO33_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO33_IE_MSB 6u
#define PADS_BANK0_GPIO33_IE_LSB 6u
#define PADS_BANK0_GPIO33_IE_ACCESS "RW"
#define PADS_BANK0_GPIO33_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO33_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO33_DRIVE_MSB 5u
#define PADS_BANK0_GPIO33_DRIVE_LSB 4u
#define PADS_BANK0_GPIO33_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO33_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO33_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO33_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO33_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO33_PUE_RESET 0x0u
#define PADS_BANK0_GPIO33_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO33_PUE_MSB 3u
#define PADS_BANK0_GPIO33_PUE_LSB 3u
#define PADS_BANK0_GPIO33_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO33_PDE_RESET 0x1u
#define PADS_BANK0_GPIO33_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO33_PDE_MSB 2u
#define PADS_BANK0_GPIO33_PDE_LSB 2u
#define PADS_BANK0_GPIO33_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO33_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO33_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO33_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO33_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO33_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO33_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO33_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO33_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO33_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO33_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO34_OFFSET 0x0000008cu
#define PADS_BANK0_GPIO34_BITS 0x000001ffu
#define PADS_BANK0_GPIO34_RESET 0x00000116u
#define PADS_BANK0_GPIO34_ISO_RESET 0x1u
#define PADS_BANK0_GPIO34_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO34_ISO_MSB 8u
#define PADS_BANK0_GPIO34_ISO_LSB 8u
#define PADS_BANK0_GPIO34_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO34_OD_RESET 0x0u
#define PADS_BANK0_GPIO34_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO34_OD_MSB 7u
#define PADS_BANK0_GPIO34_OD_LSB 7u
#define PADS_BANK0_GPIO34_OD_ACCESS "RW"
#define PADS_BANK0_GPIO34_IE_RESET 0x0u
#define PADS_BANK0_GPIO34_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO34_IE_MSB 6u
#define PADS_BANK0_GPIO34_IE_LSB 6u
#define PADS_BANK0_GPIO34_IE_ACCESS "RW"
#define PADS_BANK0_GPIO34_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO34_DRIVE_BITS 0x00000030u
