gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PADS_BANK0_GPIO46_DRIVE_MSB 5u
#define PADS_BANK0_GPIO46_DRIVE_LSB 4u
#define PADS_BANK0_GPIO46_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO46_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO46_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO46_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO46_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO46_PUE_RESET 0x0u
#define PADS_BANK0_GPIO46_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO46_PUE_MSB 3u
#define PADS_BANK0_GPIO46_PUE_LSB 3u
#define PADS_BANK0_GPIO46_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO46_PDE_RESET 0x1u
#define PADS_BANK0_GPIO46_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO46_PDE_MSB 2u
#define PADS_BANK0_GPIO46_PDE_LSB 2u
#define PADS_BANK0_GPIO46_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO46_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO46_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO46_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO46_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO46_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO46_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO46_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO46_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO46_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO46_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_GPIO47_OFFSET 0x000000c0u
#define PADS_BANK0_GPIO47_BITS 0x000001ffu
#define PADS_BANK0_GPIO47_RESET 0x00000116u
#define PADS_BANK0_GPIO47_ISO_RESET 0x1u
#define PADS_BANK0_GPIO47_ISO_BITS 0x00000100u
#define PADS_BANK0_GPIO47_ISO_MSB 8u
#define PADS_BANK0_GPIO47_ISO_LSB 8u
#define PADS_BANK0_GPIO47_ISO_ACCESS "RW"
#define PADS_BANK0_GPIO47_OD_RESET 0x0u
#define PADS_BANK0_GPIO47_OD_BITS 0x00000080u
#define PADS_BANK0_GPIO47_OD_MSB 7u
#define PADS_BANK0_GPIO47_OD_LSB 7u
#define PADS_BANK0_GPIO47_OD_ACCESS "RW"
#define PADS_BANK0_GPIO47_IE_RESET 0x0u
#define PADS_BANK0_GPIO47_IE_BITS 0x00000040u
#define PADS_BANK0_GPIO47_IE_MSB 6u
#define PADS_BANK0_GPIO47_IE_LSB 6u
#define PADS_BANK0_GPIO47_IE_ACCESS "RW"
#define PADS_BANK0_GPIO47_DRIVE_RESET 0x1u
#define PADS_BANK0_GPIO47_DRIVE_BITS 0x00000030u
#define PADS_BANK0_GPIO47_DRIVE_MSB 5u
#define PADS_BANK0_GPIO47_DRIVE_LSB 4u
#define PADS_BANK0_GPIO47_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO47_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_GPIO47_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_GPIO47_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_GPIO47_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_GPIO47_PUE_RESET 0x0u
#define PADS_BANK0_GPIO47_PUE_BITS 0x00000008u
#define PADS_BANK0_GPIO47_PUE_MSB 3u
#define PADS_BANK0_GPIO47_PUE_LSB 3u
#define PADS_BANK0_GPIO47_PUE_ACCESS "RW"
#define PADS_BANK0_GPIO47_PDE_RESET 0x1u
#define PADS_BANK0_GPIO47_PDE_BITS 0x00000004u
#define PADS_BANK0_GPIO47_PDE_MSB 2u
#define PADS_BANK0_GPIO47_PDE_LSB 2u
#define PADS_BANK0_GPIO47_PDE_ACCESS "RW"
#define PADS_BANK0_GPIO47_SCHMITT_RESET 0x1u
#define PADS_BANK0_GPIO47_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_GPIO47_SCHMITT_MSB 1u
#define PADS_BANK0_GPIO47_SCHMITT_LSB 1u
#define PADS_BANK0_GPIO47_SCHMITT_ACCESS "RW"
#define PADS_BANK0_GPIO47_SLEWFAST_RESET 0x0u
#define PADS_BANK0_GPIO47_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_GPIO47_SLEWFAST_MSB 0u
#define PADS_BANK0_GPIO47_SLEWFAST_LSB 0u
#define PADS_BANK0_GPIO47_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_SWCLK_OFFSET 0x000000c4u
#define PADS_BANK0_SWCLK_BITS 0x000001ffu
#define PADS_BANK0_SWCLK_RESET 0x0000005au
#define PADS_BANK0_SWCLK_ISO_RESET 0x0u
#define PADS_BANK0_SWCLK_ISO_BITS 0x00000100u
#define PADS_BANK0_SWCLK_ISO_MSB 8u
#define PADS_BANK0_SWCLK_ISO_LSB 8u
#define PADS_BANK0_SWCLK_ISO_ACCESS "RW"
#define PADS_BANK0_SWCLK_OD_RESET 0x0u
#define PADS_BANK0_SWCLK_OD_BITS 0x00000080u
#define PADS_BANK0_SWCLK_OD_MSB 7u
#define PADS_BANK0_SWCLK_OD_LSB 7u
#define PADS_BANK0_SWCLK_OD_ACCESS "RW"
#define PADS_BANK0_SWCLK_IE_RESET 0x1u
#define PADS_BANK0_SWCLK_IE_BITS 0x00000040u
#define PADS_BANK0_SWCLK_IE_MSB 6u
#define PADS_BANK0_SWCLK_IE_LSB 6u
#define PADS_BANK0_SWCLK_IE_ACCESS "RW"
#define PADS_BANK0_SWCLK_DRIVE_RESET 0x1u
#define PADS_BANK0_SWCLK_DRIVE_BITS 0x00000030u
#define PADS_BANK0_SWCLK_DRIVE_MSB 5u
#define PADS_BANK0_SWCLK_DRIVE_LSB 4u
#define PADS_BANK0_SWCLK_DRIVE_ACCESS "RW"
#define PADS_BANK0_SWCLK_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_SWCLK_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_SWCLK_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_SWCLK_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_SWCLK_PUE_RESET 0x1u
#define PADS_BANK0_SWCLK_PUE_BITS 0x00000008u
#define PADS_BANK0_SWCLK_PUE_MSB 3u
#define PADS_BANK0_SWCLK_PUE_LSB 3u
#define PADS_BANK0_SWCLK_PUE_ACCESS "RW"
#define PADS_BANK0_SWCLK_PDE_RESET 0x0u
#define PADS_BANK0_SWCLK_PDE_BITS 0x00000004u
#define PADS_BANK0_SWCLK_PDE_MSB 2u
#define PADS_BANK0_SWCLK_PDE_LSB 2u
#define PADS_BANK0_SWCLK_PDE_ACCESS "RW"
#define PADS_BANK0_SWCLK_SCHMITT_RESET 0x1u
#define PADS_BANK0_SWCLK_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_SWCLK_SCHMITT_MSB 1u
#define PADS_BANK0_SWCLK_SCHMITT_LSB 1u
#define PADS_BANK0_SWCLK_SCHMITT_ACCESS "RW"
#define PADS_BANK0_SWCLK_SLEWFAST_RESET 0x0u
#define PADS_BANK0_SWCLK_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_SWCLK_SLEWFAST_MSB 0u
#define PADS_BANK0_SWCLK_SLEWFAST_LSB 0u
#define PADS_BANK0_SWCLK_SLEWFAST_ACCESS "RW"
#define PADS_BANK0_SWD_OFFSET 0x000000c8u
#define PADS_BANK0_SWD_BITS 0x000001ffu
#define PADS_BANK0_SWD_RESET 0x0000005au
#define PADS_BANK0_SWD_ISO_RESET 0x0u
#define PADS_BANK0_SWD_ISO_BITS 0x00000100u
#define PADS_BANK0_SWD_ISO_MSB 8u
#define PADS_BANK0_SWD_ISO_LSB 8u
#define PADS_BANK0_SWD_ISO_ACCESS "RW"
#define PADS_BANK0_SWD_OD_RESET 0x0u
#define PADS_BANK0_SWD_OD_BITS 0x00000080u
#define PADS_BANK0_SWD_OD_MSB 7u
#define PADS_BANK0_SWD_OD_LSB 7u
#define PADS_BANK0_SWD_OD_ACCESS "RW"
#define PADS_BANK0_SWD_IE_RESET 0x1u
#define PADS_BANK0_SWD_IE_BITS 0x00000040u
#define PADS_BANK0_SWD_IE_MSB 6u
#define PADS_BANK0_SWD_IE_LSB 6u
#define PADS_BANK0_SWD_IE_ACCESS "RW"
#define PADS_BANK0_SWD_DRIVE_RESET 0x1u
#define PADS_BANK0_SWD_DRIVE_BITS 0x00000030u
#define PADS_BANK0_SWD_DRIVE_MSB 5u
#define PADS_BANK0_SWD_DRIVE_LSB 4u
#define PADS_BANK0_SWD_DRIVE_ACCESS "RW"
#define PADS_BANK0_SWD_DRIVE_VALUE_2MA 0x0u
#define PADS_BANK0_SWD_DRIVE_VALUE_4MA 0x1u
#define PADS_BANK0_SWD_DRIVE_VALUE_8MA 0x2u
#define PADS_BANK0_SWD_DRIVE_VALUE_12MA 0x3u
#define PADS_BANK0_SWD_PUE_RESET 0x1u
#define PADS_BANK0_SWD_PUE_BITS 0x00000008u
#define PADS_BANK0_SWD_PUE_MSB 3u
#define PADS_BANK0_SWD_PUE_LSB 3u
#define PADS_BANK0_SWD_PUE_ACCESS "RW"
#define PADS_BANK0_SWD_PDE_RESET 0x0u
#define PADS_BANK0_SWD_PDE_BITS 0x00000004u
#define PADS_BANK0_SWD_PDE_MSB 2u
#define PADS_BANK0_SWD_PDE_LSB 2u
#define PADS_BANK0_SWD_PDE_ACCESS "RW"
#define PADS_BANK0_SWD_SCHMITT_RESET 0x1u
#define PADS_BANK0_SWD_SCHMITT_BITS 0x00000002u
#define PADS_BANK0_SWD_SCHMITT_MSB 1u
#define PADS_BANK0_SWD_SCHMITT_LSB 1u
#define PADS_BANK0_SWD_SCHMITT_ACCESS "RW"
#define PADS_BANK0_SWD_SLEWFAST_RESET 0x0u
#define PADS_BANK0_SWD_SLEWFAST_BITS 0x00000001u
#define PADS_BANK0_SWD_SLEWFAST_MSB 0u
#define PADS_BANK0_SWD_SLEWFAST_LSB 0u
#define PADS_BANK0_SWD_SLEWFAST_ACCESS "RW"
typedef struct {
   
    io_rw_32 voltage_select;
   
    io_rw_32 io[48];
} pads_bank0_hw_t;
