gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_PIO1_5 0x07u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_PIO2_5 0x08u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_CORESIGHT_TRACEDATA_3 0x09u
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO5_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO6_STATUS_OFFSET 0x00000030u
#define IO_BANK0_GPIO6_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO6_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO6_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO6_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO6_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO6_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO6_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO6_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO6_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO6_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO6_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO6_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO6_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO6_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO6_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO6_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO6_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO6_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO6_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO6_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO6_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO6_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO6_CTRL_OFFSET 0x00000034u
#define IO_BANK0_GPIO6_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO6_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO6_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO6_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO6_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO6_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO6_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO6_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO6_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO6_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO6_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO6_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO6_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO6_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO6_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO6_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO6_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO6_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO6_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO6_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO6_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO6_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO6_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO6_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO6_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_SPI0_SCLK 0x01u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_PWM_A_3 0x04u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_SIOB_PROC_6 0x05u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_PIO0_6 0x06u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_PIO1_6 0x07u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_PIO2_6 0x08u
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_BANK0_GPIO6_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO7_STATUS_OFFSET 0x00000038u
#define IO_BANK0_GPIO7_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO7_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO7_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO7_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO7_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO7_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO7_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO7_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO7_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO7_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO7_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO7_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO7_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO7_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO7_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO7_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO7_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO7_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO7_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO7_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO7_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO7_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO7_CTRL_OFFSET 0x0000003cu
#define IO_BANK0_GPIO7_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO7_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO7_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO7_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO7_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO7_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO7_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO7_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO7_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO7_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO7_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO7_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO7_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO7_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO7_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO7_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO7_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO7_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO7_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO7_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO7_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO7_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO7_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO7_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO7_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_SPI0_TX 0x01u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_PWM_B_3 0x04u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_SIOB_PROC_7 0x05u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_PIO0_7 0x06u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_PIO1_7 0x07u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_PIO2_7 0x08u
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
#define IO_BANK0_GPIO7_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO8_STATUS_OFFSET 0x00000040u
#define IO_BANK0_GPIO8_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO8_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO8_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO8_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO8_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO8_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO8_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO8_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO8_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO8_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO8_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO8_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO8_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO8_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO8_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO8_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO8_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO8_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO8_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO8_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO8_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO8_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO8_CTRL_OFFSET 0x00000044u
#define IO_BANK0_GPIO8_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO8_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO8_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO8_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO8_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO8_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO8_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO8_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO8_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO8_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO8_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO8_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO8_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO8_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO8_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO8_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO8_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO8_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO8_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO8_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO8_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO8_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO8_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO8_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO8_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_SPI1_RX 0x01u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_PWM_A_4 0x04u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_SIOB_PROC_8 0x05u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_PIO0_8 0x06u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_PIO1_8 0x07u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_PIO2_8 0x08u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_XIP_SS_N_1 0x09u
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO8_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO9_STATUS_OFFSET 0x00000048u
#define IO_BANK0_GPIO9_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO9_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO9_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO9_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO9_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO9_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO9_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO9_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO9_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO9_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO9_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO9_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO9_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO9_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO9_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO9_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO9_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO9_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO9_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO9_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO9_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO9_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO9_CTRL_OFFSET 0x0000004cu
#define IO_BANK0_GPIO9_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO9_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO9_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO9_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO9_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO9_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO9_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO9_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO9_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO9_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO9_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO9_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO9_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO9_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO9_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO9_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO9_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO9_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO9_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO9_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO9_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO9_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO9_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO9_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO9_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_SPI1_SS_N 0x01u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_PWM_B_4 0x04u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_SIOB_PROC_9 0x05u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_PIO0_9 0x06u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_PIO1_9 0x07u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_PIO2_9 0x08u
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO9_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO10_STATUS_OFFSET 0x00000050u
#define IO_BANK0_GPIO10_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO10_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO10_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO10_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO10_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO10_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO10_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO10_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO10_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO10_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO10_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO10_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO10_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO10_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO10_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO10_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO10_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO10_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO10_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO10_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO10_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO10_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO10_CTRL_OFFSET 0x00000054u
#define IO_BANK0_GPIO10_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO10_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO10_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO10_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO10_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO10_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO10_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO10_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO10_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO10_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO10_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO10_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO10_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO10_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO10_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO10_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO10_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO10_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO10_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO10_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO10_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO10_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO10_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO10_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO10_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_SPI1_SCLK 0x01u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_PWM_A_5 0x04u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_SIOB_PROC_10 0x05u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_PIO0_10 0x06u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_PIO1_10 0x07u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_PIO2_10 0x08u
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_BANK0_GPIO10_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO11_STATUS_OFFSET 0x00000058u
#define IO_BANK0_GPIO11_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO11_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO11_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO11_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO11_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO11_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO11_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO11_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO11_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO11_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO11_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO11_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO11_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO11_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO11_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO11_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO11_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO11_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO11_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO11_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO11_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO11_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO11_CTRL_OFFSET 0x0000005cu
#define IO_BANK0_GPIO11_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO11_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO11_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO11_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO11_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO11_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO11_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO11_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO11_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO11_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO11_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO11_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO11_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO11_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO11_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO11_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO11_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_SPI1_TX 0x01u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PWM_B_5 0x04u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_SIOB_PROC_11 0x05u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PIO0_11 0x06u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PIO1_11 0x07u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PIO2_11 0x08u
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
