gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO12_STATUS_OFFSET 0x00000060u
#define IO_BANK0_GPIO12_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO12_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO12_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO12_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO12_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO12_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO12_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO12_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO12_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO12_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO12_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO12_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO12_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO12_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO12_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO12_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO12_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO12_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO12_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO12_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO12_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO12_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO12_CTRL_OFFSET 0x00000064u
#define IO_BANK0_GPIO12_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO12_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO12_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO12_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO12_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO12_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO12_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO12_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO12_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO12_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO12_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO12_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO12_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO12_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO12_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO12_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO12_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_HSTX_0 0x00u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_SPI1_RX 0x01u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PWM_A_6 0x04u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_SIOB_PROC_12 0x05u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PIO0_12 0x06u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PIO1_12 0x07u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PIO2_12 0x08u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_0 0x09u
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO13_STATUS_OFFSET 0x00000068u
#define IO_BANK0_GPIO13_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO13_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO13_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO13_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO13_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO13_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO13_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO13_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO13_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO13_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO13_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO13_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO13_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO13_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO13_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO13_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO13_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO13_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO13_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO13_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO13_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO13_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO13_CTRL_OFFSET 0x0000006cu
#define IO_BANK0_GPIO13_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO13_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO13_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO13_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO13_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO13_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO13_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO13_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO13_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO13_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO13_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO13_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO13_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO13_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO13_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO13_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO13_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_HSTX_1 0x00u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_SPI1_SS_N 0x01u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PWM_B_6 0x04u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_SIOB_PROC_13 0x05u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PIO0_13 0x06u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PIO1_13 0x07u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PIO2_13 0x08u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_0 0x09u
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO14_STATUS_OFFSET 0x00000070u
#define IO_BANK0_GPIO14_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO14_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO14_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO14_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO14_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO14_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO14_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO14_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO14_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO14_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO14_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO14_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO14_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO14_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO14_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO14_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO14_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO14_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO14_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO14_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO14_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO14_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO14_CTRL_OFFSET 0x00000074u
#define IO_BANK0_GPIO14_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO14_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO14_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO14_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO14_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO14_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO14_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO14_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO14_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO14_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO14_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO14_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO14_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO14_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO14_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO14_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO14_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_HSTX_2 0x00u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_SPI1_SCLK 0x01u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PWM_A_7 0x04u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_SIOB_PROC_14 0x05u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PIO0_14 0x06u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PIO1_14 0x07u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PIO2_14 0x08u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_1 0x09u
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO15_STATUS_OFFSET 0x00000078u
#define IO_BANK0_GPIO15_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO15_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO15_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO15_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO15_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO15_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO15_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO15_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO15_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO15_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO15_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO15_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO15_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO15_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO15_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO15_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO15_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO15_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO15_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO15_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO15_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO15_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO15_CTRL_OFFSET 0x0000007cu
#define IO_BANK0_GPIO15_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO15_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO15_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO15_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO15_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO15_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO15_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO15_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO15_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO15_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO15_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO15_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO15_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO15_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO15_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO15_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO15_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_HSTX_3 0x00u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_SPI1_TX 0x01u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_UART0_RTS 0x02u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PWM_B_7 0x04u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_SIOB_PROC_15 0x05u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PIO0_15 0x06u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PIO1_15 0x07u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PIO2_15 0x08u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_1 0x09u
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_UART0_RX 0x0bu
#define IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO16_STATUS_OFFSET 0x00000080u
#define IO_BANK0_GPIO16_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO16_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO16_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO16_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO16_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO16_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO16_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO16_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO16_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO16_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO16_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO16_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO16_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO16_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO16_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO16_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO16_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO16_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO16_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO16_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO16_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO16_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO16_CTRL_OFFSET 0x00000084u
#define IO_BANK0_GPIO16_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO16_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO16_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO16_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO16_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO16_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO16_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO16_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO16_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO16_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO16_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO16_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO16_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO16_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO16_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO16_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO16_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_HSTX_4 0x00u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_SPI0_RX 0x01u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PWM_A_0 0x04u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_SIOB_PROC_16 0x05u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PIO0_16 0x06u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PIO1_16 0x07u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PIO2_16 0x08u
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO17_STATUS_OFFSET 0x00000088u
#define IO_BANK0_GPIO17_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO17_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO17_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO17_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO17_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO17_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO17_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO17_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO17_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO17_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO17_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO17_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO17_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO17_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO17_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO17_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO17_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO17_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO17_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO17_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO17_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO17_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO17_CTRL_OFFSET 0x0000008cu
#define IO_BANK0_GPIO17_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO17_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO17_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO17_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO17_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO17_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO17_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO17_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO17_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO17_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO17_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO17_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO17_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO17_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO17_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO17_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO17_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_HSTX_5 0x00u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_SPI0_SS_N 0x01u
