gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PWM_B_0 0x04u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_SIOB_PROC_17 0x05u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PIO0_17 0x06u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PIO1_17 0x07u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PIO2_17 0x08u
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO18_STATUS_OFFSET 0x00000090u
#define IO_BANK0_GPIO18_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO18_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO18_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO18_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO18_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO18_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO18_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO18_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO18_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO18_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO18_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO18_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO18_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO18_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO18_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO18_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO18_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO18_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO18_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO18_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO18_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO18_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO18_CTRL_OFFSET 0x00000094u
#define IO_BANK0_GPIO18_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO18_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO18_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO18_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO18_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO18_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO18_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO18_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO18_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO18_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO18_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO18_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO18_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO18_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO18_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO18_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO18_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO18_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO18_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_HSTX_6 0x00u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_SPI0_SCLK 0x01u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_PWM_A_1 0x04u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_SIOB_PROC_18 0x05u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_PIO0_18 0x06u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_PIO1_18 0x07u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_PIO2_18 0x08u
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO19_STATUS_OFFSET 0x00000098u
#define IO_BANK0_GPIO19_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO19_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO19_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO19_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO19_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO19_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO19_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO19_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO19_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO19_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO19_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO19_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO19_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO19_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO19_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO19_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO19_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO19_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO19_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO19_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO19_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO19_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO19_CTRL_OFFSET 0x0000009cu
#define IO_BANK0_GPIO19_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO19_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO19_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO19_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO19_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO19_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO19_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO19_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO19_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO19_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO19_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO19_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO19_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO19_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO19_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO19_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO19_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO19_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO19_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO19_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO19_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO19_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO19_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO19_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO19_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_HSTX_7 0x00u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_SPI0_TX 0x01u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_UART0_RTS 0x02u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_PWM_B_1 0x04u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_SIOB_PROC_19 0x05u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_PIO0_19 0x06u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_PIO1_19 0x07u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_PIO2_19 0x08u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_XIP_SS_N_1 0x09u
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_UART0_RX 0x0bu
#define IO_BANK0_GPIO19_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO20_STATUS_OFFSET 0x000000a0u
#define IO_BANK0_GPIO20_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO20_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO20_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO20_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO20_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO20_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO20_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO20_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO20_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO20_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO20_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO20_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO20_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO20_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO20_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO20_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO20_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO20_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO20_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO20_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO20_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO20_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO20_CTRL_OFFSET 0x000000a4u
#define IO_BANK0_GPIO20_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO20_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO20_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO20_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO20_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO20_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO20_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO20_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO20_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO20_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO20_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO20_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO20_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO20_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO20_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO20_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO20_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO20_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO20_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO20_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO20_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO20_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO20_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO20_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO20_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_SPI0_RX 0x01u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_PWM_A_2 0x04u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_SIOB_PROC_20 0x05u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_PIO0_20 0x06u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_PIO1_20 0x07u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_PIO2_20 0x08u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_0 0x09u
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO20_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO21_STATUS_OFFSET 0x000000a8u
#define IO_BANK0_GPIO21_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO21_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO21_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO21_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO21_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO21_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO21_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO21_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO21_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO21_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO21_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO21_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO21_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO21_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO21_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO21_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO21_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO21_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO21_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO21_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO21_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO21_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO21_CTRL_OFFSET 0x000000acu
#define IO_BANK0_GPIO21_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO21_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO21_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO21_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO21_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO21_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO21_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO21_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO21_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO21_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO21_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO21_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO21_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO21_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO21_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO21_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO21_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO21_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO21_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO21_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO21_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO21_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO21_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO21_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO21_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_SPI0_SS_N 0x01u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_PWM_B_2 0x04u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_SIOB_PROC_21 0x05u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_PIO0_21 0x06u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_PIO1_21 0x07u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_PIO2_21 0x08u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_0 0x09u
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO22_STATUS_OFFSET 0x000000b0u
#define IO_BANK0_GPIO22_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO22_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO22_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO22_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO22_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO22_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO22_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO22_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO22_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO22_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO22_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO22_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO22_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO22_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO22_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO22_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO22_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO22_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO22_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO22_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO22_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO22_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO22_CTRL_OFFSET 0x000000b4u
#define IO_BANK0_GPIO22_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO22_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO22_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO22_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO22_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO22_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO22_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO22_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO22_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO22_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO22_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO22_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO22_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO22_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO22_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO22_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO22_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_SPI0_SCLK 0x01u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PWM_A_3 0x04u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_SIOB_PROC_22 0x05u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PIO0_22 0x06u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PIO1_22 0x07u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PIO2_22 0x08u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_1 0x09u
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO23_STATUS_OFFSET 0x000000b8u
#define IO_BANK0_GPIO23_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO23_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO23_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO23_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO23_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO23_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO23_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO23_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO23_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO23_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO23_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO23_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO23_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO23_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO23_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO23_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO23_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO23_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO23_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO23_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO23_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO23_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO23_CTRL_OFFSET 0x000000bcu
#define IO_BANK0_GPIO23_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO23_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO23_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO23_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO23_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO23_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO23_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO23_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO23_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO23_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO23_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO23_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO23_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO23_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO23_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO23_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO23_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_HIGH 0x3u
