gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_SPI0_TX 0x01u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PWM_B_3 0x04u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_SIOB_PROC_23 0x05u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PIO0_23 0x06u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PIO1_23 0x07u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PIO2_23 0x08u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_1 0x09u
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO24_STATUS_OFFSET 0x000000c0u
#define IO_BANK0_GPIO24_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO24_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO24_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO24_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO24_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO24_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO24_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO24_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO24_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO24_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO24_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO24_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO24_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO24_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO24_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO24_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO24_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO24_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO24_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO24_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO24_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO24_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO24_CTRL_OFFSET 0x000000c4u
#define IO_BANK0_GPIO24_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO24_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO24_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO24_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO24_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO24_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO24_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO24_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO24_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO24_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO24_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO24_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO24_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO24_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO24_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO24_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO24_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_SPI1_RX 0x01u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PWM_A_4 0x04u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_SIOB_PROC_24 0x05u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PIO0_24 0x06u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PIO1_24 0x07u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PIO2_24 0x08u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_2 0x09u
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO25_STATUS_OFFSET 0x000000c8u
#define IO_BANK0_GPIO25_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO25_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO25_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO25_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO25_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO25_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO25_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO25_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO25_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO25_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO25_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO25_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO25_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO25_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO25_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO25_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO25_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO25_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO25_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO25_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO25_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO25_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO25_CTRL_OFFSET 0x000000ccu
#define IO_BANK0_GPIO25_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO25_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO25_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO25_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO25_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO25_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO25_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO25_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO25_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO25_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO25_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO25_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO25_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO25_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO25_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO25_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO25_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_SPI1_SS_N 0x01u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PWM_B_4 0x04u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_SIOB_PROC_25 0x05u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PIO0_25 0x06u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PIO1_25 0x07u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PIO2_25 0x08u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_3 0x09u
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO26_STATUS_OFFSET 0x000000d0u
#define IO_BANK0_GPIO26_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO26_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO26_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO26_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO26_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO26_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO26_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO26_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO26_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO26_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO26_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO26_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO26_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO26_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO26_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO26_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO26_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO26_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO26_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO26_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO26_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO26_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO26_CTRL_OFFSET 0x000000d4u
#define IO_BANK0_GPIO26_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO26_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO26_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO26_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO26_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO26_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO26_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO26_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO26_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO26_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO26_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO26_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO26_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO26_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO26_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO26_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO26_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO26_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO26_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO26_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO26_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO26_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO26_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO26_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO26_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_SPI1_SCLK 0x01u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_PWM_A_5 0x04u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_SIOB_PROC_26 0x05u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_PIO0_26 0x06u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_PIO1_26 0x07u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_PIO2_26 0x08u
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN 0x0au
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_BANK0_GPIO26_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO27_STATUS_OFFSET 0x000000d8u
#define IO_BANK0_GPIO27_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO27_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO27_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO27_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO27_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO27_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO27_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO27_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO27_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO27_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO27_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO27_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO27_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO27_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO27_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO27_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO27_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO27_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO27_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO27_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO27_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO27_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO27_CTRL_OFFSET 0x000000dcu
#define IO_BANK0_GPIO27_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO27_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO27_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO27_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO27_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO27_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO27_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO27_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO27_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO27_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO27_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO27_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO27_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO27_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO27_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO27_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO27_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO27_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO27_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO27_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO27_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO27_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO27_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO27_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO27_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_SPI1_TX 0x01u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_PWM_B_5 0x04u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_SIOB_PROC_27 0x05u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_PIO0_27 0x06u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_PIO1_27 0x07u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_PIO2_27 0x08u
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT 0x0au
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
#define IO_BANK0_GPIO27_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO28_STATUS_OFFSET 0x000000e0u
#define IO_BANK0_GPIO28_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO28_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO28_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO28_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO28_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO28_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO28_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO28_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO28_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO28_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO28_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO28_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO28_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO28_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO28_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO28_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO28_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO28_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO28_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO28_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO28_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO28_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO28_CTRL_OFFSET 0x000000e4u
#define IO_BANK0_GPIO28_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO28_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO28_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO28_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO28_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO28_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO28_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO28_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO28_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO28_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO28_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO28_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO28_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO28_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO28_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO28_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO28_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO28_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO28_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO28_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO28_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO28_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO28_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO28_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO28_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_RESET 0x1fu
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_MSB 4u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_LSB 0u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_ACCESS "RW"
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_SPI1_RX 0x01u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_PWM_A_6 0x04u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_SIOB_PROC_28 0x05u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_PIO0_28 0x06u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_PIO1_28 0x07u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_PIO2_28 0x08u
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT 0x0au
#define IO_BANK0_GPIO28_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_BANK0_GPIO29_STATUS_OFFSET 0x000000e8u
#define IO_BANK0_GPIO29_STATUS_BITS 0x04022200u
#define IO_BANK0_GPIO29_STATUS_RESET 0x00000000u
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_RESET 0x0u
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_MSB 26u
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_LSB 26u
#define IO_BANK0_GPIO29_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_RESET 0x0u
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_MSB 17u
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_LSB 17u
#define IO_BANK0_GPIO29_STATUS_INFROMPAD_ACCESS "RO"
#define IO_BANK0_GPIO29_STATUS_OETOPAD_RESET 0x0u
#define IO_BANK0_GPIO29_STATUS_OETOPAD_BITS 0x00002000u
#define IO_BANK0_GPIO29_STATUS_OETOPAD_MSB 13u
#define IO_BANK0_GPIO29_STATUS_OETOPAD_LSB 13u
#define IO_BANK0_GPIO29_STATUS_OETOPAD_ACCESS "RO"
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_RESET 0x0u
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_MSB 9u
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_LSB 9u
#define IO_BANK0_GPIO29_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_BANK0_GPIO29_CTRL_OFFSET 0x000000ecu
#define IO_BANK0_GPIO29_CTRL_BITS 0x3003f01fu
#define IO_BANK0_GPIO29_CTRL_RESET 0x0000001fu
#define IO_BANK0_GPIO29_CTRL_IRQOVER_RESET 0x0u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_BITS 0x30000000u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_MSB 29u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_LSB 28u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO29_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO29_CTRL_INOVER_RESET 0x0u
#define IO_BANK0_GPIO29_CTRL_INOVER_BITS 0x00030000u
#define IO_BANK0_GPIO29_CTRL_INOVER_MSB 17u
#define IO_BANK0_GPIO29_CTRL_INOVER_LSB 16u
#define IO_BANK0_GPIO29_CTRL_INOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_BANK0_GPIO29_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_BANK0_GPIO29_CTRL_OEOVER_RESET 0x0u
#define IO_BANK0_GPIO29_CTRL_OEOVER_BITS 0x0000c000u
#define IO_BANK0_GPIO29_CTRL_OEOVER_MSB 15u
#define IO_BANK0_GPIO29_CTRL_OEOVER_LSB 14u
#define IO_BANK0_GPIO29_CTRL_OEOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_BANK0_GPIO29_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_BANK0_GPIO29_CTRL_OUTOVER_RESET 0x0u
#define IO_BANK0_GPIO29_CTRL_OUTOVER_BITS 0x00003000u
#define IO_BANK0_GPIO29_CTRL_OUTOVER_MSB 13u
#define IO_BANK0_GPIO29_CTRL_OUTOVER_LSB 12u
#define IO_BANK0_GPIO29_CTRL_OUTOVER_ACCESS "RW"
#define IO_BANK0_GPIO29_CTRL_OUTOVER_VALUE_NORMAL 0x0u
