gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_BANK0_PROC1_INTE5_GPIO45_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO45_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO45_EDGE_LOW_BITS 0x00400000u
#define IO_BANK0_PROC1_INTE5_GPIO45_EDGE_LOW_MSB 22u
#define IO_BANK0_PROC1_INTE5_GPIO45_EDGE_LOW_LSB 22u
#define IO_BANK0_PROC1_INTE5_GPIO45_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_HIGH_BITS 0x00200000u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_HIGH_MSB 21u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_HIGH_LSB 21u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_LOW_BITS 0x00100000u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_LOW_MSB 20u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_LOW_LSB 20u
#define IO_BANK0_PROC1_INTE5_GPIO45_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_HIGH_BITS 0x00080000u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_HIGH_MSB 19u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_HIGH_LSB 19u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_LOW_BITS 0x00040000u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_LOW_MSB 18u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_LOW_LSB 18u
#define IO_BANK0_PROC1_INTE5_GPIO44_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_HIGH_BITS 0x00020000u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_HIGH_MSB 17u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_HIGH_LSB 17u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_LOW_BITS 0x00010000u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_LOW_MSB 16u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_LOW_LSB 16u
#define IO_BANK0_PROC1_INTE5_GPIO44_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_HIGH_BITS 0x00008000u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_HIGH_MSB 15u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_HIGH_LSB 15u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_LOW_BITS 0x00004000u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_LOW_MSB 14u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_LOW_LSB 14u
#define IO_BANK0_PROC1_INTE5_GPIO43_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_HIGH_BITS 0x00002000u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_HIGH_MSB 13u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_HIGH_LSB 13u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_LOW_BITS 0x00001000u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_LOW_MSB 12u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_LOW_LSB 12u
#define IO_BANK0_PROC1_INTE5_GPIO43_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_HIGH_BITS 0x00000800u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_HIGH_MSB 11u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_HIGH_LSB 11u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_LOW_BITS 0x00000400u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_LOW_MSB 10u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_LOW_LSB 10u
#define IO_BANK0_PROC1_INTE5_GPIO42_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_HIGH_BITS 0x00000200u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_HIGH_MSB 9u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_HIGH_LSB 9u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_LOW_BITS 0x00000100u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_LOW_MSB 8u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_LOW_LSB 8u
#define IO_BANK0_PROC1_INTE5_GPIO42_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_HIGH_BITS 0x00000080u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_HIGH_MSB 7u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_HIGH_LSB 7u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_LOW_BITS 0x00000040u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_LOW_MSB 6u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_LOW_LSB 6u
#define IO_BANK0_PROC1_INTE5_GPIO41_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_HIGH_BITS 0x00000020u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_HIGH_MSB 5u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_HIGH_LSB 5u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_LOW_BITS 0x00000010u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_LOW_MSB 4u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_LOW_LSB 4u
#define IO_BANK0_PROC1_INTE5_GPIO41_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_HIGH_BITS 0x00000008u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_HIGH_MSB 3u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_HIGH_LSB 3u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_LOW_BITS 0x00000004u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_LOW_MSB 2u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_LOW_LSB 2u
#define IO_BANK0_PROC1_INTE5_GPIO40_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_HIGH_BITS 0x00000002u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_HIGH_MSB 1u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_HIGH_LSB 1u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_LOW_BITS 0x00000001u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_LOW_MSB 0u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_LOW_LSB 0u
#define IO_BANK0_PROC1_INTE5_GPIO40_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_OFFSET 0x000002a8u
#define IO_BANK0_PROC1_INTF0_BITS 0xffffffffu
#define IO_BANK0_PROC1_INTF0_RESET 0x00000000u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_HIGH_BITS 0x80000000u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_HIGH_MSB 31u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_HIGH_LSB 31u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_LOW_BITS 0x40000000u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_LOW_MSB 30u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_LOW_LSB 30u
#define IO_BANK0_PROC1_INTF0_GPIO7_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_HIGH_BITS 0x20000000u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_HIGH_MSB 29u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_HIGH_LSB 29u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_LOW_BITS 0x10000000u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_LOW_MSB 28u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_LOW_LSB 28u
#define IO_BANK0_PROC1_INTF0_GPIO7_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_HIGH_BITS 0x08000000u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_HIGH_MSB 27u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_HIGH_LSB 27u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_LOW_BITS 0x04000000u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_LOW_MSB 26u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_LOW_LSB 26u
#define IO_BANK0_PROC1_INTF0_GPIO6_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_HIGH_BITS 0x02000000u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_HIGH_MSB 25u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_HIGH_LSB 25u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_LOW_BITS 0x01000000u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_LOW_MSB 24u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_LOW_LSB 24u
#define IO_BANK0_PROC1_INTF0_GPIO6_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_HIGH_BITS 0x00800000u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_HIGH_MSB 23u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_HIGH_LSB 23u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_LOW_BITS 0x00400000u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_LOW_MSB 22u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_LOW_LSB 22u
#define IO_BANK0_PROC1_INTF0_GPIO5_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_HIGH_BITS 0x00200000u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_HIGH_MSB 21u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_HIGH_LSB 21u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_LOW_BITS 0x00100000u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_LOW_MSB 20u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_LOW_LSB 20u
#define IO_BANK0_PROC1_INTF0_GPIO5_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_HIGH_BITS 0x00080000u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_HIGH_MSB 19u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_HIGH_LSB 19u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_LOW_BITS 0x00040000u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_LOW_MSB 18u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_LOW_LSB 18u
#define IO_BANK0_PROC1_INTF0_GPIO4_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_HIGH_BITS 0x00020000u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_HIGH_MSB 17u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_HIGH_LSB 17u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_LOW_BITS 0x00010000u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_LOW_MSB 16u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_LOW_LSB 16u
#define IO_BANK0_PROC1_INTF0_GPIO4_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_HIGH_BITS 0x00008000u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_HIGH_MSB 15u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_HIGH_LSB 15u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_LOW_BITS 0x00004000u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_LOW_MSB 14u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_LOW_LSB 14u
#define IO_BANK0_PROC1_INTF0_GPIO3_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_HIGH_BITS 0x00002000u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_HIGH_MSB 13u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_HIGH_LSB 13u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_LOW_BITS 0x00001000u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_LOW_MSB 12u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_LOW_LSB 12u
#define IO_BANK0_PROC1_INTF0_GPIO3_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_HIGH_BITS 0x00000800u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_HIGH_MSB 11u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_HIGH_LSB 11u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_LOW_BITS 0x00000400u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_LOW_MSB 10u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_LOW_LSB 10u
#define IO_BANK0_PROC1_INTF0_GPIO2_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_HIGH_BITS 0x00000200u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_HIGH_MSB 9u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_HIGH_LSB 9u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_LOW_BITS 0x00000100u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_LOW_MSB 8u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_LOW_LSB 8u
#define IO_BANK0_PROC1_INTF0_GPIO2_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_HIGH_BITS 0x00000080u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_HIGH_MSB 7u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_HIGH_LSB 7u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_LOW_BITS 0x00000040u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_LOW_MSB 6u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_LOW_LSB 6u
#define IO_BANK0_PROC1_INTF0_GPIO1_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_HIGH_BITS 0x00000020u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_HIGH_MSB 5u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_HIGH_LSB 5u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_LOW_BITS 0x00000010u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_LOW_MSB 4u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_LOW_LSB 4u
#define IO_BANK0_PROC1_INTF0_GPIO1_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_HIGH_BITS 0x00000008u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_HIGH_MSB 3u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_HIGH_LSB 3u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_LOW_BITS 0x00000004u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_LOW_MSB 2u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_LOW_LSB 2u
#define IO_BANK0_PROC1_INTF0_GPIO0_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_HIGH_BITS 0x00000002u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_HIGH_MSB 1u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_HIGH_LSB 1u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_LOW_BITS 0x00000001u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_LOW_MSB 0u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_LOW_LSB 0u
#define IO_BANK0_PROC1_INTF0_GPIO0_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_OFFSET 0x000002acu
#define IO_BANK0_PROC1_INTF1_BITS 0xffffffffu
#define IO_BANK0_PROC1_INTF1_RESET 0x00000000u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_HIGH_BITS 0x80000000u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_HIGH_MSB 31u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_HIGH_LSB 31u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_LOW_BITS 0x40000000u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_LOW_MSB 30u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_LOW_LSB 30u
#define IO_BANK0_PROC1_INTF1_GPIO15_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_HIGH_BITS 0x20000000u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_HIGH_MSB 29u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_HIGH_LSB 29u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_LOW_BITS 0x10000000u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_LOW_MSB 28u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_LOW_LSB 28u
#define IO_BANK0_PROC1_INTF1_GPIO15_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_HIGH_BITS 0x08000000u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_HIGH_MSB 27u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_HIGH_LSB 27u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_LOW_BITS 0x04000000u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_LOW_MSB 26u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_LOW_LSB 26u
#define IO_BANK0_PROC1_INTF1_GPIO14_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_HIGH_BITS 0x02000000u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_HIGH_MSB 25u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_HIGH_LSB 25u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_LOW_BITS 0x01000000u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_LOW_MSB 24u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_LOW_LSB 24u
#define IO_BANK0_PROC1_INTF1_GPIO14_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_HIGH_BITS 0x00800000u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_HIGH_MSB 23u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_HIGH_LSB 23u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_LOW_BITS 0x00400000u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_LOW_MSB 22u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_LOW_LSB 22u
#define IO_BANK0_PROC1_INTF1_GPIO13_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_HIGH_BITS 0x00200000u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_HIGH_MSB 21u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_HIGH_LSB 21u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_LOW_BITS 0x00100000u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_LOW_MSB 20u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_LOW_LSB 20u
#define IO_BANK0_PROC1_INTF1_GPIO13_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_HIGH_BITS 0x00080000u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_HIGH_MSB 19u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_HIGH_LSB 19u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_LOW_BITS 0x00040000u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_LOW_MSB 18u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_LOW_LSB 18u
#define IO_BANK0_PROC1_INTF1_GPIO12_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_HIGH_BITS 0x00020000u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_HIGH_MSB 17u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_HIGH_LSB 17u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_LOW_BITS 0x00010000u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_LOW_MSB 16u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_LOW_LSB 16u
#define IO_BANK0_PROC1_INTF1_GPIO12_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_HIGH_BITS 0x00008000u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_HIGH_MSB 15u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_HIGH_LSB 15u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_LOW_BITS 0x00004000u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_LOW_MSB 14u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_LOW_LSB 14u
#define IO_BANK0_PROC1_INTF1_GPIO11_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_HIGH_BITS 0x00002000u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_HIGH_MSB 13u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_HIGH_LSB 13u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_LOW_BITS 0x00001000u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_LOW_MSB 12u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_LOW_LSB 12u
#define IO_BANK0_PROC1_INTF1_GPIO11_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_HIGH_BITS 0x00000800u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_HIGH_MSB 11u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_HIGH_LSB 11u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_LOW_BITS 0x00000400u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_LOW_MSB 10u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_LOW_LSB 10u
#define IO_BANK0_PROC1_INTF1_GPIO10_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_HIGH_BITS 0x00000200u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_HIGH_MSB 9u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_HIGH_LSB 9u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_LOW_BITS 0x00000100u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_LOW_MSB 8u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_LOW_LSB 8u
#define IO_BANK0_PROC1_INTF1_GPIO10_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_HIGH_BITS 0x00000080u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_HIGH_MSB 7u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_HIGH_LSB 7u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_LOW_BITS 0x00000040u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_LOW_MSB 6u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_LOW_LSB 6u
#define IO_BANK0_PROC1_INTF1_GPIO9_EDGE_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_HIGH_BITS 0x00000020u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_HIGH_MSB 5u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_HIGH_LSB 5u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_HIGH_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_LOW_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_LOW_BITS 0x00000010u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_LOW_MSB 4u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_LOW_LSB 4u
#define IO_BANK0_PROC1_INTF1_GPIO9_LEVEL_LOW_ACCESS "RW"
#define IO_BANK0_PROC1_INTF1_GPIO8_EDGE_HIGH_RESET 0x0u
#define IO_BANK0_PROC1_INTF1_GPIO8_EDGE_HIGH_BITS 0x00000008u
