gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define M33_ID_AFR0_IMPDEF1_BITS 0x000000f0u
#define M33_ID_AFR0_IMPDEF1_MSB 7u
#define M33_ID_AFR0_IMPDEF1_LSB 4u
#define M33_ID_AFR0_IMPDEF1_ACCESS "RO"
#define M33_ID_AFR0_IMPDEF0_RESET 0x0u
#define M33_ID_AFR0_IMPDEF0_BITS 0x0000000fu
#define M33_ID_AFR0_IMPDEF0_MSB 3u
#define M33_ID_AFR0_IMPDEF0_LSB 0u
#define M33_ID_AFR0_IMPDEF0_ACCESS "RO"
#define M33_ID_MMFR0_OFFSET 0x0000ed50u
#define M33_ID_MMFR0_BITS 0x00fffff0u
#define M33_ID_MMFR0_RESET 0x00101f40u
#define M33_ID_MMFR0_AUXREG_RESET 0x1u
#define M33_ID_MMFR0_AUXREG_BITS 0x00f00000u
#define M33_ID_MMFR0_AUXREG_MSB 23u
#define M33_ID_MMFR0_AUXREG_LSB 20u
#define M33_ID_MMFR0_AUXREG_ACCESS "RO"
#define M33_ID_MMFR0_TCM_RESET 0x0u
#define M33_ID_MMFR0_TCM_BITS 0x000f0000u
#define M33_ID_MMFR0_TCM_MSB 19u
#define M33_ID_MMFR0_TCM_LSB 16u
#define M33_ID_MMFR0_TCM_ACCESS "RO"
#define M33_ID_MMFR0_SHARELVL_RESET 0x1u
#define M33_ID_MMFR0_SHARELVL_BITS 0x0000f000u
#define M33_ID_MMFR0_SHARELVL_MSB 15u
#define M33_ID_MMFR0_SHARELVL_LSB 12u
#define M33_ID_MMFR0_SHARELVL_ACCESS "RO"
#define M33_ID_MMFR0_OUTERSHR_RESET 0xfu
#define M33_ID_MMFR0_OUTERSHR_BITS 0x00000f00u
#define M33_ID_MMFR0_OUTERSHR_MSB 11u
#define M33_ID_MMFR0_OUTERSHR_LSB 8u
#define M33_ID_MMFR0_OUTERSHR_ACCESS "RO"
#define M33_ID_MMFR0_PMSA_RESET 0x4u
#define M33_ID_MMFR0_PMSA_BITS 0x000000f0u
#define M33_ID_MMFR0_PMSA_MSB 7u
#define M33_ID_MMFR0_PMSA_LSB 4u
#define M33_ID_MMFR0_PMSA_ACCESS "RO"
#define M33_ID_MMFR1_OFFSET 0x0000ed54u
#define M33_ID_MMFR1_BITS 0x00000000u
#define M33_ID_MMFR1_RESET 0x00000000u
#define M33_ID_MMFR1_MSB 31u
#define M33_ID_MMFR1_LSB 0u
#define M33_ID_MMFR1_ACCESS "RW"
#define M33_ID_MMFR2_OFFSET 0x0000ed58u
#define M33_ID_MMFR2_BITS 0x0f000000u
#define M33_ID_MMFR2_RESET 0x01000000u
#define M33_ID_MMFR2_WFISTALL_RESET 0x1u
#define M33_ID_MMFR2_WFISTALL_BITS 0x0f000000u
#define M33_ID_MMFR2_WFISTALL_MSB 27u
#define M33_ID_MMFR2_WFISTALL_LSB 24u
#define M33_ID_MMFR2_WFISTALL_ACCESS "RO"
#define M33_ID_MMFR3_OFFSET 0x0000ed5cu
#define M33_ID_MMFR3_BITS 0x00000fffu
#define M33_ID_MMFR3_RESET 0x00000000u
#define M33_ID_MMFR3_BPMAINT_RESET 0x0u
#define M33_ID_MMFR3_BPMAINT_BITS 0x00000f00u
#define M33_ID_MMFR3_BPMAINT_MSB 11u
#define M33_ID_MMFR3_BPMAINT_LSB 8u
#define M33_ID_MMFR3_BPMAINT_ACCESS "RO"
#define M33_ID_MMFR3_CMAINTSW_RESET 0x0u
#define M33_ID_MMFR3_CMAINTSW_BITS 0x000000f0u
#define M33_ID_MMFR3_CMAINTSW_MSB 7u
#define M33_ID_MMFR3_CMAINTSW_LSB 4u
#define M33_ID_MMFR3_CMAINTSW_ACCESS "RO"
#define M33_ID_MMFR3_CMAINTVA_RESET 0x0u
#define M33_ID_MMFR3_CMAINTVA_BITS 0x0000000fu
#define M33_ID_MMFR3_CMAINTVA_MSB 3u
#define M33_ID_MMFR3_CMAINTVA_LSB 0u
#define M33_ID_MMFR3_CMAINTVA_ACCESS "RO"
#define M33_ID_ISAR0_OFFSET 0x0000ed60u
#define M33_ID_ISAR0_BITS 0x0ffffff0u
#define M33_ID_ISAR0_RESET 0x08092300u
#define M33_ID_ISAR0_DIVIDE_RESET 0x8u
#define M33_ID_ISAR0_DIVIDE_BITS 0x0f000000u
#define M33_ID_ISAR0_DIVIDE_MSB 27u
#define M33_ID_ISAR0_DIVIDE_LSB 24u
#define M33_ID_ISAR0_DIVIDE_ACCESS "RO"
#define M33_ID_ISAR0_DEBUG_RESET 0x0u
#define M33_ID_ISAR0_DEBUG_BITS 0x00f00000u
#define M33_ID_ISAR0_DEBUG_MSB 23u
#define M33_ID_ISAR0_DEBUG_LSB 20u
#define M33_ID_ISAR0_DEBUG_ACCESS "RO"
#define M33_ID_ISAR0_COPROC_RESET 0x9u
#define M33_ID_ISAR0_COPROC_BITS 0x000f0000u
#define M33_ID_ISAR0_COPROC_MSB 19u
#define M33_ID_ISAR0_COPROC_LSB 16u
#define M33_ID_ISAR0_COPROC_ACCESS "RO"
#define M33_ID_ISAR0_CMPBRANCH_RESET 0x2u
#define M33_ID_ISAR0_CMPBRANCH_BITS 0x0000f000u
#define M33_ID_ISAR0_CMPBRANCH_MSB 15u
#define M33_ID_ISAR0_CMPBRANCH_LSB 12u
#define M33_ID_ISAR0_CMPBRANCH_ACCESS "RO"
#define M33_ID_ISAR0_BITFIELD_RESET 0x3u
#define M33_ID_ISAR0_BITFIELD_BITS 0x00000f00u
#define M33_ID_ISAR0_BITFIELD_MSB 11u
#define M33_ID_ISAR0_BITFIELD_LSB 8u
#define M33_ID_ISAR0_BITFIELD_ACCESS "RO"
#define M33_ID_ISAR0_BITCOUNT_RESET 0x0u
#define M33_ID_ISAR0_BITCOUNT_BITS 0x000000f0u
#define M33_ID_ISAR0_BITCOUNT_MSB 7u
#define M33_ID_ISAR0_BITCOUNT_LSB 4u
#define M33_ID_ISAR0_BITCOUNT_ACCESS "RO"
#define M33_ID_ISAR1_OFFSET 0x0000ed64u
#define M33_ID_ISAR1_BITS 0x0ffff000u
#define M33_ID_ISAR1_RESET 0x05725000u
#define M33_ID_ISAR1_INTERWORK_RESET 0x5u
#define M33_ID_ISAR1_INTERWORK_BITS 0x0f000000u
#define M33_ID_ISAR1_INTERWORK_MSB 27u
#define M33_ID_ISAR1_INTERWORK_LSB 24u
#define M33_ID_ISAR1_INTERWORK_ACCESS "RO"
#define M33_ID_ISAR1_IMMEDIATE_RESET 0x7u
#define M33_ID_ISAR1_IMMEDIATE_BITS 0x00f00000u
#define M33_ID_ISAR1_IMMEDIATE_MSB 23u
#define M33_ID_ISAR1_IMMEDIATE_LSB 20u
#define M33_ID_ISAR1_IMMEDIATE_ACCESS "RO"
#define M33_ID_ISAR1_IFTHEN_RESET 0x2u
#define M33_ID_ISAR1_IFTHEN_BITS 0x000f0000u
#define M33_ID_ISAR1_IFTHEN_MSB 19u
#define M33_ID_ISAR1_IFTHEN_LSB 16u
#define M33_ID_ISAR1_IFTHEN_ACCESS "RO"
#define M33_ID_ISAR1_EXTEND_RESET 0x5u
#define M33_ID_ISAR1_EXTEND_BITS 0x0000f000u
#define M33_ID_ISAR1_EXTEND_MSB 15u
#define M33_ID_ISAR1_EXTEND_LSB 12u
#define M33_ID_ISAR1_EXTEND_ACCESS "RO"
#define M33_ID_ISAR2_OFFSET 0x0000ed68u
#define M33_ID_ISAR2_BITS 0xf0ffffffu
#define M33_ID_ISAR2_RESET 0x30173426u
#define M33_ID_ISAR2_REVERSAL_RESET 0x3u
#define M33_ID_ISAR2_REVERSAL_BITS 0xf0000000u
#define M33_ID_ISAR2_REVERSAL_MSB 31u
#define M33_ID_ISAR2_REVERSAL_LSB 28u
#define M33_ID_ISAR2_REVERSAL_ACCESS "RO"
#define M33_ID_ISAR2_MULTU_RESET 0x1u
#define M33_ID_ISAR2_MULTU_BITS 0x00f00000u
#define M33_ID_ISAR2_MULTU_MSB 23u
#define M33_ID_ISAR2_MULTU_LSB 20u
#define M33_ID_ISAR2_MULTU_ACCESS "RO"
#define M33_ID_ISAR2_MULTS_RESET 0x7u
#define M33_ID_ISAR2_MULTS_BITS 0x000f0000u
#define M33_ID_ISAR2_MULTS_MSB 19u
#define M33_ID_ISAR2_MULTS_LSB 16u
#define M33_ID_ISAR2_MULTS_ACCESS "RO"
#define M33_ID_ISAR2_MULT_RESET 0x3u
#define M33_ID_ISAR2_MULT_BITS 0x0000f000u
#define M33_ID_ISAR2_MULT_MSB 15u
#define M33_ID_ISAR2_MULT_LSB 12u
#define M33_ID_ISAR2_MULT_ACCESS "RO"
#define M33_ID_ISAR2_MULTIACCESSINT_RESET 0x4u
#define M33_ID_ISAR2_MULTIACCESSINT_BITS 0x00000f00u
#define M33_ID_ISAR2_MULTIACCESSINT_MSB 11u
#define M33_ID_ISAR2_MULTIACCESSINT_LSB 8u
#define M33_ID_ISAR2_MULTIACCESSINT_ACCESS "RO"
#define M33_ID_ISAR2_MEMHINT_RESET 0x2u
#define M33_ID_ISAR2_MEMHINT_BITS 0x000000f0u
#define M33_ID_ISAR2_MEMHINT_MSB 7u
#define M33_ID_ISAR2_MEMHINT_LSB 4u
#define M33_ID_ISAR2_MEMHINT_ACCESS "RO"
#define M33_ID_ISAR2_LOADSTORE_RESET 0x6u
#define M33_ID_ISAR2_LOADSTORE_BITS 0x0000000fu
#define M33_ID_ISAR2_LOADSTORE_MSB 3u
#define M33_ID_ISAR2_LOADSTORE_LSB 0u
#define M33_ID_ISAR2_LOADSTORE_ACCESS "RO"
#define M33_ID_ISAR3_OFFSET 0x0000ed6cu
#define M33_ID_ISAR3_BITS 0x0fffffffu
#define M33_ID_ISAR3_RESET 0x07895729u
#define M33_ID_ISAR3_TRUENOP_RESET 0x7u
#define M33_ID_ISAR3_TRUENOP_BITS 0x0f000000u
#define M33_ID_ISAR3_TRUENOP_MSB 27u
#define M33_ID_ISAR3_TRUENOP_LSB 24u
#define M33_ID_ISAR3_TRUENOP_ACCESS "RO"
#define M33_ID_ISAR3_T32COPY_RESET 0x8u
#define M33_ID_ISAR3_T32COPY_BITS 0x00f00000u
#define M33_ID_ISAR3_T32COPY_MSB 23u
#define M33_ID_ISAR3_T32COPY_LSB 20u
#define M33_ID_ISAR3_T32COPY_ACCESS "RO"
#define M33_ID_ISAR3_TABBRANCH_RESET 0x9u
#define M33_ID_ISAR3_TABBRANCH_BITS 0x000f0000u
#define M33_ID_ISAR3_TABBRANCH_MSB 19u
#define M33_ID_ISAR3_TABBRANCH_LSB 16u
#define M33_ID_ISAR3_TABBRANCH_ACCESS "RO"
#define M33_ID_ISAR3_SYNCHPRIM_RESET 0x5u
#define M33_ID_ISAR3_SYNCHPRIM_BITS 0x0000f000u
#define M33_ID_ISAR3_SYNCHPRIM_MSB 15u
#define M33_ID_ISAR3_SYNCHPRIM_LSB 12u
#define M33_ID_ISAR3_SYNCHPRIM_ACCESS "RO"
#define M33_ID_ISAR3_SVC_RESET 0x7u
#define M33_ID_ISAR3_SVC_BITS 0x00000f00u
#define M33_ID_ISAR3_SVC_MSB 11u
#define M33_ID_ISAR3_SVC_LSB 8u
#define M33_ID_ISAR3_SVC_ACCESS "RO"
#define M33_ID_ISAR3_SIMD_RESET 0x2u
#define M33_ID_ISAR3_SIMD_BITS 0x000000f0u
#define M33_ID_ISAR3_SIMD_MSB 7u
#define M33_ID_ISAR3_SIMD_LSB 4u
#define M33_ID_ISAR3_SIMD_ACCESS "RO"
#define M33_ID_ISAR3_SATURATE_RESET 0x9u
#define M33_ID_ISAR3_SATURATE_BITS 0x0000000fu
#define M33_ID_ISAR3_SATURATE_MSB 3u
#define M33_ID_ISAR3_SATURATE_LSB 0u
#define M33_ID_ISAR3_SATURATE_ACCESS "RO"
#define M33_ID_ISAR4_OFFSET 0x0000ed70u
#define M33_ID_ISAR4_BITS 0x0fff0fffu
#define M33_ID_ISAR4_RESET 0x01310132u
#define M33_ID_ISAR4_PSR_M_RESET 0x1u
#define M33_ID_ISAR4_PSR_M_BITS 0x0f000000u
#define M33_ID_ISAR4_PSR_M_MSB 27u
#define M33_ID_ISAR4_PSR_M_LSB 24u
#define M33_ID_ISAR4_PSR_M_ACCESS "RO"
#define M33_ID_ISAR4_SYNCPRIM_FRAC_RESET 0x3u
#define M33_ID_ISAR4_SYNCPRIM_FRAC_BITS 0x00f00000u
#define M33_ID_ISAR4_SYNCPRIM_FRAC_MSB 23u
#define M33_ID_ISAR4_SYNCPRIM_FRAC_LSB 20u
#define M33_ID_ISAR4_SYNCPRIM_FRAC_ACCESS "RO"
#define M33_ID_ISAR4_BARRIER_RESET 0x1u
#define M33_ID_ISAR4_BARRIER_BITS 0x000f0000u
#define M33_ID_ISAR4_BARRIER_MSB 19u
#define M33_ID_ISAR4_BARRIER_LSB 16u
#define M33_ID_ISAR4_BARRIER_ACCESS "RO"
#define M33_ID_ISAR4_WRITEBACK_RESET 0x1u
#define M33_ID_ISAR4_WRITEBACK_BITS 0x00000f00u
#define M33_ID_ISAR4_WRITEBACK_MSB 11u
#define M33_ID_ISAR4_WRITEBACK_LSB 8u
#define M33_ID_ISAR4_WRITEBACK_ACCESS "RO"
#define M33_ID_ISAR4_WITHSHIFTS_RESET 0x3u
#define M33_ID_ISAR4_WITHSHIFTS_BITS 0x000000f0u
#define M33_ID_ISAR4_WITHSHIFTS_MSB 7u
#define M33_ID_ISAR4_WITHSHIFTS_LSB 4u
#define M33_ID_ISAR4_WITHSHIFTS_ACCESS "RO"
#define M33_ID_ISAR4_UNPRIV_RESET 0x2u
#define M33_ID_ISAR4_UNPRIV_BITS 0x0000000fu
#define M33_ID_ISAR4_UNPRIV_MSB 3u
#define M33_ID_ISAR4_UNPRIV_LSB 0u
#define M33_ID_ISAR4_UNPRIV_ACCESS "RO"
#define M33_ID_ISAR5_OFFSET 0x0000ed74u
#define M33_ID_ISAR5_BITS 0x00000000u
#define M33_ID_ISAR5_RESET 0x00000000u
#define M33_ID_ISAR5_MSB 31u
#define M33_ID_ISAR5_LSB 0u
#define M33_ID_ISAR5_ACCESS "RW"
#define M33_CTR_OFFSET 0x0000ed7cu
#define M33_CTR_BITS 0x8fffc00fu
#define M33_CTR_RESET 0x8000c000u
#define M33_CTR_RES1_RESET 0x1u
#define M33_CTR_RES1_BITS 0x80000000u
#define M33_CTR_RES1_MSB 31u
#define M33_CTR_RES1_LSB 31u
#define M33_CTR_RES1_ACCESS "RO"
#define M33_CTR_CWG_RESET 0x0u
#define M33_CTR_CWG_BITS 0x0f000000u
#define M33_CTR_CWG_MSB 27u
#define M33_CTR_CWG_LSB 24u
#define M33_CTR_CWG_ACCESS "RO"
#define M33_CTR_ERG_RESET 0x0u
#define M33_CTR_ERG_BITS 0x00f00000u
#define M33_CTR_ERG_MSB 23u
#define M33_CTR_ERG_LSB 20u
#define M33_CTR_ERG_ACCESS "RO"
#define M33_CTR_DMINLINE_RESET 0x0u
#define M33_CTR_DMINLINE_BITS 0x000f0000u
#define M33_CTR_DMINLINE_MSB 19u
#define M33_CTR_DMINLINE_LSB 16u
#define M33_CTR_DMINLINE_ACCESS "RO"
#define M33_CTR_RES1_1_RESET 0x3u
#define M33_CTR_RES1_1_BITS 0x0000c000u
#define M33_CTR_RES1_1_MSB 15u
#define M33_CTR_RES1_1_LSB 14u
#define M33_CTR_RES1_1_ACCESS "RO"
#define M33_CTR_IMINLINE_RESET 0x0u
#define M33_CTR_IMINLINE_BITS 0x0000000fu
#define M33_CTR_IMINLINE_MSB 3u
#define M33_CTR_IMINLINE_LSB 0u
#define M33_CTR_IMINLINE_ACCESS "RO"
#define M33_CPACR_OFFSET 0x0000ed88u
#define M33_CPACR_BITS 0x00f0ffffu
#define M33_CPACR_RESET 0x00000000u
#define M33_CPACR_CP11_RESET 0x0u
#define M33_CPACR_CP11_BITS 0x00c00000u
#define M33_CPACR_CP11_MSB 23u
#define M33_CPACR_CP11_LSB 22u
#define M33_CPACR_CP11_ACCESS "RW"
#define M33_CPACR_CP10_RESET 0x0u
#define M33_CPACR_CP10_BITS 0x00300000u
#define M33_CPACR_CP10_MSB 21u
#define M33_CPACR_CP10_LSB 20u
#define M33_CPACR_CP10_ACCESS "RW"
#define M33_CPACR_CP7_RESET 0x0u
#define M33_CPACR_CP7_BITS 0x0000c000u
#define M33_CPACR_CP7_MSB 15u
#define M33_CPACR_CP7_LSB 14u
#define M33_CPACR_CP7_ACCESS "RW"
#define M33_CPACR_CP6_RESET 0x0u
#define M33_CPACR_CP6_BITS 0x00003000u
#define M33_CPACR_CP6_MSB 13u
#define M33_CPACR_CP6_LSB 12u
#define M33_CPACR_CP6_ACCESS "RW"
#define M33_CPACR_CP5_RESET 0x0u
#define M33_CPACR_CP5_BITS 0x00000c00u
#define M33_CPACR_CP5_MSB 11u
#define M33_CPACR_CP5_LSB 10u
#define M33_CPACR_CP5_ACCESS "RW"
#define M33_CPACR_CP4_RESET 0x0u
#define M33_CPACR_CP4_BITS 0x00000300u
#define M33_CPACR_CP4_MSB 9u
#define M33_CPACR_CP4_LSB 8u
#define M33_CPACR_CP4_ACCESS "RW"
#define M33_CPACR_CP3_RESET 0x0u
#define M33_CPACR_CP3_BITS 0x000000c0u
#define M33_CPACR_CP3_MSB 7u
#define M33_CPACR_CP3_LSB 6u
#define M33_CPACR_CP3_ACCESS "RW"
#define M33_CPACR_CP2_RESET 0x0u
#define M33_CPACR_CP2_BITS 0x00000030u
#define M33_CPACR_CP2_MSB 5u
#define M33_CPACR_CP2_LSB 4u
#define M33_CPACR_CP2_ACCESS "RW"
#define M33_CPACR_CP1_RESET 0x0u
#define M33_CPACR_CP1_BITS 0x0000000cu
#define M33_CPACR_CP1_MSB 3u
#define M33_CPACR_CP1_LSB 2u
#define M33_CPACR_CP1_ACCESS "RW"
#define M33_CPACR_CP0_RESET 0x0u
#define M33_CPACR_CP0_BITS 0x00000003u
#define M33_CPACR_CP0_MSB 1u
#define M33_CPACR_CP0_LSB 0u
#define M33_CPACR_CP0_ACCESS "RW"
#define M33_NSACR_OFFSET 0x0000ed8cu
#define M33_NSACR_BITS 0x00000cffu
#define M33_NSACR_RESET 0x00000000u
#define M33_NSACR_CP11_RESET 0x0u
#define M33_NSACR_CP11_BITS 0x00000800u
#define M33_NSACR_CP11_MSB 11u
#define M33_NSACR_CP11_LSB 11u
#define M33_NSACR_CP11_ACCESS "RW"
#define M33_NSACR_CP10_RESET 0x0u
#define M33_NSACR_CP10_BITS 0x00000400u
#define M33_NSACR_CP10_MSB 10u
#define M33_NSACR_CP10_LSB 10u
#define M33_NSACR_CP10_ACCESS "RW"
#define M33_NSACR_CP7_RESET 0x0u
#define M33_NSACR_CP7_BITS 0x00000080u
#define M33_NSACR_CP7_MSB 7u
#define M33_NSACR_CP7_LSB 7u
#define M33_NSACR_CP7_ACCESS "RW"
#define M33_NSACR_CP6_RESET 0x0u
#define M33_NSACR_CP6_BITS 0x00000040u
#define M33_NSACR_CP6_MSB 6u
#define M33_NSACR_CP6_LSB 6u
#define M33_NSACR_CP6_ACCESS "RW"
#define M33_NSACR_CP5_RESET 0x0u
#define M33_NSACR_CP5_BITS 0x00000020u
#define M33_NSACR_CP5_MSB 5u
#define M33_NSACR_CP5_LSB 5u
#define M33_NSACR_CP5_ACCESS "RW"
#define M33_NSACR_CP4_RESET 0x0u
#define M33_NSACR_CP4_BITS 0x00000010u
#define M33_NSACR_CP4_MSB 4u
#define M33_NSACR_CP4_LSB 4u
#define M33_NSACR_CP4_ACCESS "RW"
#define M33_NSACR_CP3_RESET 0x0u
#define M33_NSACR_CP3_BITS 0x00000008u
#define M33_NSACR_CP3_MSB 3u
#define M33_NSACR_CP3_LSB 3u
#define M33_NSACR_CP3_ACCESS "RW"
#define M33_NSACR_CP2_RESET 0x0u
#define M33_NSACR_CP2_BITS 0x00000004u
#define M33_NSACR_CP2_MSB 2u
#define M33_NSACR_CP2_LSB 2u
#define M33_NSACR_CP2_ACCESS "RW"
#define M33_NSACR_CP1_RESET 0x0u
#define M33_NSACR_CP1_BITS 0x00000002u
#define M33_NSACR_CP1_MSB 1u
#define M33_NSACR_CP1_LSB 1u
#define M33_NSACR_CP1_ACCESS "RW"
#define M33_NSACR_CP0_RESET 0x0u
#define M33_NSACR_CP0_BITS 0x00000001u
#define M33_NSACR_CP0_MSB 0u
#define M33_NSACR_CP0_LSB 0u
#define M33_NSACR_CP0_ACCESS "RW"
#define M33_MPU_TYPE_OFFSET 0x0000ed90u
#define M33_MPU_TYPE_BITS 0x0000ff01u
#define M33_MPU_TYPE_RESET 0x00000800u
#define M33_MPU_TYPE_DREGION_RESET 0x08u
#define M33_MPU_TYPE_DREGION_BITS 0x0000ff00u
#define M33_MPU_TYPE_DREGION_MSB 15u
#define M33_MPU_TYPE_DREGION_LSB 8u
#define M33_MPU_TYPE_DREGION_ACCESS "RO"
#define M33_MPU_TYPE_SEPARATE_RESET 0x0u
#define M33_MPU_TYPE_SEPARATE_BITS 0x00000001u
#define M33_MPU_TYPE_SEPARATE_MSB 0u
#define M33_MPU_TYPE_SEPARATE_LSB 0u
#define M33_MPU_TYPE_SEPARATE_ACCESS "RO"
#define M33_MPU_CTRL_OFFSET 0x0000ed94u
#define M33_MPU_CTRL_BITS 0x00000007u
#define M33_MPU_CTRL_RESET 0x00000000u
#define M33_MPU_CTRL_PRIVDEFENA_RESET 0x0u
#define M33_MPU_CTRL_PRIVDEFENA_BITS 0x00000004u
#define M33_MPU_CTRL_PRIVDEFENA_MSB 2u
#define M33_MPU_CTRL_PRIVDEFENA_LSB 2u
#define M33_MPU_CTRL_PRIVDEFENA_ACCESS "RW"
#define M33_MPU_CTRL_HFNMIENA_RESET 0x0u
#define M33_MPU_CTRL_HFNMIENA_BITS 0x00000002u
#define M33_MPU_CTRL_HFNMIENA_MSB 1u
#define M33_MPU_CTRL_HFNMIENA_LSB 1u
#define M33_MPU_CTRL_HFNMIENA_ACCESS "RW"
#define M33_MPU_CTRL_ENABLE_RESET 0x0u
#define M33_MPU_CTRL_ENABLE_BITS 0x00000001u
#define M33_MPU_CTRL_ENABLE_MSB 0u
#define M33_MPU_CTRL_ENABLE_LSB 0u
#define M33_MPU_CTRL_ENABLE_ACCESS "RW"
#define M33_MPU_RNR_OFFSET 0x0000ed98u
#define M33_MPU_RNR_BITS 0x00000007u
#define M33_MPU_RNR_RESET 0x00000000u
#define M33_MPU_RNR_REGION_RESET 0x0u
#define M33_MPU_RNR_REGION_BITS 0x00000007u
#define M33_MPU_RNR_REGION_MSB 2u
#define M33_MPU_RNR_REGION_LSB 0u
#define M33_MPU_RNR_REGION_ACCESS "RW"
#define M33_MPU_RBAR_OFFSET 0x0000ed9cu
#define M33_MPU_RBAR_BITS 0xffffffffu
#define M33_MPU_RBAR_RESET 0x00000000u
#define M33_MPU_RBAR_BASE_RESET 0x0000000u
#define M33_MPU_RBAR_BASE_BITS 0xffffffe0u
#define M33_MPU_RBAR_BASE_MSB 31u
#define M33_MPU_RBAR_BASE_LSB 5u
#define M33_MPU_RBAR_BASE_ACCESS "RW"
#define M33_MPU_RBAR_SH_RESET 0x0u
#define M33_MPU_RBAR_SH_BITS 0x00000018u
#define M33_MPU_RBAR_SH_MSB 4u
#define M33_MPU_RBAR_SH_LSB 3u
#define M33_MPU_RBAR_SH_ACCESS "RW"
#define M33_MPU_RBAR_AP_RESET 0x0u
#define M33_MPU_RBAR_AP_BITS 0x00000006u
#define M33_MPU_RBAR_AP_MSB 2u
#define M33_MPU_RBAR_AP_LSB 1u
#define M33_MPU_RBAR_AP_ACCESS "RW"
#define M33_MPU_RBAR_XN_RESET 0x0u
#define M33_MPU_RBAR_XN_BITS 0x00000001u
#define M33_MPU_RBAR_XN_MSB 0u
#define M33_MPU_RBAR_XN_LSB 0u
#define M33_MPU_RBAR_XN_ACCESS "RW"
#define M33_MPU_RLAR_OFFSET 0x0000eda0u
#define M33_MPU_RLAR_BITS 0xffffffefu
#define M33_MPU_RLAR_RESET 0x00000000u
#define M33_MPU_RLAR_LIMIT_RESET 0x0000000u
#define M33_MPU_RLAR_LIMIT_BITS 0xffffffe0u
#define M33_MPU_RLAR_LIMIT_MSB 31u
#define M33_MPU_RLAR_LIMIT_LSB 5u
#define M33_MPU_RLAR_LIMIT_ACCESS "RW"
#define M33_MPU_RLAR_ATTRINDX_RESET 0x0u
#define M33_MPU_RLAR_ATTRINDX_BITS 0x0000000eu
#define M33_MPU_RLAR_ATTRINDX_MSB 3u
#define M33_MPU_RLAR_ATTRINDX_LSB 1u
#define M33_MPU_RLAR_ATTRINDX_ACCESS "RW"
#define M33_MPU_RLAR_EN_RESET 0x0u
#define M33_MPU_RLAR_EN_BITS 0x00000001u
#define M33_MPU_RLAR_EN_MSB 0u
#define M33_MPU_RLAR_EN_LSB 0u
#define M33_MPU_RLAR_EN_ACCESS "RW"
#define M33_MPU_RBAR_A1_OFFSET 0x0000eda4u
#define M33_MPU_RBAR_A1_BITS 0xffffffffu
#define M33_MPU_RBAR_A1_RESET 0x00000000u
#define M33_MPU_RBAR_A1_BASE_RESET 0x0000000u
#define M33_MPU_RBAR_A1_BASE_BITS 0xffffffe0u
#define M33_MPU_RBAR_A1_BASE_MSB 31u
#define M33_MPU_RBAR_A1_BASE_LSB 5u
#define M33_MPU_RBAR_A1_BASE_ACCESS "RW"
#define M33_MPU_RBAR_A1_SH_RESET 0x0u
#define M33_MPU_RBAR_A1_SH_BITS 0x00000018u
#define M33_MPU_RBAR_A1_SH_MSB 4u
#define M33_MPU_RBAR_A1_SH_LSB 3u
#define M33_MPU_RBAR_A1_SH_ACCESS "RW"
#define M33_MPU_RBAR_A1_AP_RESET 0x0u
#define M33_MPU_RBAR_A1_AP_BITS 0x00000006u
#define M33_MPU_RBAR_A1_AP_MSB 2u
#define M33_MPU_RBAR_A1_AP_LSB 1u
#define M33_MPU_RBAR_A1_AP_ACCESS "RW"
#define M33_MPU_RBAR_A1_XN_RESET 0x0u
#define M33_MPU_RBAR_A1_XN_BITS 0x00000001u
#define M33_MPU_RBAR_A1_XN_MSB 0u
#define M33_MPU_RBAR_A1_XN_LSB 0u
#define M33_MPU_RBAR_A1_XN_ACCESS "RW"
#define M33_MPU_RLAR_A1_OFFSET 0x0000eda8u
#define M33_MPU_RLAR_A1_BITS 0xffffffefu
#define M33_MPU_RLAR_A1_RESET 0x00000000u
#define M33_MPU_RLAR_A1_LIMIT_RESET 0x0000000u
#define M33_MPU_RLAR_A1_LIMIT_BITS 0xffffffe0u
#define M33_MPU_RLAR_A1_LIMIT_MSB 31u
#define M33_MPU_RLAR_A1_LIMIT_LSB 5u
#define M33_MPU_RLAR_A1_LIMIT_ACCESS "RW"
#define M33_MPU_RLAR_A1_ATTRINDX_RESET 0x0u
#define M33_MPU_RLAR_A1_ATTRINDX_BITS 0x0000000eu
#define M33_MPU_RLAR_A1_ATTRINDX_MSB 3u
#define M33_MPU_RLAR_A1_ATTRINDX_LSB 1u
#define M33_MPU_RLAR_A1_ATTRINDX_ACCESS "RW"
#define M33_MPU_RLAR_A1_EN_RESET 0x0u
#define M33_MPU_RLAR_A1_EN_BITS 0x00000001u
#define M33_MPU_RLAR_A1_EN_MSB 0u
#define M33_MPU_RLAR_A1_EN_LSB 0u
#define M33_MPU_RLAR_A1_EN_ACCESS "RW"
#define M33_MPU_RBAR_A2_OFFSET 0x0000edacu
#define M33_MPU_RBAR_A2_BITS 0xffffffffu
#define M33_MPU_RBAR_A2_RESET 0x00000000u
#define M33_MPU_RBAR_A2_BASE_RESET 0x0000000u
#define M33_MPU_RBAR_A2_BASE_BITS 0xffffffe0u
#define M33_MPU_RBAR_A2_BASE_MSB 31u
#define M33_MPU_RBAR_A2_BASE_LSB 5u
#define M33_MPU_RBAR_A2_BASE_ACCESS "RW"
#define M33_MPU_RBAR_A2_SH_RESET 0x0u
#define M33_MPU_RBAR_A2_SH_BITS 0x00000018u
#define M33_MPU_RBAR_A2_SH_MSB 4u
#define M33_MPU_RBAR_A2_SH_LSB 3u
#define M33_MPU_RBAR_A2_SH_ACCESS "RW"
#define M33_MPU_RBAR_A2_AP_RESET 0x0u
#define M33_MPU_RBAR_A2_AP_BITS 0x00000006u
#define M33_MPU_RBAR_A2_AP_MSB 2u
#define M33_MPU_RBAR_A2_AP_LSB 1u
#define M33_MPU_RBAR_A2_AP_ACCESS "RW"
#define M33_MPU_RBAR_A2_XN_RESET 0x0u
#define M33_MPU_RBAR_A2_XN_BITS 0x00000001u
#define M33_MPU_RBAR_A2_XN_MSB 0u
#define M33_MPU_RBAR_A2_XN_LSB 0u
#define M33_MPU_RBAR_A2_XN_ACCESS "RW"
#define M33_MPU_RLAR_A2_OFFSET 0x0000edb0u
#define M33_MPU_RLAR_A2_BITS 0xffffffefu
#define M33_MPU_RLAR_A2_RESET 0x00000000u
#define M33_MPU_RLAR_A2_LIMIT_RESET 0x0000000u
#define M33_MPU_RLAR_A2_LIMIT_BITS 0xffffffe0u
#define M33_MPU_RLAR_A2_LIMIT_MSB 31u
#define M33_MPU_RLAR_A2_LIMIT_LSB 5u
#define M33_MPU_RLAR_A2_LIMIT_ACCESS "RW"
#define M33_MPU_RLAR_A2_ATTRINDX_RESET 0x0u
#define M33_MPU_RLAR_A2_ATTRINDX_BITS 0x0000000eu
#define M33_MPU_RLAR_A2_ATTRINDX_MSB 3u
#define M33_MPU_RLAR_A2_ATTRINDX_LSB 1u
#define M33_MPU_RLAR_A2_ATTRINDX_ACCESS "RW"
#define M33_MPU_RLAR_A2_EN_RESET 0x0u
#define M33_MPU_RLAR_A2_EN_BITS 0x00000001u
#define M33_MPU_RLAR_A2_EN_MSB 0u
#define M33_MPU_RLAR_A2_EN_LSB 0u
#define M33_MPU_RLAR_A2_EN_ACCESS "RW"
#define M33_MPU_RBAR_A3_OFFSET 0x0000edb4u
#define M33_MPU_RBAR_A3_BITS 0xffffffffu
#define M33_MPU_RBAR_A3_RESET 0x00000000u
#define M33_MPU_RBAR_A3_BASE_RESET 0x0000000u
#define M33_MPU_RBAR_A3_BASE_BITS 0xffffffe0u
#define M33_MPU_RBAR_A3_BASE_MSB 31u
#define M33_MPU_RBAR_A3_BASE_LSB 5u
#define M33_MPU_RBAR_A3_BASE_ACCESS "RW"
#define M33_MPU_RBAR_A3_SH_RESET 0x0u
#define M33_MPU_RBAR_A3_SH_BITS 0x00000018u
#define M33_MPU_RBAR_A3_SH_MSB 4u
#define M33_MPU_RBAR_A3_SH_LSB 3u
#define M33_MPU_RBAR_A3_SH_ACCESS "RW"
#define M33_MPU_RBAR_A3_AP_RESET 0x0u
#define M33_MPU_RBAR_A3_AP_BITS 0x00000006u
#define M33_MPU_RBAR_A3_AP_MSB 2u
#define M33_MPU_RBAR_A3_AP_LSB 1u
#define M33_MPU_RBAR_A3_AP_ACCESS "RW"
#define M33_MPU_RBAR_A3_XN_RESET 0x0u
#define M33_MPU_RBAR_A3_XN_BITS 0x00000001u
#define M33_MPU_RBAR_A3_XN_MSB 0u
#define M33_MPU_RBAR_A3_XN_LSB 0u
#define M33_MPU_RBAR_A3_XN_ACCESS "RW"
#define M33_MPU_RLAR_A3_OFFSET 0x0000edb8u
#define M33_MPU_RLAR_A3_BITS 0xffffffefu
#define M33_MPU_RLAR_A3_RESET 0x00000000u
#define M33_MPU_RLAR_A3_LIMIT_RESET 0x0000000u
#define M33_MPU_RLAR_A3_LIMIT_BITS 0xffffffe0u
#define M33_MPU_RLAR_A3_LIMIT_MSB 31u
#define M33_MPU_RLAR_A3_LIMIT_LSB 5u
#define M33_MPU_RLAR_A3_LIMIT_ACCESS "RW"
#define M33_MPU_RLAR_A3_ATTRINDX_RESET 0x0u
#define M33_MPU_RLAR_A3_ATTRINDX_BITS 0x0000000eu
#define M33_MPU_RLAR_A3_ATTRINDX_MSB 3u
#define M33_MPU_RLAR_A3_ATTRINDX_LSB 1u
#define M33_MPU_RLAR_A3_ATTRINDX_ACCESS "RW"
#define M33_MPU_RLAR_A3_EN_RESET 0x0u
#define M33_MPU_RLAR_A3_EN_BITS 0x00000001u
#define M33_MPU_RLAR_A3_EN_MSB 0u
#define M33_MPU_RLAR_A3_EN_LSB 0u
#define M33_MPU_RLAR_A3_EN_ACCESS "RW"
#define M33_MPU_MAIR0_OFFSET 0x0000edc0u
#define M33_MPU_MAIR0_BITS 0xffffffffu
#define M33_MPU_MAIR0_RESET 0x00000000u
#define M33_MPU_MAIR0_ATTR3_RESET 0x00u
#define M33_MPU_MAIR0_ATTR3_BITS 0xff000000u
#define M33_MPU_MAIR0_ATTR3_MSB 31u
#define M33_MPU_MAIR0_ATTR3_LSB 24u
#define M33_MPU_MAIR0_ATTR3_ACCESS "RW"
#define M33_MPU_MAIR0_ATTR2_RESET 0x00u
#define M33_MPU_MAIR0_ATTR2_BITS 0x00ff0000u
#define M33_MPU_MAIR0_ATTR2_MSB 23u
#define M33_MPU_MAIR0_ATTR2_LSB 16u
#define M33_MPU_MAIR0_ATTR2_ACCESS "RW"
#define M33_MPU_MAIR0_ATTR1_RESET 0x00u
#define M33_MPU_MAIR0_ATTR1_BITS 0x0000ff00u
#define M33_MPU_MAIR0_ATTR1_MSB 15u
#define M33_MPU_MAIR0_ATTR1_LSB 8u
#define M33_MPU_MAIR0_ATTR1_ACCESS "RW"
#define M33_MPU_MAIR0_ATTR0_RESET 0x00u
#define M33_MPU_MAIR0_ATTR0_BITS 0x000000ffu
#define M33_MPU_MAIR0_ATTR0_MSB 7u
#define M33_MPU_MAIR0_ATTR0_LSB 0u
#define M33_MPU_MAIR0_ATTR0_ACCESS "RW"
#define M33_MPU_MAIR1_OFFSET 0x0000edc4u
#define M33_MPU_MAIR1_BITS 0xffffffffu
#define M33_MPU_MAIR1_RESET 0x00000000u
#define M33_MPU_MAIR1_ATTR7_RESET 0x00u
#define M33_MPU_MAIR1_ATTR7_BITS 0xff000000u
#define M33_MPU_MAIR1_ATTR7_MSB 31u
#define M33_MPU_MAIR1_ATTR7_LSB 24u
#define M33_MPU_MAIR1_ATTR7_ACCESS "RW"
#define M33_MPU_MAIR1_ATTR6_RESET 0x00u
#define M33_MPU_MAIR1_ATTR6_BITS 0x00ff0000u
#define M33_MPU_MAIR1_ATTR6_MSB 23u
#define M33_MPU_MAIR1_ATTR6_LSB 16u
#define M33_MPU_MAIR1_ATTR6_ACCESS "RW"
#define M33_MPU_MAIR1_ATTR5_RESET 0x00u
#define M33_MPU_MAIR1_ATTR5_BITS 0x0000ff00u
#define M33_MPU_MAIR1_ATTR5_MSB 15u
#define M33_MPU_MAIR1_ATTR5_LSB 8u
#define M33_MPU_MAIR1_ATTR5_ACCESS "RW"
#define M33_MPU_MAIR1_ATTR4_RESET 0x00u
#define M33_MPU_MAIR1_ATTR4_BITS 0x000000ffu
#define M33_MPU_MAIR1_ATTR4_MSB 7u
#define M33_MPU_MAIR1_ATTR4_LSB 0u
