gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define M33_TRCSSPCICR_PC_MSB 3u
#define M33_TRCSSPCICR_PC_LSB 0u
#define M33_TRCSSPCICR_PC_ACCESS "RW"
#define M33_TRCPDCR_OFFSET 0x00041310u
#define M33_TRCPDCR_BITS 0x00000008u
#define M33_TRCPDCR_RESET 0x00000000u
#define M33_TRCPDCR_PU_RESET 0x0u
#define M33_TRCPDCR_PU_BITS 0x00000008u
#define M33_TRCPDCR_PU_MSB 3u
#define M33_TRCPDCR_PU_LSB 3u
#define M33_TRCPDCR_PU_ACCESS "RW"
#define M33_TRCPDSR_OFFSET 0x00041314u
#define M33_TRCPDSR_BITS 0x00000023u
#define M33_TRCPDSR_RESET 0x00000003u
#define M33_TRCPDSR_OSLK_RESET 0x0u
#define M33_TRCPDSR_OSLK_BITS 0x00000020u
#define M33_TRCPDSR_OSLK_MSB 5u
#define M33_TRCPDSR_OSLK_LSB 5u
#define M33_TRCPDSR_OSLK_ACCESS "RO"
#define M33_TRCPDSR_STICKYPD_RESET 0x1u
#define M33_TRCPDSR_STICKYPD_BITS 0x00000002u
#define M33_TRCPDSR_STICKYPD_MSB 1u
#define M33_TRCPDSR_STICKYPD_LSB 1u
#define M33_TRCPDSR_STICKYPD_ACCESS "RO"
#define M33_TRCPDSR_POWER_RESET 0x1u
#define M33_TRCPDSR_POWER_BITS 0x00000001u
#define M33_TRCPDSR_POWER_MSB 0u
#define M33_TRCPDSR_POWER_LSB 0u
#define M33_TRCPDSR_POWER_ACCESS "RO"
#define M33_TRCITATBIDR_OFFSET 0x00041ee4u
#define M33_TRCITATBIDR_BITS 0x0000007fu
#define M33_TRCITATBIDR_RESET 0x00000000u
#define M33_TRCITATBIDR_ID_RESET 0x00u
#define M33_TRCITATBIDR_ID_BITS 0x0000007fu
#define M33_TRCITATBIDR_ID_MSB 6u
#define M33_TRCITATBIDR_ID_LSB 0u
#define M33_TRCITATBIDR_ID_ACCESS "RW"
#define M33_TRCITIATBINR_OFFSET 0x00041ef4u
#define M33_TRCITIATBINR_BITS 0x00000003u
#define M33_TRCITIATBINR_RESET 0x00000000u
#define M33_TRCITIATBINR_AFVALIDM_RESET 0x0u
#define M33_TRCITIATBINR_AFVALIDM_BITS 0x00000002u
#define M33_TRCITIATBINR_AFVALIDM_MSB 1u
#define M33_TRCITIATBINR_AFVALIDM_LSB 1u
#define M33_TRCITIATBINR_AFVALIDM_ACCESS "RW"
#define M33_TRCITIATBINR_ATREADYM_RESET 0x0u
#define M33_TRCITIATBINR_ATREADYM_BITS 0x00000001u
#define M33_TRCITIATBINR_ATREADYM_MSB 0u
#define M33_TRCITIATBINR_ATREADYM_LSB 0u
#define M33_TRCITIATBINR_ATREADYM_ACCESS "RW"
#define M33_TRCITIATBOUTR_OFFSET 0x00041efcu
#define M33_TRCITIATBOUTR_BITS 0x00000003u
#define M33_TRCITIATBOUTR_RESET 0x00000000u
#define M33_TRCITIATBOUTR_AFREADY_RESET 0x0u
#define M33_TRCITIATBOUTR_AFREADY_BITS 0x00000002u
#define M33_TRCITIATBOUTR_AFREADY_MSB 1u
#define M33_TRCITIATBOUTR_AFREADY_LSB 1u
#define M33_TRCITIATBOUTR_AFREADY_ACCESS "RW"
#define M33_TRCITIATBOUTR_ATVALID_RESET 0x0u
#define M33_TRCITIATBOUTR_ATVALID_BITS 0x00000001u
#define M33_TRCITIATBOUTR_ATVALID_MSB 0u
#define M33_TRCITIATBOUTR_ATVALID_LSB 0u
#define M33_TRCITIATBOUTR_ATVALID_ACCESS "RW"
#define M33_TRCCLAIMSET_OFFSET 0x00041fa0u
#define M33_TRCCLAIMSET_BITS 0x0000000fu
#define M33_TRCCLAIMSET_RESET 0x0000000fu
#define M33_TRCCLAIMSET_SET3_RESET 0x1u
#define M33_TRCCLAIMSET_SET3_BITS 0x00000008u
#define M33_TRCCLAIMSET_SET3_MSB 3u
#define M33_TRCCLAIMSET_SET3_LSB 3u
#define M33_TRCCLAIMSET_SET3_ACCESS "RW"
#define M33_TRCCLAIMSET_SET2_RESET 0x1u
#define M33_TRCCLAIMSET_SET2_BITS 0x00000004u
#define M33_TRCCLAIMSET_SET2_MSB 2u
#define M33_TRCCLAIMSET_SET2_LSB 2u
#define M33_TRCCLAIMSET_SET2_ACCESS "RW"
#define M33_TRCCLAIMSET_SET1_RESET 0x1u
#define M33_TRCCLAIMSET_SET1_BITS 0x00000002u
#define M33_TRCCLAIMSET_SET1_MSB 1u
#define M33_TRCCLAIMSET_SET1_LSB 1u
#define M33_TRCCLAIMSET_SET1_ACCESS "RW"
#define M33_TRCCLAIMSET_SET0_RESET 0x1u
#define M33_TRCCLAIMSET_SET0_BITS 0x00000001u
#define M33_TRCCLAIMSET_SET0_MSB 0u
#define M33_TRCCLAIMSET_SET0_LSB 0u
#define M33_TRCCLAIMSET_SET0_ACCESS "RW"
#define M33_TRCCLAIMCLR_OFFSET 0x00041fa4u
#define M33_TRCCLAIMCLR_BITS 0x0000000fu
#define M33_TRCCLAIMCLR_RESET 0x00000000u
#define M33_TRCCLAIMCLR_CLR3_RESET 0x0u
#define M33_TRCCLAIMCLR_CLR3_BITS 0x00000008u
#define M33_TRCCLAIMCLR_CLR3_MSB 3u
#define M33_TRCCLAIMCLR_CLR3_LSB 3u
#define M33_TRCCLAIMCLR_CLR3_ACCESS "RW"
#define M33_TRCCLAIMCLR_CLR2_RESET 0x0u
#define M33_TRCCLAIMCLR_CLR2_BITS 0x00000004u
#define M33_TRCCLAIMCLR_CLR2_MSB 2u
#define M33_TRCCLAIMCLR_CLR2_LSB 2u
#define M33_TRCCLAIMCLR_CLR2_ACCESS "RW"
#define M33_TRCCLAIMCLR_CLR1_RESET 0x0u
#define M33_TRCCLAIMCLR_CLR1_BITS 0x00000002u
#define M33_TRCCLAIMCLR_CLR1_MSB 1u
#define M33_TRCCLAIMCLR_CLR1_LSB 1u
#define M33_TRCCLAIMCLR_CLR1_ACCESS "RW"
#define M33_TRCCLAIMCLR_CLR0_RESET 0x0u
#define M33_TRCCLAIMCLR_CLR0_BITS 0x00000001u
#define M33_TRCCLAIMCLR_CLR0_MSB 0u
#define M33_TRCCLAIMCLR_CLR0_LSB 0u
#define M33_TRCCLAIMCLR_CLR0_ACCESS "RW"
#define M33_TRCAUTHSTATUS_OFFSET 0x00041fb8u
#define M33_TRCAUTHSTATUS_BITS 0x000000ffu
#define M33_TRCAUTHSTATUS_RESET 0x00000000u
#define M33_TRCAUTHSTATUS_SNID_RESET 0x0u
#define M33_TRCAUTHSTATUS_SNID_BITS 0x000000c0u
#define M33_TRCAUTHSTATUS_SNID_MSB 7u
#define M33_TRCAUTHSTATUS_SNID_LSB 6u
#define M33_TRCAUTHSTATUS_SNID_ACCESS "RO"
#define M33_TRCAUTHSTATUS_SID_RESET 0x0u
#define M33_TRCAUTHSTATUS_SID_BITS 0x00000030u
#define M33_TRCAUTHSTATUS_SID_MSB 5u
#define M33_TRCAUTHSTATUS_SID_LSB 4u
#define M33_TRCAUTHSTATUS_SID_ACCESS "RO"
#define M33_TRCAUTHSTATUS_NSNID_RESET 0x0u
#define M33_TRCAUTHSTATUS_NSNID_BITS 0x0000000cu
#define M33_TRCAUTHSTATUS_NSNID_MSB 3u
#define M33_TRCAUTHSTATUS_NSNID_LSB 2u
#define M33_TRCAUTHSTATUS_NSNID_ACCESS "RO"
#define M33_TRCAUTHSTATUS_NSID_RESET 0x0u
#define M33_TRCAUTHSTATUS_NSID_BITS 0x00000003u
#define M33_TRCAUTHSTATUS_NSID_MSB 1u
#define M33_TRCAUTHSTATUS_NSID_LSB 0u
#define M33_TRCAUTHSTATUS_NSID_ACCESS "RO"
#define M33_TRCDEVARCH_OFFSET 0x00041fbcu
#define M33_TRCDEVARCH_BITS 0xffffffffu
#define M33_TRCDEVARCH_RESET 0x47724a13u
#define M33_TRCDEVARCH_ARCHITECT_RESET 0x23bu
#define M33_TRCDEVARCH_ARCHITECT_BITS 0xffe00000u
#define M33_TRCDEVARCH_ARCHITECT_MSB 31u
#define M33_TRCDEVARCH_ARCHITECT_LSB 21u
#define M33_TRCDEVARCH_ARCHITECT_ACCESS "RO"
#define M33_TRCDEVARCH_PRESENT_RESET 0x1u
#define M33_TRCDEVARCH_PRESENT_BITS 0x00100000u
#define M33_TRCDEVARCH_PRESENT_MSB 20u
#define M33_TRCDEVARCH_PRESENT_LSB 20u
#define M33_TRCDEVARCH_PRESENT_ACCESS "RO"
#define M33_TRCDEVARCH_REVISION_RESET 0x2u
#define M33_TRCDEVARCH_REVISION_BITS 0x000f0000u
#define M33_TRCDEVARCH_REVISION_MSB 19u
#define M33_TRCDEVARCH_REVISION_LSB 16u
#define M33_TRCDEVARCH_REVISION_ACCESS "RO"
#define M33_TRCDEVARCH_ARCHID_RESET 0x4a13u
#define M33_TRCDEVARCH_ARCHID_BITS 0x0000ffffu
#define M33_TRCDEVARCH_ARCHID_MSB 15u
#define M33_TRCDEVARCH_ARCHID_LSB 0u
#define M33_TRCDEVARCH_ARCHID_ACCESS "RO"
#define M33_TRCDEVID_OFFSET 0x00041fc8u
#define M33_TRCDEVID_BITS 0x00000000u
#define M33_TRCDEVID_RESET 0x00000000u
#define M33_TRCDEVID_MSB 31u
#define M33_TRCDEVID_LSB 0u
#define M33_TRCDEVID_ACCESS "RW"
#define M33_TRCDEVTYPE_OFFSET 0x00041fccu
#define M33_TRCDEVTYPE_BITS 0x000000ffu
#define M33_TRCDEVTYPE_RESET 0x00000013u
#define M33_TRCDEVTYPE_SUB_RESET 0x1u
#define M33_TRCDEVTYPE_SUB_BITS 0x000000f0u
#define M33_TRCDEVTYPE_SUB_MSB 7u
#define M33_TRCDEVTYPE_SUB_LSB 4u
#define M33_TRCDEVTYPE_SUB_ACCESS "RO"
#define M33_TRCDEVTYPE_MAJOR_RESET 0x3u
#define M33_TRCDEVTYPE_MAJOR_BITS 0x0000000fu
#define M33_TRCDEVTYPE_MAJOR_MSB 3u
#define M33_TRCDEVTYPE_MAJOR_LSB 0u
#define M33_TRCDEVTYPE_MAJOR_ACCESS "RO"
#define M33_TRCPIDR4_OFFSET 0x00041fd0u
#define M33_TRCPIDR4_BITS 0x000000ffu
#define M33_TRCPIDR4_RESET 0x00000004u
#define M33_TRCPIDR4_SIZE_RESET 0x0u
#define M33_TRCPIDR4_SIZE_BITS 0x000000f0u
#define M33_TRCPIDR4_SIZE_MSB 7u
#define M33_TRCPIDR4_SIZE_LSB 4u
#define M33_TRCPIDR4_SIZE_ACCESS "RO"
#define M33_TRCPIDR4_DES_2_RESET 0x4u
#define M33_TRCPIDR4_DES_2_BITS 0x0000000fu
#define M33_TRCPIDR4_DES_2_MSB 3u
#define M33_TRCPIDR4_DES_2_LSB 0u
#define M33_TRCPIDR4_DES_2_ACCESS "RO"
#define M33_TRCPIDR5_OFFSET 0x00041fd4u
#define M33_TRCPIDR5_BITS 0x00000000u
#define M33_TRCPIDR5_RESET 0x00000000u
#define M33_TRCPIDR5_MSB 31u
#define M33_TRCPIDR5_LSB 0u
#define M33_TRCPIDR5_ACCESS "RW"
#define M33_TRCPIDR6_OFFSET 0x00041fd8u
#define M33_TRCPIDR6_BITS 0x00000000u
#define M33_TRCPIDR6_RESET 0x00000000u
#define M33_TRCPIDR6_MSB 31u
#define M33_TRCPIDR6_LSB 0u
#define M33_TRCPIDR6_ACCESS "RW"
#define M33_TRCPIDR7_OFFSET 0x00041fdcu
#define M33_TRCPIDR7_BITS 0x00000000u
#define M33_TRCPIDR7_RESET 0x00000000u
#define M33_TRCPIDR7_MSB 31u
#define M33_TRCPIDR7_LSB 0u
#define M33_TRCPIDR7_ACCESS "RW"
#define M33_TRCPIDR0_OFFSET 0x00041fe0u
#define M33_TRCPIDR0_BITS 0x000000ffu
#define M33_TRCPIDR0_RESET 0x00000021u
#define M33_TRCPIDR0_PART_0_RESET 0x21u
#define M33_TRCPIDR0_PART_0_BITS 0x000000ffu
#define M33_TRCPIDR0_PART_0_MSB 7u
#define M33_TRCPIDR0_PART_0_LSB 0u
#define M33_TRCPIDR0_PART_0_ACCESS "RO"
#define M33_TRCPIDR1_OFFSET 0x00041fe4u
#define M33_TRCPIDR1_BITS 0x000000ffu
#define M33_TRCPIDR1_RESET 0x000000bdu
#define M33_TRCPIDR1_DES_0_RESET 0xbu
#define M33_TRCPIDR1_DES_0_BITS 0x000000f0u
#define M33_TRCPIDR1_DES_0_MSB 7u
#define M33_TRCPIDR1_DES_0_LSB 4u
#define M33_TRCPIDR1_DES_0_ACCESS "RO"
#define M33_TRCPIDR1_PART_0_RESET 0xdu
#define M33_TRCPIDR1_PART_0_BITS 0x0000000fu
#define M33_TRCPIDR1_PART_0_MSB 3u
#define M33_TRCPIDR1_PART_0_LSB 0u
#define M33_TRCPIDR1_PART_0_ACCESS "RO"
#define M33_TRCPIDR2_OFFSET 0x00041fe8u
#define M33_TRCPIDR2_BITS 0x000000ffu
#define M33_TRCPIDR2_RESET 0x0000002bu
#define M33_TRCPIDR2_REVISION_RESET 0x2u
#define M33_TRCPIDR2_REVISION_BITS 0x000000f0u
#define M33_TRCPIDR2_REVISION_MSB 7u
#define M33_TRCPIDR2_REVISION_LSB 4u
#define M33_TRCPIDR2_REVISION_ACCESS "RO"
#define M33_TRCPIDR2_JEDEC_RESET 0x1u
#define M33_TRCPIDR2_JEDEC_BITS 0x00000008u
#define M33_TRCPIDR2_JEDEC_MSB 3u
#define M33_TRCPIDR2_JEDEC_LSB 3u
#define M33_TRCPIDR2_JEDEC_ACCESS "RO"
#define M33_TRCPIDR2_DES_0_RESET 0x3u
#define M33_TRCPIDR2_DES_0_BITS 0x00000007u
#define M33_TRCPIDR2_DES_0_MSB 2u
#define M33_TRCPIDR2_DES_0_LSB 0u
#define M33_TRCPIDR2_DES_0_ACCESS "RO"
#define M33_TRCPIDR3_OFFSET 0x00041fecu
#define M33_TRCPIDR3_BITS 0x000000ffu
#define M33_TRCPIDR3_RESET 0x00000000u
#define M33_TRCPIDR3_REVAND_RESET 0x0u
#define M33_TRCPIDR3_REVAND_BITS 0x000000f0u
#define M33_TRCPIDR3_REVAND_MSB 7u
#define M33_TRCPIDR3_REVAND_LSB 4u
#define M33_TRCPIDR3_REVAND_ACCESS "RO"
#define M33_TRCPIDR3_CMOD_RESET 0x0u
#define M33_TRCPIDR3_CMOD_BITS 0x0000000fu
#define M33_TRCPIDR3_CMOD_MSB 3u
#define M33_TRCPIDR3_CMOD_LSB 0u
#define M33_TRCPIDR3_CMOD_ACCESS "RO"
#define M33_TRCCIDR0_OFFSET 0x00041ff0u
#define M33_TRCCIDR0_BITS 0x000000ffu
#define M33_TRCCIDR0_RESET 0x0000000du
#define M33_TRCCIDR0_PRMBL_0_RESET 0x0du
#define M33_TRCCIDR0_PRMBL_0_BITS 0x000000ffu
#define M33_TRCCIDR0_PRMBL_0_MSB 7u
#define M33_TRCCIDR0_PRMBL_0_LSB 0u
#define M33_TRCCIDR0_PRMBL_0_ACCESS "RO"
#define M33_TRCCIDR1_OFFSET 0x00041ff4u
#define M33_TRCCIDR1_BITS 0x000000ffu
#define M33_TRCCIDR1_RESET 0x00000090u
#define M33_TRCCIDR1_CLASS_RESET 0x9u
#define M33_TRCCIDR1_CLASS_BITS 0x000000f0u
#define M33_TRCCIDR1_CLASS_MSB 7u
#define M33_TRCCIDR1_CLASS_LSB 4u
#define M33_TRCCIDR1_CLASS_ACCESS "RO"
#define M33_TRCCIDR1_PRMBL_1_RESET 0x0u
#define M33_TRCCIDR1_PRMBL_1_BITS 0x0000000fu
#define M33_TRCCIDR1_PRMBL_1_MSB 3u
#define M33_TRCCIDR1_PRMBL_1_LSB 0u
#define M33_TRCCIDR1_PRMBL_1_ACCESS "RO"
#define M33_TRCCIDR2_OFFSET 0x00041ff8u
#define M33_TRCCIDR2_BITS 0x000000ffu
#define M33_TRCCIDR2_RESET 0x00000005u
#define M33_TRCCIDR2_PRMBL_2_RESET 0x05u
#define M33_TRCCIDR2_PRMBL_2_BITS 0x000000ffu
#define M33_TRCCIDR2_PRMBL_2_MSB 7u
#define M33_TRCCIDR2_PRMBL_2_LSB 0u
#define M33_TRCCIDR2_PRMBL_2_ACCESS "RO"
#define M33_TRCCIDR3_OFFSET 0x00041ffcu
#define M33_TRCCIDR3_BITS 0x000000ffu
#define M33_TRCCIDR3_RESET 0x000000b1u
#define M33_TRCCIDR3_PRMBL_3_RESET 0xb1u
#define M33_TRCCIDR3_PRMBL_3_BITS 0x000000ffu
#define M33_TRCCIDR3_PRMBL_3_MSB 7u
#define M33_TRCCIDR3_PRMBL_3_LSB 0u
#define M33_TRCCIDR3_PRMBL_3_ACCESS "RO"
#define M33_CTICONTROL_OFFSET 0x00042000u
#define M33_CTICONTROL_BITS 0x00000001u
#define M33_CTICONTROL_RESET 0x00000000u
#define M33_CTICONTROL_GLBEN_RESET 0x0u
#define M33_CTICONTROL_GLBEN_BITS 0x00000001u
#define M33_CTICONTROL_GLBEN_MSB 0u
#define M33_CTICONTROL_GLBEN_LSB 0u
#define M33_CTICONTROL_GLBEN_ACCESS "RW"
#define M33_CTIINTACK_OFFSET 0x00042010u
#define M33_CTIINTACK_BITS 0x000000ffu
#define M33_CTIINTACK_RESET 0x00000000u
#define M33_CTIINTACK_INTACK_RESET 0x00u
#define M33_CTIINTACK_INTACK_BITS 0x000000ffu
#define M33_CTIINTACK_INTACK_MSB 7u
#define M33_CTIINTACK_INTACK_LSB 0u
#define M33_CTIINTACK_INTACK_ACCESS "RW"
#define M33_CTIAPPSET_OFFSET 0x00042014u
#define M33_CTIAPPSET_BITS 0x0000000fu
#define M33_CTIAPPSET_RESET 0x00000000u
#define M33_CTIAPPSET_APPSET_RESET 0x0u
#define M33_CTIAPPSET_APPSET_BITS 0x0000000fu
#define M33_CTIAPPSET_APPSET_MSB 3u
#define M33_CTIAPPSET_APPSET_LSB 0u
#define M33_CTIAPPSET_APPSET_ACCESS "RW"
#define M33_CTIAPPCLEAR_OFFSET 0x00042018u
#define M33_CTIAPPCLEAR_BITS 0x0000000fu
#define M33_CTIAPPCLEAR_RESET 0x00000000u
#define M33_CTIAPPCLEAR_APPCLEAR_RESET 0x0u
#define M33_CTIAPPCLEAR_APPCLEAR_BITS 0x0000000fu
#define M33_CTIAPPCLEAR_APPCLEAR_MSB 3u
#define M33_CTIAPPCLEAR_APPCLEAR_LSB 0u
#define M33_CTIAPPCLEAR_APPCLEAR_ACCESS "RW"
#define M33_CTIAPPPULSE_OFFSET 0x0004201cu
#define M33_CTIAPPPULSE_BITS 0x0000000fu
#define M33_CTIAPPPULSE_RESET 0x00000000u
#define M33_CTIAPPPULSE_APPULSE_RESET 0x0u
#define M33_CTIAPPPULSE_APPULSE_BITS 0x0000000fu
#define M33_CTIAPPPULSE_APPULSE_MSB 3u
#define M33_CTIAPPPULSE_APPULSE_LSB 0u
#define M33_CTIAPPPULSE_APPULSE_ACCESS "RW"
#define M33_CTIINEN0_OFFSET 0x00042020u
#define M33_CTIINEN0_BITS 0x0000000fu
#define M33_CTIINEN0_RESET 0x00000000u
#define M33_CTIINEN0_TRIGINEN_RESET 0x0u
#define M33_CTIINEN0_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN0_TRIGINEN_MSB 3u
#define M33_CTIINEN0_TRIGINEN_LSB 0u
#define M33_CTIINEN0_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN1_OFFSET 0x00042024u
#define M33_CTIINEN1_BITS 0x0000000fu
#define M33_CTIINEN1_RESET 0x00000000u
#define M33_CTIINEN1_TRIGINEN_RESET 0x0u
#define M33_CTIINEN1_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN1_TRIGINEN_MSB 3u
#define M33_CTIINEN1_TRIGINEN_LSB 0u
#define M33_CTIINEN1_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN2_OFFSET 0x00042028u
#define M33_CTIINEN2_BITS 0x0000000fu
#define M33_CTIINEN2_RESET 0x00000000u
#define M33_CTIINEN2_TRIGINEN_RESET 0x0u
#define M33_CTIINEN2_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN2_TRIGINEN_MSB 3u
#define M33_CTIINEN2_TRIGINEN_LSB 0u
#define M33_CTIINEN2_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN3_OFFSET 0x0004202cu
#define M33_CTIINEN3_BITS 0x0000000fu
#define M33_CTIINEN3_RESET 0x00000000u
#define M33_CTIINEN3_TRIGINEN_RESET 0x0u
#define M33_CTIINEN3_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN3_TRIGINEN_MSB 3u
#define M33_CTIINEN3_TRIGINEN_LSB 0u
#define M33_CTIINEN3_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN4_OFFSET 0x00042030u
#define M33_CTIINEN4_BITS 0x0000000fu
#define M33_CTIINEN4_RESET 0x00000000u
#define M33_CTIINEN4_TRIGINEN_RESET 0x0u
#define M33_CTIINEN4_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN4_TRIGINEN_MSB 3u
#define M33_CTIINEN4_TRIGINEN_LSB 0u
#define M33_CTIINEN4_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN5_OFFSET 0x00042034u
#define M33_CTIINEN5_BITS 0x0000000fu
#define M33_CTIINEN5_RESET 0x00000000u
#define M33_CTIINEN5_TRIGINEN_RESET 0x0u
#define M33_CTIINEN5_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN5_TRIGINEN_MSB 3u
#define M33_CTIINEN5_TRIGINEN_LSB 0u
#define M33_CTIINEN5_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN6_OFFSET 0x00042038u
#define M33_CTIINEN6_BITS 0x0000000fu
#define M33_CTIINEN6_RESET 0x00000000u
#define M33_CTIINEN6_TRIGINEN_RESET 0x0u
#define M33_CTIINEN6_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN6_TRIGINEN_MSB 3u
#define M33_CTIINEN6_TRIGINEN_LSB 0u
#define M33_CTIINEN6_TRIGINEN_ACCESS "RW"
#define M33_CTIINEN7_OFFSET 0x0004203cu
#define M33_CTIINEN7_BITS 0x0000000fu
#define M33_CTIINEN7_RESET 0x00000000u
#define M33_CTIINEN7_TRIGINEN_RESET 0x0u
#define M33_CTIINEN7_TRIGINEN_BITS 0x0000000fu
#define M33_CTIINEN7_TRIGINEN_MSB 3u
#define M33_CTIINEN7_TRIGINEN_LSB 0u
#define M33_CTIINEN7_TRIGINEN_ACCESS "RW"
#define M33_CTIOUTEN0_OFFSET 0x000420a0u
#define M33_CTIOUTEN0_BITS 0x0000000fu
#define M33_CTIOUTEN0_RESET 0x00000000u
#define M33_CTIOUTEN0_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN0_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN0_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN0_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN0_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN1_OFFSET 0x000420a4u
#define M33_CTIOUTEN1_BITS 0x0000000fu
#define M33_CTIOUTEN1_RESET 0x00000000u
#define M33_CTIOUTEN1_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN1_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN1_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN1_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN1_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN2_OFFSET 0x000420a8u
#define M33_CTIOUTEN2_BITS 0x0000000fu
#define M33_CTIOUTEN2_RESET 0x00000000u
#define M33_CTIOUTEN2_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN2_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN2_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN2_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN2_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN3_OFFSET 0x000420acu
#define M33_CTIOUTEN3_BITS 0x0000000fu
#define M33_CTIOUTEN3_RESET 0x00000000u
#define M33_CTIOUTEN3_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN3_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN3_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN3_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN3_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN4_OFFSET 0x000420b0u
#define M33_CTIOUTEN4_BITS 0x0000000fu
#define M33_CTIOUTEN4_RESET 0x00000000u
#define M33_CTIOUTEN4_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN4_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN4_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN4_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN4_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN5_OFFSET 0x000420b4u
#define M33_CTIOUTEN5_BITS 0x0000000fu
#define M33_CTIOUTEN5_RESET 0x00000000u
#define M33_CTIOUTEN5_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN5_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN5_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN5_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN5_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN6_OFFSET 0x000420b8u
#define M33_CTIOUTEN6_BITS 0x0000000fu
#define M33_CTIOUTEN6_RESET 0x00000000u
#define M33_CTIOUTEN6_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN6_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN6_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN6_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN6_TRIGOUTEN_ACCESS "RW"
#define M33_CTIOUTEN7_OFFSET 0x000420bcu
#define M33_CTIOUTEN7_BITS 0x0000000fu
#define M33_CTIOUTEN7_RESET 0x00000000u
#define M33_CTIOUTEN7_TRIGOUTEN_RESET 0x0u
#define M33_CTIOUTEN7_TRIGOUTEN_BITS 0x0000000fu
#define M33_CTIOUTEN7_TRIGOUTEN_MSB 3u
#define M33_CTIOUTEN7_TRIGOUTEN_LSB 0u
#define M33_CTIOUTEN7_TRIGOUTEN_ACCESS "RW"
#define M33_CTITRIGINSTATUS_OFFSET 0x00042130u
#define M33_CTITRIGINSTATUS_BITS 0x000000ffu
#define M33_CTITRIGINSTATUS_RESET 0x00000000u
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_RESET 0x00u
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_BITS 0x000000ffu
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_MSB 7u
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_LSB 0u
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_ACCESS "RO"
#define M33_CTITRIGOUTSTATUS_OFFSET 0x00042134u
#define M33_CTITRIGOUTSTATUS_BITS 0x000000ffu
#define M33_CTITRIGOUTSTATUS_RESET 0x00000000u
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_RESET 0x00u
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_BITS 0x000000ffu
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_MSB 7u
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_LSB 0u
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_ACCESS "RO"
#define M33_CTICHINSTATUS_OFFSET 0x00042138u
#define M33_CTICHINSTATUS_BITS 0x0000000fu
#define M33_CTICHINSTATUS_RESET 0x00000000u
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_RESET 0x0u
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_BITS 0x0000000fu
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_MSB 3u
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_LSB 0u
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_ACCESS "RO"
#define M33_CTIGATE_OFFSET 0x00042140u
#define M33_CTIGATE_BITS 0x0000000fu
#define M33_CTIGATE_RESET 0x0000000fu
#define M33_CTIGATE_CTIGATEEN3_RESET 0x1u
#define M33_CTIGATE_CTIGATEEN3_BITS 0x00000008u
#define M33_CTIGATE_CTIGATEEN3_MSB 3u
#define M33_CTIGATE_CTIGATEEN3_LSB 3u
#define M33_CTIGATE_CTIGATEEN3_ACCESS "RW"
#define M33_CTIGATE_CTIGATEEN2_RESET 0x1u
#define M33_CTIGATE_CTIGATEEN2_BITS 0x00000004u
#define M33_CTIGATE_CTIGATEEN2_MSB 2u
#define M33_CTIGATE_CTIGATEEN2_LSB 2u
#define M33_CTIGATE_CTIGATEEN2_ACCESS "RW"
#define M33_CTIGATE_CTIGATEEN1_RESET 0x1u
#define M33_CTIGATE_CTIGATEEN1_BITS 0x00000002u
#define M33_CTIGATE_CTIGATEEN1_MSB 1u
#define M33_CTIGATE_CTIGATEEN1_LSB 1u
#define M33_CTIGATE_CTIGATEEN1_ACCESS "RW"
#define M33_CTIGATE_CTIGATEEN0_RESET 0x1u
#define M33_CTIGATE_CTIGATEEN0_BITS 0x00000001u
#define M33_CTIGATE_CTIGATEEN0_MSB 0u
#define M33_CTIGATE_CTIGATEEN0_LSB 0u
#define M33_CTIGATE_CTIGATEEN0_ACCESS "RW"
#define M33_ASICCTL_OFFSET 0x00042144u
#define M33_ASICCTL_BITS 0x00000000u
#define M33_ASICCTL_RESET 0x00000000u
#define M33_ASICCTL_MSB 31u
#define M33_ASICCTL_LSB 0u
#define M33_ASICCTL_ACCESS "RW"
#define M33_ITCHOUT_OFFSET 0x00042ee4u
#define M33_ITCHOUT_BITS 0x0000000fu
#define M33_ITCHOUT_RESET 0x00000000u
#define M33_ITCHOUT_CTCHOUT_RESET 0x0u
#define M33_ITCHOUT_CTCHOUT_BITS 0x0000000fu
#define M33_ITCHOUT_CTCHOUT_MSB 3u
#define M33_ITCHOUT_CTCHOUT_LSB 0u
#define M33_ITCHOUT_CTCHOUT_ACCESS "RW"
#define M33_ITTRIGOUT_OFFSET 0x00042ee8u
#define M33_ITTRIGOUT_BITS 0x000000ffu
#define M33_ITTRIGOUT_RESET 0x00000000u
#define M33_ITTRIGOUT_CTTRIGOUT_RESET 0x00u
#define M33_ITTRIGOUT_CTTRIGOUT_BITS 0x000000ffu
#define M33_ITTRIGOUT_CTTRIGOUT_MSB 7u
#define M33_ITTRIGOUT_CTTRIGOUT_LSB 0u
#define M33_ITTRIGOUT_CTTRIGOUT_ACCESS "RW"
#define M33_ITCHIN_OFFSET 0x00042ef4u
#define M33_ITCHIN_BITS 0x0000000fu
#define M33_ITCHIN_RESET 0x00000000u
#define M33_ITCHIN_CTCHIN_RESET 0x0u
#define M33_ITCHIN_CTCHIN_BITS 0x0000000fu
#define M33_ITCHIN_CTCHIN_MSB 3u
#define M33_ITCHIN_CTCHIN_LSB 0u
#define M33_ITCHIN_CTCHIN_ACCESS "RO"
#define M33_ITCTRL_OFFSET 0x00042f00u
#define M33_ITCTRL_BITS 0x00000001u
#define M33_ITCTRL_RESET 0x00000000u
#define M33_ITCTRL_IME_RESET 0x0u
#define M33_ITCTRL_IME_BITS 0x00000001u
#define M33_ITCTRL_IME_MSB 0u
#define M33_ITCTRL_IME_LSB 0u
#define M33_ITCTRL_IME_ACCESS "RW"
#define M33_DEVARCH_OFFSET 0x00042fbcu
#define M33_DEVARCH_BITS 0xffffffffu
#define M33_DEVARCH_RESET 0x47701a14u
#define M33_DEVARCH_ARCHITECT_RESET 0x23bu
#define M33_DEVARCH_ARCHITECT_BITS 0xffe00000u
#define M33_DEVARCH_ARCHITECT_MSB 31u
#define M33_DEVARCH_ARCHITECT_LSB 21u
#define M33_DEVARCH_ARCHITECT_ACCESS "RO"
#define M33_DEVARCH_PRESENT_RESET 0x1u
#define M33_DEVARCH_PRESENT_BITS 0x00100000u
#define M33_DEVARCH_PRESENT_MSB 20u
#define M33_DEVARCH_PRESENT_LSB 20u
#define M33_DEVARCH_PRESENT_ACCESS "RO"
#define M33_DEVARCH_REVISION_RESET 0x0u
#define M33_DEVARCH_REVISION_BITS 0x000f0000u
#define M33_DEVARCH_REVISION_MSB 19u
#define M33_DEVARCH_REVISION_LSB 16u
#define M33_DEVARCH_REVISION_ACCESS "RO"
#define M33_DEVARCH_ARCHID_RESET 0x1a14u
#define M33_DEVARCH_ARCHID_BITS 0x0000ffffu
#define M33_DEVARCH_ARCHID_MSB 15u
#define M33_DEVARCH_ARCHID_LSB 0u
#define M33_DEVARCH_ARCHID_ACCESS "RO"
#define M33_DEVID_OFFSET 0x00042fc8u
#define M33_DEVID_BITS 0x000fff1fu
#define M33_DEVID_RESET 0x00040800u
#define M33_DEVID_NUMCH_RESET 0x4u
#define M33_DEVID_NUMCH_BITS 0x000f0000u
#define M33_DEVID_NUMCH_MSB 19u
#define M33_DEVID_NUMCH_LSB 16u
#define M33_DEVID_NUMCH_ACCESS "RO"
#define M33_DEVID_NUMTRIG_RESET 0x08u
#define M33_DEVID_NUMTRIG_BITS 0x0000ff00u
#define M33_DEVID_NUMTRIG_MSB 15u
#define M33_DEVID_NUMTRIG_LSB 8u
#define M33_DEVID_NUMTRIG_ACCESS "RO"
#define M33_DEVID_EXTMUXNUM_RESET 0x00u
#define M33_DEVID_EXTMUXNUM_BITS 0x0000001fu
#define M33_DEVID_EXTMUXNUM_MSB 4u
#define M33_DEVID_EXTMUXNUM_LSB 0u
#define M33_DEVID_EXTMUXNUM_ACCESS "RO"
#define M33_DEVTYPE_OFFSET 0x00042fccu
#define M33_DEVTYPE_BITS 0x000000ffu
#define M33_DEVTYPE_RESET 0x00000014u
#define M33_DEVTYPE_SUB_RESET 0x1u
#define M33_DEVTYPE_SUB_BITS 0x000000f0u
#define M33_DEVTYPE_SUB_MSB 7u
#define M33_DEVTYPE_SUB_LSB 4u
#define M33_DEVTYPE_SUB_ACCESS "RO"
#define M33_DEVTYPE_MAJOR_RESET 0x4u
