gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define M33_DEVTYPE_MAJOR_BITS 0x0000000fu
#define M33_DEVTYPE_MAJOR_MSB 3u
#define M33_DEVTYPE_MAJOR_LSB 0u
#define M33_DEVTYPE_MAJOR_ACCESS "RO"
#define M33_PIDR4_OFFSET 0x00042fd0u
#define M33_PIDR4_BITS 0x000000ffu
#define M33_PIDR4_RESET 0x00000004u
#define M33_PIDR4_SIZE_RESET 0x0u
#define M33_PIDR4_SIZE_BITS 0x000000f0u
#define M33_PIDR4_SIZE_MSB 7u
#define M33_PIDR4_SIZE_LSB 4u
#define M33_PIDR4_SIZE_ACCESS "RO"
#define M33_PIDR4_DES_2_RESET 0x4u
#define M33_PIDR4_DES_2_BITS 0x0000000fu
#define M33_PIDR4_DES_2_MSB 3u
#define M33_PIDR4_DES_2_LSB 0u
#define M33_PIDR4_DES_2_ACCESS "RO"
#define M33_PIDR5_OFFSET 0x00042fd4u
#define M33_PIDR5_BITS 0x00000000u
#define M33_PIDR5_RESET 0x00000000u
#define M33_PIDR5_MSB 31u
#define M33_PIDR5_LSB 0u
#define M33_PIDR5_ACCESS "RW"
#define M33_PIDR6_OFFSET 0x00042fd8u
#define M33_PIDR6_BITS 0x00000000u
#define M33_PIDR6_RESET 0x00000000u
#define M33_PIDR6_MSB 31u
#define M33_PIDR6_LSB 0u
#define M33_PIDR6_ACCESS "RW"
#define M33_PIDR7_OFFSET 0x00042fdcu
#define M33_PIDR7_BITS 0x00000000u
#define M33_PIDR7_RESET 0x00000000u
#define M33_PIDR7_MSB 31u
#define M33_PIDR7_LSB 0u
#define M33_PIDR7_ACCESS "RW"
#define M33_PIDR0_OFFSET 0x00042fe0u
#define M33_PIDR0_BITS 0x000000ffu
#define M33_PIDR0_RESET 0x00000021u
#define M33_PIDR0_PART_0_RESET 0x21u
#define M33_PIDR0_PART_0_BITS 0x000000ffu
#define M33_PIDR0_PART_0_MSB 7u
#define M33_PIDR0_PART_0_LSB 0u
#define M33_PIDR0_PART_0_ACCESS "RO"
#define M33_PIDR1_OFFSET 0x00042fe4u
#define M33_PIDR1_BITS 0x000000ffu
#define M33_PIDR1_RESET 0x000000bdu
#define M33_PIDR1_DES_0_RESET 0xbu
#define M33_PIDR1_DES_0_BITS 0x000000f0u
#define M33_PIDR1_DES_0_MSB 7u
#define M33_PIDR1_DES_0_LSB 4u
#define M33_PIDR1_DES_0_ACCESS "RO"
#define M33_PIDR1_PART_1_RESET 0xdu
#define M33_PIDR1_PART_1_BITS 0x0000000fu
#define M33_PIDR1_PART_1_MSB 3u
#define M33_PIDR1_PART_1_LSB 0u
#define M33_PIDR1_PART_1_ACCESS "RO"
#define M33_PIDR2_OFFSET 0x00042fe8u
#define M33_PIDR2_BITS 0x000000ffu
#define M33_PIDR2_RESET 0x0000000bu
#define M33_PIDR2_REVISION_RESET 0x0u
#define M33_PIDR2_REVISION_BITS 0x000000f0u
#define M33_PIDR2_REVISION_MSB 7u
#define M33_PIDR2_REVISION_LSB 4u
#define M33_PIDR2_REVISION_ACCESS "RO"
#define M33_PIDR2_JEDEC_RESET 0x1u
#define M33_PIDR2_JEDEC_BITS 0x00000008u
#define M33_PIDR2_JEDEC_MSB 3u
#define M33_PIDR2_JEDEC_LSB 3u
#define M33_PIDR2_JEDEC_ACCESS "RO"
#define M33_PIDR2_DES_1_RESET 0x3u
#define M33_PIDR2_DES_1_BITS 0x00000007u
#define M33_PIDR2_DES_1_MSB 2u
#define M33_PIDR2_DES_1_LSB 0u
#define M33_PIDR2_DES_1_ACCESS "RO"
#define M33_PIDR3_OFFSET 0x00042fecu
#define M33_PIDR3_BITS 0x000000ffu
#define M33_PIDR3_RESET 0x00000000u
#define M33_PIDR3_REVAND_RESET 0x0u
#define M33_PIDR3_REVAND_BITS 0x000000f0u
#define M33_PIDR3_REVAND_MSB 7u
#define M33_PIDR3_REVAND_LSB 4u
#define M33_PIDR3_REVAND_ACCESS "RO"
#define M33_PIDR3_CMOD_RESET 0x0u
#define M33_PIDR3_CMOD_BITS 0x0000000fu
#define M33_PIDR3_CMOD_MSB 3u
#define M33_PIDR3_CMOD_LSB 0u
#define M33_PIDR3_CMOD_ACCESS "RO"
#define M33_CIDR0_OFFSET 0x00042ff0u
#define M33_CIDR0_BITS 0x000000ffu
#define M33_CIDR0_RESET 0x0000000du
#define M33_CIDR0_PRMBL_0_RESET 0x0du
#define M33_CIDR0_PRMBL_0_BITS 0x000000ffu
#define M33_CIDR0_PRMBL_0_MSB 7u
#define M33_CIDR0_PRMBL_0_LSB 0u
#define M33_CIDR0_PRMBL_0_ACCESS "RO"
#define M33_CIDR1_OFFSET 0x00042ff4u
#define M33_CIDR1_BITS 0x000000ffu
#define M33_CIDR1_RESET 0x00000090u
#define M33_CIDR1_CLASS_RESET 0x9u
#define M33_CIDR1_CLASS_BITS 0x000000f0u
#define M33_CIDR1_CLASS_MSB 7u
#define M33_CIDR1_CLASS_LSB 4u
#define M33_CIDR1_CLASS_ACCESS "RO"
#define M33_CIDR1_PRMBL_1_RESET 0x0u
#define M33_CIDR1_PRMBL_1_BITS 0x0000000fu
#define M33_CIDR1_PRMBL_1_MSB 3u
#define M33_CIDR1_PRMBL_1_LSB 0u
#define M33_CIDR1_PRMBL_1_ACCESS "RO"
#define M33_CIDR2_OFFSET 0x00042ff8u
#define M33_CIDR2_BITS 0x000000ffu
#define M33_CIDR2_RESET 0x00000005u
#define M33_CIDR2_PRMBL_2_RESET 0x05u
#define M33_CIDR2_PRMBL_2_BITS 0x000000ffu
#define M33_CIDR2_PRMBL_2_MSB 7u
#define M33_CIDR2_PRMBL_2_LSB 0u
#define M33_CIDR2_PRMBL_2_ACCESS "RO"
#define M33_CIDR3_OFFSET 0x00042ffcu
#define M33_CIDR3_BITS 0x000000ffu
#define M33_CIDR3_RESET 0x000000b1u
#define M33_CIDR3_PRMBL_3_RESET 0xb1u
#define M33_CIDR3_PRMBL_3_BITS 0x000000ffu
#define M33_CIDR3_PRMBL_3_MSB 7u
#define M33_CIDR3_PRMBL_3_LSB 0u
#define M33_CIDR3_PRMBL_3_ACCESS "RO"
#define ARM_CPU_PREFIXED(x) M33_ ## x
#define _HARDWARE_STRUCTS_M33_H 
typedef struct {
   
    io_rw_32 itm_stim[32];
    uint32_t _pad0[864];
   
    io_rw_32 itm_ter0;
    uint32_t _pad1[15];
   
    io_rw_32 itm_tpr;
    uint32_t _pad2[15];
   
    io_rw_32 itm_tcr;
    uint32_t _pad3[27];
   
    io_ro_32 int_atready;
    uint32_t _pad4;
   
    io_rw_32 int_atvalid;
    uint32_t _pad5;
   
    io_rw_32 itm_itctrl;
    uint32_t _pad6[46];
   
    io_ro_32 itm_devarch;
    uint32_t _pad7[3];
   
    io_ro_32 itm_devtype;
   
    io_ro_32 itm_pidr4;
   
    io_rw_32 itm_pidr5;
   
    io_rw_32 itm_pidr6;
   
    io_rw_32 itm_pidr7;
   
    io_ro_32 itm_pidr0;
   
    io_ro_32 itm_pidr1;
   
    io_ro_32 itm_pidr2;
   
    io_ro_32 itm_pidr3;
   
    io_ro_32 itm_cidr[4];
   
    io_rw_32 dwt_ctrl;
   
    io_rw_32 dwt_cyccnt;
    uint32_t _pad8;
   
    io_rw_32 dwt_exccnt;
    uint32_t _pad9;
   
    io_rw_32 dwt_lsucnt;
   
    io_rw_32 dwt_foldcnt;
    uint32_t _pad10;
   
    io_rw_32 dwt_comp0;
    uint32_t _pad11;
   
    io_rw_32 dwt_function0;
    uint32_t _pad12;
   
    io_rw_32 dwt_comp1;
    uint32_t _pad13;
   
    io_rw_32 dwt_function1;
    uint32_t _pad14;
   
    io_rw_32 dwt_comp2;
    uint32_t _pad15;
   
    io_rw_32 dwt_function2;
    uint32_t _pad16;
   
    io_rw_32 dwt_comp3;
    uint32_t _pad17;
   
    io_rw_32 dwt_function3;
    uint32_t _pad18[984];
   
    io_ro_32 dwt_devarch;
    uint32_t _pad19[3];
   
    io_ro_32 dwt_devtype;
   
    io_ro_32 dwt_pidr4;
   
    io_rw_32 dwt_pidr5;
   
    io_rw_32 dwt_pidr6;
   
    io_rw_32 dwt_pidr7;
   
    io_ro_32 dwt_pidr0;
   
    io_ro_32 dwt_pidr1;
   
