gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 bootlock[8];
} bootram_hw_t;
static bootram_hw_t * const bootram_hw = (bootram_hw_t *)(BOOTRAM_BASE + BOOTRAM_WRITE_ONCE0_OFFSET); // ORIGINAL: #define bootram_hw ((bootram_hw_t *)(BOOTRAM_BASE + BOOTRAM_WRITE_ONCE0_OFFSET))
_Static_assert(sizeof (bootram_hw_t) == 0x002c, "");
typedef volatile uint32_t boot_lock_t;
__inline__ __attribute__((__always_inline__)) static boot_lock_t *boot_lock_instance(uint lock_num) {
    ({if (((0 || 0) && !0)) ((!(lock_num >= 8u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_boot_lock/include/hardware/boot_lock.h", 37, __func__, "!(lock_num >= 8u)"));});
    return (boot_lock_t *) (0x400e0000u + 0x0000080cu + lock_num * 4);
}
__inline__ __attribute__((__always_inline__)) static uint boot_lock_get_num(boot_lock_t *lock) {
    ({if (((0 || 0) && !0)) ((!((uint) lock < 0x400e0000u + 0x0000080cu || (uint) lock >= 8u * sizeof(boot_lock_t) + 0x400e0000u + 0x0000080cu || ((uint) lock - 0x400e0000u + 0x0000080cu) % sizeof(boot_lock_t) != 0)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_boot_lock/include/hardware/boot_lock.h", 48, __func__, "!((uint) lock < 0x400e0000u + 0x0000080cu || (uint) lock >= 8u * sizeof(boot_lock_t) + 0x400e0000u + 0x0000080cu || ((uint) lock - 0x400e0000u + 0x0000080cu) % sizeof(boot_lock_t) != 0)"));});
    return (uint) (lock - (boot_lock_t *) (0x400e0000u + 0x0000080cu));
}
__inline__ __attribute__((__always_inline__)) static void boot_lock_unsafe_blocking(boot_lock_t *lock) {
    while (__builtin_expect(!*lock, 0)) {
        tight_loop_contents();
    }
    __mem_fence_acquire();
}
__inline__ __attribute__((__always_inline__)) static _Bool boot_try_lock_unsafe(boot_lock_t *lock) {
    if (*lock) {
        __mem_fence_acquire();
        return 1;
    }
    return 0;
}
__inline__ __attribute__((__always_inline__)) static void boot_unlock_unsafe(boot_lock_t *lock) {
    __mem_fence_release();
    *lock = 0;
}
__inline__ __attribute__((__always_inline__)) static uint32_t boot_lock_blocking(boot_lock_t *lock) {
    uint32_t save = save_and_disable_interrupts();
    boot_lock_unsafe_blocking(lock);
    return save;
}
inline static _Bool is_boot_locked(boot_lock_t *lock) {
    _Static_assert(sizeof(boot_lock_t) == (4), "hw size mismatch");
    uint lock_num = boot_lock_get_num(lock);
    return 0 != (*(io_ro_32 *) (0x400e0000u + 0x00000808u) & (1u << lock_num));
}
__inline__ __attribute__((__always_inline__)) static void boot_unlock(boot_lock_t *lock, uint32_t saved_irq) {
    boot_unlock_unsafe(lock);
    restore_interrupts_from_disabled(saved_irq);
}
boot_lock_t *boot_lock_init(uint lock_num);
void boot_locks_reset(void);
#define _HARDWARE_CLAIM_H 
void hw_claim_or_assert(uint8_t *bits, uint bit_index, const char *message);
int hw_claim_unused_from_range(uint8_t *bits, _Bool required, uint bit_lsb, uint bit_msb, const char *message);
_Bool hw_is_claimed(const uint8_t *bits, uint bit_index);
void hw_claim_clear(uint8_t *bits, uint bit_index);
uint32_t hw_claim_lock(void);
void hw_claim_unlock(uint32_t token);
#define _HARDWARE_CLOCKS_H 
#define _HARDWARE_STRUCTS_CLOCKS_H 
#define _HARDWARE_REGS_CLOCKS_H 
#define CLOCKS_CLK_GPOUT0_CTRL_OFFSET 0x00000000u
#define CLOCKS_CLK_GPOUT0_CTRL_BITS 0x10131de0u
#define CLOCKS_CLK_GPOUT0_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_BITS 0x00100000u
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_MSB 20u
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_BITS 0x00001000u
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_MSB 12u
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_LSB 12u
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_BITS 0x000001e0u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_MSB 8u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x0u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x1u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x3u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG 0x4u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_ROSC_CLKSRC 0x5u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x6u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC 0x7u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_SYS 0x8u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_USB 0x9u
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_ADC 0xau
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_REF 0xbu
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_PERI 0xcu
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_HSTX 0xdu
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_OTP_CLK2FC 0xeu
#define CLOCKS_CLK_GPOUT0_DIV_OFFSET 0x00000004u
#define CLOCKS_CLK_GPOUT0_DIV_BITS 0xffffffffu
#define CLOCKS_CLK_GPOUT0_DIV_RESET 0x00010000u
#define CLOCKS_CLK_GPOUT0_DIV_INT_RESET 0x0001u
#define CLOCKS_CLK_GPOUT0_DIV_INT_BITS 0xffff0000u
#define CLOCKS_CLK_GPOUT0_DIV_INT_MSB 31u
#define CLOCKS_CLK_GPOUT0_DIV_INT_LSB 16u
#define CLOCKS_CLK_GPOUT0_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_RESET 0x0000u
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_BITS 0x0000ffffu
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_MSB 15u
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_LSB 0u
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_SELECTED_OFFSET 0x00000008u
#define CLOCKS_CLK_GPOUT0_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_GPOUT0_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_GPOUT0_SELECTED_MSB 0u
#define CLOCKS_CLK_GPOUT0_SELECTED_LSB 0u
#define CLOCKS_CLK_GPOUT0_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT1_CTRL_OFFSET 0x0000000cu
#define CLOCKS_CLK_GPOUT1_CTRL_BITS 0x10131de0u
#define CLOCKS_CLK_GPOUT1_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_BITS 0x00100000u
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_MSB 20u
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_BITS 0x00001000u
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_MSB 12u
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_LSB 12u
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_BITS 0x000001e0u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_MSB 8u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x0u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x1u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x3u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG 0x4u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_ROSC_CLKSRC 0x5u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x6u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC 0x7u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_SYS 0x8u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_USB 0x9u
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_ADC 0xau
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_REF 0xbu
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_PERI 0xcu
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_HSTX 0xdu
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_OTP_CLK2FC 0xeu
#define CLOCKS_CLK_GPOUT1_DIV_OFFSET 0x00000010u
#define CLOCKS_CLK_GPOUT1_DIV_BITS 0xffffffffu
#define CLOCKS_CLK_GPOUT1_DIV_RESET 0x00010000u
#define CLOCKS_CLK_GPOUT1_DIV_INT_RESET 0x0001u
#define CLOCKS_CLK_GPOUT1_DIV_INT_BITS 0xffff0000u
#define CLOCKS_CLK_GPOUT1_DIV_INT_MSB 31u
#define CLOCKS_CLK_GPOUT1_DIV_INT_LSB 16u
#define CLOCKS_CLK_GPOUT1_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_RESET 0x0000u
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_BITS 0x0000ffffu
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_MSB 15u
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_LSB 0u
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_SELECTED_OFFSET 0x00000014u
#define CLOCKS_CLK_GPOUT1_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_GPOUT1_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_GPOUT1_SELECTED_MSB 0u
#define CLOCKS_CLK_GPOUT1_SELECTED_LSB 0u
#define CLOCKS_CLK_GPOUT1_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT2_CTRL_OFFSET 0x00000018u
#define CLOCKS_CLK_GPOUT2_CTRL_BITS 0x10131de0u
#define CLOCKS_CLK_GPOUT2_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_BITS 0x00100000u
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_MSB 20u
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_BITS 0x00001000u
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_MSB 12u
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_LSB 12u
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_BITS 0x000001e0u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_MSB 8u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x0u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x1u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x3u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG 0x4u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH 0x5u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x6u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC 0x7u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_SYS 0x8u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_USB 0x9u
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_ADC 0xau
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_REF 0xbu
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_PERI 0xcu
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_HSTX 0xdu
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_OTP_CLK2FC 0xeu
#define CLOCKS_CLK_GPOUT2_DIV_OFFSET 0x0000001cu
#define CLOCKS_CLK_GPOUT2_DIV_BITS 0xffffffffu
#define CLOCKS_CLK_GPOUT2_DIV_RESET 0x00010000u
#define CLOCKS_CLK_GPOUT2_DIV_INT_RESET 0x0001u
#define CLOCKS_CLK_GPOUT2_DIV_INT_BITS 0xffff0000u
#define CLOCKS_CLK_GPOUT2_DIV_INT_MSB 31u
#define CLOCKS_CLK_GPOUT2_DIV_INT_LSB 16u
#define CLOCKS_CLK_GPOUT2_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_RESET 0x0000u
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_BITS 0x0000ffffu
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_MSB 15u
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_LSB 0u
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_SELECTED_OFFSET 0x00000020u
#define CLOCKS_CLK_GPOUT2_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_GPOUT2_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_GPOUT2_SELECTED_MSB 0u
#define CLOCKS_CLK_GPOUT2_SELECTED_LSB 0u
#define CLOCKS_CLK_GPOUT2_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT3_CTRL_OFFSET 0x00000024u
#define CLOCKS_CLK_GPOUT3_CTRL_BITS 0x10131de0u
#define CLOCKS_CLK_GPOUT3_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_BITS 0x00100000u
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_MSB 20u
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_LSB 20u
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_BITS 0x00030000u
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_MSB 17u
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_LSB 16u
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_BITS 0x00001000u
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_MSB 12u
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_LSB 12u
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_BITS 0x000001e0u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_MSB 8u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x0u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x1u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x3u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG 0x4u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH 0x5u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x6u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC 0x7u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_SYS 0x8u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_USB 0x9u
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_ADC 0xau
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_REF 0xbu
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_PERI 0xcu
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_HSTX 0xdu
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_OTP_CLK2FC 0xeu
#define CLOCKS_CLK_GPOUT3_DIV_OFFSET 0x00000028u
#define CLOCKS_CLK_GPOUT3_DIV_BITS 0xffffffffu
#define CLOCKS_CLK_GPOUT3_DIV_RESET 0x00010000u
#define CLOCKS_CLK_GPOUT3_DIV_INT_RESET 0x0001u
#define CLOCKS_CLK_GPOUT3_DIV_INT_BITS 0xffff0000u
#define CLOCKS_CLK_GPOUT3_DIV_INT_MSB 31u
#define CLOCKS_CLK_GPOUT3_DIV_INT_LSB 16u
#define CLOCKS_CLK_GPOUT3_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_RESET 0x0000u
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_BITS 0x0000ffffu
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_MSB 15u
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_LSB 0u
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_SELECTED_OFFSET 0x0000002cu
#define CLOCKS_CLK_GPOUT3_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_GPOUT3_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_GPOUT3_SELECTED_MSB 0u
#define CLOCKS_CLK_GPOUT3_SELECTED_LSB 0u
#define CLOCKS_CLK_GPOUT3_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_REF_CTRL_OFFSET 0x00000030u
#define CLOCKS_CLK_REF_CTRL_BITS 0x00000063u
#define CLOCKS_CLK_REF_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_BITS 0x00000060u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_MSB 6u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x0u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x1u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x2u
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG 0x3u
#define CLOCKS_CLK_REF_CTRL_SRC_RESET "-"
#define CLOCKS_CLK_REF_CTRL_SRC_BITS 0x00000003u
#define CLOCKS_CLK_REF_CTRL_SRC_MSB 1u
#define CLOCKS_CLK_REF_CTRL_SRC_LSB 0u
#define CLOCKS_CLK_REF_CTRL_SRC_ACCESS "RW"
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_ROSC_CLKSRC_PH 0x0u
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_CLKSRC_CLK_REF_AUX 0x1u
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC 0x2u
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_LPOSC_CLKSRC 0x3u
#define CLOCKS_CLK_REF_DIV_OFFSET 0x00000034u
#define CLOCKS_CLK_REF_DIV_BITS 0x00ff0000u
#define CLOCKS_CLK_REF_DIV_RESET 0x00010000u
#define CLOCKS_CLK_REF_DIV_INT_RESET 0x01u
#define CLOCKS_CLK_REF_DIV_INT_BITS 0x00ff0000u
#define CLOCKS_CLK_REF_DIV_INT_MSB 23u
#define CLOCKS_CLK_REF_DIV_INT_LSB 16u
#define CLOCKS_CLK_REF_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_REF_SELECTED_OFFSET 0x00000038u
#define CLOCKS_CLK_REF_SELECTED_BITS 0x0000000fu
#define CLOCKS_CLK_REF_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_REF_SELECTED_MSB 3u
#define CLOCKS_CLK_REF_SELECTED_LSB 0u
#define CLOCKS_CLK_REF_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_SYS_CTRL_OFFSET 0x0000003cu
#define CLOCKS_CLK_SYS_CTRL_BITS 0x000000e1u
#define CLOCKS_CLK_SYS_CTRL_RESET 0x00000041u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_RESET 0x2u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_BITS 0x000000e0u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_MSB 7u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x0u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x1u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_ROSC_CLKSRC 0x2u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x3u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x4u
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x5u
#define CLOCKS_CLK_SYS_CTRL_SRC_RESET 0x1u
#define CLOCKS_CLK_SYS_CTRL_SRC_BITS 0x00000001u
#define CLOCKS_CLK_SYS_CTRL_SRC_MSB 0u
#define CLOCKS_CLK_SYS_CTRL_SRC_LSB 0u
#define CLOCKS_CLK_SYS_CTRL_SRC_ACCESS "RW"
#define CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLK_REF 0x0u
#define CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX 0x1u
#define CLOCKS_CLK_SYS_DIV_OFFSET 0x00000040u
#define CLOCKS_CLK_SYS_DIV_BITS 0xffffffffu
#define CLOCKS_CLK_SYS_DIV_RESET 0x00010000u
#define CLOCKS_CLK_SYS_DIV_INT_RESET 0x0001u
#define CLOCKS_CLK_SYS_DIV_INT_BITS 0xffff0000u
#define CLOCKS_CLK_SYS_DIV_INT_MSB 31u
#define CLOCKS_CLK_SYS_DIV_INT_LSB 16u
#define CLOCKS_CLK_SYS_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_SYS_DIV_FRAC_RESET 0x0000u
#define CLOCKS_CLK_SYS_DIV_FRAC_BITS 0x0000ffffu
#define CLOCKS_CLK_SYS_DIV_FRAC_MSB 15u
#define CLOCKS_CLK_SYS_DIV_FRAC_LSB 0u
#define CLOCKS_CLK_SYS_DIV_FRAC_ACCESS "RW"
#define CLOCKS_CLK_SYS_SELECTED_OFFSET 0x00000044u
#define CLOCKS_CLK_SYS_SELECTED_BITS 0x00000003u
#define CLOCKS_CLK_SYS_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_SYS_SELECTED_MSB 1u
#define CLOCKS_CLK_SYS_SELECTED_LSB 0u
#define CLOCKS_CLK_SYS_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_PERI_CTRL_OFFSET 0x00000048u
#define CLOCKS_CLK_PERI_CTRL_BITS 0x10000ce0u
#define CLOCKS_CLK_PERI_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_PERI_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_PERI_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_PERI_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_PERI_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_PERI_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_PERI_CTRL_ENABLE_RESET 0x0u
#define CLOCKS_CLK_PERI_CTRL_ENABLE_BITS 0x00000800u
#define CLOCKS_CLK_PERI_CTRL_ENABLE_MSB 11u
#define CLOCKS_CLK_PERI_CTRL_ENABLE_LSB 11u
#define CLOCKS_CLK_PERI_CTRL_ENABLE_ACCESS "RW"
#define CLOCKS_CLK_PERI_CTRL_KILL_RESET 0x0u
#define CLOCKS_CLK_PERI_CTRL_KILL_BITS 0x00000400u
#define CLOCKS_CLK_PERI_CTRL_KILL_MSB 10u
#define CLOCKS_CLK_PERI_CTRL_KILL_LSB 10u
#define CLOCKS_CLK_PERI_CTRL_KILL_ACCESS "RW"
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_RESET 0x0u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_BITS 0x000000e0u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_MSB 7u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_LSB 5u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS 0x0u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS 0x1u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB 0x2u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH 0x3u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_XOSC_CLKSRC 0x4u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 0x5u
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 0x6u
#define CLOCKS_CLK_PERI_DIV_OFFSET 0x0000004cu
#define CLOCKS_CLK_PERI_DIV_BITS 0x00030000u
#define CLOCKS_CLK_PERI_DIV_RESET 0x00010000u
#define CLOCKS_CLK_PERI_DIV_INT_RESET 0x1u
#define CLOCKS_CLK_PERI_DIV_INT_BITS 0x00030000u
#define CLOCKS_CLK_PERI_DIV_INT_MSB 17u
#define CLOCKS_CLK_PERI_DIV_INT_LSB 16u
#define CLOCKS_CLK_PERI_DIV_INT_ACCESS "RW"
#define CLOCKS_CLK_PERI_SELECTED_OFFSET 0x00000050u
#define CLOCKS_CLK_PERI_SELECTED_BITS 0x00000001u
#define CLOCKS_CLK_PERI_SELECTED_RESET 0x00000001u
#define CLOCKS_CLK_PERI_SELECTED_MSB 0u
#define CLOCKS_CLK_PERI_SELECTED_LSB 0u
#define CLOCKS_CLK_PERI_SELECTED_ACCESS "RO"
#define CLOCKS_CLK_HSTX_CTRL_OFFSET 0x00000054u
#define CLOCKS_CLK_HSTX_CTRL_BITS 0x10130ce0u
#define CLOCKS_CLK_HSTX_CTRL_RESET 0x00000000u
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_RESET 0x0u
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_BITS 0x10000000u
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_MSB 28u
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_LSB 28u
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_ACCESS "RO"
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_RESET 0x0u
