gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define CLOCKS_WAKE_EN1_CLK_USB_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_BITS 0x04000000u
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_MSB 26u
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_LSB 26u
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_BITS 0x02000000u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_MSB 25u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_LSB 25u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_BITS 0x01000000u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_MSB 24u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_LSB 24u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_BITS 0x00800000u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_MSB 23u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_LSB 23u
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_BITS 0x00400000u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_MSB 22u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_LSB 22u
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_BITS 0x00200000u
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_MSB 21u
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_LSB 21u
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_BITS 0x00100000u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_MSB 20u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_LSB 20u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_BITS 0x00080000u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_MSB 19u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_LSB 19u
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_BITS 0x00040000u
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_MSB 18u
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_LSB 18u
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_BITS 0x00020000u
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_MSB 17u
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_LSB 17u
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_BITS 0x00010000u
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_MSB 16u
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_LSB 16u
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_BITS 0x00008000u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_MSB 15u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_LSB 15u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_BITS 0x00004000u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_MSB 14u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_LSB 14u
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_BITS 0x00002000u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_MSB 13u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_LSB 13u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_BITS 0x00001000u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_MSB 12u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_LSB 12u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_BITS 0x00000800u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_MSB 11u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_LSB 11u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_BITS 0x00000400u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_MSB 10u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_LSB 10u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_BITS 0x00000200u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_MSB 9u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_LSB 9u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_BITS 0x00000100u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_MSB 8u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_LSB 8u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_BITS 0x00000080u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_MSB 7u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_LSB 7u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_BITS 0x00000040u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_MSB 6u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_LSB 6u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM1_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM1_BITS 0x00000020u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM1_MSB 5u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM1_LSB 5u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM1_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM0_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM0_BITS 0x00000010u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM0_MSB 4u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM0_LSB 4u
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM0_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI1_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI1_BITS 0x00000008u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI1_MSB 3u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI1_LSB 3u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI1_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI1_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI1_BITS 0x00000004u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI1_MSB 2u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI1_LSB 2u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI1_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI0_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI0_BITS 0x00000002u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI0_MSB 1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI0_LSB 1u
#define CLOCKS_WAKE_EN1_CLK_SYS_SPI0_ACCESS "RW"
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI0_RESET 0x1u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI0_BITS 0x00000001u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI0_MSB 0u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI0_LSB 0u
#define CLOCKS_WAKE_EN1_CLK_PERI_SPI0_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_OFFSET 0x000000b4u
#define CLOCKS_SLEEP_EN0_BITS 0xffffffffu
#define CLOCKS_SLEEP_EN0_RESET 0xffffffffu
#define CLOCKS_SLEEP_EN0_CLK_SYS_SIO_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SIO_BITS 0x80000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SIO_MSB 31u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SIO_LSB 31u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SIO_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_SHA256_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SHA256_BITS 0x40000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SHA256_MSB 30u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SHA256_LSB 30u
#define CLOCKS_SLEEP_EN0_CLK_SYS_SHA256_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PSM_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PSM_BITS 0x20000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PSM_MSB 29u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PSM_LSB 29u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PSM_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROSC_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROSC_BITS 0x10000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROSC_MSB 28u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROSC_LSB 28u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROSC_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROM_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROM_BITS 0x08000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROM_MSB 27u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROM_LSB 27u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ROM_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_RESETS_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_RESETS_BITS 0x04000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_RESETS_MSB 26u
#define CLOCKS_SLEEP_EN0_CLK_SYS_RESETS_LSB 26u
#define CLOCKS_SLEEP_EN0_CLK_SYS_RESETS_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PWM_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PWM_BITS 0x02000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PWM_MSB 25u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PWM_LSB 25u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PWM_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_POWMAN_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_POWMAN_BITS 0x01000000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_POWMAN_MSB 24u
#define CLOCKS_SLEEP_EN0_CLK_SYS_POWMAN_LSB 24u
#define CLOCKS_SLEEP_EN0_CLK_SYS_POWMAN_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_REF_POWMAN_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_REF_POWMAN_BITS 0x00800000u
#define CLOCKS_SLEEP_EN0_CLK_REF_POWMAN_MSB 23u
#define CLOCKS_SLEEP_EN0_CLK_REF_POWMAN_LSB 23u
#define CLOCKS_SLEEP_EN0_CLK_REF_POWMAN_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_USB_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_USB_BITS 0x00400000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_USB_MSB 22u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_USB_LSB 22u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_USB_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_SYS_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_SYS_BITS 0x00200000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_SYS_MSB 21u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_SYS_LSB 21u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PLL_SYS_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO2_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO2_BITS 0x00100000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO2_MSB 20u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO2_LSB 20u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO2_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO1_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO1_BITS 0x00080000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO1_MSB 19u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO1_LSB 19u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO1_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO0_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO0_BITS 0x00040000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO0_MSB 18u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO0_LSB 18u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PIO0_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_PADS_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PADS_BITS 0x00020000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PADS_MSB 17u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PADS_LSB 17u
#define CLOCKS_SLEEP_EN0_CLK_SYS_PADS_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_OTP_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_OTP_BITS 0x00010000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_OTP_MSB 16u
#define CLOCKS_SLEEP_EN0_CLK_SYS_OTP_LSB 16u
#define CLOCKS_SLEEP_EN0_CLK_SYS_OTP_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_REF_OTP_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_REF_OTP_BITS 0x00008000u
#define CLOCKS_SLEEP_EN0_CLK_REF_OTP_MSB 15u
#define CLOCKS_SLEEP_EN0_CLK_REF_OTP_LSB 15u
#define CLOCKS_SLEEP_EN0_CLK_REF_OTP_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_JTAG_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_JTAG_BITS 0x00004000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_JTAG_MSB 14u
#define CLOCKS_SLEEP_EN0_CLK_SYS_JTAG_LSB 14u
#define CLOCKS_SLEEP_EN0_CLK_SYS_JTAG_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_IO_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_IO_BITS 0x00002000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_IO_MSB 13u
#define CLOCKS_SLEEP_EN0_CLK_SYS_IO_LSB 13u
#define CLOCKS_SLEEP_EN0_CLK_SYS_IO_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_BITS 0x00001000u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_MSB 12u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_LSB 12u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C1_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_BITS 0x00000800u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_MSB 11u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_LSB 11u
#define CLOCKS_SLEEP_EN0_CLK_SYS_I2C0_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_HSTX_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_HSTX_BITS 0x00000400u
#define CLOCKS_SLEEP_EN0_CLK_SYS_HSTX_MSB 10u
#define CLOCKS_SLEEP_EN0_CLK_SYS_HSTX_LSB 10u
#define CLOCKS_SLEEP_EN0_CLK_SYS_HSTX_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_HSTX_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_HSTX_BITS 0x00000200u
#define CLOCKS_SLEEP_EN0_CLK_HSTX_MSB 9u
#define CLOCKS_SLEEP_EN0_CLK_HSTX_LSB 9u
#define CLOCKS_SLEEP_EN0_CLK_HSTX_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_GLITCH_DETECTOR_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_GLITCH_DETECTOR_BITS 0x00000100u
#define CLOCKS_SLEEP_EN0_CLK_SYS_GLITCH_DETECTOR_MSB 8u
#define CLOCKS_SLEEP_EN0_CLK_SYS_GLITCH_DETECTOR_LSB 8u
#define CLOCKS_SLEEP_EN0_CLK_SYS_GLITCH_DETECTOR_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_BITS 0x00000080u
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_MSB 7u
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_LSB 7u
#define CLOCKS_SLEEP_EN0_CLK_SYS_DMA_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_BITS 0x00000040u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_MSB 6u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_LSB 6u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSFABRIC_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_BITS 0x00000020u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_MSB 5u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_LSB 5u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BUSCTRL_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_BOOTRAM_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BOOTRAM_BITS 0x00000010u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BOOTRAM_MSB 4u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BOOTRAM_LSB 4u
#define CLOCKS_SLEEP_EN0_CLK_SYS_BOOTRAM_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_BITS 0x00000008u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_MSB 3u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_LSB 3u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ADC_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_ADC_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_ADC_BITS 0x00000004u
#define CLOCKS_SLEEP_EN0_CLK_ADC_MSB 2u
#define CLOCKS_SLEEP_EN0_CLK_ADC_LSB 2u
#define CLOCKS_SLEEP_EN0_CLK_ADC_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_ACCESSCTRL_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ACCESSCTRL_BITS 0x00000002u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ACCESSCTRL_MSB 1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ACCESSCTRL_LSB 1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_ACCESSCTRL_ACCESS "RW"
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_RESET 0x1u
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_BITS 0x00000001u
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_MSB 0u
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_LSB 0u
#define CLOCKS_SLEEP_EN0_CLK_SYS_CLOCKS_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_OFFSET 0x000000b8u
#define CLOCKS_SLEEP_EN1_BITS 0x7fffffffu
#define CLOCKS_SLEEP_EN1_RESET 0x7fffffffu
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_BITS 0x40000000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_MSB 30u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_LSB 30u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XOSC_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_BITS 0x20000000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_MSB 29u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_LSB 29u
#define CLOCKS_SLEEP_EN1_CLK_SYS_XIP_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_BITS 0x10000000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_MSB 28u
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_LSB 28u
#define CLOCKS_SLEEP_EN1_CLK_SYS_WATCHDOG_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_USB_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_USB_BITS 0x08000000u
#define CLOCKS_SLEEP_EN1_CLK_USB_MSB 27u
#define CLOCKS_SLEEP_EN1_CLK_USB_LSB 27u
#define CLOCKS_SLEEP_EN1_CLK_USB_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_BITS 0x04000000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_MSB 26u
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_LSB 26u
#define CLOCKS_SLEEP_EN1_CLK_SYS_USBCTRL_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_BITS 0x02000000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_MSB 25u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_LSB 25u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART1_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_BITS 0x01000000u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_MSB 24u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_LSB 24u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART1_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_BITS 0x00800000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_MSB 23u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_LSB 23u
#define CLOCKS_SLEEP_EN1_CLK_SYS_UART0_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_BITS 0x00400000u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_MSB 22u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_LSB 22u
#define CLOCKS_SLEEP_EN1_CLK_PERI_UART0_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_BITS 0x00200000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_MSB 21u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_LSB 21u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_BITS 0x00100000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_MSB 20u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_LSB 20u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_BITS 0x00080000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_MSB 19u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_LSB 19u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_BITS 0x00040000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_MSB 18u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_LSB 18u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_REF_TICKS_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_REF_TICKS_BITS 0x00020000u
#define CLOCKS_SLEEP_EN1_CLK_REF_TICKS_MSB 17u
#define CLOCKS_SLEEP_EN1_CLK_REF_TICKS_LSB 17u
#define CLOCKS_SLEEP_EN1_CLK_REF_TICKS_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_BITS 0x00010000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_MSB 16u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_LSB 16u
#define CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_BITS 0x00008000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_MSB 15u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_LSB 15u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_BITS 0x00004000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_MSB 14u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_LSB 14u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_BITS 0x00002000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_MSB 13u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_LSB 13u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_BITS 0x00001000u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_MSB 12u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_LSB 12u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_BITS 0x00000800u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_MSB 11u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_LSB 11u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_BITS 0x00000400u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_MSB 10u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_LSB 10u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_BITS 0x00000200u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_MSB 9u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_LSB 9u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_BITS 0x00000100u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_MSB 8u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_LSB 8u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_BITS 0x00000080u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_MSB 7u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_LSB 7u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_BITS 0x00000040u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_MSB 6u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_LSB 6u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_BITS 0x00000020u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_MSB 5u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_LSB 5u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_BITS 0x00000010u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_MSB 4u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_LSB 4u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_BITS 0x00000008u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_MSB 3u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_LSB 3u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_BITS 0x00000004u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_MSB 2u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_LSB 2u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_BITS 0x00000002u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_MSB 1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_LSB 1u
#define CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_ACCESS "RW"
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_RESET 0x1u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_BITS 0x00000001u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_MSB 0u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_LSB 0u
#define CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_ACCESS "RW"
#define CLOCKS_ENABLED0_OFFSET 0x000000bcu
#define CLOCKS_ENABLED0_BITS 0xffffffffu
#define CLOCKS_ENABLED0_RESET 0x00000000u
#define CLOCKS_ENABLED0_CLK_SYS_SIO_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_SIO_BITS 0x80000000u
#define CLOCKS_ENABLED0_CLK_SYS_SIO_MSB 31u
#define CLOCKS_ENABLED0_CLK_SYS_SIO_LSB 31u
#define CLOCKS_ENABLED0_CLK_SYS_SIO_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_SHA256_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_SHA256_BITS 0x40000000u
#define CLOCKS_ENABLED0_CLK_SYS_SHA256_MSB 30u
#define CLOCKS_ENABLED0_CLK_SYS_SHA256_LSB 30u
#define CLOCKS_ENABLED0_CLK_SYS_SHA256_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PSM_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PSM_BITS 0x20000000u
#define CLOCKS_ENABLED0_CLK_SYS_PSM_MSB 29u
#define CLOCKS_ENABLED0_CLK_SYS_PSM_LSB 29u
#define CLOCKS_ENABLED0_CLK_SYS_PSM_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_BITS 0x10000000u
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_MSB 28u
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_LSB 28u
#define CLOCKS_ENABLED0_CLK_SYS_ROSC_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_ROM_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_ROM_BITS 0x08000000u
#define CLOCKS_ENABLED0_CLK_SYS_ROM_MSB 27u
#define CLOCKS_ENABLED0_CLK_SYS_ROM_LSB 27u
