gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define CLOCKS_ENABLED0_CLK_SYS_ROM_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_BITS 0x04000000u
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_MSB 26u
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_LSB 26u
#define CLOCKS_ENABLED0_CLK_SYS_RESETS_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PWM_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PWM_BITS 0x02000000u
#define CLOCKS_ENABLED0_CLK_SYS_PWM_MSB 25u
#define CLOCKS_ENABLED0_CLK_SYS_PWM_LSB 25u
#define CLOCKS_ENABLED0_CLK_SYS_PWM_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_POWMAN_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_POWMAN_BITS 0x01000000u
#define CLOCKS_ENABLED0_CLK_SYS_POWMAN_MSB 24u
#define CLOCKS_ENABLED0_CLK_SYS_POWMAN_LSB 24u
#define CLOCKS_ENABLED0_CLK_SYS_POWMAN_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_REF_POWMAN_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_REF_POWMAN_BITS 0x00800000u
#define CLOCKS_ENABLED0_CLK_REF_POWMAN_MSB 23u
#define CLOCKS_ENABLED0_CLK_REF_POWMAN_LSB 23u
#define CLOCKS_ENABLED0_CLK_REF_POWMAN_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_BITS 0x00400000u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_MSB 22u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_LSB 22u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_USB_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_BITS 0x00200000u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_MSB 21u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_LSB 21u
#define CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PIO2_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PIO2_BITS 0x00100000u
#define CLOCKS_ENABLED0_CLK_SYS_PIO2_MSB 20u
#define CLOCKS_ENABLED0_CLK_SYS_PIO2_LSB 20u
#define CLOCKS_ENABLED0_CLK_SYS_PIO2_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_BITS 0x00080000u
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_MSB 19u
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_LSB 19u
#define CLOCKS_ENABLED0_CLK_SYS_PIO1_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_BITS 0x00040000u
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_MSB 18u
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_LSB 18u
#define CLOCKS_ENABLED0_CLK_SYS_PIO0_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_PADS_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_PADS_BITS 0x00020000u
#define CLOCKS_ENABLED0_CLK_SYS_PADS_MSB 17u
#define CLOCKS_ENABLED0_CLK_SYS_PADS_LSB 17u
#define CLOCKS_ENABLED0_CLK_SYS_PADS_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_OTP_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_OTP_BITS 0x00010000u
#define CLOCKS_ENABLED0_CLK_SYS_OTP_MSB 16u
#define CLOCKS_ENABLED0_CLK_SYS_OTP_LSB 16u
#define CLOCKS_ENABLED0_CLK_SYS_OTP_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_REF_OTP_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_REF_OTP_BITS 0x00008000u
#define CLOCKS_ENABLED0_CLK_REF_OTP_MSB 15u
#define CLOCKS_ENABLED0_CLK_REF_OTP_LSB 15u
#define CLOCKS_ENABLED0_CLK_REF_OTP_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_BITS 0x00004000u
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_MSB 14u
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_LSB 14u
#define CLOCKS_ENABLED0_CLK_SYS_JTAG_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_IO_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_IO_BITS 0x00002000u
#define CLOCKS_ENABLED0_CLK_SYS_IO_MSB 13u
#define CLOCKS_ENABLED0_CLK_SYS_IO_LSB 13u
#define CLOCKS_ENABLED0_CLK_SYS_IO_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_BITS 0x00001000u
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_MSB 12u
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_LSB 12u
#define CLOCKS_ENABLED0_CLK_SYS_I2C1_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_BITS 0x00000800u
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_MSB 11u
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_LSB 11u
#define CLOCKS_ENABLED0_CLK_SYS_I2C0_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_HSTX_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_HSTX_BITS 0x00000400u
#define CLOCKS_ENABLED0_CLK_SYS_HSTX_MSB 10u
#define CLOCKS_ENABLED0_CLK_SYS_HSTX_LSB 10u
#define CLOCKS_ENABLED0_CLK_SYS_HSTX_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_HSTX_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_HSTX_BITS 0x00000200u
#define CLOCKS_ENABLED0_CLK_HSTX_MSB 9u
#define CLOCKS_ENABLED0_CLK_HSTX_LSB 9u
#define CLOCKS_ENABLED0_CLK_HSTX_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_BITS 0x00000100u
#define CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_MSB 8u
#define CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_LSB 8u
#define CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_DMA_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_DMA_BITS 0x00000080u
#define CLOCKS_ENABLED0_CLK_SYS_DMA_MSB 7u
#define CLOCKS_ENABLED0_CLK_SYS_DMA_LSB 7u
#define CLOCKS_ENABLED0_CLK_SYS_DMA_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_BITS 0x00000040u
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_MSB 6u
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_LSB 6u
#define CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_BITS 0x00000020u
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_MSB 5u
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_LSB 5u
#define CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_BITS 0x00000010u
#define CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_MSB 4u
#define CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_LSB 4u
#define CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_ADC_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_ADC_BITS 0x00000008u
#define CLOCKS_ENABLED0_CLK_SYS_ADC_MSB 3u
#define CLOCKS_ENABLED0_CLK_SYS_ADC_LSB 3u
#define CLOCKS_ENABLED0_CLK_SYS_ADC_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_ADC_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_ADC_BITS 0x00000004u
#define CLOCKS_ENABLED0_CLK_ADC_MSB 2u
#define CLOCKS_ENABLED0_CLK_ADC_LSB 2u
#define CLOCKS_ENABLED0_CLK_ADC_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_BITS 0x00000002u
#define CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_MSB 1u
#define CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_LSB 1u
#define CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_ACCESS "RO"
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_RESET 0x0u
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_BITS 0x00000001u
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_MSB 0u
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_LSB 0u
#define CLOCKS_ENABLED0_CLK_SYS_CLOCKS_ACCESS "RO"
#define CLOCKS_ENABLED1_OFFSET 0x000000c0u
#define CLOCKS_ENABLED1_BITS 0x7fffffffu
#define CLOCKS_ENABLED1_RESET 0x00000000u
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_BITS 0x40000000u
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_MSB 30u
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_LSB 30u
#define CLOCKS_ENABLED1_CLK_SYS_XOSC_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_XIP_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_XIP_BITS 0x20000000u
#define CLOCKS_ENABLED1_CLK_SYS_XIP_MSB 29u
#define CLOCKS_ENABLED1_CLK_SYS_XIP_LSB 29u
#define CLOCKS_ENABLED1_CLK_SYS_XIP_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_BITS 0x10000000u
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_MSB 28u
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_LSB 28u
#define CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_USB_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_USB_BITS 0x08000000u
#define CLOCKS_ENABLED1_CLK_USB_MSB 27u
#define CLOCKS_ENABLED1_CLK_USB_LSB 27u
#define CLOCKS_ENABLED1_CLK_USB_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_BITS 0x04000000u
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_MSB 26u
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_LSB 26u
#define CLOCKS_ENABLED1_CLK_SYS_USBCTRL_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_UART1_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_UART1_BITS 0x02000000u
#define CLOCKS_ENABLED1_CLK_SYS_UART1_MSB 25u
#define CLOCKS_ENABLED1_CLK_SYS_UART1_LSB 25u
#define CLOCKS_ENABLED1_CLK_SYS_UART1_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_PERI_UART1_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_PERI_UART1_BITS 0x01000000u
#define CLOCKS_ENABLED1_CLK_PERI_UART1_MSB 24u
#define CLOCKS_ENABLED1_CLK_PERI_UART1_LSB 24u
#define CLOCKS_ENABLED1_CLK_PERI_UART1_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_UART0_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_UART0_BITS 0x00800000u
#define CLOCKS_ENABLED1_CLK_SYS_UART0_MSB 23u
#define CLOCKS_ENABLED1_CLK_SYS_UART0_LSB 23u
#define CLOCKS_ENABLED1_CLK_SYS_UART0_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_PERI_UART0_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_PERI_UART0_BITS 0x00400000u
#define CLOCKS_ENABLED1_CLK_PERI_UART0_MSB 22u
#define CLOCKS_ENABLED1_CLK_PERI_UART0_LSB 22u
#define CLOCKS_ENABLED1_CLK_PERI_UART0_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_TRNG_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_TRNG_BITS 0x00200000u
#define CLOCKS_ENABLED1_CLK_SYS_TRNG_MSB 21u
#define CLOCKS_ENABLED1_CLK_SYS_TRNG_LSB 21u
#define CLOCKS_ENABLED1_CLK_SYS_TRNG_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_TIMER1_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER1_BITS 0x00100000u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER1_MSB 20u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER1_LSB 20u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER1_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_TIMER0_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER0_BITS 0x00080000u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER0_MSB 19u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER0_LSB 19u
#define CLOCKS_ENABLED1_CLK_SYS_TIMER0_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_TICKS_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_TICKS_BITS 0x00040000u
#define CLOCKS_ENABLED1_CLK_SYS_TICKS_MSB 18u
#define CLOCKS_ENABLED1_CLK_SYS_TICKS_LSB 18u
#define CLOCKS_ENABLED1_CLK_SYS_TICKS_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_REF_TICKS_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_REF_TICKS_BITS 0x00020000u
#define CLOCKS_ENABLED1_CLK_REF_TICKS_MSB 17u
#define CLOCKS_ENABLED1_CLK_REF_TICKS_LSB 17u
#define CLOCKS_ENABLED1_CLK_REF_TICKS_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_BITS 0x00010000u
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_MSB 16u
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_LSB 16u
#define CLOCKS_ENABLED1_CLK_SYS_TBMAN_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_BITS 0x00008000u
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_MSB 15u
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_LSB 15u
#define CLOCKS_ENABLED1_CLK_SYS_SYSINFO_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_BITS 0x00004000u
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_MSB 14u
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_LSB 14u
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_BITS 0x00002000u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_MSB 13u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_LSB 13u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_BITS 0x00001000u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_MSB 12u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_LSB 12u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_BITS 0x00000800u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_MSB 11u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_LSB 11u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_BITS 0x00000400u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_MSB 10u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_LSB 10u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_BITS 0x00000200u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_MSB 9u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_LSB 9u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_BITS 0x00000100u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_MSB 8u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_LSB 8u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_BITS 0x00000080u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_MSB 7u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_LSB 7u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_BITS 0x00000040u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_MSB 6u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_LSB 6u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_BITS 0x00000020u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_MSB 5u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_LSB 5u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_BITS 0x00000010u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_MSB 4u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_LSB 4u
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_BITS 0x00000008u
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_MSB 3u
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_LSB 3u
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_BITS 0x00000004u
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_MSB 2u
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_LSB 2u
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_BITS 0x00000002u
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_MSB 1u
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_LSB 1u
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_ACCESS "RO"
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_RESET 0x0u
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_BITS 0x00000001u
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_MSB 0u
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_LSB 0u
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_ACCESS "RO"
#define CLOCKS_INTR_OFFSET 0x000000c4u
#define CLOCKS_INTR_BITS 0x00000001u
#define CLOCKS_INTR_RESET 0x00000000u
#define CLOCKS_INTR_CLK_SYS_RESUS_RESET 0x0u
#define CLOCKS_INTR_CLK_SYS_RESUS_BITS 0x00000001u
#define CLOCKS_INTR_CLK_SYS_RESUS_MSB 0u
#define CLOCKS_INTR_CLK_SYS_RESUS_LSB 0u
#define CLOCKS_INTR_CLK_SYS_RESUS_ACCESS "RO"
#define CLOCKS_INTE_OFFSET 0x000000c8u
#define CLOCKS_INTE_BITS 0x00000001u
#define CLOCKS_INTE_RESET 0x00000000u
#define CLOCKS_INTE_CLK_SYS_RESUS_RESET 0x0u
#define CLOCKS_INTE_CLK_SYS_RESUS_BITS 0x00000001u
#define CLOCKS_INTE_CLK_SYS_RESUS_MSB 0u
#define CLOCKS_INTE_CLK_SYS_RESUS_LSB 0u
#define CLOCKS_INTE_CLK_SYS_RESUS_ACCESS "RW"
#define CLOCKS_INTF_OFFSET 0x000000ccu
#define CLOCKS_INTF_BITS 0x00000001u
#define CLOCKS_INTF_RESET 0x00000000u
#define CLOCKS_INTF_CLK_SYS_RESUS_RESET 0x0u
#define CLOCKS_INTF_CLK_SYS_RESUS_BITS 0x00000001u
#define CLOCKS_INTF_CLK_SYS_RESUS_MSB 0u
#define CLOCKS_INTF_CLK_SYS_RESUS_LSB 0u
#define CLOCKS_INTF_CLK_SYS_RESUS_ACCESS "RW"
#define CLOCKS_INTS_OFFSET 0x000000d0u
#define CLOCKS_INTS_BITS 0x00000001u
#define CLOCKS_INTS_RESET 0x00000000u
#define CLOCKS_INTS_CLK_SYS_RESUS_RESET 0x0u
#define CLOCKS_INTS_CLK_SYS_RESUS_BITS 0x00000001u
#define CLOCKS_INTS_CLK_SYS_RESUS_MSB 0u
#define CLOCKS_INTS_CLK_SYS_RESUS_LSB 0u
#define CLOCKS_INTS_CLK_SYS_RESUS_ACCESS "RO"
typedef enum clock_num_rp2350 {
    clk_gpout0 = 0,
    clk_gpout1 = 1,
    clk_gpout2 = 2,
    clk_gpout3 = 3,
    clk_ref = 4,
    clk_sys = 5,
    clk_peri = 6,
    clk_hstx = 7,
    clk_usb = 8,
    clk_adc = 9,
    CLK_COUNT
} clock_num_t;
typedef enum clock_dest_num_rp2350 {
    CLK_DEST_SYS_CLOCKS = 0,
    CLK_DEST_SYS_ACCESSCTRL = 1,
    CLK_DEST_ADC = 2,
    CLK_DEST_SYS_ADC = 3,
    CLK_DEST_SYS_BOOTRAM = 4,
    CLK_DEST_SYS_BUSCTRL = 5,
    CLK_DEST_SYS_BUSFABRIC = 6,
    CLK_DEST_SYS_DMA = 7,
    CLK_DEST_SYS_GLITCH_DETECTOR = 8,
    CLK_DEST_HSTX = 9,
    CLK_DEST_SYS_HSTX = 10,
    CLK_DEST_SYS_I2C0 = 11,
    CLK_DEST_SYS_I2C1 = 12,
    CLK_DEST_SYS_IO = 13,
    CLK_DEST_SYS_JTAG = 14,
    CLK_DEST_REF_OTP = 15,
    CLK_DEST_SYS_OTP = 16,
    CLK_DEST_SYS_PADS = 17,
    CLK_DEST_SYS_PIO0 = 18,
    CLK_DEST_SYS_PIO1 = 19,
    CLK_DEST_SYS_PIO2 = 20,
    CLK_DEST_SYS_PLL_SYS = 21,
    CLK_DEST_SYS_PLL_USB = 22,
    CLK_DEST_REF_POWMAN = 23,
    CLK_DEST_SYS_POWMAN = 24,
    CLK_DEST_SYS_PWM = 25,
    CLK_DEST_SYS_RESETS = 26,
    CLK_DEST_SYS_ROM = 27,
    CLK_DEST_SYS_ROSC = 28,
    CLK_DEST_SYS_PSM = 29,
    CLK_DEST_SYS_SHA256 = 30,
    CLK_DEST_SYS_SIO = 31,
    CLK_DEST_PERI_SPI0 = 32,
    CLK_DEST_SYS_SPI0 = 33,
    CLK_DEST_PERI_SPI1 = 34,
    CLK_DEST_SYS_SPI1 = 35,
    CLK_DEST_SYS_SRAM0 = 36,
    CLK_DEST_SYS_SRAM1 = 37,
    CLK_DEST_SYS_SRAM2 = 38,
    CLK_DEST_SYS_SRAM3 = 39,
    CLK_DEST_SYS_SRAM4 = 40,
    CLK_DEST_SYS_SRAM5 = 41,
    CLK_DEST_SYS_SRAM6 = 42,
    CLK_DEST_SYS_SRAM7 = 43,
    CLK_DEST_SYS_SRAM8 = 44,
    CLK_DEST_SYS_SRAM9 = 45,
    CLK_DEST_SYS_SYSCFG = 46,
    CLK_DEST_SYS_SYSINFO = 47,
    CLK_DEST_SYS_TBMAN = 48,
    CLK_DEST_REF_TICKS = 49,
    CLK_DEST_SYS_TICKS = 50,
    CLK_DEST_SYS_TIMER0 = 51,
    CLK_DEST_SYS_TIMER1 = 52,
    CLK_DEST_SYS_TRNG = 53,
    CLK_DEST_PERI_UART0 = 54,
    CLK_DEST_SYS_UART0 = 55,
    CLK_DEST_PERI_UART1 = 56,
    CLK_DEST_SYS_UART1 = 57,
    CLK_DEST_SYS_USBCTRL = 58,
    CLK_DEST_USB = 59,
    CLK_DEST_SYS_WATCHDOG = 60,
    CLK_DEST_SYS_XIP = 61,
    CLK_DEST_SYS_XOSC = 62,
    NUM_CLOCK_DESTINATIONS
} clock_dest_num_t;
