gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef struct {
   
    io_rw_32 ctrl;
   
    io_rw_32 div;
   
    io_ro_32 selected;
} clock_hw_t;
typedef struct {
   
    io_rw_32 ctrl;
   
    io_ro_32 status;
} clock_resus_hw_t;
typedef struct {
   
    io_rw_32 ref_khz;
   
    io_rw_32 min_khz;
   
    io_rw_32 max_khz;
   
    io_rw_32 delay;
   
    io_rw_32 interval;
   
    io_rw_32 src;
   
    io_ro_32 status;
   
    io_ro_32 result;
} fc_hw_t;
typedef struct {
    clock_hw_t clk[10];
   
    io_rw_32 dftclk_xosc_ctrl;
   
    io_rw_32 dftclk_rosc_ctrl;
   
    io_rw_32 dftclk_lposc_ctrl;
    clock_resus_hw_t resus;
    fc_hw_t fc0;
    union {
        struct {
           
            io_rw_32 wake_en0;
           
            io_rw_32 wake_en1;
        };
       
        io_rw_32 wake_en[2];
    };
    union {
        struct {
           
            io_rw_32 sleep_en0;
           
            io_rw_32 sleep_en1;
        };
       
        io_rw_32 sleep_en[2];
    };
    union {
        struct {
           
            io_ro_32 enabled0;
           
            io_ro_32 enabled1;
        };
       
        io_ro_32 enabled[2];
    };
   
    io_ro_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} clocks_hw_t;
static clocks_hw_t * const clocks_hw = (clocks_hw_t *)CLOCKS_BASE; // ORIGINAL: #define clocks_hw ((clocks_hw_t *)CLOCKS_BASE)
_Static_assert(sizeof (clocks_hw_t) == 0x00d4, "");
#define KHZ 1000
#define MHZ 1000000
#define PLL_COMMON_REFDIV 1
#define PLL_SYS_REFDIV PLL_COMMON_REFDIV
#define PLL_SYS_VCO_FREQ_HZ (1500 * MHZ)
#define PLL_SYS_POSTDIV1 5
#define PLL_SYS_POSTDIV2 2
#define SYS_CLK_VREG_VOLTAGE_AUTO_ADJUST 0
#define SYS_CLK_VREG_VOLTAGE_AUTO_ADJUST_DELAY_US 1000
#define PLL_USB_REFDIV PLL_COMMON_REFDIV
#define PLL_USB_VCO_FREQ_HZ (1200 * MHZ)
#define PLL_USB_POSTDIV1 5
#define PLL_USB_POSTDIV2 5
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_CLOCKS 0
#define PICO_CLOCK_GPIO_CLKDIV_ROUND_NEAREST PICO_CLKDIV_ROUND_NEAREST
typedef clock_num_t clock_handle_t;
_Bool clock_configure(clock_handle_t clock, uint32_t src, uint32_t auxsrc, uint32_t src_freq, uint32_t freq);
void clock_configure_undivided(clock_handle_t clock, uint32_t src, uint32_t auxsrc, uint32_t src_freq);
void clock_configure_int_divider(clock_handle_t clock, uint32_t src, uint32_t auxsrc, uint32_t src_freq, uint32_t int_divider);
void clock_stop(clock_handle_t clock);
uint32_t clock_get_hz(clock_handle_t clock);
uint32_t frequency_count_khz(uint src);
void clock_set_reported_hz(clock_handle_t clock, uint hz);
static inline float frequency_count_mhz(uint src) {
    return ((float) (frequency_count_khz(src))) / 1000;
}
typedef void (*resus_callback_t)(void);
void clocks_enable_resus(resus_callback_t resus_callback);
void clock_gpio_init_int_frac16(uint gpio, uint src, uint32_t div_int, uint16_t div_frac16);
static inline void clock_gpio_init_int_frac8(uint gpio, uint src, uint32_t div_int, uint8_t div_frac8) {
    return clock_gpio_init_int_frac16(gpio, src, div_int, (uint16_t)(div_frac8 << 8u));
}
static inline void clock_gpio_init_int_frac(uint gpio, uint src, uint32_t div_int, uint8_t div_frac8) {
    return clock_gpio_init_int_frac8(gpio, src, div_int, div_frac8);
}
static inline void clock_gpio_init(uint gpio, uint src, float div)
{
    uint div_int = (uint)div;
    const int frac_bit_count = (15u + 1 - 0u);
    div += 0.5f / (1 << frac_bit_count);
    uint16_t frac = (uint16_t)((div - (float)div_int) * (1u << frac_bit_count));
    clock_gpio_init_int_frac16(gpio, src, div_int, frac);
}
_Bool clock_configure_gpin(clock_handle_t clock, uint gpio, uint32_t src_freq, uint32_t freq);
void set_sys_clock_48mhz(void);
void set_sys_clock_pll(uint32_t vco_freq, uint post_div1, uint post_div2);
_Bool check_sys_clock_hz(uint32_t freq_hz, uint *vco_freq_out, uint *post_div1_out, uint *post_div2_out);
_Bool check_sys_clock_khz(uint32_t freq_khz, uint *vco_freq_out, uint *post_div1_out, uint *post_div2_out);
static inline _Bool set_sys_clock_hz(uint32_t freq_hz, _Bool required) {
    uint vco, postdiv1, postdiv2;
    if (check_sys_clock_hz(freq_hz, &vco, &postdiv1, &postdiv2)) {
        set_sys_clock_pll(vco, postdiv1, postdiv2);
        return 1;
    } else if (required) {
        panic("System clock of %u Hz cannot be exactly achieved", freq_hz);
    }
    return 0;
}
static inline _Bool set_sys_clock_khz(uint32_t freq_khz, _Bool required) {
    uint vco, postdiv1, postdiv2;
    if (check_sys_clock_khz(freq_khz, &vco, &postdiv1, &postdiv2)) {
        set_sys_clock_pll(vco, postdiv1, postdiv2);
        return 1;
    } else if (required) {
        panic("System clock of %u kHz cannot be exactly achieved", freq_khz);
    }
    return 0;
}
#define GPIO_TO_GPOUT_CLOCK_HANDLE_RP2040(gpio,default_clk_handle) ((gpio) == 21 ? clk_gpout0 : ((gpio) == 23 ? clk_gpout1 : ((gpio) == 24 ? clk_gpout2 : ((gpio) == 25 ? clk_gpout3 : (default_clk_handle)))))
#define GPIO_TO_GPOUT_CLOCK_HANDLE_RP2350(gpio,default_clk_handle) ((gpio) == 13 ? clk_gpout0 : ((gpio) == 15 ? clk_gpout1 : (GPIO_TO_GPOUT_CLOCK_HANDLE_RP2040(gpio, default_clk_handle))))
#define GPIO_TO_GPOUT_CLOCK_HANDLE GPIO_TO_GPOUT_CLOCK_HANDLE_RP2350
static inline clock_handle_t gpio_to_gpout_clock_handle(uint gpio, clock_handle_t default_clk_handle) {
    return ((gpio) == 13 ? clk_gpout0 : ((gpio) == 15 ? clk_gpout1 : (((gpio) == 21 ? clk_gpout0 : ((gpio) == 23 ? clk_gpout1 : ((gpio) == 24 ? clk_gpout2 : ((gpio) == 25 ? clk_gpout3 : (({({if (((0 || 0) && !0)) ((!(1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_clocks/include/hardware/clocks.h", 614, __func__, "!(1)"));}); default_clk_handle;})))))))));
}
#define _HARDWARE_DIVIDER_H 
#define PICO_EMULATE_DIVIDER 1
typedef uint64_t divmod_result_t;
extern divmod_result_t hw_divider_results[2u];
static inline int __sign_of(int32_t v) {
    return v > 0 ? 1 : (v < 0 ? -1 : 0);
}
static inline divmod_result_t hw_divider_divmod_s32(int32_t a, int32_t b) {
    if (!b) return (((uint64_t)a)<<32u) | (uint32_t)(-__sign_of(a));
    return (((uint64_t)(a%b))<<32u) | (uint32_t)(a/b);
}
static inline divmod_result_t hw_divider_divmod_u32(uint32_t a, uint32_t b) {
    if (!b) return (((uint64_t)a)<<32u) | (uint32_t)(-1);
    return (((uint64_t)(a%b))<<32u) | (a/b);
}
static inline void hw_divider_divmod_s32_start(int32_t a, int32_t b) {
    hw_divider_results[get_core_num()] = hw_divider_divmod_s32(a, b);
}
static inline void hw_divider_divmod_u32_start(uint32_t a, uint32_t b) {
    hw_divider_results[get_core_num()] = hw_divider_divmod_u32(a, b);
}
static inline void hw_divider_wait_ready(void) {
}
static inline divmod_result_t hw_divider_result_nowait(void) {
    return hw_divider_results[get_core_num()];
}
static inline divmod_result_t hw_divider_result_wait(void) {
    hw_divider_wait_ready();
    return hw_divider_result_nowait();
}
inline static uint32_t to_quotient_u32(divmod_result_t r) {
    return (uint32_t) r;
}
inline static int32_t to_quotient_s32(divmod_result_t r) {
    return (int32_t)(uint32_t)r;
}
inline static uint32_t to_remainder_u32(divmod_result_t r) {
    return (uint32_t)(r >> 32u);
}
inline static int32_t to_remainder_s32(divmod_result_t r) {
    return (int32_t)(r >> 32u);
}
static inline uint32_t hw_divider_u32_quotient_wait(void) {
    return to_quotient_u32(hw_divider_result_wait());
}
static inline int32_t hw_divider_s32_quotient_wait(void) {
    return to_quotient_s32(hw_divider_result_wait());
}
static inline uint32_t hw_divider_u32_remainder_wait(void) {
    return to_remainder_u32(hw_divider_result_wait());
}
static inline int32_t hw_divider_s32_remainder_wait(void) {
    return to_remainder_s32(hw_divider_result_wait());
}
static inline uint32_t hw_divider_u32_quotient(uint32_t a, uint32_t b) {
    return b ? (a / b) : (uint32_t)(-1);
}
static inline uint32_t hw_divider_u32_remainder(uint32_t a, uint32_t b) {
    return b ? (a % b) : a;
}
static inline int32_t hw_divider_quotient_s32(int32_t a, int32_t b) {
    return b ? (a / b) : -1;
}
static inline int32_t hw_divider_remainder_s32(int32_t a, int32_t b) {
    return b ? (a % b) : a;
}
static inline void hw_divider_pause(void) {
}
static inline uint32_t hw_divider_u32_quotient_inlined(uint32_t a, uint32_t b) {
    return hw_divider_u32_quotient(a,b);
}
static inline uint32_t hw_divider_u32_remainder_inlined(uint32_t a, uint32_t b) {
    return hw_divider_u32_remainder(a,b);
}
static inline int32_t hw_divider_s32_quotient_inlined(int32_t a, int32_t b) {
    return hw_divider_quotient_s32(a,b);
}
static inline int32_t hw_divider_s32_remainder_inlined(int32_t a, int32_t b) {
    return hw_divider_remainder_s32(a,b);
}
typedef uint64_t hw_divider_state_t;
static inline void hw_divider_save_state(hw_divider_state_t *dest) {
    *dest = hw_divider_results[get_core_num()];
}
static inline void hw_divider_restore_state(hw_divider_state_t *src) {
    hw_divider_results[get_core_num()] = *src;
}
#define _HARDWARE_DMA_H 
#define _HARDWARE_STRUCTS_DMA_H 
#define _HARDWARE_REGS_DMA_H 
#define DMA_CH0_READ_ADDR_OFFSET 0x00000000u
#define DMA_CH0_READ_ADDR_BITS 0xffffffffu
#define DMA_CH0_READ_ADDR_RESET 0x00000000u
#define DMA_CH0_READ_ADDR_MSB 31u
#define DMA_CH0_READ_ADDR_LSB 0u
#define DMA_CH0_READ_ADDR_ACCESS "RW"
#define DMA_CH0_WRITE_ADDR_OFFSET 0x00000004u
#define DMA_CH0_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH0_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH0_WRITE_ADDR_MSB 31u
#define DMA_CH0_WRITE_ADDR_LSB 0u
#define DMA_CH0_WRITE_ADDR_ACCESS "RW"
#define DMA_CH0_TRANS_COUNT_OFFSET 0x00000008u
#define DMA_CH0_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH0_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH0_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH0_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH0_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH0_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH0_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH0_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH0_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH0_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH0_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH0_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH0_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH0_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH0_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_OFFSET 0x0000000cu
#define DMA_CH0_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH0_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH0_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH0_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH0_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH0_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH0_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH0_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH0_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH0_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH0_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH0_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH0_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH0_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH0_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH0_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH0_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH0_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH0_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH0_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH0_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH0_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH0_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH0_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH0_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH0_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH0_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH0_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH0_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH0_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH0_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH0_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH0_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH0_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH0_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH0_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH0_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH0_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH0_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH0_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH0_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH0_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH0_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH0_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH0_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH0_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH0_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH0_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH0_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH0_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH0_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH0_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH0_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH0_CTRL_TRIG_EN_MSB 0u
#define DMA_CH0_CTRL_TRIG_EN_LSB 0u
#define DMA_CH0_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH0_AL1_CTRL_OFFSET 0x00000010u
#define DMA_CH0_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH0_AL1_CTRL_RESET "-"
#define DMA_CH0_AL1_CTRL_MSB 31u
#define DMA_CH0_AL1_CTRL_LSB 0u
#define DMA_CH0_AL1_CTRL_ACCESS "RW"
#define DMA_CH0_AL1_READ_ADDR_OFFSET 0x00000014u
#define DMA_CH0_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH0_AL1_READ_ADDR_RESET "-"
#define DMA_CH0_AL1_READ_ADDR_MSB 31u
#define DMA_CH0_AL1_READ_ADDR_LSB 0u
#define DMA_CH0_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH0_AL1_WRITE_ADDR_OFFSET 0x00000018u
#define DMA_CH0_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH0_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH0_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH0_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH0_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH0_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000001cu
#define DMA_CH0_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH0_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH0_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH0_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH0_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH0_AL2_CTRL_OFFSET 0x00000020u
#define DMA_CH0_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH0_AL2_CTRL_RESET "-"
#define DMA_CH0_AL2_CTRL_MSB 31u
#define DMA_CH0_AL2_CTRL_LSB 0u
#define DMA_CH0_AL2_CTRL_ACCESS "RW"
#define DMA_CH0_AL2_TRANS_COUNT_OFFSET 0x00000024u
#define DMA_CH0_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH0_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH0_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH0_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH0_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH0_AL2_READ_ADDR_OFFSET 0x00000028u
#define DMA_CH0_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH0_AL2_READ_ADDR_RESET "-"
#define DMA_CH0_AL2_READ_ADDR_MSB 31u
#define DMA_CH0_AL2_READ_ADDR_LSB 0u
#define DMA_CH0_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH0_AL2_WRITE_ADDR_TRIG_OFFSET 0x0000002cu
#define DMA_CH0_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH0_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH0_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH0_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH0_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH0_AL3_CTRL_OFFSET 0x00000030u
#define DMA_CH0_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH0_AL3_CTRL_RESET "-"
#define DMA_CH0_AL3_CTRL_MSB 31u
#define DMA_CH0_AL3_CTRL_LSB 0u
#define DMA_CH0_AL3_CTRL_ACCESS "RW"
#define DMA_CH0_AL3_WRITE_ADDR_OFFSET 0x00000034u
#define DMA_CH0_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH0_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH0_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH0_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH0_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH0_AL3_TRANS_COUNT_OFFSET 0x00000038u
#define DMA_CH0_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH0_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH0_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH0_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH0_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH0_AL3_READ_ADDR_TRIG_OFFSET 0x0000003cu
#define DMA_CH0_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH0_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH0_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH0_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH0_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH1_READ_ADDR_OFFSET 0x00000040u
#define DMA_CH1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH1_READ_ADDR_RESET 0x00000000u
#define DMA_CH1_READ_ADDR_MSB 31u
#define DMA_CH1_READ_ADDR_LSB 0u
#define DMA_CH1_READ_ADDR_ACCESS "RW"
#define DMA_CH1_WRITE_ADDR_OFFSET 0x00000044u
#define DMA_CH1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH1_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH1_WRITE_ADDR_MSB 31u
#define DMA_CH1_WRITE_ADDR_LSB 0u
#define DMA_CH1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH1_TRANS_COUNT_OFFSET 0x00000048u
#define DMA_CH1_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH1_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH1_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH1_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH1_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH1_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH1_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH1_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH1_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH1_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH1_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH1_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH1_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH1_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH1_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_OFFSET 0x0000004cu
#define DMA_CH1_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH1_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH1_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH1_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH1_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH1_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH1_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH1_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH1_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH1_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH1_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH1_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH1_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH1_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH1_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH1_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH1_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH1_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH1_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH1_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH1_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH1_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH1_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH1_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH1_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH1_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH1_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH1_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH1_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH1_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH1_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH1_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH1_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH1_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH1_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH1_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH1_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH1_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH1_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH1_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH1_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH1_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH1_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH1_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH1_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH1_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH1_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH1_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH1_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
