gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define DMA_CH1_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH1_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH1_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH1_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH1_CTRL_TRIG_EN_MSB 0u
#define DMA_CH1_CTRL_TRIG_EN_LSB 0u
#define DMA_CH1_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH1_AL1_CTRL_OFFSET 0x00000050u
#define DMA_CH1_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH1_AL1_CTRL_RESET "-"
#define DMA_CH1_AL1_CTRL_MSB 31u
#define DMA_CH1_AL1_CTRL_LSB 0u
#define DMA_CH1_AL1_CTRL_ACCESS "RW"
#define DMA_CH1_AL1_READ_ADDR_OFFSET 0x00000054u
#define DMA_CH1_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH1_AL1_READ_ADDR_RESET "-"
#define DMA_CH1_AL1_READ_ADDR_MSB 31u
#define DMA_CH1_AL1_READ_ADDR_LSB 0u
#define DMA_CH1_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH1_AL1_WRITE_ADDR_OFFSET 0x00000058u
#define DMA_CH1_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH1_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH1_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH1_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH1_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH1_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000005cu
#define DMA_CH1_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH1_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH1_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH1_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH1_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH1_AL2_CTRL_OFFSET 0x00000060u
#define DMA_CH1_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH1_AL2_CTRL_RESET "-"
#define DMA_CH1_AL2_CTRL_MSB 31u
#define DMA_CH1_AL2_CTRL_LSB 0u
#define DMA_CH1_AL2_CTRL_ACCESS "RW"
#define DMA_CH1_AL2_TRANS_COUNT_OFFSET 0x00000064u
#define DMA_CH1_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH1_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH1_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH1_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH1_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH1_AL2_READ_ADDR_OFFSET 0x00000068u
#define DMA_CH1_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH1_AL2_READ_ADDR_RESET "-"
#define DMA_CH1_AL2_READ_ADDR_MSB 31u
#define DMA_CH1_AL2_READ_ADDR_LSB 0u
#define DMA_CH1_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH1_AL2_WRITE_ADDR_TRIG_OFFSET 0x0000006cu
#define DMA_CH1_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH1_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH1_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH1_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH1_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH1_AL3_CTRL_OFFSET 0x00000070u
#define DMA_CH1_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH1_AL3_CTRL_RESET "-"
#define DMA_CH1_AL3_CTRL_MSB 31u
#define DMA_CH1_AL3_CTRL_LSB 0u
#define DMA_CH1_AL3_CTRL_ACCESS "RW"
#define DMA_CH1_AL3_WRITE_ADDR_OFFSET 0x00000074u
#define DMA_CH1_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH1_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH1_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH1_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH1_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH1_AL3_TRANS_COUNT_OFFSET 0x00000078u
#define DMA_CH1_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH1_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH1_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH1_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH1_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH1_AL3_READ_ADDR_TRIG_OFFSET 0x0000007cu
#define DMA_CH1_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH1_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH1_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH1_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH1_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH2_READ_ADDR_OFFSET 0x00000080u
#define DMA_CH2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH2_READ_ADDR_RESET 0x00000000u
#define DMA_CH2_READ_ADDR_MSB 31u
#define DMA_CH2_READ_ADDR_LSB 0u
#define DMA_CH2_READ_ADDR_ACCESS "RW"
#define DMA_CH2_WRITE_ADDR_OFFSET 0x00000084u
#define DMA_CH2_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH2_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH2_WRITE_ADDR_MSB 31u
#define DMA_CH2_WRITE_ADDR_LSB 0u
#define DMA_CH2_WRITE_ADDR_ACCESS "RW"
#define DMA_CH2_TRANS_COUNT_OFFSET 0x00000088u
#define DMA_CH2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH2_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH2_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH2_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH2_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH2_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH2_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH2_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH2_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH2_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH2_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH2_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH2_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH2_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH2_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_OFFSET 0x0000008cu
#define DMA_CH2_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH2_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH2_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH2_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH2_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH2_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH2_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH2_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH2_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH2_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH2_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH2_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH2_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH2_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH2_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH2_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH2_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH2_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH2_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH2_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH2_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH2_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH2_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH2_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH2_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH2_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH2_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH2_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH2_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH2_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH2_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH2_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH2_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH2_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH2_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH2_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH2_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH2_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH2_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH2_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH2_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH2_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH2_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH2_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH2_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH2_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH2_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH2_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH2_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH2_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH2_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH2_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH2_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH2_CTRL_TRIG_EN_MSB 0u
#define DMA_CH2_CTRL_TRIG_EN_LSB 0u
#define DMA_CH2_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH2_AL1_CTRL_OFFSET 0x00000090u
#define DMA_CH2_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH2_AL1_CTRL_RESET "-"
#define DMA_CH2_AL1_CTRL_MSB 31u
#define DMA_CH2_AL1_CTRL_LSB 0u
#define DMA_CH2_AL1_CTRL_ACCESS "RW"
#define DMA_CH2_AL1_READ_ADDR_OFFSET 0x00000094u
#define DMA_CH2_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH2_AL1_READ_ADDR_RESET "-"
#define DMA_CH2_AL1_READ_ADDR_MSB 31u
#define DMA_CH2_AL1_READ_ADDR_LSB 0u
#define DMA_CH2_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH2_AL1_WRITE_ADDR_OFFSET 0x00000098u
#define DMA_CH2_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH2_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH2_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH2_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH2_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH2_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000009cu
#define DMA_CH2_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH2_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH2_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH2_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH2_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH2_AL2_CTRL_OFFSET 0x000000a0u
#define DMA_CH2_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH2_AL2_CTRL_RESET "-"
#define DMA_CH2_AL2_CTRL_MSB 31u
#define DMA_CH2_AL2_CTRL_LSB 0u
#define DMA_CH2_AL2_CTRL_ACCESS "RW"
#define DMA_CH2_AL2_TRANS_COUNT_OFFSET 0x000000a4u
#define DMA_CH2_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH2_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH2_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH2_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH2_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH2_AL2_READ_ADDR_OFFSET 0x000000a8u
#define DMA_CH2_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH2_AL2_READ_ADDR_RESET "-"
#define DMA_CH2_AL2_READ_ADDR_MSB 31u
#define DMA_CH2_AL2_READ_ADDR_LSB 0u
#define DMA_CH2_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH2_AL2_WRITE_ADDR_TRIG_OFFSET 0x000000acu
#define DMA_CH2_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH2_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH2_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH2_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH2_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH2_AL3_CTRL_OFFSET 0x000000b0u
#define DMA_CH2_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH2_AL3_CTRL_RESET "-"
#define DMA_CH2_AL3_CTRL_MSB 31u
#define DMA_CH2_AL3_CTRL_LSB 0u
#define DMA_CH2_AL3_CTRL_ACCESS "RW"
#define DMA_CH2_AL3_WRITE_ADDR_OFFSET 0x000000b4u
#define DMA_CH2_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH2_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH2_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH2_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH2_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH2_AL3_TRANS_COUNT_OFFSET 0x000000b8u
#define DMA_CH2_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH2_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH2_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH2_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH2_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH2_AL3_READ_ADDR_TRIG_OFFSET 0x000000bcu
#define DMA_CH2_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH2_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH2_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH2_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH2_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH3_READ_ADDR_OFFSET 0x000000c0u
#define DMA_CH3_READ_ADDR_BITS 0xffffffffu
#define DMA_CH3_READ_ADDR_RESET 0x00000000u
#define DMA_CH3_READ_ADDR_MSB 31u
#define DMA_CH3_READ_ADDR_LSB 0u
#define DMA_CH3_READ_ADDR_ACCESS "RW"
#define DMA_CH3_WRITE_ADDR_OFFSET 0x000000c4u
#define DMA_CH3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH3_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH3_WRITE_ADDR_MSB 31u
#define DMA_CH3_WRITE_ADDR_LSB 0u
#define DMA_CH3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH3_TRANS_COUNT_OFFSET 0x000000c8u
#define DMA_CH3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH3_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH3_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH3_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH3_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH3_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH3_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH3_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH3_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH3_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH3_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH3_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH3_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH3_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH3_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_OFFSET 0x000000ccu
#define DMA_CH3_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH3_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH3_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH3_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH3_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH3_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH3_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH3_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH3_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH3_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH3_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH3_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH3_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH3_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH3_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH3_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH3_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH3_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH3_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH3_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH3_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH3_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH3_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH3_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH3_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH3_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH3_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH3_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH3_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH3_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH3_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH3_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH3_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH3_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH3_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH3_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH3_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH3_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH3_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH3_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH3_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH3_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH3_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH3_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH3_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH3_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH3_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH3_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH3_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH3_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH3_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH3_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH3_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH3_CTRL_TRIG_EN_MSB 0u
#define DMA_CH3_CTRL_TRIG_EN_LSB 0u
#define DMA_CH3_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH3_AL1_CTRL_OFFSET 0x000000d0u
#define DMA_CH3_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH3_AL1_CTRL_RESET "-"
#define DMA_CH3_AL1_CTRL_MSB 31u
#define DMA_CH3_AL1_CTRL_LSB 0u
#define DMA_CH3_AL1_CTRL_ACCESS "RW"
#define DMA_CH3_AL1_READ_ADDR_OFFSET 0x000000d4u
#define DMA_CH3_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH3_AL1_READ_ADDR_RESET "-"
#define DMA_CH3_AL1_READ_ADDR_MSB 31u
#define DMA_CH3_AL1_READ_ADDR_LSB 0u
#define DMA_CH3_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH3_AL1_WRITE_ADDR_OFFSET 0x000000d8u
#define DMA_CH3_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH3_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH3_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH3_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH3_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH3_AL1_TRANS_COUNT_TRIG_OFFSET 0x000000dcu
#define DMA_CH3_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH3_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH3_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH3_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH3_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH3_AL2_CTRL_OFFSET 0x000000e0u
#define DMA_CH3_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH3_AL2_CTRL_RESET "-"
#define DMA_CH3_AL2_CTRL_MSB 31u
#define DMA_CH3_AL2_CTRL_LSB 0u
#define DMA_CH3_AL2_CTRL_ACCESS "RW"
#define DMA_CH3_AL2_TRANS_COUNT_OFFSET 0x000000e4u
#define DMA_CH3_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH3_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH3_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH3_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH3_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH3_AL2_READ_ADDR_OFFSET 0x000000e8u
#define DMA_CH3_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH3_AL2_READ_ADDR_RESET "-"
#define DMA_CH3_AL2_READ_ADDR_MSB 31u
#define DMA_CH3_AL2_READ_ADDR_LSB 0u
#define DMA_CH3_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH3_AL2_WRITE_ADDR_TRIG_OFFSET 0x000000ecu
#define DMA_CH3_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH3_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH3_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH3_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH3_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH3_AL3_CTRL_OFFSET 0x000000f0u
#define DMA_CH3_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH3_AL3_CTRL_RESET "-"
#define DMA_CH3_AL3_CTRL_MSB 31u
#define DMA_CH3_AL3_CTRL_LSB 0u
#define DMA_CH3_AL3_CTRL_ACCESS "RW"
#define DMA_CH3_AL3_WRITE_ADDR_OFFSET 0x000000f4u
#define DMA_CH3_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH3_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH3_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH3_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH3_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH3_AL3_TRANS_COUNT_OFFSET 0x000000f8u
#define DMA_CH3_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH3_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH3_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH3_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH3_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH3_AL3_READ_ADDR_TRIG_OFFSET 0x000000fcu
#define DMA_CH3_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH3_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH3_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH3_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH3_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH4_READ_ADDR_OFFSET 0x00000100u
#define DMA_CH4_READ_ADDR_BITS 0xffffffffu
#define DMA_CH4_READ_ADDR_RESET 0x00000000u
#define DMA_CH4_READ_ADDR_MSB 31u
#define DMA_CH4_READ_ADDR_LSB 0u
#define DMA_CH4_READ_ADDR_ACCESS "RW"
#define DMA_CH4_WRITE_ADDR_OFFSET 0x00000104u
#define DMA_CH4_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH4_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH4_WRITE_ADDR_MSB 31u
#define DMA_CH4_WRITE_ADDR_LSB 0u
#define DMA_CH4_WRITE_ADDR_ACCESS "RW"
#define DMA_CH4_TRANS_COUNT_OFFSET 0x00000108u
#define DMA_CH4_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH4_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH4_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH4_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH4_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH4_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH4_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH4_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH4_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH4_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH4_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH4_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH4_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH4_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH4_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_OFFSET 0x0000010cu
#define DMA_CH4_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH4_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH4_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH4_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH4_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH4_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH4_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH4_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH4_CTRL_TRIG_BUSY_LSB 26u
