gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define DMA_CH4_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH4_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH4_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH4_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH4_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH4_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH4_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH4_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH4_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH4_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH4_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH4_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH4_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH4_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH4_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH4_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH4_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH4_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH4_CTRL_TRIG_EN_MSB 0u
#define DMA_CH4_CTRL_TRIG_EN_LSB 0u
#define DMA_CH4_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH4_AL1_CTRL_OFFSET 0x00000110u
#define DMA_CH4_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH4_AL1_CTRL_RESET "-"
#define DMA_CH4_AL1_CTRL_MSB 31u
#define DMA_CH4_AL1_CTRL_LSB 0u
#define DMA_CH4_AL1_CTRL_ACCESS "RW"
#define DMA_CH4_AL1_READ_ADDR_OFFSET 0x00000114u
#define DMA_CH4_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH4_AL1_READ_ADDR_RESET "-"
#define DMA_CH4_AL1_READ_ADDR_MSB 31u
#define DMA_CH4_AL1_READ_ADDR_LSB 0u
#define DMA_CH4_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH4_AL1_WRITE_ADDR_OFFSET 0x00000118u
#define DMA_CH4_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH4_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH4_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH4_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH4_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH4_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000011cu
#define DMA_CH4_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH4_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH4_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH4_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH4_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH4_AL2_CTRL_OFFSET 0x00000120u
#define DMA_CH4_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH4_AL2_CTRL_RESET "-"
#define DMA_CH4_AL2_CTRL_MSB 31u
#define DMA_CH4_AL2_CTRL_LSB 0u
#define DMA_CH4_AL2_CTRL_ACCESS "RW"
#define DMA_CH4_AL2_TRANS_COUNT_OFFSET 0x00000124u
#define DMA_CH4_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH4_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH4_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH4_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH4_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH4_AL2_READ_ADDR_OFFSET 0x00000128u
#define DMA_CH4_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH4_AL2_READ_ADDR_RESET "-"
#define DMA_CH4_AL2_READ_ADDR_MSB 31u
#define DMA_CH4_AL2_READ_ADDR_LSB 0u
#define DMA_CH4_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH4_AL2_WRITE_ADDR_TRIG_OFFSET 0x0000012cu
#define DMA_CH4_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH4_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH4_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH4_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH4_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH4_AL3_CTRL_OFFSET 0x00000130u
#define DMA_CH4_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH4_AL3_CTRL_RESET "-"
#define DMA_CH4_AL3_CTRL_MSB 31u
#define DMA_CH4_AL3_CTRL_LSB 0u
#define DMA_CH4_AL3_CTRL_ACCESS "RW"
#define DMA_CH4_AL3_WRITE_ADDR_OFFSET 0x00000134u
#define DMA_CH4_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH4_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH4_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH4_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH4_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH4_AL3_TRANS_COUNT_OFFSET 0x00000138u
#define DMA_CH4_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH4_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH4_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH4_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH4_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH4_AL3_READ_ADDR_TRIG_OFFSET 0x0000013cu
#define DMA_CH4_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH4_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH4_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH4_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH4_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH5_READ_ADDR_OFFSET 0x00000140u
#define DMA_CH5_READ_ADDR_BITS 0xffffffffu
#define DMA_CH5_READ_ADDR_RESET 0x00000000u
#define DMA_CH5_READ_ADDR_MSB 31u
#define DMA_CH5_READ_ADDR_LSB 0u
#define DMA_CH5_READ_ADDR_ACCESS "RW"
#define DMA_CH5_WRITE_ADDR_OFFSET 0x00000144u
#define DMA_CH5_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH5_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH5_WRITE_ADDR_MSB 31u
#define DMA_CH5_WRITE_ADDR_LSB 0u
#define DMA_CH5_WRITE_ADDR_ACCESS "RW"
#define DMA_CH5_TRANS_COUNT_OFFSET 0x00000148u
#define DMA_CH5_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH5_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH5_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH5_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH5_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH5_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH5_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH5_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH5_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH5_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH5_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH5_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH5_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH5_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH5_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_OFFSET 0x0000014cu
#define DMA_CH5_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH5_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH5_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH5_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH5_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH5_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH5_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH5_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH5_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH5_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH5_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH5_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH5_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH5_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH5_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH5_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH5_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH5_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH5_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH5_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH5_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH5_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH5_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH5_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH5_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH5_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH5_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH5_CTRL_TRIG_EN_MSB 0u
#define DMA_CH5_CTRL_TRIG_EN_LSB 0u
#define DMA_CH5_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH5_AL1_CTRL_OFFSET 0x00000150u
#define DMA_CH5_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH5_AL1_CTRL_RESET "-"
#define DMA_CH5_AL1_CTRL_MSB 31u
#define DMA_CH5_AL1_CTRL_LSB 0u
#define DMA_CH5_AL1_CTRL_ACCESS "RW"
#define DMA_CH5_AL1_READ_ADDR_OFFSET 0x00000154u
#define DMA_CH5_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH5_AL1_READ_ADDR_RESET "-"
#define DMA_CH5_AL1_READ_ADDR_MSB 31u
#define DMA_CH5_AL1_READ_ADDR_LSB 0u
#define DMA_CH5_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH5_AL1_WRITE_ADDR_OFFSET 0x00000158u
#define DMA_CH5_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH5_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH5_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH5_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH5_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH5_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000015cu
#define DMA_CH5_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH5_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH5_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH5_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH5_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH5_AL2_CTRL_OFFSET 0x00000160u
#define DMA_CH5_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH5_AL2_CTRL_RESET "-"
#define DMA_CH5_AL2_CTRL_MSB 31u
#define DMA_CH5_AL2_CTRL_LSB 0u
#define DMA_CH5_AL2_CTRL_ACCESS "RW"
#define DMA_CH5_AL2_TRANS_COUNT_OFFSET 0x00000164u
#define DMA_CH5_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH5_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH5_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH5_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH5_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH5_AL2_READ_ADDR_OFFSET 0x00000168u
#define DMA_CH5_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH5_AL2_READ_ADDR_RESET "-"
#define DMA_CH5_AL2_READ_ADDR_MSB 31u
#define DMA_CH5_AL2_READ_ADDR_LSB 0u
#define DMA_CH5_AL2_READ_ADDR_ACCESS "RW"
#define DMA_CH5_AL2_WRITE_ADDR_TRIG_OFFSET 0x0000016cu
#define DMA_CH5_AL2_WRITE_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH5_AL2_WRITE_ADDR_TRIG_RESET "-"
#define DMA_CH5_AL2_WRITE_ADDR_TRIG_MSB 31u
#define DMA_CH5_AL2_WRITE_ADDR_TRIG_LSB 0u
#define DMA_CH5_AL2_WRITE_ADDR_TRIG_ACCESS "RW"
#define DMA_CH5_AL3_CTRL_OFFSET 0x00000170u
#define DMA_CH5_AL3_CTRL_BITS 0xffffffffu
#define DMA_CH5_AL3_CTRL_RESET "-"
#define DMA_CH5_AL3_CTRL_MSB 31u
#define DMA_CH5_AL3_CTRL_LSB 0u
#define DMA_CH5_AL3_CTRL_ACCESS "RW"
#define DMA_CH5_AL3_WRITE_ADDR_OFFSET 0x00000174u
#define DMA_CH5_AL3_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH5_AL3_WRITE_ADDR_RESET "-"
#define DMA_CH5_AL3_WRITE_ADDR_MSB 31u
#define DMA_CH5_AL3_WRITE_ADDR_LSB 0u
#define DMA_CH5_AL3_WRITE_ADDR_ACCESS "RW"
#define DMA_CH5_AL3_TRANS_COUNT_OFFSET 0x00000178u
#define DMA_CH5_AL3_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH5_AL3_TRANS_COUNT_RESET "-"
#define DMA_CH5_AL3_TRANS_COUNT_MSB 31u
#define DMA_CH5_AL3_TRANS_COUNT_LSB 0u
#define DMA_CH5_AL3_TRANS_COUNT_ACCESS "RW"
#define DMA_CH5_AL3_READ_ADDR_TRIG_OFFSET 0x0000017cu
#define DMA_CH5_AL3_READ_ADDR_TRIG_BITS 0xffffffffu
#define DMA_CH5_AL3_READ_ADDR_TRIG_RESET "-"
#define DMA_CH5_AL3_READ_ADDR_TRIG_MSB 31u
#define DMA_CH5_AL3_READ_ADDR_TRIG_LSB 0u
#define DMA_CH5_AL3_READ_ADDR_TRIG_ACCESS "RW"
#define DMA_CH6_READ_ADDR_OFFSET 0x00000180u
#define DMA_CH6_READ_ADDR_BITS 0xffffffffu
#define DMA_CH6_READ_ADDR_RESET 0x00000000u
#define DMA_CH6_READ_ADDR_MSB 31u
#define DMA_CH6_READ_ADDR_LSB 0u
#define DMA_CH6_READ_ADDR_ACCESS "RW"
#define DMA_CH6_WRITE_ADDR_OFFSET 0x00000184u
#define DMA_CH6_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH6_WRITE_ADDR_RESET 0x00000000u
#define DMA_CH6_WRITE_ADDR_MSB 31u
#define DMA_CH6_WRITE_ADDR_LSB 0u
#define DMA_CH6_WRITE_ADDR_ACCESS "RW"
#define DMA_CH6_TRANS_COUNT_OFFSET 0x00000188u
#define DMA_CH6_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH6_TRANS_COUNT_RESET 0x00000000u
#define DMA_CH6_TRANS_COUNT_MODE_RESET 0x0u
#define DMA_CH6_TRANS_COUNT_MODE_BITS 0xf0000000u
#define DMA_CH6_TRANS_COUNT_MODE_MSB 31u
#define DMA_CH6_TRANS_COUNT_MODE_LSB 28u
#define DMA_CH6_TRANS_COUNT_MODE_ACCESS "RW"
#define DMA_CH6_TRANS_COUNT_MODE_VALUE_NORMAL 0x0u
#define DMA_CH6_TRANS_COUNT_MODE_VALUE_TRIGGER_SELF 0x1u
#define DMA_CH6_TRANS_COUNT_MODE_VALUE_ENDLESS 0xfu
#define DMA_CH6_TRANS_COUNT_COUNT_RESET 0x0000000u
#define DMA_CH6_TRANS_COUNT_COUNT_BITS 0x0fffffffu
#define DMA_CH6_TRANS_COUNT_COUNT_MSB 27u
#define DMA_CH6_TRANS_COUNT_COUNT_LSB 0u
#define DMA_CH6_TRANS_COUNT_COUNT_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_OFFSET 0x0000018cu
#define DMA_CH6_CTRL_TRIG_BITS 0xe7ffffffu
#define DMA_CH6_CTRL_TRIG_RESET 0x00000000u
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_BITS 0x80000000u
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_MSB 31u
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_LSB 31u
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_ACCESS "RO"
#define DMA_CH6_CTRL_TRIG_READ_ERROR_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_READ_ERROR_BITS 0x40000000u
#define DMA_CH6_CTRL_TRIG_READ_ERROR_MSB 30u
#define DMA_CH6_CTRL_TRIG_READ_ERROR_LSB 30u
#define DMA_CH6_CTRL_TRIG_READ_ERROR_ACCESS "WC"
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_BITS 0x20000000u
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_MSB 29u
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_LSB 29u
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_ACCESS "WC"
#define DMA_CH6_CTRL_TRIG_BUSY_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_BUSY_BITS 0x04000000u
#define DMA_CH6_CTRL_TRIG_BUSY_MSB 26u
#define DMA_CH6_CTRL_TRIG_BUSY_LSB 26u
#define DMA_CH6_CTRL_TRIG_BUSY_ACCESS "RO"
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_BITS 0x02000000u
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_MSB 25u
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_LSB 25u
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_BSWAP_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_BSWAP_BITS 0x01000000u
#define DMA_CH6_CTRL_TRIG_BSWAP_MSB 24u
#define DMA_CH6_CTRL_TRIG_BSWAP_LSB 24u
#define DMA_CH6_CTRL_TRIG_BSWAP_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_BITS 0x00800000u
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_MSB 23u
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_LSB 23u
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_RESET 0x00u
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_BITS 0x007e0000u
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_MSB 22u
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_LSB 17u
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_VALUE_TIMER0 0x3bu
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_VALUE_TIMER1 0x3cu
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_VALUE_TIMER2 0x3du
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_VALUE_TIMER3 0x3eu
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_VALUE_PERMANENT 0x3fu
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_BITS 0x0001e000u
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_MSB 16u
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_LSB 13u
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_RING_SEL_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_RING_SEL_BITS 0x00001000u
#define DMA_CH6_CTRL_TRIG_RING_SEL_MSB 12u
#define DMA_CH6_CTRL_TRIG_RING_SEL_LSB 12u
#define DMA_CH6_CTRL_TRIG_RING_SEL_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_RING_SIZE_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_RING_SIZE_BITS 0x00000f00u
#define DMA_CH6_CTRL_TRIG_RING_SIZE_MSB 11u
#define DMA_CH6_CTRL_TRIG_RING_SIZE_LSB 8u
#define DMA_CH6_CTRL_TRIG_RING_SIZE_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_RING_SIZE_VALUE_RING_NONE 0x0u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_REV_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_REV_BITS 0x00000080u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_REV_MSB 7u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_REV_LSB 7u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_REV_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_BITS 0x00000040u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_MSB 6u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_LSB 6u
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_INCR_READ_REV_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_INCR_READ_REV_BITS 0x00000020u
#define DMA_CH6_CTRL_TRIG_INCR_READ_REV_MSB 5u
#define DMA_CH6_CTRL_TRIG_INCR_READ_REV_LSB 5u
#define DMA_CH6_CTRL_TRIG_INCR_READ_REV_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_INCR_READ_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_INCR_READ_BITS 0x00000010u
#define DMA_CH6_CTRL_TRIG_INCR_READ_MSB 4u
#define DMA_CH6_CTRL_TRIG_INCR_READ_LSB 4u
#define DMA_CH6_CTRL_TRIG_INCR_READ_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_BITS 0x0000000cu
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_MSB 3u
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_LSB 2u
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_BYTE 0x0u
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_HALFWORD 0x1u
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_VALUE_SIZE_WORD 0x2u
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_BITS 0x00000002u
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_MSB 1u
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_LSB 1u
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_ACCESS "RW"
#define DMA_CH6_CTRL_TRIG_EN_RESET 0x0u
#define DMA_CH6_CTRL_TRIG_EN_BITS 0x00000001u
#define DMA_CH6_CTRL_TRIG_EN_MSB 0u
#define DMA_CH6_CTRL_TRIG_EN_LSB 0u
#define DMA_CH6_CTRL_TRIG_EN_ACCESS "RW"
#define DMA_CH6_AL1_CTRL_OFFSET 0x00000190u
#define DMA_CH6_AL1_CTRL_BITS 0xffffffffu
#define DMA_CH6_AL1_CTRL_RESET "-"
#define DMA_CH6_AL1_CTRL_MSB 31u
#define DMA_CH6_AL1_CTRL_LSB 0u
#define DMA_CH6_AL1_CTRL_ACCESS "RW"
#define DMA_CH6_AL1_READ_ADDR_OFFSET 0x00000194u
#define DMA_CH6_AL1_READ_ADDR_BITS 0xffffffffu
#define DMA_CH6_AL1_READ_ADDR_RESET "-"
#define DMA_CH6_AL1_READ_ADDR_MSB 31u
#define DMA_CH6_AL1_READ_ADDR_LSB 0u
#define DMA_CH6_AL1_READ_ADDR_ACCESS "RW"
#define DMA_CH6_AL1_WRITE_ADDR_OFFSET 0x00000198u
#define DMA_CH6_AL1_WRITE_ADDR_BITS 0xffffffffu
#define DMA_CH6_AL1_WRITE_ADDR_RESET "-"
#define DMA_CH6_AL1_WRITE_ADDR_MSB 31u
#define DMA_CH6_AL1_WRITE_ADDR_LSB 0u
#define DMA_CH6_AL1_WRITE_ADDR_ACCESS "RW"
#define DMA_CH6_AL1_TRANS_COUNT_TRIG_OFFSET 0x0000019cu
#define DMA_CH6_AL1_TRANS_COUNT_TRIG_BITS 0xffffffffu
#define DMA_CH6_AL1_TRANS_COUNT_TRIG_RESET "-"
#define DMA_CH6_AL1_TRANS_COUNT_TRIG_MSB 31u
#define DMA_CH6_AL1_TRANS_COUNT_TRIG_LSB 0u
#define DMA_CH6_AL1_TRANS_COUNT_TRIG_ACCESS "RW"
#define DMA_CH6_AL2_CTRL_OFFSET 0x000001a0u
#define DMA_CH6_AL2_CTRL_BITS 0xffffffffu
#define DMA_CH6_AL2_CTRL_RESET "-"
#define DMA_CH6_AL2_CTRL_MSB 31u
#define DMA_CH6_AL2_CTRL_LSB 0u
#define DMA_CH6_AL2_CTRL_ACCESS "RW"
#define DMA_CH6_AL2_TRANS_COUNT_OFFSET 0x000001a4u
#define DMA_CH6_AL2_TRANS_COUNT_BITS 0xffffffffu
#define DMA_CH6_AL2_TRANS_COUNT_RESET "-"
#define DMA_CH6_AL2_TRANS_COUNT_MSB 31u
#define DMA_CH6_AL2_TRANS_COUNT_LSB 0u
#define DMA_CH6_AL2_TRANS_COUNT_ACCESS "RW"
#define DMA_CH6_AL2_READ_ADDR_OFFSET 0x000001a8u
#define DMA_CH6_AL2_READ_ADDR_BITS 0xffffffffu
#define DMA_CH6_AL2_READ_ADDR_RESET "-"
#define DMA_CH6_AL2_READ_ADDR_MSB 31u
#define DMA_CH6_AL2_READ_ADDR_LSB 0u
#define DMA_CH6_AL2_READ_ADDR_ACCESS "RW"
