gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define DMA_SECCFG_CH4_P_LSB 0u
#define DMA_SECCFG_CH4_P_ACCESS "RW"
#define DMA_SECCFG_CH5_OFFSET 0x00000494u
#define DMA_SECCFG_CH5_BITS 0x00000007u
#define DMA_SECCFG_CH5_RESET 0x00000003u
#define DMA_SECCFG_CH5_LOCK_RESET 0x0u
#define DMA_SECCFG_CH5_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH5_LOCK_MSB 2u
#define DMA_SECCFG_CH5_LOCK_LSB 2u
#define DMA_SECCFG_CH5_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH5_S_RESET 0x1u
#define DMA_SECCFG_CH5_S_BITS 0x00000002u
#define DMA_SECCFG_CH5_S_MSB 1u
#define DMA_SECCFG_CH5_S_LSB 1u
#define DMA_SECCFG_CH5_S_ACCESS "RW"
#define DMA_SECCFG_CH5_P_RESET 0x1u
#define DMA_SECCFG_CH5_P_BITS 0x00000001u
#define DMA_SECCFG_CH5_P_MSB 0u
#define DMA_SECCFG_CH5_P_LSB 0u
#define DMA_SECCFG_CH5_P_ACCESS "RW"
#define DMA_SECCFG_CH6_OFFSET 0x00000498u
#define DMA_SECCFG_CH6_BITS 0x00000007u
#define DMA_SECCFG_CH6_RESET 0x00000003u
#define DMA_SECCFG_CH6_LOCK_RESET 0x0u
#define DMA_SECCFG_CH6_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH6_LOCK_MSB 2u
#define DMA_SECCFG_CH6_LOCK_LSB 2u
#define DMA_SECCFG_CH6_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH6_S_RESET 0x1u
#define DMA_SECCFG_CH6_S_BITS 0x00000002u
#define DMA_SECCFG_CH6_S_MSB 1u
#define DMA_SECCFG_CH6_S_LSB 1u
#define DMA_SECCFG_CH6_S_ACCESS "RW"
#define DMA_SECCFG_CH6_P_RESET 0x1u
#define DMA_SECCFG_CH6_P_BITS 0x00000001u
#define DMA_SECCFG_CH6_P_MSB 0u
#define DMA_SECCFG_CH6_P_LSB 0u
#define DMA_SECCFG_CH6_P_ACCESS "RW"
#define DMA_SECCFG_CH7_OFFSET 0x0000049cu
#define DMA_SECCFG_CH7_BITS 0x00000007u
#define DMA_SECCFG_CH7_RESET 0x00000003u
#define DMA_SECCFG_CH7_LOCK_RESET 0x0u
#define DMA_SECCFG_CH7_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH7_LOCK_MSB 2u
#define DMA_SECCFG_CH7_LOCK_LSB 2u
#define DMA_SECCFG_CH7_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH7_S_RESET 0x1u
#define DMA_SECCFG_CH7_S_BITS 0x00000002u
#define DMA_SECCFG_CH7_S_MSB 1u
#define DMA_SECCFG_CH7_S_LSB 1u
#define DMA_SECCFG_CH7_S_ACCESS "RW"
#define DMA_SECCFG_CH7_P_RESET 0x1u
#define DMA_SECCFG_CH7_P_BITS 0x00000001u
#define DMA_SECCFG_CH7_P_MSB 0u
#define DMA_SECCFG_CH7_P_LSB 0u
#define DMA_SECCFG_CH7_P_ACCESS "RW"
#define DMA_SECCFG_CH8_OFFSET 0x000004a0u
#define DMA_SECCFG_CH8_BITS 0x00000007u
#define DMA_SECCFG_CH8_RESET 0x00000003u
#define DMA_SECCFG_CH8_LOCK_RESET 0x0u
#define DMA_SECCFG_CH8_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH8_LOCK_MSB 2u
#define DMA_SECCFG_CH8_LOCK_LSB 2u
#define DMA_SECCFG_CH8_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH8_S_RESET 0x1u
#define DMA_SECCFG_CH8_S_BITS 0x00000002u
#define DMA_SECCFG_CH8_S_MSB 1u
#define DMA_SECCFG_CH8_S_LSB 1u
#define DMA_SECCFG_CH8_S_ACCESS "RW"
#define DMA_SECCFG_CH8_P_RESET 0x1u
#define DMA_SECCFG_CH8_P_BITS 0x00000001u
#define DMA_SECCFG_CH8_P_MSB 0u
#define DMA_SECCFG_CH8_P_LSB 0u
#define DMA_SECCFG_CH8_P_ACCESS "RW"
#define DMA_SECCFG_CH9_OFFSET 0x000004a4u
#define DMA_SECCFG_CH9_BITS 0x00000007u
#define DMA_SECCFG_CH9_RESET 0x00000003u
#define DMA_SECCFG_CH9_LOCK_RESET 0x0u
#define DMA_SECCFG_CH9_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH9_LOCK_MSB 2u
#define DMA_SECCFG_CH9_LOCK_LSB 2u
#define DMA_SECCFG_CH9_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH9_S_RESET 0x1u
#define DMA_SECCFG_CH9_S_BITS 0x00000002u
#define DMA_SECCFG_CH9_S_MSB 1u
#define DMA_SECCFG_CH9_S_LSB 1u
#define DMA_SECCFG_CH9_S_ACCESS "RW"
#define DMA_SECCFG_CH9_P_RESET 0x1u
#define DMA_SECCFG_CH9_P_BITS 0x00000001u
#define DMA_SECCFG_CH9_P_MSB 0u
#define DMA_SECCFG_CH9_P_LSB 0u
#define DMA_SECCFG_CH9_P_ACCESS "RW"
#define DMA_SECCFG_CH10_OFFSET 0x000004a8u
#define DMA_SECCFG_CH10_BITS 0x00000007u
#define DMA_SECCFG_CH10_RESET 0x00000003u
#define DMA_SECCFG_CH10_LOCK_RESET 0x0u
#define DMA_SECCFG_CH10_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH10_LOCK_MSB 2u
#define DMA_SECCFG_CH10_LOCK_LSB 2u
#define DMA_SECCFG_CH10_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH10_S_RESET 0x1u
#define DMA_SECCFG_CH10_S_BITS 0x00000002u
#define DMA_SECCFG_CH10_S_MSB 1u
#define DMA_SECCFG_CH10_S_LSB 1u
#define DMA_SECCFG_CH10_S_ACCESS "RW"
#define DMA_SECCFG_CH10_P_RESET 0x1u
#define DMA_SECCFG_CH10_P_BITS 0x00000001u
#define DMA_SECCFG_CH10_P_MSB 0u
#define DMA_SECCFG_CH10_P_LSB 0u
#define DMA_SECCFG_CH10_P_ACCESS "RW"
#define DMA_SECCFG_CH11_OFFSET 0x000004acu
#define DMA_SECCFG_CH11_BITS 0x00000007u
#define DMA_SECCFG_CH11_RESET 0x00000003u
#define DMA_SECCFG_CH11_LOCK_RESET 0x0u
#define DMA_SECCFG_CH11_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH11_LOCK_MSB 2u
#define DMA_SECCFG_CH11_LOCK_LSB 2u
#define DMA_SECCFG_CH11_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH11_S_RESET 0x1u
#define DMA_SECCFG_CH11_S_BITS 0x00000002u
#define DMA_SECCFG_CH11_S_MSB 1u
#define DMA_SECCFG_CH11_S_LSB 1u
#define DMA_SECCFG_CH11_S_ACCESS "RW"
#define DMA_SECCFG_CH11_P_RESET 0x1u
#define DMA_SECCFG_CH11_P_BITS 0x00000001u
#define DMA_SECCFG_CH11_P_MSB 0u
#define DMA_SECCFG_CH11_P_LSB 0u
#define DMA_SECCFG_CH11_P_ACCESS "RW"
#define DMA_SECCFG_CH12_OFFSET 0x000004b0u
#define DMA_SECCFG_CH12_BITS 0x00000007u
#define DMA_SECCFG_CH12_RESET 0x00000003u
#define DMA_SECCFG_CH12_LOCK_RESET 0x0u
#define DMA_SECCFG_CH12_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH12_LOCK_MSB 2u
#define DMA_SECCFG_CH12_LOCK_LSB 2u
#define DMA_SECCFG_CH12_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH12_S_RESET 0x1u
#define DMA_SECCFG_CH12_S_BITS 0x00000002u
#define DMA_SECCFG_CH12_S_MSB 1u
#define DMA_SECCFG_CH12_S_LSB 1u
#define DMA_SECCFG_CH12_S_ACCESS "RW"
#define DMA_SECCFG_CH12_P_RESET 0x1u
#define DMA_SECCFG_CH12_P_BITS 0x00000001u
#define DMA_SECCFG_CH12_P_MSB 0u
#define DMA_SECCFG_CH12_P_LSB 0u
#define DMA_SECCFG_CH12_P_ACCESS "RW"
#define DMA_SECCFG_CH13_OFFSET 0x000004b4u
#define DMA_SECCFG_CH13_BITS 0x00000007u
#define DMA_SECCFG_CH13_RESET 0x00000003u
#define DMA_SECCFG_CH13_LOCK_RESET 0x0u
#define DMA_SECCFG_CH13_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH13_LOCK_MSB 2u
#define DMA_SECCFG_CH13_LOCK_LSB 2u
#define DMA_SECCFG_CH13_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH13_S_RESET 0x1u
#define DMA_SECCFG_CH13_S_BITS 0x00000002u
#define DMA_SECCFG_CH13_S_MSB 1u
#define DMA_SECCFG_CH13_S_LSB 1u
#define DMA_SECCFG_CH13_S_ACCESS "RW"
#define DMA_SECCFG_CH13_P_RESET 0x1u
#define DMA_SECCFG_CH13_P_BITS 0x00000001u
#define DMA_SECCFG_CH13_P_MSB 0u
#define DMA_SECCFG_CH13_P_LSB 0u
#define DMA_SECCFG_CH13_P_ACCESS "RW"
#define DMA_SECCFG_CH14_OFFSET 0x000004b8u
#define DMA_SECCFG_CH14_BITS 0x00000007u
#define DMA_SECCFG_CH14_RESET 0x00000003u
#define DMA_SECCFG_CH14_LOCK_RESET 0x0u
#define DMA_SECCFG_CH14_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH14_LOCK_MSB 2u
#define DMA_SECCFG_CH14_LOCK_LSB 2u
#define DMA_SECCFG_CH14_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH14_S_RESET 0x1u
#define DMA_SECCFG_CH14_S_BITS 0x00000002u
#define DMA_SECCFG_CH14_S_MSB 1u
#define DMA_SECCFG_CH14_S_LSB 1u
#define DMA_SECCFG_CH14_S_ACCESS "RW"
#define DMA_SECCFG_CH14_P_RESET 0x1u
#define DMA_SECCFG_CH14_P_BITS 0x00000001u
#define DMA_SECCFG_CH14_P_MSB 0u
#define DMA_SECCFG_CH14_P_LSB 0u
#define DMA_SECCFG_CH14_P_ACCESS "RW"
#define DMA_SECCFG_CH15_OFFSET 0x000004bcu
#define DMA_SECCFG_CH15_BITS 0x00000007u
#define DMA_SECCFG_CH15_RESET 0x00000003u
#define DMA_SECCFG_CH15_LOCK_RESET 0x0u
#define DMA_SECCFG_CH15_LOCK_BITS 0x00000004u
#define DMA_SECCFG_CH15_LOCK_MSB 2u
#define DMA_SECCFG_CH15_LOCK_LSB 2u
#define DMA_SECCFG_CH15_LOCK_ACCESS "RW"
#define DMA_SECCFG_CH15_S_RESET 0x1u
#define DMA_SECCFG_CH15_S_BITS 0x00000002u
#define DMA_SECCFG_CH15_S_MSB 1u
#define DMA_SECCFG_CH15_S_LSB 1u
#define DMA_SECCFG_CH15_S_ACCESS "RW"
#define DMA_SECCFG_CH15_P_RESET 0x1u
#define DMA_SECCFG_CH15_P_BITS 0x00000001u
#define DMA_SECCFG_CH15_P_MSB 0u
#define DMA_SECCFG_CH15_P_LSB 0u
#define DMA_SECCFG_CH15_P_ACCESS "RW"
#define DMA_SECCFG_IRQ0_OFFSET 0x000004c0u
#define DMA_SECCFG_IRQ0_BITS 0x00000003u
#define DMA_SECCFG_IRQ0_RESET 0x00000003u
#define DMA_SECCFG_IRQ0_S_RESET 0x1u
#define DMA_SECCFG_IRQ0_S_BITS 0x00000002u
#define DMA_SECCFG_IRQ0_S_MSB 1u
#define DMA_SECCFG_IRQ0_S_LSB 1u
#define DMA_SECCFG_IRQ0_S_ACCESS "RW"
#define DMA_SECCFG_IRQ0_P_RESET 0x1u
#define DMA_SECCFG_IRQ0_P_BITS 0x00000001u
#define DMA_SECCFG_IRQ0_P_MSB 0u
#define DMA_SECCFG_IRQ0_P_LSB 0u
#define DMA_SECCFG_IRQ0_P_ACCESS "RW"
#define DMA_SECCFG_IRQ1_OFFSET 0x000004c4u
#define DMA_SECCFG_IRQ1_BITS 0x00000003u
#define DMA_SECCFG_IRQ1_RESET 0x00000003u
#define DMA_SECCFG_IRQ1_S_RESET 0x1u
#define DMA_SECCFG_IRQ1_S_BITS 0x00000002u
#define DMA_SECCFG_IRQ1_S_MSB 1u
#define DMA_SECCFG_IRQ1_S_LSB 1u
#define DMA_SECCFG_IRQ1_S_ACCESS "RW"
#define DMA_SECCFG_IRQ1_P_RESET 0x1u
#define DMA_SECCFG_IRQ1_P_BITS 0x00000001u
#define DMA_SECCFG_IRQ1_P_MSB 0u
#define DMA_SECCFG_IRQ1_P_LSB 0u
#define DMA_SECCFG_IRQ1_P_ACCESS "RW"
#define DMA_SECCFG_IRQ2_OFFSET 0x000004c8u
#define DMA_SECCFG_IRQ2_BITS 0x00000003u
#define DMA_SECCFG_IRQ2_RESET 0x00000003u
#define DMA_SECCFG_IRQ2_S_RESET 0x1u
#define DMA_SECCFG_IRQ2_S_BITS 0x00000002u
#define DMA_SECCFG_IRQ2_S_MSB 1u
#define DMA_SECCFG_IRQ2_S_LSB 1u
#define DMA_SECCFG_IRQ2_S_ACCESS "RW"
#define DMA_SECCFG_IRQ2_P_RESET 0x1u
#define DMA_SECCFG_IRQ2_P_BITS 0x00000001u
#define DMA_SECCFG_IRQ2_P_MSB 0u
#define DMA_SECCFG_IRQ2_P_LSB 0u
#define DMA_SECCFG_IRQ2_P_ACCESS "RW"
#define DMA_SECCFG_IRQ3_OFFSET 0x000004ccu
#define DMA_SECCFG_IRQ3_BITS 0x00000003u
#define DMA_SECCFG_IRQ3_RESET 0x00000003u
#define DMA_SECCFG_IRQ3_S_RESET 0x1u
#define DMA_SECCFG_IRQ3_S_BITS 0x00000002u
#define DMA_SECCFG_IRQ3_S_MSB 1u
#define DMA_SECCFG_IRQ3_S_LSB 1u
#define DMA_SECCFG_IRQ3_S_ACCESS "RW"
#define DMA_SECCFG_IRQ3_P_RESET 0x1u
#define DMA_SECCFG_IRQ3_P_BITS 0x00000001u
#define DMA_SECCFG_IRQ3_P_MSB 0u
#define DMA_SECCFG_IRQ3_P_LSB 0u
#define DMA_SECCFG_IRQ3_P_ACCESS "RW"
#define DMA_SECCFG_MISC_OFFSET 0x000004d0u
#define DMA_SECCFG_MISC_BITS 0x000003ffu
#define DMA_SECCFG_MISC_RESET 0x000003ffu
#define DMA_SECCFG_MISC_TIMER3_S_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER3_S_BITS 0x00000200u
#define DMA_SECCFG_MISC_TIMER3_S_MSB 9u
#define DMA_SECCFG_MISC_TIMER3_S_LSB 9u
#define DMA_SECCFG_MISC_TIMER3_S_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER3_P_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER3_P_BITS 0x00000100u
#define DMA_SECCFG_MISC_TIMER3_P_MSB 8u
#define DMA_SECCFG_MISC_TIMER3_P_LSB 8u
#define DMA_SECCFG_MISC_TIMER3_P_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER2_S_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER2_S_BITS 0x00000080u
#define DMA_SECCFG_MISC_TIMER2_S_MSB 7u
#define DMA_SECCFG_MISC_TIMER2_S_LSB 7u
#define DMA_SECCFG_MISC_TIMER2_S_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER2_P_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER2_P_BITS 0x00000040u
#define DMA_SECCFG_MISC_TIMER2_P_MSB 6u
#define DMA_SECCFG_MISC_TIMER2_P_LSB 6u
#define DMA_SECCFG_MISC_TIMER2_P_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER1_S_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER1_S_BITS 0x00000020u
#define DMA_SECCFG_MISC_TIMER1_S_MSB 5u
#define DMA_SECCFG_MISC_TIMER1_S_LSB 5u
#define DMA_SECCFG_MISC_TIMER1_S_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER1_P_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER1_P_BITS 0x00000010u
#define DMA_SECCFG_MISC_TIMER1_P_MSB 4u
#define DMA_SECCFG_MISC_TIMER1_P_LSB 4u
#define DMA_SECCFG_MISC_TIMER1_P_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER0_S_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER0_S_BITS 0x00000008u
#define DMA_SECCFG_MISC_TIMER0_S_MSB 3u
#define DMA_SECCFG_MISC_TIMER0_S_LSB 3u
#define DMA_SECCFG_MISC_TIMER0_S_ACCESS "RW"
#define DMA_SECCFG_MISC_TIMER0_P_RESET 0x1u
#define DMA_SECCFG_MISC_TIMER0_P_BITS 0x00000004u
#define DMA_SECCFG_MISC_TIMER0_P_MSB 2u
#define DMA_SECCFG_MISC_TIMER0_P_LSB 2u
#define DMA_SECCFG_MISC_TIMER0_P_ACCESS "RW"
#define DMA_SECCFG_MISC_SNIFF_S_RESET 0x1u
#define DMA_SECCFG_MISC_SNIFF_S_BITS 0x00000002u
#define DMA_SECCFG_MISC_SNIFF_S_MSB 1u
#define DMA_SECCFG_MISC_SNIFF_S_LSB 1u
#define DMA_SECCFG_MISC_SNIFF_S_ACCESS "RW"
#define DMA_SECCFG_MISC_SNIFF_P_RESET 0x1u
#define DMA_SECCFG_MISC_SNIFF_P_BITS 0x00000001u
#define DMA_SECCFG_MISC_SNIFF_P_MSB 0u
#define DMA_SECCFG_MISC_SNIFF_P_LSB 0u
#define DMA_SECCFG_MISC_SNIFF_P_ACCESS "RW"
#define DMA_MPU_CTRL_OFFSET 0x00000500u
#define DMA_MPU_CTRL_BITS 0x0000000eu
#define DMA_MPU_CTRL_RESET 0x00000000u
#define DMA_MPU_CTRL_NS_HIDE_ADDR_RESET 0x0u
#define DMA_MPU_CTRL_NS_HIDE_ADDR_BITS 0x00000008u
#define DMA_MPU_CTRL_NS_HIDE_ADDR_MSB 3u
#define DMA_MPU_CTRL_NS_HIDE_ADDR_LSB 3u
#define DMA_MPU_CTRL_NS_HIDE_ADDR_ACCESS "RW"
#define DMA_MPU_CTRL_S_RESET 0x0u
#define DMA_MPU_CTRL_S_BITS 0x00000004u
#define DMA_MPU_CTRL_S_MSB 2u
#define DMA_MPU_CTRL_S_LSB 2u
#define DMA_MPU_CTRL_S_ACCESS "RW"
#define DMA_MPU_CTRL_P_RESET 0x0u
#define DMA_MPU_CTRL_P_BITS 0x00000002u
#define DMA_MPU_CTRL_P_MSB 1u
#define DMA_MPU_CTRL_P_LSB 1u
#define DMA_MPU_CTRL_P_ACCESS "RW"
#define DMA_MPU_BAR0_OFFSET 0x00000504u
#define DMA_MPU_BAR0_BITS 0xffffffe0u
#define DMA_MPU_BAR0_RESET 0x00000000u
#define DMA_MPU_BAR0_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR0_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR0_ADDR_MSB 31u
#define DMA_MPU_BAR0_ADDR_LSB 5u
#define DMA_MPU_BAR0_ADDR_ACCESS "RW"
#define DMA_MPU_LAR0_OFFSET 0x00000508u
#define DMA_MPU_LAR0_BITS 0xffffffe7u
#define DMA_MPU_LAR0_RESET 0x00000000u
#define DMA_MPU_LAR0_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR0_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR0_ADDR_MSB 31u
#define DMA_MPU_LAR0_ADDR_LSB 5u
#define DMA_MPU_LAR0_ADDR_ACCESS "RW"
#define DMA_MPU_LAR0_S_RESET 0x0u
#define DMA_MPU_LAR0_S_BITS 0x00000004u
#define DMA_MPU_LAR0_S_MSB 2u
#define DMA_MPU_LAR0_S_LSB 2u
#define DMA_MPU_LAR0_S_ACCESS "RW"
#define DMA_MPU_LAR0_P_RESET 0x0u
#define DMA_MPU_LAR0_P_BITS 0x00000002u
#define DMA_MPU_LAR0_P_MSB 1u
#define DMA_MPU_LAR0_P_LSB 1u
#define DMA_MPU_LAR0_P_ACCESS "RW"
#define DMA_MPU_LAR0_EN_RESET 0x0u
#define DMA_MPU_LAR0_EN_BITS 0x00000001u
#define DMA_MPU_LAR0_EN_MSB 0u
#define DMA_MPU_LAR0_EN_LSB 0u
#define DMA_MPU_LAR0_EN_ACCESS "RW"
#define DMA_MPU_BAR1_OFFSET 0x0000050cu
#define DMA_MPU_BAR1_BITS 0xffffffe0u
#define DMA_MPU_BAR1_RESET 0x00000000u
#define DMA_MPU_BAR1_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR1_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR1_ADDR_MSB 31u
#define DMA_MPU_BAR1_ADDR_LSB 5u
#define DMA_MPU_BAR1_ADDR_ACCESS "RW"
#define DMA_MPU_LAR1_OFFSET 0x00000510u
#define DMA_MPU_LAR1_BITS 0xffffffe7u
#define DMA_MPU_LAR1_RESET 0x00000000u
#define DMA_MPU_LAR1_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR1_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR1_ADDR_MSB 31u
#define DMA_MPU_LAR1_ADDR_LSB 5u
#define DMA_MPU_LAR1_ADDR_ACCESS "RW"
#define DMA_MPU_LAR1_S_RESET 0x0u
#define DMA_MPU_LAR1_S_BITS 0x00000004u
#define DMA_MPU_LAR1_S_MSB 2u
#define DMA_MPU_LAR1_S_LSB 2u
#define DMA_MPU_LAR1_S_ACCESS "RW"
#define DMA_MPU_LAR1_P_RESET 0x0u
#define DMA_MPU_LAR1_P_BITS 0x00000002u
#define DMA_MPU_LAR1_P_MSB 1u
#define DMA_MPU_LAR1_P_LSB 1u
#define DMA_MPU_LAR1_P_ACCESS "RW"
#define DMA_MPU_LAR1_EN_RESET 0x0u
#define DMA_MPU_LAR1_EN_BITS 0x00000001u
#define DMA_MPU_LAR1_EN_MSB 0u
#define DMA_MPU_LAR1_EN_LSB 0u
#define DMA_MPU_LAR1_EN_ACCESS "RW"
#define DMA_MPU_BAR2_OFFSET 0x00000514u
#define DMA_MPU_BAR2_BITS 0xffffffe0u
#define DMA_MPU_BAR2_RESET 0x00000000u
#define DMA_MPU_BAR2_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR2_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR2_ADDR_MSB 31u
#define DMA_MPU_BAR2_ADDR_LSB 5u
#define DMA_MPU_BAR2_ADDR_ACCESS "RW"
#define DMA_MPU_LAR2_OFFSET 0x00000518u
#define DMA_MPU_LAR2_BITS 0xffffffe7u
#define DMA_MPU_LAR2_RESET 0x00000000u
#define DMA_MPU_LAR2_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR2_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR2_ADDR_MSB 31u
#define DMA_MPU_LAR2_ADDR_LSB 5u
#define DMA_MPU_LAR2_ADDR_ACCESS "RW"
#define DMA_MPU_LAR2_S_RESET 0x0u
#define DMA_MPU_LAR2_S_BITS 0x00000004u
#define DMA_MPU_LAR2_S_MSB 2u
#define DMA_MPU_LAR2_S_LSB 2u
#define DMA_MPU_LAR2_S_ACCESS "RW"
#define DMA_MPU_LAR2_P_RESET 0x0u
#define DMA_MPU_LAR2_P_BITS 0x00000002u
#define DMA_MPU_LAR2_P_MSB 1u
#define DMA_MPU_LAR2_P_LSB 1u
#define DMA_MPU_LAR2_P_ACCESS "RW"
#define DMA_MPU_LAR2_EN_RESET 0x0u
#define DMA_MPU_LAR2_EN_BITS 0x00000001u
#define DMA_MPU_LAR2_EN_MSB 0u
#define DMA_MPU_LAR2_EN_LSB 0u
#define DMA_MPU_LAR2_EN_ACCESS "RW"
#define DMA_MPU_BAR3_OFFSET 0x0000051cu
#define DMA_MPU_BAR3_BITS 0xffffffe0u
#define DMA_MPU_BAR3_RESET 0x00000000u
#define DMA_MPU_BAR3_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR3_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR3_ADDR_MSB 31u
#define DMA_MPU_BAR3_ADDR_LSB 5u
#define DMA_MPU_BAR3_ADDR_ACCESS "RW"
#define DMA_MPU_LAR3_OFFSET 0x00000520u
#define DMA_MPU_LAR3_BITS 0xffffffe7u
#define DMA_MPU_LAR3_RESET 0x00000000u
#define DMA_MPU_LAR3_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR3_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR3_ADDR_MSB 31u
#define DMA_MPU_LAR3_ADDR_LSB 5u
#define DMA_MPU_LAR3_ADDR_ACCESS "RW"
#define DMA_MPU_LAR3_S_RESET 0x0u
#define DMA_MPU_LAR3_S_BITS 0x00000004u
#define DMA_MPU_LAR3_S_MSB 2u
#define DMA_MPU_LAR3_S_LSB 2u
#define DMA_MPU_LAR3_S_ACCESS "RW"
#define DMA_MPU_LAR3_P_RESET 0x0u
#define DMA_MPU_LAR3_P_BITS 0x00000002u
#define DMA_MPU_LAR3_P_MSB 1u
#define DMA_MPU_LAR3_P_LSB 1u
#define DMA_MPU_LAR3_P_ACCESS "RW"
#define DMA_MPU_LAR3_EN_RESET 0x0u
#define DMA_MPU_LAR3_EN_BITS 0x00000001u
#define DMA_MPU_LAR3_EN_MSB 0u
#define DMA_MPU_LAR3_EN_LSB 0u
#define DMA_MPU_LAR3_EN_ACCESS "RW"
#define DMA_MPU_BAR4_OFFSET 0x00000524u
#define DMA_MPU_BAR4_BITS 0xffffffe0u
#define DMA_MPU_BAR4_RESET 0x00000000u
#define DMA_MPU_BAR4_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR4_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR4_ADDR_MSB 31u
#define DMA_MPU_BAR4_ADDR_LSB 5u
#define DMA_MPU_BAR4_ADDR_ACCESS "RW"
#define DMA_MPU_LAR4_OFFSET 0x00000528u
#define DMA_MPU_LAR4_BITS 0xffffffe7u
#define DMA_MPU_LAR4_RESET 0x00000000u
#define DMA_MPU_LAR4_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR4_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR4_ADDR_MSB 31u
#define DMA_MPU_LAR4_ADDR_LSB 5u
#define DMA_MPU_LAR4_ADDR_ACCESS "RW"
#define DMA_MPU_LAR4_S_RESET 0x0u
#define DMA_MPU_LAR4_S_BITS 0x00000004u
#define DMA_MPU_LAR4_S_MSB 2u
#define DMA_MPU_LAR4_S_LSB 2u
#define DMA_MPU_LAR4_S_ACCESS "RW"
#define DMA_MPU_LAR4_P_RESET 0x0u
#define DMA_MPU_LAR4_P_BITS 0x00000002u
#define DMA_MPU_LAR4_P_MSB 1u
#define DMA_MPU_LAR4_P_LSB 1u
#define DMA_MPU_LAR4_P_ACCESS "RW"
#define DMA_MPU_LAR4_EN_RESET 0x0u
#define DMA_MPU_LAR4_EN_BITS 0x00000001u
#define DMA_MPU_LAR4_EN_MSB 0u
#define DMA_MPU_LAR4_EN_LSB 0u
#define DMA_MPU_LAR4_EN_ACCESS "RW"
#define DMA_MPU_BAR5_OFFSET 0x0000052cu
#define DMA_MPU_BAR5_BITS 0xffffffe0u
#define DMA_MPU_BAR5_RESET 0x00000000u
#define DMA_MPU_BAR5_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR5_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR5_ADDR_MSB 31u
#define DMA_MPU_BAR5_ADDR_LSB 5u
#define DMA_MPU_BAR5_ADDR_ACCESS "RW"
#define DMA_MPU_LAR5_OFFSET 0x00000530u
#define DMA_MPU_LAR5_BITS 0xffffffe7u
#define DMA_MPU_LAR5_RESET 0x00000000u
#define DMA_MPU_LAR5_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR5_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR5_ADDR_MSB 31u
#define DMA_MPU_LAR5_ADDR_LSB 5u
#define DMA_MPU_LAR5_ADDR_ACCESS "RW"
#define DMA_MPU_LAR5_S_RESET 0x0u
#define DMA_MPU_LAR5_S_BITS 0x00000004u
#define DMA_MPU_LAR5_S_MSB 2u
#define DMA_MPU_LAR5_S_LSB 2u
#define DMA_MPU_LAR5_S_ACCESS "RW"
#define DMA_MPU_LAR5_P_RESET 0x0u
#define DMA_MPU_LAR5_P_BITS 0x00000002u
#define DMA_MPU_LAR5_P_MSB 1u
#define DMA_MPU_LAR5_P_LSB 1u
#define DMA_MPU_LAR5_P_ACCESS "RW"
#define DMA_MPU_LAR5_EN_RESET 0x0u
#define DMA_MPU_LAR5_EN_BITS 0x00000001u
#define DMA_MPU_LAR5_EN_MSB 0u
#define DMA_MPU_LAR5_EN_LSB 0u
#define DMA_MPU_LAR5_EN_ACCESS "RW"
#define DMA_MPU_BAR6_OFFSET 0x00000534u
#define DMA_MPU_BAR6_BITS 0xffffffe0u
#define DMA_MPU_BAR6_RESET 0x00000000u
#define DMA_MPU_BAR6_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR6_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR6_ADDR_MSB 31u
#define DMA_MPU_BAR6_ADDR_LSB 5u
#define DMA_MPU_BAR6_ADDR_ACCESS "RW"
#define DMA_MPU_LAR6_OFFSET 0x00000538u
#define DMA_MPU_LAR6_BITS 0xffffffe7u
#define DMA_MPU_LAR6_RESET 0x00000000u
#define DMA_MPU_LAR6_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR6_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR6_ADDR_MSB 31u
#define DMA_MPU_LAR6_ADDR_LSB 5u
#define DMA_MPU_LAR6_ADDR_ACCESS "RW"
#define DMA_MPU_LAR6_S_RESET 0x0u
#define DMA_MPU_LAR6_S_BITS 0x00000004u
#define DMA_MPU_LAR6_S_MSB 2u
#define DMA_MPU_LAR6_S_LSB 2u
#define DMA_MPU_LAR6_S_ACCESS "RW"
#define DMA_MPU_LAR6_P_RESET 0x0u
#define DMA_MPU_LAR6_P_BITS 0x00000002u
#define DMA_MPU_LAR6_P_MSB 1u
#define DMA_MPU_LAR6_P_LSB 1u
#define DMA_MPU_LAR6_P_ACCESS "RW"
#define DMA_MPU_LAR6_EN_RESET 0x0u
#define DMA_MPU_LAR6_EN_BITS 0x00000001u
#define DMA_MPU_LAR6_EN_MSB 0u
#define DMA_MPU_LAR6_EN_LSB 0u
#define DMA_MPU_LAR6_EN_ACCESS "RW"
#define DMA_MPU_BAR7_OFFSET 0x0000053cu
#define DMA_MPU_BAR7_BITS 0xffffffe0u
#define DMA_MPU_BAR7_RESET 0x00000000u
#define DMA_MPU_BAR7_ADDR_RESET 0x0000000u
#define DMA_MPU_BAR7_ADDR_BITS 0xffffffe0u
#define DMA_MPU_BAR7_ADDR_MSB 31u
#define DMA_MPU_BAR7_ADDR_LSB 5u
#define DMA_MPU_BAR7_ADDR_ACCESS "RW"
#define DMA_MPU_LAR7_OFFSET 0x00000540u
#define DMA_MPU_LAR7_BITS 0xffffffe7u
#define DMA_MPU_LAR7_RESET 0x00000000u
#define DMA_MPU_LAR7_ADDR_RESET 0x0000000u
#define DMA_MPU_LAR7_ADDR_BITS 0xffffffe0u
#define DMA_MPU_LAR7_ADDR_MSB 31u
#define DMA_MPU_LAR7_ADDR_LSB 5u
#define DMA_MPU_LAR7_ADDR_ACCESS "RW"
#define DMA_MPU_LAR7_S_RESET 0x0u
#define DMA_MPU_LAR7_S_BITS 0x00000004u
#define DMA_MPU_LAR7_S_MSB 2u
#define DMA_MPU_LAR7_S_LSB 2u
#define DMA_MPU_LAR7_S_ACCESS "RW"
#define DMA_MPU_LAR7_P_RESET 0x0u
#define DMA_MPU_LAR7_P_BITS 0x00000002u
#define DMA_MPU_LAR7_P_MSB 1u
#define DMA_MPU_LAR7_P_LSB 1u
#define DMA_MPU_LAR7_P_ACCESS "RW"
#define DMA_MPU_LAR7_EN_RESET 0x0u
#define DMA_MPU_LAR7_EN_BITS 0x00000001u
#define DMA_MPU_LAR7_EN_MSB 0u
#define DMA_MPU_LAR7_EN_LSB 0u
#define DMA_MPU_LAR7_EN_ACCESS "RW"
#define DMA_CH0_DBG_CTDREQ_OFFSET 0x00000800u
#define DMA_CH0_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH0_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH0_DBG_CTDREQ_MSB 5u
#define DMA_CH0_DBG_CTDREQ_LSB 0u
#define DMA_CH0_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH0_DBG_TCR_OFFSET 0x00000804u
#define DMA_CH0_DBG_TCR_BITS 0xffffffffu
#define DMA_CH0_DBG_TCR_RESET 0x00000000u
#define DMA_CH0_DBG_TCR_MSB 31u
#define DMA_CH0_DBG_TCR_LSB 0u
#define DMA_CH0_DBG_TCR_ACCESS "RO"
#define DMA_CH1_DBG_CTDREQ_OFFSET 0x00000840u
#define DMA_CH1_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH1_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH1_DBG_CTDREQ_MSB 5u
#define DMA_CH1_DBG_CTDREQ_LSB 0u
#define DMA_CH1_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH1_DBG_TCR_OFFSET 0x00000844u
#define DMA_CH1_DBG_TCR_BITS 0xffffffffu
#define DMA_CH1_DBG_TCR_RESET 0x00000000u
#define DMA_CH1_DBG_TCR_MSB 31u
#define DMA_CH1_DBG_TCR_LSB 0u
#define DMA_CH1_DBG_TCR_ACCESS "RO"
#define DMA_CH2_DBG_CTDREQ_OFFSET 0x00000880u
#define DMA_CH2_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH2_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH2_DBG_CTDREQ_MSB 5u
#define DMA_CH2_DBG_CTDREQ_LSB 0u
#define DMA_CH2_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH2_DBG_TCR_OFFSET 0x00000884u
#define DMA_CH2_DBG_TCR_BITS 0xffffffffu
#define DMA_CH2_DBG_TCR_RESET 0x00000000u
#define DMA_CH2_DBG_TCR_MSB 31u
#define DMA_CH2_DBG_TCR_LSB 0u
#define DMA_CH2_DBG_TCR_ACCESS "RO"
#define DMA_CH3_DBG_CTDREQ_OFFSET 0x000008c0u
#define DMA_CH3_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH3_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH3_DBG_CTDREQ_MSB 5u
#define DMA_CH3_DBG_CTDREQ_LSB 0u
#define DMA_CH3_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH3_DBG_TCR_OFFSET 0x000008c4u
#define DMA_CH3_DBG_TCR_BITS 0xffffffffu
#define DMA_CH3_DBG_TCR_RESET 0x00000000u
#define DMA_CH3_DBG_TCR_MSB 31u
#define DMA_CH3_DBG_TCR_LSB 0u
#define DMA_CH3_DBG_TCR_ACCESS "RO"
#define DMA_CH4_DBG_CTDREQ_OFFSET 0x00000900u
#define DMA_CH4_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH4_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH4_DBG_CTDREQ_MSB 5u
#define DMA_CH4_DBG_CTDREQ_LSB 0u
#define DMA_CH4_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH4_DBG_TCR_OFFSET 0x00000904u
#define DMA_CH4_DBG_TCR_BITS 0xffffffffu
#define DMA_CH4_DBG_TCR_RESET 0x00000000u
#define DMA_CH4_DBG_TCR_MSB 31u
#define DMA_CH4_DBG_TCR_LSB 0u
#define DMA_CH4_DBG_TCR_ACCESS "RO"
#define DMA_CH5_DBG_CTDREQ_OFFSET 0x00000940u
