gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define DMA_CH5_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH5_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH5_DBG_CTDREQ_MSB 5u
#define DMA_CH5_DBG_CTDREQ_LSB 0u
#define DMA_CH5_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH5_DBG_TCR_OFFSET 0x00000944u
#define DMA_CH5_DBG_TCR_BITS 0xffffffffu
#define DMA_CH5_DBG_TCR_RESET 0x00000000u
#define DMA_CH5_DBG_TCR_MSB 31u
#define DMA_CH5_DBG_TCR_LSB 0u
#define DMA_CH5_DBG_TCR_ACCESS "RO"
#define DMA_CH6_DBG_CTDREQ_OFFSET 0x00000980u
#define DMA_CH6_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH6_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH6_DBG_CTDREQ_MSB 5u
#define DMA_CH6_DBG_CTDREQ_LSB 0u
#define DMA_CH6_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH6_DBG_TCR_OFFSET 0x00000984u
#define DMA_CH6_DBG_TCR_BITS 0xffffffffu
#define DMA_CH6_DBG_TCR_RESET 0x00000000u
#define DMA_CH6_DBG_TCR_MSB 31u
#define DMA_CH6_DBG_TCR_LSB 0u
#define DMA_CH6_DBG_TCR_ACCESS "RO"
#define DMA_CH7_DBG_CTDREQ_OFFSET 0x000009c0u
#define DMA_CH7_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH7_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH7_DBG_CTDREQ_MSB 5u
#define DMA_CH7_DBG_CTDREQ_LSB 0u
#define DMA_CH7_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH7_DBG_TCR_OFFSET 0x000009c4u
#define DMA_CH7_DBG_TCR_BITS 0xffffffffu
#define DMA_CH7_DBG_TCR_RESET 0x00000000u
#define DMA_CH7_DBG_TCR_MSB 31u
#define DMA_CH7_DBG_TCR_LSB 0u
#define DMA_CH7_DBG_TCR_ACCESS "RO"
#define DMA_CH8_DBG_CTDREQ_OFFSET 0x00000a00u
#define DMA_CH8_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH8_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH8_DBG_CTDREQ_MSB 5u
#define DMA_CH8_DBG_CTDREQ_LSB 0u
#define DMA_CH8_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH8_DBG_TCR_OFFSET 0x00000a04u
#define DMA_CH8_DBG_TCR_BITS 0xffffffffu
#define DMA_CH8_DBG_TCR_RESET 0x00000000u
#define DMA_CH8_DBG_TCR_MSB 31u
#define DMA_CH8_DBG_TCR_LSB 0u
#define DMA_CH8_DBG_TCR_ACCESS "RO"
#define DMA_CH9_DBG_CTDREQ_OFFSET 0x00000a40u
#define DMA_CH9_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH9_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH9_DBG_CTDREQ_MSB 5u
#define DMA_CH9_DBG_CTDREQ_LSB 0u
#define DMA_CH9_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH9_DBG_TCR_OFFSET 0x00000a44u
#define DMA_CH9_DBG_TCR_BITS 0xffffffffu
#define DMA_CH9_DBG_TCR_RESET 0x00000000u
#define DMA_CH9_DBG_TCR_MSB 31u
#define DMA_CH9_DBG_TCR_LSB 0u
#define DMA_CH9_DBG_TCR_ACCESS "RO"
#define DMA_CH10_DBG_CTDREQ_OFFSET 0x00000a80u
#define DMA_CH10_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH10_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH10_DBG_CTDREQ_MSB 5u
#define DMA_CH10_DBG_CTDREQ_LSB 0u
#define DMA_CH10_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH10_DBG_TCR_OFFSET 0x00000a84u
#define DMA_CH10_DBG_TCR_BITS 0xffffffffu
#define DMA_CH10_DBG_TCR_RESET 0x00000000u
#define DMA_CH10_DBG_TCR_MSB 31u
#define DMA_CH10_DBG_TCR_LSB 0u
#define DMA_CH10_DBG_TCR_ACCESS "RO"
#define DMA_CH11_DBG_CTDREQ_OFFSET 0x00000ac0u
#define DMA_CH11_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH11_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH11_DBG_CTDREQ_MSB 5u
#define DMA_CH11_DBG_CTDREQ_LSB 0u
#define DMA_CH11_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH11_DBG_TCR_OFFSET 0x00000ac4u
#define DMA_CH11_DBG_TCR_BITS 0xffffffffu
#define DMA_CH11_DBG_TCR_RESET 0x00000000u
#define DMA_CH11_DBG_TCR_MSB 31u
#define DMA_CH11_DBG_TCR_LSB 0u
#define DMA_CH11_DBG_TCR_ACCESS "RO"
#define DMA_CH12_DBG_CTDREQ_OFFSET 0x00000b00u
#define DMA_CH12_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH12_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH12_DBG_CTDREQ_MSB 5u
#define DMA_CH12_DBG_CTDREQ_LSB 0u
#define DMA_CH12_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH12_DBG_TCR_OFFSET 0x00000b04u
#define DMA_CH12_DBG_TCR_BITS 0xffffffffu
#define DMA_CH12_DBG_TCR_RESET 0x00000000u
#define DMA_CH12_DBG_TCR_MSB 31u
#define DMA_CH12_DBG_TCR_LSB 0u
#define DMA_CH12_DBG_TCR_ACCESS "RO"
#define DMA_CH13_DBG_CTDREQ_OFFSET 0x00000b40u
#define DMA_CH13_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH13_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH13_DBG_CTDREQ_MSB 5u
#define DMA_CH13_DBG_CTDREQ_LSB 0u
#define DMA_CH13_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH13_DBG_TCR_OFFSET 0x00000b44u
#define DMA_CH13_DBG_TCR_BITS 0xffffffffu
#define DMA_CH13_DBG_TCR_RESET 0x00000000u
#define DMA_CH13_DBG_TCR_MSB 31u
#define DMA_CH13_DBG_TCR_LSB 0u
#define DMA_CH13_DBG_TCR_ACCESS "RO"
#define DMA_CH14_DBG_CTDREQ_OFFSET 0x00000b80u
#define DMA_CH14_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH14_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH14_DBG_CTDREQ_MSB 5u
#define DMA_CH14_DBG_CTDREQ_LSB 0u
#define DMA_CH14_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH14_DBG_TCR_OFFSET 0x00000b84u
#define DMA_CH14_DBG_TCR_BITS 0xffffffffu
#define DMA_CH14_DBG_TCR_RESET 0x00000000u
#define DMA_CH14_DBG_TCR_MSB 31u
#define DMA_CH14_DBG_TCR_LSB 0u
#define DMA_CH14_DBG_TCR_ACCESS "RO"
#define DMA_CH15_DBG_CTDREQ_OFFSET 0x00000bc0u
#define DMA_CH15_DBG_CTDREQ_BITS 0x0000003fu
#define DMA_CH15_DBG_CTDREQ_RESET 0x00000000u
#define DMA_CH15_DBG_CTDREQ_MSB 5u
#define DMA_CH15_DBG_CTDREQ_LSB 0u
#define DMA_CH15_DBG_CTDREQ_ACCESS "WC"
#define DMA_CH15_DBG_TCR_OFFSET 0x00000bc4u
#define DMA_CH15_DBG_TCR_BITS 0xffffffffu
#define DMA_CH15_DBG_TCR_RESET 0x00000000u
#define DMA_CH15_DBG_TCR_MSB 31u
#define DMA_CH15_DBG_TCR_LSB 0u
#define DMA_CH15_DBG_TCR_ACCESS "RO"
#define _HARDWARE_STRUCTS_DMA_DEBUG_H 
typedef struct {
   
    io_rw_32 dbg_ctdreq;
   
    io_ro_32 dbg_tcr;
    uint32_t _pad0[14];
} dma_debug_channel_hw_t;
typedef struct {
    dma_debug_channel_hw_t ch[16];
} dma_debug_hw_t;
static dma_debug_hw_t * const dma_debug_hw = (dma_debug_hw_t *)(DMA_BASE + DMA_CH0_DBG_CTDREQ_OFFSET); // ORIGINAL: #define dma_debug_hw ((dma_debug_hw_t *)(DMA_BASE + DMA_CH0_DBG_CTDREQ_OFFSET))
typedef struct {
   
    io_rw_32 read_addr;
   
    io_rw_32 write_addr;
   
    io_rw_32 transfer_count;
   
    io_rw_32 ctrl_trig;
   
    io_rw_32 al1_ctrl;
   
    io_rw_32 al1_read_addr;
   
    io_rw_32 al1_write_addr;
   
    io_rw_32 al1_transfer_count_trig;
   
    io_rw_32 al2_ctrl;
   
    io_rw_32 al2_transfer_count;
   
    io_rw_32 al2_read_addr;
   
    io_rw_32 al2_write_addr_trig;
   
    io_rw_32 al3_ctrl;
   
    io_rw_32 al3_write_addr;
   
    io_rw_32 al3_transfer_count;
   
    io_rw_32 al3_read_addr_trig;
} dma_channel_hw_t;
