gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef struct {
   
    io_rw_32 bar;
   
    io_rw_32 lar;
} dma_mpu_region_hw_t;
typedef struct {
   
    io_rw_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_rw_32 ints;
} dma_irq_ctrl_hw_t;
typedef struct {
    dma_channel_hw_t ch[16];
    union {
        struct {
           
            io_rw_32 intr;
           
            io_rw_32 inte0;
           
            io_rw_32 intf0;
           
            io_rw_32 ints0;
            uint32_t __pad0;
           
            io_rw_32 inte1;
           
            io_rw_32 intf1;
           
            io_rw_32 ints1;
            uint32_t __pad1;
           
            io_rw_32 inte2;
           
            io_rw_32 intf2;
           
            io_rw_32 ints2;
            uint32_t __pad2;
           
            io_rw_32 inte3;
           
            io_rw_32 intf3;
           
            io_rw_32 ints3;
        };
        dma_irq_ctrl_hw_t irq_ctrl[4];
    };
   
    io_rw_32 timer[4];
   
    io_wo_32 multi_channel_trigger;
   
    io_rw_32 sniff_ctrl;
   
    io_rw_32 sniff_data;
    uint32_t _pad0;
   
    io_ro_32 fifo_levels;
   
    io_wo_32 abort;
   
    io_ro_32 n_channels;
    uint32_t _pad1[5];
   
    io_rw_32 seccfg_ch[16];
   
    io_rw_32 seccfg_irq[4];
   
    io_rw_32 seccfg_misc;
    uint32_t _pad2[11];
   
    io_rw_32 mpu_ctrl;
    dma_mpu_region_hw_t mpu_region[8];
} dma_hw_t;
static dma_hw_t * const dma_hw = (dma_hw_t *)DMA_BASE; // ORIGINAL: #define dma_hw ((dma_hw_t *)DMA_BASE)
_Static_assert(sizeof (dma_hw_t) == 0x0544, "");
#define _DREQ_H 
typedef enum dreq_num_rp2350 {
    DREQ_PIO0_TX0 = 0,
    DREQ_PIO0_TX1 = 1,
    DREQ_PIO0_TX2 = 2,
    DREQ_PIO0_TX3 = 3,
    DREQ_PIO0_RX0 = 4,
    DREQ_PIO0_RX1 = 5,
    DREQ_PIO0_RX2 = 6,
    DREQ_PIO0_RX3 = 7,
    DREQ_PIO1_TX0 = 8,
    DREQ_PIO1_TX1 = 9,
    DREQ_PIO1_TX2 = 10,
    DREQ_PIO1_TX3 = 11,
    DREQ_PIO1_RX0 = 12,
    DREQ_PIO1_RX1 = 13,
    DREQ_PIO1_RX2 = 14,
    DREQ_PIO1_RX3 = 15,
    DREQ_PIO2_TX0 = 16,
    DREQ_PIO2_TX1 = 17,
    DREQ_PIO2_TX2 = 18,
    DREQ_PIO2_TX3 = 19,
    DREQ_PIO2_RX0 = 20,
    DREQ_PIO2_RX1 = 21,
    DREQ_PIO2_RX2 = 22,
    DREQ_PIO2_RX3 = 23,
    DREQ_SPI0_TX = 24,
    DREQ_SPI0_RX = 25,
    DREQ_SPI1_TX = 26,
    DREQ_SPI1_RX = 27,
    DREQ_UART0_TX = 28,
    DREQ_UART0_RX = 29,
    DREQ_UART1_TX = 30,
    DREQ_UART1_RX = 31,
    DREQ_PWM_WRAP0 = 32,
    DREQ_PWM_WRAP1 = 33,
    DREQ_PWM_WRAP2 = 34,
    DREQ_PWM_WRAP3 = 35,
    DREQ_PWM_WRAP4 = 36,
    DREQ_PWM_WRAP5 = 37,
    DREQ_PWM_WRAP6 = 38,
    DREQ_PWM_WRAP7 = 39,
    DREQ_PWM_WRAP8 = 40,
    DREQ_PWM_WRAP9 = 41,
    DREQ_PWM_WRAP10 = 42,
    DREQ_PWM_WRAP11 = 43,
    DREQ_I2C0_TX = 44,
    DREQ_I2C0_RX = 45,
    DREQ_I2C1_TX = 46,
    DREQ_I2C1_RX = 47,
    DREQ_ADC = 48,
    DREQ_XIP_STREAM = 49,
    DREQ_XIP_QMITX = 50,
    DREQ_XIP_QMIRX = 51,
    DREQ_HSTX = 52,
    DREQ_CORESIGHT = 53,
    DREQ_SHA256 = 54,
    DREQ_DMA_TIMER0 = 59,
    DREQ_DMA_TIMER1 = 60,
    DREQ_DMA_TIMER2 = 61,
    DREQ_DMA_TIMER3 = 62,
    DREQ_FORCE = 63,
    DREQ_COUNT
} dreq_num_t;
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_DMA 0
#define DMA_IRQ_NUM(irq_index) (DMA_IRQ_0 + (irq_index))
static inline void check_dma_channel_param(__attribute__((__unused__)) uint channel) {
}
static inline void check_dma_timer_param(__attribute__((__unused__)) uint timer_num) {
    ({if (((0 || 0) && !0)) ((timer_num < 4u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 68, __func__, "timer_num < 4u"));});
}
inline static dma_channel_hw_t *dma_channel_hw_addr(uint channel) {
    check_dma_channel_param(channel);
    return &((dma_hw_t *)0x50000000u)->ch[channel];
}
void dma_channel_claim(uint channel);
void dma_claim_mask(uint32_t channel_mask);
void dma_channel_unclaim(uint channel);
void dma_unclaim_mask(uint32_t channel_mask);
int dma_claim_unused_channel(_Bool required);
_Bool dma_channel_is_claimed(uint channel);
typedef enum dma_channel_transfer_size {
    DMA_SIZE_8 = 0,
    DMA_SIZE_16 = 1,
    DMA_SIZE_32 = 2
} dma_channel_transfer_size_t;
typedef enum dma_address_update_type {
    DMA_ADDRESS_UPDATE_NONE = 0,
    DMA_ADDRESS_UPDATE_INCREMENT = 1,
    DMA_ADDRESS_UPDATE_INCREMENT_BY_TWO = 2,
    DMA_ADDRESS_UPDATE_DECREMENT = 3,
} dma_address_update_type_t;
typedef struct {
    uint32_t ctrl;
} dma_channel_config_t;
typedef dma_channel_config_t dma_channel_config;
#define DMA_ADDRESS_UPDATE_TYPE_TO_DMA_CH_CTRL_READ_BITS(u) ((((u)&1) << DMA_CH0_CTRL_TRIG_INCR_READ_LSB) | (((u)&2) << (DMA_CH0_CTRL_TRIG_INCR_READ_REV_LSB - 1)))
#define DMA_ADDRESS_UPDATE_TYPE_TO_DMA_CH_CTRL_WRITE_BITS(u) ((((u)&1) << DMA_CH0_CTRL_TRIG_INCR_WRITE_LSB) | (((u)&2) << (DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_LSB - 1)))
#define DMA_CH_CTRL_ALL_ADDRESS_UPDATE_READ_BITS (DMA_CH0_CTRL_TRIG_INCR_READ_BITS | DMA_CH0_CTRL_TRIG_INCR_READ_REV_BITS)
#define DMA_CH_CTRL_ALL_ADDRESS_UPDATE_WRITE_BITS (DMA_CH0_CTRL_TRIG_INCR_WRITE_BITS | DMA_CH0_CTRL_TRIG_INCR_WRITE_REV_BITS)
static inline void channel_config_set_read_address_update_type(dma_channel_config_t *c, dma_address_update_type_t update_type) {
    c->ctrl = (c->ctrl & ~(0x00000010u | 0x00000020u)) |
        ((((update_type)&1) << 4u) | (((update_type)&2) << (5u - 1)));
}
static inline void channel_config_set_write_address_update_type(dma_channel_config_t *c, dma_address_update_type_t update_type) {
    c->ctrl = (c->ctrl & ~(0x00000040u | 0x00000080u)) |
        ((((update_type)&1) << 6u) | (((update_type)&2) << (7u - 1)));
}
static inline void channel_config_set_read_increment(dma_channel_config_t *c, _Bool incr) {
    channel_config_set_read_address_update_type(c, incr ? DMA_ADDRESS_UPDATE_INCREMENT : DMA_ADDRESS_UPDATE_NONE);
}
static inline void channel_config_set_write_increment(dma_channel_config_t *c, _Bool incr) {
    channel_config_set_write_address_update_type(c, incr ? DMA_ADDRESS_UPDATE_INCREMENT : DMA_ADDRESS_UPDATE_NONE);
}
static inline void channel_config_set_dreq(dma_channel_config_t *c, uint dreq) {
    ((dreq <= DREQ_FORCE) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 283, __func__, "dreq <= DREQ_FORCE"));
    c->ctrl = (c->ctrl & ~0x007e0000u) | (dreq << 17u);
}
static inline void channel_config_set_chain_to(dma_channel_config_t *c, uint chain_to) {
    ((chain_to <= 16u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 297, __func__, "chain_to <= NUM_DMA_CHANNELS"));
    c->ctrl = (c->ctrl & ~0x0001e000u) | (chain_to << 13u);
}
static inline void channel_config_set_transfer_data_size(dma_channel_config_t *c, dma_channel_transfer_size_t size) {
    ((size == DMA_SIZE_8 || size == DMA_SIZE_16 || size == DMA_SIZE_32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 311, __func__, "size == DMA_SIZE_8 || size == DMA_SIZE_16 || size == DMA_SIZE_32"));
    c->ctrl = (c->ctrl & ~0x0000000cu) | (((uint)size) << 2u);
}
static inline void channel_config_set_ring(dma_channel_config_t *c, _Bool write, uint size_bits) {
    ((size_bits < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 331, __func__, "size_bits < 32"));
    c->ctrl = (c->ctrl & ~(0x00000f00u | 0x00001000u)) |
              (size_bits << 8u) |
              (write ? 0x00001000u : 0);
}
static inline void channel_config_set_bswap(dma_channel_config_t *c, _Bool bswap) {
    c->ctrl = bswap ? (c->ctrl | 0x01000000u) : (c->ctrl & ~0x01000000u);
}
static inline void channel_config_set_irq_quiet(dma_channel_config_t *c, _Bool irq_quiet) {
    c->ctrl = irq_quiet ? (c->ctrl | 0x00800000u) : (c->ctrl & ~0x00800000u);
}
static inline void channel_config_set_high_priority(dma_channel_config_t *c, _Bool high_priority) {
    c->ctrl = high_priority ? (c->ctrl | 0x00000002u) : (c->ctrl & ~0x00000002u);
}
static inline void channel_config_set_enable(dma_channel_config_t *c, _Bool enable) {
    c->ctrl = enable ? (c->ctrl | 0x00000001u) : (c->ctrl & ~0x00000001u);
}
static inline void channel_config_set_sniff_enable(dma_channel_config_t *c, _Bool sniff_enable) {
    c->ctrl = sniff_enable ? (c->ctrl | 0x02000000u) : (c->ctrl &
                                                                             ~0x02000000u);
}
static inline dma_channel_config_t dma_channel_get_default_config(uint channel) {
    dma_channel_config_t c = {0};
    channel_config_set_read_increment(&c, 1);
    channel_config_set_write_increment(&c, 0);
    channel_config_set_dreq(&c, DREQ_FORCE);
    channel_config_set_chain_to(&c, channel);
    channel_config_set_transfer_data_size(&c, DMA_SIZE_32);
    channel_config_set_ring(&c, 0, 0);
    channel_config_set_bswap(&c, 0);
    channel_config_set_irq_quiet(&c, 0);
    channel_config_set_enable(&c, 1);
    channel_config_set_sniff_enable(&c, 0);
    channel_config_set_high_priority( &c, 0);
    return c;
}
static inline dma_channel_config_t dma_get_channel_config(uint channel) {
    dma_channel_config_t c;
    c.ctrl = dma_channel_hw_addr(channel)->ctrl_trig;
    return c;
}
static inline uint32_t channel_config_get_ctrl_value(const dma_channel_config_t *config) {
    return config->ctrl;
}
static inline void dma_channel_set_config(uint channel, const dma_channel_config_t *config, _Bool trigger) {
    if (!trigger) {
        dma_channel_hw_addr(channel)->al1_ctrl = channel_config_get_ctrl_value(config);
    } else {
        dma_channel_hw_addr(channel)->ctrl_trig = channel_config_get_ctrl_value(config);
    }
}
static inline void dma_channel_set_read_addr(uint channel, const volatile void *read_addr, _Bool trigger) {
    if (!trigger) {
        dma_channel_hw_addr(channel)->read_addr = (uintptr_t) read_addr;
    } else {
        dma_channel_hw_addr(channel)->al3_read_addr_trig = (uintptr_t) read_addr;
    }
}
static inline void dma_channel_set_write_addr(uint channel, volatile void *write_addr, _Bool trigger) {
    if (!trigger) {
        dma_channel_hw_addr(channel)->write_addr = (uintptr_t) write_addr;
    } else {
        dma_channel_hw_addr(channel)->al2_write_addr_trig = (uintptr_t) write_addr;
    }
}
static inline uint32_t dma_encode_transfer_count(uint transfer_count) {
    ({if (((0 || 0) && !0)) ((!(transfer_count & 0xf0000000u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 533, __func__, "!(transfer_count & 0xf0000000u)"));});
    return transfer_count & 0x0fffffffu;
}
static inline uint32_t dma_encode_transfer_count_with_self_trigger(uint transfer_count) {
    return dma_encode_transfer_count(transfer_count) | (0x1u << 28u);
}
static inline uint32_t dma_encode_endless_transfer_count(void) {
    _Static_assert(0xfu == 0xf);
    _Static_assert(28u == 28);
    return 0xffffffffu;
}
static inline void dma_channel_set_transfer_count(uint channel, uint32_t encoded_transfer_count, _Bool trigger) {
    if (!trigger) {
        dma_channel_hw_addr(channel)->transfer_count = encoded_transfer_count;
    } else {
        dma_channel_hw_addr(channel)->al1_transfer_count_trig = encoded_transfer_count;
    }
}
static inline void dma_channel_set_trans_count(uint channel, uint32_t trans_count, _Bool trigger) {
    dma_channel_set_transfer_count(channel, trans_count, trigger);
}
static inline void dma_channel_configure(uint channel, const dma_channel_config_t *config, volatile void *write_addr,
                                         const volatile void *read_addr,
                                         uint32_t encoded_transfer_count, _Bool trigger) {
    dma_channel_set_read_addr(channel, read_addr, 0);
    dma_channel_set_write_addr(channel, write_addr, 0);
    dma_channel_set_transfer_count(channel, encoded_transfer_count, 0);
    dma_channel_set_config(channel, config, trigger);
}
inline static void __attribute__((always_inline)) dma_channel_transfer_from_buffer_now(uint channel,
                                                                                       const volatile void *read_addr,
                                                                                       uint32_t encoded_transfer_count) {
    dma_channel_hw_t *hw = dma_channel_hw_addr(channel);
    hw->read_addr = (uintptr_t) read_addr;
    hw->al1_transfer_count_trig = encoded_transfer_count;
}
inline static void dma_channel_transfer_to_buffer_now(uint channel, volatile void *write_addr, uint32_t encoded_transfer_count) {
    dma_channel_hw_t *hw = dma_channel_hw_addr(channel);
    hw->write_addr = (uintptr_t) write_addr;
    hw->al1_transfer_count_trig = encoded_transfer_count;
}
static inline void dma_start_channel_mask(uint32_t chan_mask) {
    ({if (((0 || 0) && !0)) ((chan_mask && chan_mask < (1u << 16u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 705, __func__, "chan_mask && chan_mask < (1u << 16u)"));});
    ((dma_hw_t *)0x50000000u)->multi_channel_trigger = chan_mask;
}
static inline void dma_channel_start(uint channel) {
    dma_start_channel_mask(1u << channel);
}
static inline void dma_channel_abort(uint channel) {
    check_dma_channel_param(channel);
    ((dma_hw_t *)0x50000000u)->abort = 1u << channel;
    while (((dma_hw_t *)0x50000000u)->ch[channel].ctrl_trig & 0x04000000u) tight_loop_contents();
}
static inline void dma_channel_set_irq0_enabled(uint channel, _Bool enabled) {
    check_dma_channel_param(channel);
    _Static_assert(__builtin_offsetof (dma_hw_t, inte0) == (0x00000404u), "hw offset mismatch");
    if (enabled)
        hw_set_bits(&((dma_hw_t *)0x50000000u)->inte0, 1u << channel);
    else
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->inte0, 1u << channel);
}
static inline void dma_set_irq0_channel_mask_enabled(uint32_t channel_mask, _Bool enabled) {
    if (enabled) {
        hw_set_bits(&((dma_hw_t *)0x50000000u)->inte0, channel_mask);
    } else {
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->inte0, channel_mask);
    }
}
static inline void dma_channel_set_irq1_enabled(uint channel, _Bool enabled) {
    check_dma_channel_param(channel);
    _Static_assert(__builtin_offsetof (dma_hw_t, inte1) == (0x00000414u), "hw offset mismatch");
    if (enabled)
        hw_set_bits(&((dma_hw_t *)0x50000000u)->inte1, 1u << channel);
    else
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->inte1, 1u << channel);
}
static inline void dma_set_irq1_channel_mask_enabled(uint32_t channel_mask, _Bool enabled) {
    if (enabled) {
        hw_set_bits(&((dma_hw_t *)0x50000000u)->inte1, channel_mask);
    } else {
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->inte1, channel_mask);
    }
}
static inline void dma_irqn_set_channel_enabled(uint irq_index, uint channel, _Bool enabled) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 4u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 832, __func__, "!(irq_index >= 4u)"));});
    if (enabled)
        hw_set_bits(&((dma_hw_t *)0x50000000u)->irq_ctrl[irq_index].inte, 1u << channel);
    else
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->irq_ctrl[irq_index].inte, 1u << channel);
}
static inline void dma_irqn_set_channel_mask_enabled(uint irq_index, uint32_t channel_mask, _Bool enabled) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 4u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 848, __func__, "!(irq_index >= 4u)"));});
    if (enabled) {
        hw_set_bits(&((dma_hw_t *)0x50000000u)->irq_ctrl[irq_index].inte, channel_mask);
    } else {
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->irq_ctrl[irq_index].inte, channel_mask);
    }
}
static inline _Bool dma_channel_get_irq0_status(uint channel) {
    check_dma_channel_param(channel);
    return ((dma_hw_t *)0x50000000u)->ints0 & (1u << channel);
}
static inline _Bool dma_channel_get_irq1_status(uint channel) {
    check_dma_channel_param(channel);
    return ((dma_hw_t *)0x50000000u)->ints1 & (1u << channel);
}
static inline _Bool dma_irqn_get_channel_status(uint irq_index, uint channel) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 4u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 886, __func__, "!(irq_index >= 4u)"));});
    check_dma_channel_param(channel);
    return ((dma_hw_t *)0x50000000u)->irq_ctrl[irq_index].ints & (1u << channel);
}
static inline void dma_channel_acknowledge_irq0(uint channel) {
    check_dma_channel_param(channel);
    ((dma_hw_t *)0x50000000u)->ints0 = 1u << channel;
}
static inline void dma_channel_acknowledge_irq1(uint channel) {
    check_dma_channel_param(channel);
    ((dma_hw_t *)0x50000000u)->ints1 = 1u << channel;
}
static inline void dma_irqn_acknowledge_channel(uint irq_index, uint channel) {
    ({if (((0 || 0) && !0)) ((!(irq_index >= 4u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 918, __func__, "!(irq_index >= 4u)"));});
    check_dma_channel_param(channel);
    ((dma_hw_t *)0x50000000u)->irq_ctrl[irq_index].ints = 1u << channel;
}
inline static _Bool dma_channel_is_busy(uint channel) {
    check_dma_channel_param(channel);
    return ((dma_hw_t *)0x50000000u)->ch[channel].al1_ctrl & 0x04000000u;
}
inline static void dma_channel_wait_for_finish_blocking(uint channel) {
    while (dma_channel_is_busy(channel)) tight_loop_contents();
    __compiler_memory_barrier();
}
inline static void dma_sniffer_enable(uint channel, uint mode, _Bool force_channel_enable) {
    check_dma_channel_param(channel);
    _Static_assert(__builtin_offsetof (dma_hw_t, sniff_ctrl) == (0x00000454u), "hw offset mismatch");
    if (force_channel_enable) {
        hw_set_bits(&((dma_hw_t *)0x50000000u)->ch[channel].al1_ctrl, 0x02000000u);
    }
    hw_write_masked(&((dma_hw_t *)0x50000000u)->sniff_ctrl,
        (((channel << 1u) & 0x0000001eu) |
         ((mode << 5u) & 0x000001e0u) |
         0x00000001u),
        (0x0000001eu |
         0x000001e0u |
         0x00000001u));
}
inline static void dma_sniffer_set_byte_swap_enabled(_Bool swap) {
    if (swap)
        hw_set_bits(&((dma_hw_t *)0x50000000u)->sniff_ctrl, 0x00000200u);
    else
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->sniff_ctrl, 0x00000200u);
}
inline static void dma_sniffer_set_output_invert_enabled(_Bool invert) {
    if (invert)
        hw_set_bits(&((dma_hw_t *)0x50000000u)->sniff_ctrl, 0x00000800u);
    else
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->sniff_ctrl, 0x00000800u);
}
inline static void dma_sniffer_set_output_reverse_enabled(_Bool reverse) {
    if (reverse)
        hw_set_bits(&((dma_hw_t *)0x50000000u)->sniff_ctrl, 0x00000400u);
    else
        hw_clear_bits(&((dma_hw_t *)0x50000000u)->sniff_ctrl, 0x00000400u);
}
inline static void dma_sniffer_disable(void) {
    ((dma_hw_t *)0x50000000u)->sniff_ctrl = 0;
}
inline static void dma_sniffer_set_data_accumulator(uint32_t seed_value) {
    ((dma_hw_t *)0x50000000u)->sniff_data = seed_value;
}
inline static uint32_t dma_sniffer_get_data_accumulator(void) {
    return ((dma_hw_t *)0x50000000u)->sniff_data;
}
void dma_timer_claim(uint timer);
void dma_timer_unclaim(uint timer);
int dma_claim_unused_timer(_Bool required);
_Bool dma_timer_is_claimed(uint timer);
static inline void dma_timer_set_fraction(uint timer, uint16_t numerator, uint16_t denominator) {
    check_dma_timer_param(timer);
    ({if (((0 || 0) && !0)) ((!(numerator > denominator)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 1107, __func__, "!(numerator > denominator)"));});
    ((dma_hw_t *)0x50000000u)->timer[timer] = (((uint32_t)numerator) << 16u) | (((uint32_t)denominator) << 0u);
}
static inline uint dma_get_timer_dreq(uint timer_num) {
    _Static_assert(DREQ_DMA_TIMER1 == DREQ_DMA_TIMER0 + 1, "");
    _Static_assert(DREQ_DMA_TIMER2 == DREQ_DMA_TIMER0 + 2, "");
    _Static_assert(DREQ_DMA_TIMER3 == DREQ_DMA_TIMER0 + 3, "");
    check_dma_timer_param(timer_num);
    return DREQ_DMA_TIMER0 + timer_num;
}
static inline int dma_get_irq_num(uint irq_index) {
    ({if (((0 || 0) && !0)) ((irq_index < 4u) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_dma/include/hardware/dma.h", 1131, __func__, "irq_index < 4u"));});
    return (DMA_IRQ_0 + (irq_index));
}
void dma_channel_cleanup(uint channel);
void print_dma_ctrl(dma_channel_hw_t *channel);
#define _HARDWARE_EXCEPTION_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_EXCEPTION 0
enum exception_number {
    MIN_EXCEPTION_NUM = 2,
    NMI_EXCEPTION = 2,
    HARDFAULT_EXCEPTION = 3,
    MEMMANAGE_EXCEPTION = 4,
    BUSFAULT_EXCEPTION = 5,
    USAGEFAULT_EXCEPTION = 6,
    SECUREFAULT_EXCEPTION = 7,
    SVCALL_EXCEPTION = 11,
    PENDSV_EXCEPTION = 14,
    SYSTICK_EXCEPTION = 15,
    MAX_EXCEPTION_NUM = 15
};
