gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define I2C_IC_RAW_INTR_STAT_RX_OVER_LSB 1u
#define I2C_IC_RAW_INTR_STAT_RX_OVER_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_RX_OVER_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_OVER_VALUE_ACTIVE 0x1u
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_RESET 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_BITS 0x00000001u
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_MSB 0u
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_LSB 0u
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_ACCESS "RO"
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_VALUE_INACTIVE 0x0u
#define I2C_IC_RAW_INTR_STAT_RX_UNDER_VALUE_ACTIVE 0x1u
#define I2C_IC_RX_TL_OFFSET 0x00000038u
#define I2C_IC_RX_TL_BITS 0x000000ffu
#define I2C_IC_RX_TL_RESET 0x00000000u
#define I2C_IC_RX_TL_RX_TL_RESET 0x00u
#define I2C_IC_RX_TL_RX_TL_BITS 0x000000ffu
#define I2C_IC_RX_TL_RX_TL_MSB 7u
#define I2C_IC_RX_TL_RX_TL_LSB 0u
#define I2C_IC_RX_TL_RX_TL_ACCESS "RW"
#define I2C_IC_TX_TL_OFFSET 0x0000003cu
#define I2C_IC_TX_TL_BITS 0x000000ffu
#define I2C_IC_TX_TL_RESET 0x00000000u
#define I2C_IC_TX_TL_TX_TL_RESET 0x00u
#define I2C_IC_TX_TL_TX_TL_BITS 0x000000ffu
#define I2C_IC_TX_TL_TX_TL_MSB 7u
#define I2C_IC_TX_TL_TX_TL_LSB 0u
#define I2C_IC_TX_TL_TX_TL_ACCESS "RW"
#define I2C_IC_CLR_INTR_OFFSET 0x00000040u
#define I2C_IC_CLR_INTR_BITS 0x00000001u
#define I2C_IC_CLR_INTR_RESET 0x00000000u
#define I2C_IC_CLR_INTR_CLR_INTR_RESET 0x0u
#define I2C_IC_CLR_INTR_CLR_INTR_BITS 0x00000001u
#define I2C_IC_CLR_INTR_CLR_INTR_MSB 0u
#define I2C_IC_CLR_INTR_CLR_INTR_LSB 0u
#define I2C_IC_CLR_INTR_CLR_INTR_ACCESS "RO"
#define I2C_IC_CLR_RX_UNDER_OFFSET 0x00000044u
#define I2C_IC_CLR_RX_UNDER_BITS 0x00000001u
#define I2C_IC_CLR_RX_UNDER_RESET 0x00000000u
#define I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_RESET 0x0u
#define I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_BITS 0x00000001u
#define I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_MSB 0u
#define I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_LSB 0u
#define I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_ACCESS "RO"
#define I2C_IC_CLR_RX_OVER_OFFSET 0x00000048u
#define I2C_IC_CLR_RX_OVER_BITS 0x00000001u
#define I2C_IC_CLR_RX_OVER_RESET 0x00000000u
#define I2C_IC_CLR_RX_OVER_CLR_RX_OVER_RESET 0x0u
#define I2C_IC_CLR_RX_OVER_CLR_RX_OVER_BITS 0x00000001u
#define I2C_IC_CLR_RX_OVER_CLR_RX_OVER_MSB 0u
#define I2C_IC_CLR_RX_OVER_CLR_RX_OVER_LSB 0u
#define I2C_IC_CLR_RX_OVER_CLR_RX_OVER_ACCESS "RO"
#define I2C_IC_CLR_TX_OVER_OFFSET 0x0000004cu
#define I2C_IC_CLR_TX_OVER_BITS 0x00000001u
#define I2C_IC_CLR_TX_OVER_RESET 0x00000000u
#define I2C_IC_CLR_TX_OVER_CLR_TX_OVER_RESET 0x0u
#define I2C_IC_CLR_TX_OVER_CLR_TX_OVER_BITS 0x00000001u
#define I2C_IC_CLR_TX_OVER_CLR_TX_OVER_MSB 0u
#define I2C_IC_CLR_TX_OVER_CLR_TX_OVER_LSB 0u
#define I2C_IC_CLR_TX_OVER_CLR_TX_OVER_ACCESS "RO"
#define I2C_IC_CLR_RD_REQ_OFFSET 0x00000050u
#define I2C_IC_CLR_RD_REQ_BITS 0x00000001u
#define I2C_IC_CLR_RD_REQ_RESET 0x00000000u
#define I2C_IC_CLR_RD_REQ_CLR_RD_REQ_RESET 0x0u
#define I2C_IC_CLR_RD_REQ_CLR_RD_REQ_BITS 0x00000001u
#define I2C_IC_CLR_RD_REQ_CLR_RD_REQ_MSB 0u
#define I2C_IC_CLR_RD_REQ_CLR_RD_REQ_LSB 0u
#define I2C_IC_CLR_RD_REQ_CLR_RD_REQ_ACCESS "RO"
#define I2C_IC_CLR_TX_ABRT_OFFSET 0x00000054u
#define I2C_IC_CLR_TX_ABRT_BITS 0x00000001u
#define I2C_IC_CLR_TX_ABRT_RESET 0x00000000u
#define I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_RESET 0x0u
#define I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_BITS 0x00000001u
#define I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_MSB 0u
#define I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_LSB 0u
#define I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_ACCESS "RO"
#define I2C_IC_CLR_RX_DONE_OFFSET 0x00000058u
#define I2C_IC_CLR_RX_DONE_BITS 0x00000001u
#define I2C_IC_CLR_RX_DONE_RESET 0x00000000u
#define I2C_IC_CLR_RX_DONE_CLR_RX_DONE_RESET 0x0u
#define I2C_IC_CLR_RX_DONE_CLR_RX_DONE_BITS 0x00000001u
#define I2C_IC_CLR_RX_DONE_CLR_RX_DONE_MSB 0u
#define I2C_IC_CLR_RX_DONE_CLR_RX_DONE_LSB 0u
#define I2C_IC_CLR_RX_DONE_CLR_RX_DONE_ACCESS "RO"
#define I2C_IC_CLR_ACTIVITY_OFFSET 0x0000005cu
#define I2C_IC_CLR_ACTIVITY_BITS 0x00000001u
#define I2C_IC_CLR_ACTIVITY_RESET 0x00000000u
#define I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_RESET 0x0u
#define I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_BITS 0x00000001u
#define I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_MSB 0u
#define I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_LSB 0u
#define I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_ACCESS "RO"
#define I2C_IC_CLR_STOP_DET_OFFSET 0x00000060u
#define I2C_IC_CLR_STOP_DET_BITS 0x00000001u
#define I2C_IC_CLR_STOP_DET_RESET 0x00000000u
#define I2C_IC_CLR_STOP_DET_CLR_STOP_DET_RESET 0x0u
#define I2C_IC_CLR_STOP_DET_CLR_STOP_DET_BITS 0x00000001u
#define I2C_IC_CLR_STOP_DET_CLR_STOP_DET_MSB 0u
#define I2C_IC_CLR_STOP_DET_CLR_STOP_DET_LSB 0u
#define I2C_IC_CLR_STOP_DET_CLR_STOP_DET_ACCESS "RO"
#define I2C_IC_CLR_START_DET_OFFSET 0x00000064u
#define I2C_IC_CLR_START_DET_BITS 0x00000001u
#define I2C_IC_CLR_START_DET_RESET 0x00000000u
#define I2C_IC_CLR_START_DET_CLR_START_DET_RESET 0x0u
#define I2C_IC_CLR_START_DET_CLR_START_DET_BITS 0x00000001u
#define I2C_IC_CLR_START_DET_CLR_START_DET_MSB 0u
#define I2C_IC_CLR_START_DET_CLR_START_DET_LSB 0u
#define I2C_IC_CLR_START_DET_CLR_START_DET_ACCESS "RO"
#define I2C_IC_CLR_GEN_CALL_OFFSET 0x00000068u
#define I2C_IC_CLR_GEN_CALL_BITS 0x00000001u
#define I2C_IC_CLR_GEN_CALL_RESET 0x00000000u
#define I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_RESET 0x0u
#define I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_BITS 0x00000001u
#define I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_MSB 0u
#define I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_LSB 0u
#define I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_ACCESS "RO"
#define I2C_IC_ENABLE_OFFSET 0x0000006cu
#define I2C_IC_ENABLE_BITS 0x00000007u
#define I2C_IC_ENABLE_RESET 0x00000000u
#define I2C_IC_ENABLE_TX_CMD_BLOCK_RESET 0x0u
#define I2C_IC_ENABLE_TX_CMD_BLOCK_BITS 0x00000004u
#define I2C_IC_ENABLE_TX_CMD_BLOCK_MSB 2u
#define I2C_IC_ENABLE_TX_CMD_BLOCK_LSB 2u
#define I2C_IC_ENABLE_TX_CMD_BLOCK_ACCESS "RW"
#define I2C_IC_ENABLE_TX_CMD_BLOCK_VALUE_NOT_BLOCKED 0x0u
#define I2C_IC_ENABLE_TX_CMD_BLOCK_VALUE_BLOCKED 0x1u
#define I2C_IC_ENABLE_ABORT_RESET 0x0u
#define I2C_IC_ENABLE_ABORT_BITS 0x00000002u
#define I2C_IC_ENABLE_ABORT_MSB 1u
#define I2C_IC_ENABLE_ABORT_LSB 1u
#define I2C_IC_ENABLE_ABORT_ACCESS "RW"
#define I2C_IC_ENABLE_ABORT_VALUE_DISABLE 0x0u
#define I2C_IC_ENABLE_ABORT_VALUE_ENABLED 0x1u
#define I2C_IC_ENABLE_ENABLE_RESET 0x0u
#define I2C_IC_ENABLE_ENABLE_BITS 0x00000001u
#define I2C_IC_ENABLE_ENABLE_MSB 0u
#define I2C_IC_ENABLE_ENABLE_LSB 0u
#define I2C_IC_ENABLE_ENABLE_ACCESS "RW"
#define I2C_IC_ENABLE_ENABLE_VALUE_DISABLED 0x0u
#define I2C_IC_ENABLE_ENABLE_VALUE_ENABLED 0x1u
#define I2C_IC_STATUS_OFFSET 0x00000070u
#define I2C_IC_STATUS_BITS 0x0000007fu
#define I2C_IC_STATUS_RESET 0x00000006u
#define I2C_IC_STATUS_SLV_ACTIVITY_RESET 0x0u
#define I2C_IC_STATUS_SLV_ACTIVITY_BITS 0x00000040u
#define I2C_IC_STATUS_SLV_ACTIVITY_MSB 6u
#define I2C_IC_STATUS_SLV_ACTIVITY_LSB 6u
#define I2C_IC_STATUS_SLV_ACTIVITY_ACCESS "RO"
#define I2C_IC_STATUS_SLV_ACTIVITY_VALUE_IDLE 0x0u
#define I2C_IC_STATUS_SLV_ACTIVITY_VALUE_ACTIVE 0x1u
#define I2C_IC_STATUS_MST_ACTIVITY_RESET 0x0u
#define I2C_IC_STATUS_MST_ACTIVITY_BITS 0x00000020u
#define I2C_IC_STATUS_MST_ACTIVITY_MSB 5u
#define I2C_IC_STATUS_MST_ACTIVITY_LSB 5u
#define I2C_IC_STATUS_MST_ACTIVITY_ACCESS "RO"
#define I2C_IC_STATUS_MST_ACTIVITY_VALUE_IDLE 0x0u
#define I2C_IC_STATUS_MST_ACTIVITY_VALUE_ACTIVE 0x1u
#define I2C_IC_STATUS_RFF_RESET 0x0u
#define I2C_IC_STATUS_RFF_BITS 0x00000010u
#define I2C_IC_STATUS_RFF_MSB 4u
#define I2C_IC_STATUS_RFF_LSB 4u
#define I2C_IC_STATUS_RFF_ACCESS "RO"
#define I2C_IC_STATUS_RFF_VALUE_NOT_FULL 0x0u
#define I2C_IC_STATUS_RFF_VALUE_FULL 0x1u
#define I2C_IC_STATUS_RFNE_RESET 0x0u
#define I2C_IC_STATUS_RFNE_BITS 0x00000008u
#define I2C_IC_STATUS_RFNE_MSB 3u
#define I2C_IC_STATUS_RFNE_LSB 3u
#define I2C_IC_STATUS_RFNE_ACCESS "RO"
#define I2C_IC_STATUS_RFNE_VALUE_EMPTY 0x0u
#define I2C_IC_STATUS_RFNE_VALUE_NOT_EMPTY 0x1u
#define I2C_IC_STATUS_TFE_RESET 0x1u
#define I2C_IC_STATUS_TFE_BITS 0x00000004u
#define I2C_IC_STATUS_TFE_MSB 2u
#define I2C_IC_STATUS_TFE_LSB 2u
#define I2C_IC_STATUS_TFE_ACCESS "RO"
#define I2C_IC_STATUS_TFE_VALUE_NON_EMPTY 0x0u
#define I2C_IC_STATUS_TFE_VALUE_EMPTY 0x1u
#define I2C_IC_STATUS_TFNF_RESET 0x1u
#define I2C_IC_STATUS_TFNF_BITS 0x00000002u
#define I2C_IC_STATUS_TFNF_MSB 1u
#define I2C_IC_STATUS_TFNF_LSB 1u
#define I2C_IC_STATUS_TFNF_ACCESS "RO"
#define I2C_IC_STATUS_TFNF_VALUE_FULL 0x0u
#define I2C_IC_STATUS_TFNF_VALUE_NOT_FULL 0x1u
#define I2C_IC_STATUS_ACTIVITY_RESET 0x0u
#define I2C_IC_STATUS_ACTIVITY_BITS 0x00000001u
#define I2C_IC_STATUS_ACTIVITY_MSB 0u
#define I2C_IC_STATUS_ACTIVITY_LSB 0u
#define I2C_IC_STATUS_ACTIVITY_ACCESS "RO"
#define I2C_IC_STATUS_ACTIVITY_VALUE_INACTIVE 0x0u
#define I2C_IC_STATUS_ACTIVITY_VALUE_ACTIVE 0x1u
#define I2C_IC_TXFLR_OFFSET 0x00000074u
#define I2C_IC_TXFLR_BITS 0x0000001fu
#define I2C_IC_TXFLR_RESET 0x00000000u
#define I2C_IC_TXFLR_TXFLR_RESET 0x00u
#define I2C_IC_TXFLR_TXFLR_BITS 0x0000001fu
#define I2C_IC_TXFLR_TXFLR_MSB 4u
#define I2C_IC_TXFLR_TXFLR_LSB 0u
#define I2C_IC_TXFLR_TXFLR_ACCESS "RO"
#define I2C_IC_RXFLR_OFFSET 0x00000078u
#define I2C_IC_RXFLR_BITS 0x0000001fu
#define I2C_IC_RXFLR_RESET 0x00000000u
#define I2C_IC_RXFLR_RXFLR_RESET 0x00u
#define I2C_IC_RXFLR_RXFLR_BITS 0x0000001fu
#define I2C_IC_RXFLR_RXFLR_MSB 4u
#define I2C_IC_RXFLR_RXFLR_LSB 0u
#define I2C_IC_RXFLR_RXFLR_ACCESS "RO"
#define I2C_IC_SDA_HOLD_OFFSET 0x0000007cu
#define I2C_IC_SDA_HOLD_BITS 0x00ffffffu
#define I2C_IC_SDA_HOLD_RESET 0x00000001u
#define I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_RESET 0x00u
#define I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_BITS 0x00ff0000u
#define I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_MSB 23u
#define I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_LSB 16u
#define I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_ACCESS "RW"
#define I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_RESET 0x0001u
#define I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_BITS 0x0000ffffu
#define I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_MSB 15u
#define I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_LSB 0u
#define I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_ACCESS "RW"
#define I2C_IC_TX_ABRT_SOURCE_OFFSET 0x00000080u
#define I2C_IC_TX_ABRT_SOURCE_BITS 0xff81ffffu
#define I2C_IC_TX_ABRT_SOURCE_RESET 0x00000000u
#define I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_RESET 0x000u
#define I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_BITS 0xff800000u
#define I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_MSB 31u
#define I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_LSB 23u
#define I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_BITS 0x00010000u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_MSB 16u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_LSB 16u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_VALUE_ABRT_USER_ABRT_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_VALUE_ABRT_USER_ABRT_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_BITS 0x00008000u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_MSB 15u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_LSB 15u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_VALUE_ABRT_SLVRD_INTX_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_VALUE_ABRT_SLVRD_INTX_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_BITS 0x00004000u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_MSB 14u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_LSB 14u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_VALUE_ABRT_SLV_ARBLOST_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_VALUE_ABRT_SLV_ARBLOST_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_BITS 0x00002000u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_MSB 13u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_LSB 13u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_VALUE_ABRT_SLVFLUSH_TXFIFO_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_VALUE_ABRT_SLVFLUSH_TXFIFO_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_BITS 0x00001000u
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_MSB 12u
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_LSB 12u
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_VALUE_ABRT_LOST_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ARB_LOST_VALUE_ABRT_LOST_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_BITS 0x00000800u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_MSB 11u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_LSB 11u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_VALUE_ABRT_MASTER_DIS_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_VALUE_ABRT_MASTER_DIS_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_BITS 0x00000400u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_MSB 10u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_LSB 10u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_VALUE_ABRT_10B_RD_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_VALUE_ABRT_10B_RD_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_BITS 0x00000200u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_MSB 9u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_LSB 9u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_VALUE_ABRT_SBYTE_NORSTRT_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_VALUE_ABRT_SBYTE_NORSTRT_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_BITS 0x00000100u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_MSB 8u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_LSB 8u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_VALUE_ABRT_HS_NORSTRT_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_VALUE_ABRT_HS_NORSTRT_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_BITS 0x00000080u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_MSB 7u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_LSB 7u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_VALUE_ABRT_SBYTE_ACKDET_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_VALUE_ABRT_SBYTE_ACKDET_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_BITS 0x00000040u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_MSB 6u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_LSB 6u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_VALUE_ABRT_HS_ACK_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_VALUE_ABRT_HS_ACK_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_BITS 0x00000020u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_MSB 5u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_LSB 5u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_VALUE_ABRT_GCALL_READ_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_VALUE_ABRT_GCALL_READ_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_BITS 0x00000010u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_MSB 4u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_LSB 4u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_VALUE_ABRT_GCALL_NOACK_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_VALUE_ABRT_GCALL_NOACK_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_BITS 0x00000008u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_MSB 3u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_LSB 3u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_VALUE_ABRT_TXDATA_NOACK_VOID 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_VALUE_ABRT_TXDATA_NOACK_GENERATED 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_BITS 0x00000004u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_MSB 2u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_LSB 2u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_VALUE_INACTIVE 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_VALUE_ACTIVE 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_BITS 0x00000002u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_MSB 1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_LSB 1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_VALUE_INACTIVE 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_VALUE_ACTIVE 0x1u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_RESET 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_BITS 0x00000001u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_MSB 0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_LSB 0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_ACCESS "RO"
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_VALUE_INACTIVE 0x0u
#define I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_VALUE_ACTIVE 0x1u
#define I2C_IC_SLV_DATA_NACK_ONLY_OFFSET 0x00000084u
#define I2C_IC_SLV_DATA_NACK_ONLY_BITS 0x00000001u
#define I2C_IC_SLV_DATA_NACK_ONLY_RESET 0x00000000u
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_RESET 0x0u
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_BITS 0x00000001u
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_MSB 0u
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_LSB 0u
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_ACCESS "RW"
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_VALUE_DISABLED 0x0u
#define I2C_IC_SLV_DATA_NACK_ONLY_NACK_VALUE_ENABLED 0x1u
#define I2C_IC_DMA_CR_OFFSET 0x00000088u
#define I2C_IC_DMA_CR_BITS 0x00000003u
#define I2C_IC_DMA_CR_RESET 0x00000000u
#define I2C_IC_DMA_CR_TDMAE_RESET 0x0u
#define I2C_IC_DMA_CR_TDMAE_BITS 0x00000002u
#define I2C_IC_DMA_CR_TDMAE_MSB 1u
#define I2C_IC_DMA_CR_TDMAE_LSB 1u
#define I2C_IC_DMA_CR_TDMAE_ACCESS "RW"
#define I2C_IC_DMA_CR_TDMAE_VALUE_DISABLED 0x0u
#define I2C_IC_DMA_CR_TDMAE_VALUE_ENABLED 0x1u
#define I2C_IC_DMA_CR_RDMAE_RESET 0x0u
#define I2C_IC_DMA_CR_RDMAE_BITS 0x00000001u
#define I2C_IC_DMA_CR_RDMAE_MSB 0u
#define I2C_IC_DMA_CR_RDMAE_LSB 0u
#define I2C_IC_DMA_CR_RDMAE_ACCESS "RW"
#define I2C_IC_DMA_CR_RDMAE_VALUE_DISABLED 0x0u
#define I2C_IC_DMA_CR_RDMAE_VALUE_ENABLED 0x1u
#define I2C_IC_DMA_TDLR_OFFSET 0x0000008cu
#define I2C_IC_DMA_TDLR_BITS 0x0000000fu
#define I2C_IC_DMA_TDLR_RESET 0x00000000u
#define I2C_IC_DMA_TDLR_DMATDL_RESET 0x0u
#define I2C_IC_DMA_TDLR_DMATDL_BITS 0x0000000fu
#define I2C_IC_DMA_TDLR_DMATDL_MSB 3u
#define I2C_IC_DMA_TDLR_DMATDL_LSB 0u
#define I2C_IC_DMA_TDLR_DMATDL_ACCESS "RW"
#define I2C_IC_DMA_RDLR_OFFSET 0x00000090u
#define I2C_IC_DMA_RDLR_BITS 0x0000000fu
#define I2C_IC_DMA_RDLR_RESET 0x00000000u
#define I2C_IC_DMA_RDLR_DMARDL_RESET 0x0u
#define I2C_IC_DMA_RDLR_DMARDL_BITS 0x0000000fu
#define I2C_IC_DMA_RDLR_DMARDL_MSB 3u
#define I2C_IC_DMA_RDLR_DMARDL_LSB 0u
#define I2C_IC_DMA_RDLR_DMARDL_ACCESS "RW"
#define I2C_IC_SDA_SETUP_OFFSET 0x00000094u
#define I2C_IC_SDA_SETUP_BITS 0x000000ffu
#define I2C_IC_SDA_SETUP_RESET 0x00000064u
#define I2C_IC_SDA_SETUP_SDA_SETUP_RESET 0x64u
#define I2C_IC_SDA_SETUP_SDA_SETUP_BITS 0x000000ffu
#define I2C_IC_SDA_SETUP_SDA_SETUP_MSB 7u
#define I2C_IC_SDA_SETUP_SDA_SETUP_LSB 0u
#define I2C_IC_SDA_SETUP_SDA_SETUP_ACCESS "RW"
#define I2C_IC_ACK_GENERAL_CALL_OFFSET 0x00000098u
#define I2C_IC_ACK_GENERAL_CALL_BITS 0x00000001u
#define I2C_IC_ACK_GENERAL_CALL_RESET 0x00000001u
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_RESET 0x1u
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_BITS 0x00000001u
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_MSB 0u
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_LSB 0u
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_ACCESS "RW"
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_VALUE_DISABLED 0x0u
#define I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_VALUE_ENABLED 0x1u
#define I2C_IC_ENABLE_STATUS_OFFSET 0x0000009cu
#define I2C_IC_ENABLE_STATUS_BITS 0x00000007u
#define I2C_IC_ENABLE_STATUS_RESET 0x00000000u
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_RESET 0x0u
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_BITS 0x00000004u
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_MSB 2u
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_LSB 2u
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_ACCESS "RO"
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_VALUE_INACTIVE 0x0u
#define I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_VALUE_ACTIVE 0x1u
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_RESET 0x0u
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_BITS 0x00000002u
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_MSB 1u
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_LSB 1u
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_ACCESS "RO"
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_VALUE_INACTIVE 0x0u
#define I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_VALUE_ACTIVE 0x1u
#define I2C_IC_ENABLE_STATUS_IC_EN_RESET 0x0u
#define I2C_IC_ENABLE_STATUS_IC_EN_BITS 0x00000001u
#define I2C_IC_ENABLE_STATUS_IC_EN_MSB 0u
#define I2C_IC_ENABLE_STATUS_IC_EN_LSB 0u
#define I2C_IC_ENABLE_STATUS_IC_EN_ACCESS "RO"
#define I2C_IC_ENABLE_STATUS_IC_EN_VALUE_DISABLED 0x0u
#define I2C_IC_ENABLE_STATUS_IC_EN_VALUE_ENABLED 0x1u
#define I2C_IC_FS_SPKLEN_OFFSET 0x000000a0u
#define I2C_IC_FS_SPKLEN_BITS 0x000000ffu
#define I2C_IC_FS_SPKLEN_RESET 0x00000007u
#define I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_RESET 0x07u
#define I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_BITS 0x000000ffu
#define I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_MSB 7u
#define I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_LSB 0u
#define I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_ACCESS "RW"
#define I2C_IC_CLR_RESTART_DET_OFFSET 0x000000a8u
#define I2C_IC_CLR_RESTART_DET_BITS 0x00000001u
#define I2C_IC_CLR_RESTART_DET_RESET 0x00000000u
#define I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_RESET 0x0u
#define I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_BITS 0x00000001u
#define I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_MSB 0u
#define I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_LSB 0u
#define I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_OFFSET 0x000000f4u
#define I2C_IC_COMP_PARAM_1_BITS 0x00ffffffu
#define I2C_IC_COMP_PARAM_1_RESET 0x00000000u
#define I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_RESET 0x00u
#define I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_BITS 0x00ff0000u
#define I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_MSB 23u
#define I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_LSB 16u
#define I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_RESET 0x00u
#define I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_BITS 0x0000ff00u
#define I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_MSB 15u
#define I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_LSB 8u
#define I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_RESET 0x0u
#define I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_BITS 0x00000080u
#define I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_MSB 7u
#define I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_LSB 7u
#define I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_ACCESS "RO"
#define I2C_IC_COMP_PARAM_1_HAS_DMA_RESET 0x0u
#define I2C_IC_COMP_PARAM_1_HAS_DMA_BITS 0x00000040u
