gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
static inline uint interp_index(interp_hw_t *interp) {
    ({if (((0 || 0) && !0)) ((interp == (&((interp_hw_t *)(0xd0000000u + 0x00000080u))[0]) || interp == (&((interp_hw_t *)(0xd0000000u + 0x00000080u))[1])) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 63, __func__, "interp == (&((interp_hw_t *)(0xd0000000u + 0x00000080u))[0]) || interp == (&((interp_hw_t *)(0xd0000000u + 0x00000080u))[1])"));});
    return interp == (&((interp_hw_t *)(0xd0000000u + 0x00000080u))[1]) ? 1 : 0;
}
void interp_claim_lane(interp_hw_t *interp, uint lane);
#define interp_lane_claim interp_claim_lane
void interp_claim_lane_mask(interp_hw_t *interp, uint lane_mask);
void interp_unclaim_lane(interp_hw_t *interp, uint lane);
#define interp_lane_unclaim interp_unclaim_lane
_Bool interp_lane_is_claimed(interp_hw_t *interp, uint lane);
void interp_unclaim_lane_mask(interp_hw_t *interp, uint lane_mask);
static inline void interp_config_set_shift(interp_config *c, uint shift) {
    ({if (((0 || 0) && !0)) ((shift < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 127, __func__, "shift < 32"));});
    c->ctrl = (c->ctrl & ~0x0000001fu) |
              ((shift << 0u) & 0x0000001fu);
}
static inline void interp_config_set_mask(interp_config *c, uint mask_lsb, uint mask_msb) {
    ({if (((0 || 0) && !0)) ((mask_msb < 32) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 142, __func__, "mask_msb < 32"));});
    ({if (((0 || 0) && !0)) ((mask_lsb <= mask_msb) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 143, __func__, "mask_lsb <= mask_msb"));});
    c->ctrl = (c->ctrl & ~(0x000003e0u | 0x00007c00u)) |
              ((mask_lsb << 5u) & 0x000003e0u) |
              ((mask_msb << 10u) & 0x00007c00u);
}
static inline void interp_config_set_cross_input(interp_config *c, _Bool cross_input) {
    c->ctrl = (c->ctrl & ~0x00010000u) |
              (cross_input ? 0x00010000u : 0);
}
static inline void interp_config_set_cross_result(interp_config *c, _Bool cross_result) {
    c->ctrl = (c->ctrl & ~0x00020000u) |
              (cross_result ? 0x00020000u : 0);
}
static inline void interp_config_set_signed(interp_config *c, _Bool _signed) {
    c->ctrl = (c->ctrl & ~0x00008000u) |
              (_signed ? 0x00008000u : 0);
}
static inline void interp_config_set_add_raw(interp_config *c, _Bool add_raw) {
    c->ctrl = (c->ctrl & ~0x00040000u) |
              (add_raw ? 0x00040000u : 0);
}
static inline void interp_config_set_blend(interp_config *c, _Bool blend) {
    c->ctrl = (c->ctrl & ~0x00200000u) |
              (blend ? 0x00200000u : 0);
}
static inline void interp_config_set_clamp(interp_config *c, _Bool clamp) {
    c->ctrl = (c->ctrl & ~0x00400000u) |
              (clamp ? 0x00400000u : 0);
}
static inline void interp_config_set_force_bits(interp_config *c, uint bits) {
    ({if (((0 || 0) && !0)) ((!(bits > 3)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 251, __func__, "!(bits > 3)"));});
    c->ctrl = (c->ctrl & ~0x00180000u) |
              (bits << 19u);
}
static inline interp_config interp_default_config(void) {
    interp_config c = {0};
    interp_config_set_mask(&c, 0, 31);
    return c;
}
static inline void interp_set_config(interp_hw_t *interp, uint lane, interp_config *config) {
    ({if (((0 || 0) && !0)) ((!(lane > 1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 281, __func__, "!(lane > 1)"));});
    ({if (((0 || 0) && !0)) ((!(config->ctrl & 0x00400000u && (!interp_index(interp) || lane))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 282, __func__, "!(config->ctrl & 0x00400000u && (!interp_index(interp) || lane))"));});
    ({if (((0 || 0) && !0)) ((!(config->ctrl & 0x00200000u && (interp_index(interp) || lane))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_interp/include/hardware/interp.h", 284, __func__, "!(config->ctrl & 0x00200000u && (interp_index(interp) || lane))"));});
    interp->ctrl[lane] = config->ctrl;
}
static inline void interp_set_force_bits(interp_hw_t *interp, uint lane, uint bits) {
    interp->ctrl[lane] = interp->ctrl[lane] | (bits << 19u);
}
typedef struct {
    uint32_t accum[2];
    uint32_t base[3];
    uint32_t ctrl[2];
} interp_hw_save_t;
void interp_save(interp_hw_t *interp, interp_hw_save_t *saver);
void interp_restore(interp_hw_t *interp, interp_hw_save_t *saver);
static inline void interp_set_base(interp_hw_t *interp, uint lane, uint32_t val) {
    interp->base[lane] = val;
}
static inline uint32_t interp_get_base(interp_hw_t *interp, uint lane) {
    return interp->base[lane];
}
static inline void interp_set_base_both(interp_hw_t *interp, uint32_t val) {
    interp->base01 = val;
}
static inline void interp_set_accumulator(interp_hw_t *interp, uint lane, uint32_t val) {
    interp->accum[lane] = val;
}
static inline uint32_t interp_get_accumulator(interp_hw_t *interp, uint lane) {
    return interp->accum[lane];
}
static inline uint32_t interp_pop_lane_result(interp_hw_t *interp, uint lane) {
    return interp->pop[lane];
}
static inline uint32_t interp_peek_lane_result(interp_hw_t *interp, uint lane) {
    return interp->peek[lane];
}
static inline uint32_t interp_pop_full_result(interp_hw_t *interp) {
    return interp->pop[2];
}
static inline uint32_t interp_peek_full_result(interp_hw_t *interp) {
    return interp->peek[2];
}
static inline void interp_add_accumulator(interp_hw_t *interp, uint lane, uint32_t val) {
    interp->add_raw[lane] = val;
}
#define interp_add_accumulater(interp,lane,val) interp_add_accumulator(interp, lane, val)
static inline uint32_t interp_get_raw(interp_hw_t *interp, uint lane) {
    return interp->add_raw[lane];
}
#define _HARDWARE_PIO_H 
#define _HARDWARE_STRUCTS_PIO_H 
#define _HARDWARE_REGS_PIO_H 
#define PIO_CTRL_OFFSET 0x00000000u
#define PIO_CTRL_BITS 0x07ff0fffu
#define PIO_CTRL_RESET 0x00000000u
#define PIO_CTRL_NEXTPREV_CLKDIV_RESTART_RESET 0x0u
#define PIO_CTRL_NEXTPREV_CLKDIV_RESTART_BITS 0x04000000u
#define PIO_CTRL_NEXTPREV_CLKDIV_RESTART_MSB 26u
#define PIO_CTRL_NEXTPREV_CLKDIV_RESTART_LSB 26u
#define PIO_CTRL_NEXTPREV_CLKDIV_RESTART_ACCESS "SC"
#define PIO_CTRL_NEXTPREV_SM_DISABLE_RESET 0x0u
#define PIO_CTRL_NEXTPREV_SM_DISABLE_BITS 0x02000000u
#define PIO_CTRL_NEXTPREV_SM_DISABLE_MSB 25u
#define PIO_CTRL_NEXTPREV_SM_DISABLE_LSB 25u
#define PIO_CTRL_NEXTPREV_SM_DISABLE_ACCESS "SC"
#define PIO_CTRL_NEXTPREV_SM_ENABLE_RESET 0x0u
#define PIO_CTRL_NEXTPREV_SM_ENABLE_BITS 0x01000000u
#define PIO_CTRL_NEXTPREV_SM_ENABLE_MSB 24u
#define PIO_CTRL_NEXTPREV_SM_ENABLE_LSB 24u
#define PIO_CTRL_NEXTPREV_SM_ENABLE_ACCESS "SC"
#define PIO_CTRL_NEXT_PIO_MASK_RESET 0x0u
#define PIO_CTRL_NEXT_PIO_MASK_BITS 0x00f00000u
#define PIO_CTRL_NEXT_PIO_MASK_MSB 23u
#define PIO_CTRL_NEXT_PIO_MASK_LSB 20u
#define PIO_CTRL_NEXT_PIO_MASK_ACCESS "SC"
#define PIO_CTRL_PREV_PIO_MASK_RESET 0x0u
#define PIO_CTRL_PREV_PIO_MASK_BITS 0x000f0000u
#define PIO_CTRL_PREV_PIO_MASK_MSB 19u
#define PIO_CTRL_PREV_PIO_MASK_LSB 16u
#define PIO_CTRL_PREV_PIO_MASK_ACCESS "SC"
#define PIO_CTRL_CLKDIV_RESTART_RESET 0x0u
#define PIO_CTRL_CLKDIV_RESTART_BITS 0x00000f00u
#define PIO_CTRL_CLKDIV_RESTART_MSB 11u
#define PIO_CTRL_CLKDIV_RESTART_LSB 8u
#define PIO_CTRL_CLKDIV_RESTART_ACCESS "SC"
#define PIO_CTRL_SM_RESTART_RESET 0x0u
#define PIO_CTRL_SM_RESTART_BITS 0x000000f0u
#define PIO_CTRL_SM_RESTART_MSB 7u
#define PIO_CTRL_SM_RESTART_LSB 4u
#define PIO_CTRL_SM_RESTART_ACCESS "SC"
#define PIO_CTRL_SM_ENABLE_RESET 0x0u
#define PIO_CTRL_SM_ENABLE_BITS 0x0000000fu
#define PIO_CTRL_SM_ENABLE_MSB 3u
#define PIO_CTRL_SM_ENABLE_LSB 0u
#define PIO_CTRL_SM_ENABLE_ACCESS "RW"
#define PIO_FSTAT_OFFSET 0x00000004u
#define PIO_FSTAT_BITS 0x0f0f0f0fu
#define PIO_FSTAT_RESET 0x0f000f00u
#define PIO_FSTAT_TXEMPTY_RESET 0xfu
#define PIO_FSTAT_TXEMPTY_BITS 0x0f000000u
#define PIO_FSTAT_TXEMPTY_MSB 27u
#define PIO_FSTAT_TXEMPTY_LSB 24u
#define PIO_FSTAT_TXEMPTY_ACCESS "RO"
#define PIO_FSTAT_TXFULL_RESET 0x0u
#define PIO_FSTAT_TXFULL_BITS 0x000f0000u
#define PIO_FSTAT_TXFULL_MSB 19u
#define PIO_FSTAT_TXFULL_LSB 16u
#define PIO_FSTAT_TXFULL_ACCESS "RO"
#define PIO_FSTAT_RXEMPTY_RESET 0xfu
#define PIO_FSTAT_RXEMPTY_BITS 0x00000f00u
#define PIO_FSTAT_RXEMPTY_MSB 11u
#define PIO_FSTAT_RXEMPTY_LSB 8u
#define PIO_FSTAT_RXEMPTY_ACCESS "RO"
#define PIO_FSTAT_RXFULL_RESET 0x0u
#define PIO_FSTAT_RXFULL_BITS 0x0000000fu
#define PIO_FSTAT_RXFULL_MSB 3u
#define PIO_FSTAT_RXFULL_LSB 0u
#define PIO_FSTAT_RXFULL_ACCESS "RO"
#define PIO_FDEBUG_OFFSET 0x00000008u
#define PIO_FDEBUG_BITS 0x0f0f0f0fu
#define PIO_FDEBUG_RESET 0x00000000u
#define PIO_FDEBUG_TXSTALL_RESET 0x0u
#define PIO_FDEBUG_TXSTALL_BITS 0x0f000000u
#define PIO_FDEBUG_TXSTALL_MSB 27u
#define PIO_FDEBUG_TXSTALL_LSB 24u
#define PIO_FDEBUG_TXSTALL_ACCESS "WC"
#define PIO_FDEBUG_TXOVER_RESET 0x0u
#define PIO_FDEBUG_TXOVER_BITS 0x000f0000u
#define PIO_FDEBUG_TXOVER_MSB 19u
#define PIO_FDEBUG_TXOVER_LSB 16u
#define PIO_FDEBUG_TXOVER_ACCESS "WC"
#define PIO_FDEBUG_RXUNDER_RESET 0x0u
#define PIO_FDEBUG_RXUNDER_BITS 0x00000f00u
#define PIO_FDEBUG_RXUNDER_MSB 11u
#define PIO_FDEBUG_RXUNDER_LSB 8u
#define PIO_FDEBUG_RXUNDER_ACCESS "WC"
#define PIO_FDEBUG_RXSTALL_RESET 0x0u
#define PIO_FDEBUG_RXSTALL_BITS 0x0000000fu
#define PIO_FDEBUG_RXSTALL_MSB 3u
#define PIO_FDEBUG_RXSTALL_LSB 0u
#define PIO_FDEBUG_RXSTALL_ACCESS "WC"
#define PIO_FLEVEL_OFFSET 0x0000000cu
#define PIO_FLEVEL_BITS 0xffffffffu
#define PIO_FLEVEL_RESET 0x00000000u
#define PIO_FLEVEL_RX3_RESET 0x0u
#define PIO_FLEVEL_RX3_BITS 0xf0000000u
#define PIO_FLEVEL_RX3_MSB 31u
#define PIO_FLEVEL_RX3_LSB 28u
#define PIO_FLEVEL_RX3_ACCESS "RO"
#define PIO_FLEVEL_TX3_RESET 0x0u
#define PIO_FLEVEL_TX3_BITS 0x0f000000u
#define PIO_FLEVEL_TX3_MSB 27u
#define PIO_FLEVEL_TX3_LSB 24u
#define PIO_FLEVEL_TX3_ACCESS "RO"
#define PIO_FLEVEL_RX2_RESET 0x0u
#define PIO_FLEVEL_RX2_BITS 0x00f00000u
#define PIO_FLEVEL_RX2_MSB 23u
#define PIO_FLEVEL_RX2_LSB 20u
#define PIO_FLEVEL_RX2_ACCESS "RO"
#define PIO_FLEVEL_TX2_RESET 0x0u
#define PIO_FLEVEL_TX2_BITS 0x000f0000u
#define PIO_FLEVEL_TX2_MSB 19u
#define PIO_FLEVEL_TX2_LSB 16u
#define PIO_FLEVEL_TX2_ACCESS "RO"
#define PIO_FLEVEL_RX1_RESET 0x0u
#define PIO_FLEVEL_RX1_BITS 0x0000f000u
#define PIO_FLEVEL_RX1_MSB 15u
#define PIO_FLEVEL_RX1_LSB 12u
#define PIO_FLEVEL_RX1_ACCESS "RO"
#define PIO_FLEVEL_TX1_RESET 0x0u
#define PIO_FLEVEL_TX1_BITS 0x00000f00u
#define PIO_FLEVEL_TX1_MSB 11u
#define PIO_FLEVEL_TX1_LSB 8u
#define PIO_FLEVEL_TX1_ACCESS "RO"
#define PIO_FLEVEL_RX0_RESET 0x0u
#define PIO_FLEVEL_RX0_BITS 0x000000f0u
#define PIO_FLEVEL_RX0_MSB 7u
#define PIO_FLEVEL_RX0_LSB 4u
#define PIO_FLEVEL_RX0_ACCESS "RO"
#define PIO_FLEVEL_TX0_RESET 0x0u
#define PIO_FLEVEL_TX0_BITS 0x0000000fu
#define PIO_FLEVEL_TX0_MSB 3u
#define PIO_FLEVEL_TX0_LSB 0u
#define PIO_FLEVEL_TX0_ACCESS "RO"
#define PIO_TXF0_OFFSET 0x00000010u
#define PIO_TXF0_BITS 0xffffffffu
#define PIO_TXF0_RESET 0x00000000u
#define PIO_TXF0_MSB 31u
#define PIO_TXF0_LSB 0u
#define PIO_TXF0_ACCESS "WF"
#define PIO_TXF1_OFFSET 0x00000014u
#define PIO_TXF1_BITS 0xffffffffu
#define PIO_TXF1_RESET 0x00000000u
#define PIO_TXF1_MSB 31u
#define PIO_TXF1_LSB 0u
#define PIO_TXF1_ACCESS "WF"
#define PIO_TXF2_OFFSET 0x00000018u
#define PIO_TXF2_BITS 0xffffffffu
#define PIO_TXF2_RESET 0x00000000u
#define PIO_TXF2_MSB 31u
#define PIO_TXF2_LSB 0u
#define PIO_TXF2_ACCESS "WF"
#define PIO_TXF3_OFFSET 0x0000001cu
#define PIO_TXF3_BITS 0xffffffffu
#define PIO_TXF3_RESET 0x00000000u
#define PIO_TXF3_MSB 31u
#define PIO_TXF3_LSB 0u
#define PIO_TXF3_ACCESS "WF"
#define PIO_RXF0_OFFSET 0x00000020u
#define PIO_RXF0_BITS 0xffffffffu
#define PIO_RXF0_RESET "-"
#define PIO_RXF0_MSB 31u
#define PIO_RXF0_LSB 0u
#define PIO_RXF0_ACCESS "RF"
#define PIO_RXF1_OFFSET 0x00000024u
#define PIO_RXF1_BITS 0xffffffffu
#define PIO_RXF1_RESET "-"
#define PIO_RXF1_MSB 31u
#define PIO_RXF1_LSB 0u
#define PIO_RXF1_ACCESS "RF"
#define PIO_RXF2_OFFSET 0x00000028u
#define PIO_RXF2_BITS 0xffffffffu
#define PIO_RXF2_RESET "-"
#define PIO_RXF2_MSB 31u
#define PIO_RXF2_LSB 0u
#define PIO_RXF2_ACCESS "RF"
#define PIO_RXF3_OFFSET 0x0000002cu
#define PIO_RXF3_BITS 0xffffffffu
#define PIO_RXF3_RESET "-"
#define PIO_RXF3_MSB 31u
#define PIO_RXF3_LSB 0u
#define PIO_RXF3_ACCESS "RF"
#define PIO_IRQ_OFFSET 0x00000030u
#define PIO_IRQ_BITS 0x000000ffu
#define PIO_IRQ_RESET 0x00000000u
#define PIO_IRQ_MSB 7u
#define PIO_IRQ_LSB 0u
#define PIO_IRQ_ACCESS "WC"
#define PIO_IRQ_FORCE_OFFSET 0x00000034u
#define PIO_IRQ_FORCE_BITS 0x000000ffu
#define PIO_IRQ_FORCE_RESET 0x00000000u
#define PIO_IRQ_FORCE_MSB 7u
#define PIO_IRQ_FORCE_LSB 0u
#define PIO_IRQ_FORCE_ACCESS "WF"
#define PIO_INPUT_SYNC_BYPASS_OFFSET 0x00000038u
#define PIO_INPUT_SYNC_BYPASS_BITS 0xffffffffu
#define PIO_INPUT_SYNC_BYPASS_RESET 0x00000000u
#define PIO_INPUT_SYNC_BYPASS_MSB 31u
#define PIO_INPUT_SYNC_BYPASS_LSB 0u
#define PIO_INPUT_SYNC_BYPASS_ACCESS "RW"
#define PIO_DBG_PADOUT_OFFSET 0x0000003cu
#define PIO_DBG_PADOUT_BITS 0xffffffffu
#define PIO_DBG_PADOUT_RESET 0x00000000u
#define PIO_DBG_PADOUT_MSB 31u
#define PIO_DBG_PADOUT_LSB 0u
#define PIO_DBG_PADOUT_ACCESS "RO"
#define PIO_DBG_PADOE_OFFSET 0x00000040u
#define PIO_DBG_PADOE_BITS 0xffffffffu
#define PIO_DBG_PADOE_RESET 0x00000000u
#define PIO_DBG_PADOE_MSB 31u
#define PIO_DBG_PADOE_LSB 0u
#define PIO_DBG_PADOE_ACCESS "RO"
#define PIO_DBG_CFGINFO_OFFSET 0x00000044u
#define PIO_DBG_CFGINFO_BITS 0xf03f0f3fu
#define PIO_DBG_CFGINFO_RESET 0x10000000u
#define PIO_DBG_CFGINFO_VERSION_RESET 0x1u
#define PIO_DBG_CFGINFO_VERSION_BITS 0xf0000000u
#define PIO_DBG_CFGINFO_VERSION_MSB 31u
#define PIO_DBG_CFGINFO_VERSION_LSB 28u
#define PIO_DBG_CFGINFO_VERSION_ACCESS "RO"
#define PIO_DBG_CFGINFO_VERSION_VALUE_V0 0x0u
#define PIO_DBG_CFGINFO_VERSION_VALUE_V1 0x1u
#define PIO_DBG_CFGINFO_IMEM_SIZE_RESET "-"
#define PIO_DBG_CFGINFO_IMEM_SIZE_BITS 0x003f0000u
#define PIO_DBG_CFGINFO_IMEM_SIZE_MSB 21u
#define PIO_DBG_CFGINFO_IMEM_SIZE_LSB 16u
#define PIO_DBG_CFGINFO_IMEM_SIZE_ACCESS "RO"
#define PIO_DBG_CFGINFO_SM_COUNT_RESET "-"
#define PIO_DBG_CFGINFO_SM_COUNT_BITS 0x00000f00u
#define PIO_DBG_CFGINFO_SM_COUNT_MSB 11u
#define PIO_DBG_CFGINFO_SM_COUNT_LSB 8u
#define PIO_DBG_CFGINFO_SM_COUNT_ACCESS "RO"
#define PIO_DBG_CFGINFO_FIFO_DEPTH_RESET "-"
#define PIO_DBG_CFGINFO_FIFO_DEPTH_BITS 0x0000003fu
#define PIO_DBG_CFGINFO_FIFO_DEPTH_MSB 5u
#define PIO_DBG_CFGINFO_FIFO_DEPTH_LSB 0u
#define PIO_DBG_CFGINFO_FIFO_DEPTH_ACCESS "RO"
#define PIO_INSTR_MEM0_OFFSET 0x00000048u
#define PIO_INSTR_MEM0_BITS 0x0000ffffu
#define PIO_INSTR_MEM0_RESET 0x00000000u
#define PIO_INSTR_MEM0_MSB 15u
#define PIO_INSTR_MEM0_LSB 0u
#define PIO_INSTR_MEM0_ACCESS "WO"
#define PIO_INSTR_MEM1_OFFSET 0x0000004cu
#define PIO_INSTR_MEM1_BITS 0x0000ffffu
#define PIO_INSTR_MEM1_RESET 0x00000000u
#define PIO_INSTR_MEM1_MSB 15u
#define PIO_INSTR_MEM1_LSB 0u
#define PIO_INSTR_MEM1_ACCESS "WO"
#define PIO_INSTR_MEM2_OFFSET 0x00000050u
#define PIO_INSTR_MEM2_BITS 0x0000ffffu
#define PIO_INSTR_MEM2_RESET 0x00000000u
#define PIO_INSTR_MEM2_MSB 15u
#define PIO_INSTR_MEM2_LSB 0u
#define PIO_INSTR_MEM2_ACCESS "WO"
#define PIO_INSTR_MEM3_OFFSET 0x00000054u
#define PIO_INSTR_MEM3_BITS 0x0000ffffu
#define PIO_INSTR_MEM3_RESET 0x00000000u
#define PIO_INSTR_MEM3_MSB 15u
#define PIO_INSTR_MEM3_LSB 0u
#define PIO_INSTR_MEM3_ACCESS "WO"
#define PIO_INSTR_MEM4_OFFSET 0x00000058u
#define PIO_INSTR_MEM4_BITS 0x0000ffffu
#define PIO_INSTR_MEM4_RESET 0x00000000u
#define PIO_INSTR_MEM4_MSB 15u
#define PIO_INSTR_MEM4_LSB 0u
#define PIO_INSTR_MEM4_ACCESS "WO"
#define PIO_INSTR_MEM5_OFFSET 0x0000005cu
#define PIO_INSTR_MEM5_BITS 0x0000ffffu
#define PIO_INSTR_MEM5_RESET 0x00000000u
#define PIO_INSTR_MEM5_MSB 15u
#define PIO_INSTR_MEM5_LSB 0u
#define PIO_INSTR_MEM5_ACCESS "WO"
#define PIO_INSTR_MEM6_OFFSET 0x00000060u
#define PIO_INSTR_MEM6_BITS 0x0000ffffu
#define PIO_INSTR_MEM6_RESET 0x00000000u
#define PIO_INSTR_MEM6_MSB 15u
#define PIO_INSTR_MEM6_LSB 0u
#define PIO_INSTR_MEM6_ACCESS "WO"
#define PIO_INSTR_MEM7_OFFSET 0x00000064u
#define PIO_INSTR_MEM7_BITS 0x0000ffffu
#define PIO_INSTR_MEM7_RESET 0x00000000u
#define PIO_INSTR_MEM7_MSB 15u
#define PIO_INSTR_MEM7_LSB 0u
#define PIO_INSTR_MEM7_ACCESS "WO"
#define PIO_INSTR_MEM8_OFFSET 0x00000068u
#define PIO_INSTR_MEM8_BITS 0x0000ffffu
#define PIO_INSTR_MEM8_RESET 0x00000000u
#define PIO_INSTR_MEM8_MSB 15u
#define PIO_INSTR_MEM8_LSB 0u
#define PIO_INSTR_MEM8_ACCESS "WO"
#define PIO_INSTR_MEM9_OFFSET 0x0000006cu
#define PIO_INSTR_MEM9_BITS 0x0000ffffu
#define PIO_INSTR_MEM9_RESET 0x00000000u
#define PIO_INSTR_MEM9_MSB 15u
#define PIO_INSTR_MEM9_LSB 0u
#define PIO_INSTR_MEM9_ACCESS "WO"
#define PIO_INSTR_MEM10_OFFSET 0x00000070u
#define PIO_INSTR_MEM10_BITS 0x0000ffffu
#define PIO_INSTR_MEM10_RESET 0x00000000u
#define PIO_INSTR_MEM10_MSB 15u
#define PIO_INSTR_MEM10_LSB 0u
#define PIO_INSTR_MEM10_ACCESS "WO"
#define PIO_INSTR_MEM11_OFFSET 0x00000074u
#define PIO_INSTR_MEM11_BITS 0x0000ffffu
#define PIO_INSTR_MEM11_RESET 0x00000000u
#define PIO_INSTR_MEM11_MSB 15u
#define PIO_INSTR_MEM11_LSB 0u
#define PIO_INSTR_MEM11_ACCESS "WO"
#define PIO_INSTR_MEM12_OFFSET 0x00000078u
#define PIO_INSTR_MEM12_BITS 0x0000ffffu
#define PIO_INSTR_MEM12_RESET 0x00000000u
#define PIO_INSTR_MEM12_MSB 15u
#define PIO_INSTR_MEM12_LSB 0u
#define PIO_INSTR_MEM12_ACCESS "WO"
#define PIO_INSTR_MEM13_OFFSET 0x0000007cu
#define PIO_INSTR_MEM13_BITS 0x0000ffffu
#define PIO_INSTR_MEM13_RESET 0x00000000u
#define PIO_INSTR_MEM13_MSB 15u
#define PIO_INSTR_MEM13_LSB 0u
#define PIO_INSTR_MEM13_ACCESS "WO"
#define PIO_INSTR_MEM14_OFFSET 0x00000080u
#define PIO_INSTR_MEM14_BITS 0x0000ffffu
#define PIO_INSTR_MEM14_RESET 0x00000000u
#define PIO_INSTR_MEM14_MSB 15u
#define PIO_INSTR_MEM14_LSB 0u
#define PIO_INSTR_MEM14_ACCESS "WO"
#define PIO_INSTR_MEM15_OFFSET 0x00000084u
#define PIO_INSTR_MEM15_BITS 0x0000ffffu
#define PIO_INSTR_MEM15_RESET 0x00000000u
#define PIO_INSTR_MEM15_MSB 15u
#define PIO_INSTR_MEM15_LSB 0u
#define PIO_INSTR_MEM15_ACCESS "WO"
#define PIO_INSTR_MEM16_OFFSET 0x00000088u
#define PIO_INSTR_MEM16_BITS 0x0000ffffu
#define PIO_INSTR_MEM16_RESET 0x00000000u
#define PIO_INSTR_MEM16_MSB 15u
#define PIO_INSTR_MEM16_LSB 0u
#define PIO_INSTR_MEM16_ACCESS "WO"
#define PIO_INSTR_MEM17_OFFSET 0x0000008cu
#define PIO_INSTR_MEM17_BITS 0x0000ffffu
#define PIO_INSTR_MEM17_RESET 0x00000000u
#define PIO_INSTR_MEM17_MSB 15u
#define PIO_INSTR_MEM17_LSB 0u
#define PIO_INSTR_MEM17_ACCESS "WO"
#define PIO_INSTR_MEM18_OFFSET 0x00000090u
#define PIO_INSTR_MEM18_BITS 0x0000ffffu
#define PIO_INSTR_MEM18_RESET 0x00000000u
#define PIO_INSTR_MEM18_MSB 15u
#define PIO_INSTR_MEM18_LSB 0u
#define PIO_INSTR_MEM18_ACCESS "WO"
#define PIO_INSTR_MEM19_OFFSET 0x00000094u
#define PIO_INSTR_MEM19_BITS 0x0000ffffu
#define PIO_INSTR_MEM19_RESET 0x00000000u
#define PIO_INSTR_MEM19_MSB 15u
#define PIO_INSTR_MEM19_LSB 0u
#define PIO_INSTR_MEM19_ACCESS "WO"
#define PIO_INSTR_MEM20_OFFSET 0x00000098u
#define PIO_INSTR_MEM20_BITS 0x0000ffffu
#define PIO_INSTR_MEM20_RESET 0x00000000u
#define PIO_INSTR_MEM20_MSB 15u
#define PIO_INSTR_MEM20_LSB 0u
#define PIO_INSTR_MEM20_ACCESS "WO"
#define PIO_INSTR_MEM21_OFFSET 0x0000009cu
#define PIO_INSTR_MEM21_BITS 0x0000ffffu
#define PIO_INSTR_MEM21_RESET 0x00000000u
#define PIO_INSTR_MEM21_MSB 15u
#define PIO_INSTR_MEM21_LSB 0u
#define PIO_INSTR_MEM21_ACCESS "WO"
#define PIO_INSTR_MEM22_OFFSET 0x000000a0u
#define PIO_INSTR_MEM22_BITS 0x0000ffffu
#define PIO_INSTR_MEM22_RESET 0x00000000u
#define PIO_INSTR_MEM22_MSB 15u
#define PIO_INSTR_MEM22_LSB 0u
#define PIO_INSTR_MEM22_ACCESS "WO"
#define PIO_INSTR_MEM23_OFFSET 0x000000a4u
#define PIO_INSTR_MEM23_BITS 0x0000ffffu
#define PIO_INSTR_MEM23_RESET 0x00000000u
#define PIO_INSTR_MEM23_MSB 15u
#define PIO_INSTR_MEM23_LSB 0u
#define PIO_INSTR_MEM23_ACCESS "WO"
#define PIO_INSTR_MEM24_OFFSET 0x000000a8u
#define PIO_INSTR_MEM24_BITS 0x0000ffffu
#define PIO_INSTR_MEM24_RESET 0x00000000u
#define PIO_INSTR_MEM24_MSB 15u
#define PIO_INSTR_MEM24_LSB 0u
#define PIO_INSTR_MEM24_ACCESS "WO"
#define PIO_INSTR_MEM25_OFFSET 0x000000acu
#define PIO_INSTR_MEM25_BITS 0x0000ffffu
#define PIO_INSTR_MEM25_RESET 0x00000000u
#define PIO_INSTR_MEM25_MSB 15u
#define PIO_INSTR_MEM25_LSB 0u
#define PIO_INSTR_MEM25_ACCESS "WO"
#define PIO_INSTR_MEM26_OFFSET 0x000000b0u
#define PIO_INSTR_MEM26_BITS 0x0000ffffu
#define PIO_INSTR_MEM26_RESET 0x00000000u
#define PIO_INSTR_MEM26_MSB 15u
#define PIO_INSTR_MEM26_LSB 0u
#define PIO_INSTR_MEM26_ACCESS "WO"
#define PIO_INSTR_MEM27_OFFSET 0x000000b4u
#define PIO_INSTR_MEM27_BITS 0x0000ffffu
#define PIO_INSTR_MEM27_RESET 0x00000000u
#define PIO_INSTR_MEM27_MSB 15u
#define PIO_INSTR_MEM27_LSB 0u
#define PIO_INSTR_MEM27_ACCESS "WO"
#define PIO_INSTR_MEM28_OFFSET 0x000000b8u
#define PIO_INSTR_MEM28_BITS 0x0000ffffu
#define PIO_INSTR_MEM28_RESET 0x00000000u
#define PIO_INSTR_MEM28_MSB 15u
#define PIO_INSTR_MEM28_LSB 0u
#define PIO_INSTR_MEM28_ACCESS "WO"
#define PIO_INSTR_MEM29_OFFSET 0x000000bcu
#define PIO_INSTR_MEM29_BITS 0x0000ffffu
#define PIO_INSTR_MEM29_RESET 0x00000000u
#define PIO_INSTR_MEM29_MSB 15u
#define PIO_INSTR_MEM29_LSB 0u
#define PIO_INSTR_MEM29_ACCESS "WO"
#define PIO_INSTR_MEM30_OFFSET 0x000000c0u
#define PIO_INSTR_MEM30_BITS 0x0000ffffu
#define PIO_INSTR_MEM30_RESET 0x00000000u
#define PIO_INSTR_MEM30_MSB 15u
#define PIO_INSTR_MEM30_LSB 0u
#define PIO_INSTR_MEM30_ACCESS "WO"
#define PIO_INSTR_MEM31_OFFSET 0x000000c4u
#define PIO_INSTR_MEM31_BITS 0x0000ffffu
#define PIO_INSTR_MEM31_RESET 0x00000000u
#define PIO_INSTR_MEM31_MSB 15u
#define PIO_INSTR_MEM31_LSB 0u
#define PIO_INSTR_MEM31_ACCESS "WO"
#define PIO_SM0_CLKDIV_OFFSET 0x000000c8u
#define PIO_SM0_CLKDIV_BITS 0xffffff00u
#define PIO_SM0_CLKDIV_RESET 0x00010000u
#define PIO_SM0_CLKDIV_INT_RESET 0x0001u
#define PIO_SM0_CLKDIV_INT_BITS 0xffff0000u
#define PIO_SM0_CLKDIV_INT_MSB 31u
#define PIO_SM0_CLKDIV_INT_LSB 16u
#define PIO_SM0_CLKDIV_INT_ACCESS "RW"
#define PIO_SM0_CLKDIV_FRAC_RESET 0x00u
#define PIO_SM0_CLKDIV_FRAC_BITS 0x0000ff00u
#define PIO_SM0_CLKDIV_FRAC_MSB 15u
#define PIO_SM0_CLKDIV_FRAC_LSB 8u
#define PIO_SM0_CLKDIV_FRAC_ACCESS "RW"
#define PIO_SM0_EXECCTRL_OFFSET 0x000000ccu
#define PIO_SM0_EXECCTRL_BITS 0xffffffffu
#define PIO_SM0_EXECCTRL_RESET 0x0001f000u
#define PIO_SM0_EXECCTRL_EXEC_STALLED_RESET 0x0u
#define PIO_SM0_EXECCTRL_EXEC_STALLED_BITS 0x80000000u
#define PIO_SM0_EXECCTRL_EXEC_STALLED_MSB 31u
#define PIO_SM0_EXECCTRL_EXEC_STALLED_LSB 31u
#define PIO_SM0_EXECCTRL_EXEC_STALLED_ACCESS "RO"
#define PIO_SM0_EXECCTRL_SIDE_EN_RESET 0x0u
#define PIO_SM0_EXECCTRL_SIDE_EN_BITS 0x40000000u
#define PIO_SM0_EXECCTRL_SIDE_EN_MSB 30u
#define PIO_SM0_EXECCTRL_SIDE_EN_LSB 30u
#define PIO_SM0_EXECCTRL_SIDE_EN_ACCESS "RW"
#define PIO_SM0_EXECCTRL_SIDE_PINDIR_RESET 0x0u
#define PIO_SM0_EXECCTRL_SIDE_PINDIR_BITS 0x20000000u
#define PIO_SM0_EXECCTRL_SIDE_PINDIR_MSB 29u
#define PIO_SM0_EXECCTRL_SIDE_PINDIR_LSB 29u
#define PIO_SM0_EXECCTRL_SIDE_PINDIR_ACCESS "RW"
#define PIO_SM0_EXECCTRL_JMP_PIN_RESET 0x00u
#define PIO_SM0_EXECCTRL_JMP_PIN_BITS 0x1f000000u
#define PIO_SM0_EXECCTRL_JMP_PIN_MSB 28u
#define PIO_SM0_EXECCTRL_JMP_PIN_LSB 24u
#define PIO_SM0_EXECCTRL_JMP_PIN_ACCESS "RW"
#define PIO_SM0_EXECCTRL_OUT_EN_SEL_RESET 0x00u
#define PIO_SM0_EXECCTRL_OUT_EN_SEL_BITS 0x00f80000u
#define PIO_SM0_EXECCTRL_OUT_EN_SEL_MSB 23u
#define PIO_SM0_EXECCTRL_OUT_EN_SEL_LSB 19u
#define PIO_SM0_EXECCTRL_OUT_EN_SEL_ACCESS "RW"
#define PIO_SM0_EXECCTRL_INLINE_OUT_EN_RESET 0x0u
#define PIO_SM0_EXECCTRL_INLINE_OUT_EN_BITS 0x00040000u
#define PIO_SM0_EXECCTRL_INLINE_OUT_EN_MSB 18u
