gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PIO_SM0_EXECCTRL_INLINE_OUT_EN_LSB 18u
#define PIO_SM0_EXECCTRL_INLINE_OUT_EN_ACCESS "RW"
#define PIO_SM0_EXECCTRL_OUT_STICKY_RESET 0x0u
#define PIO_SM0_EXECCTRL_OUT_STICKY_BITS 0x00020000u
#define PIO_SM0_EXECCTRL_OUT_STICKY_MSB 17u
#define PIO_SM0_EXECCTRL_OUT_STICKY_LSB 17u
#define PIO_SM0_EXECCTRL_OUT_STICKY_ACCESS "RW"
#define PIO_SM0_EXECCTRL_WRAP_TOP_RESET 0x1fu
#define PIO_SM0_EXECCTRL_WRAP_TOP_BITS 0x0001f000u
#define PIO_SM0_EXECCTRL_WRAP_TOP_MSB 16u
#define PIO_SM0_EXECCTRL_WRAP_TOP_LSB 12u
#define PIO_SM0_EXECCTRL_WRAP_TOP_ACCESS "RW"
#define PIO_SM0_EXECCTRL_WRAP_BOTTOM_RESET 0x00u
#define PIO_SM0_EXECCTRL_WRAP_BOTTOM_BITS 0x00000f80u
#define PIO_SM0_EXECCTRL_WRAP_BOTTOM_MSB 11u
#define PIO_SM0_EXECCTRL_WRAP_BOTTOM_LSB 7u
#define PIO_SM0_EXECCTRL_WRAP_BOTTOM_ACCESS "RW"
#define PIO_SM0_EXECCTRL_STATUS_SEL_RESET 0x0u
#define PIO_SM0_EXECCTRL_STATUS_SEL_BITS 0x00000060u
#define PIO_SM0_EXECCTRL_STATUS_SEL_MSB 6u
#define PIO_SM0_EXECCTRL_STATUS_SEL_LSB 5u
#define PIO_SM0_EXECCTRL_STATUS_SEL_ACCESS "RW"
#define PIO_SM0_EXECCTRL_STATUS_SEL_VALUE_TXLEVEL 0x0u
#define PIO_SM0_EXECCTRL_STATUS_SEL_VALUE_RXLEVEL 0x1u
#define PIO_SM0_EXECCTRL_STATUS_SEL_VALUE_IRQ 0x2u
#define PIO_SM0_EXECCTRL_STATUS_N_RESET 0x00u
#define PIO_SM0_EXECCTRL_STATUS_N_BITS 0x0000001fu
#define PIO_SM0_EXECCTRL_STATUS_N_MSB 4u
#define PIO_SM0_EXECCTRL_STATUS_N_LSB 0u
#define PIO_SM0_EXECCTRL_STATUS_N_ACCESS "RW"
#define PIO_SM0_EXECCTRL_STATUS_N_VALUE_IRQ 0x00u
#define PIO_SM0_EXECCTRL_STATUS_N_VALUE_IRQ_PREVPIO 0x08u
#define PIO_SM0_EXECCTRL_STATUS_N_VALUE_IRQ_NEXTPIO 0x10u
#define PIO_SM0_SHIFTCTRL_OFFSET 0x000000d0u
#define PIO_SM0_SHIFTCTRL_BITS 0xffffc01fu
#define PIO_SM0_SHIFTCTRL_RESET 0x000c0000u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_RESET 0x0u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_BITS 0x80000000u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_MSB 31u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_LSB 31u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_FJOIN_TX_RESET 0x0u
#define PIO_SM0_SHIFTCTRL_FJOIN_TX_BITS 0x40000000u
#define PIO_SM0_SHIFTCTRL_FJOIN_TX_MSB 30u
#define PIO_SM0_SHIFTCTRL_FJOIN_TX_LSB 30u
#define PIO_SM0_SHIFTCTRL_FJOIN_TX_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_PULL_THRESH_RESET 0x00u
#define PIO_SM0_SHIFTCTRL_PULL_THRESH_BITS 0x3e000000u
#define PIO_SM0_SHIFTCTRL_PULL_THRESH_MSB 29u
#define PIO_SM0_SHIFTCTRL_PULL_THRESH_LSB 25u
#define PIO_SM0_SHIFTCTRL_PULL_THRESH_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_PUSH_THRESH_RESET 0x00u
#define PIO_SM0_SHIFTCTRL_PUSH_THRESH_BITS 0x01f00000u
#define PIO_SM0_SHIFTCTRL_PUSH_THRESH_MSB 24u
#define PIO_SM0_SHIFTCTRL_PUSH_THRESH_LSB 20u
#define PIO_SM0_SHIFTCTRL_PUSH_THRESH_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_RESET 0x1u
#define PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_BITS 0x00080000u
#define PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_MSB 19u
#define PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_LSB 19u
#define PIO_SM0_SHIFTCTRL_OUT_SHIFTDIR_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_RESET 0x1u
#define PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_BITS 0x00040000u
#define PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_MSB 18u
#define PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_LSB 18u
#define PIO_SM0_SHIFTCTRL_IN_SHIFTDIR_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_AUTOPULL_RESET 0x0u
#define PIO_SM0_SHIFTCTRL_AUTOPULL_BITS 0x00020000u
#define PIO_SM0_SHIFTCTRL_AUTOPULL_MSB 17u
#define PIO_SM0_SHIFTCTRL_AUTOPULL_LSB 17u
#define PIO_SM0_SHIFTCTRL_AUTOPULL_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_AUTOPUSH_RESET 0x0u
#define PIO_SM0_SHIFTCTRL_AUTOPUSH_BITS 0x00010000u
#define PIO_SM0_SHIFTCTRL_AUTOPUSH_MSB 16u
#define PIO_SM0_SHIFTCTRL_AUTOPUSH_LSB 16u
#define PIO_SM0_SHIFTCTRL_AUTOPUSH_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_RESET 0x0u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_BITS 0x00008000u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_MSB 15u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_LSB 15u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_PUT_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_RESET 0x0u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_BITS 0x00004000u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_MSB 14u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_LSB 14u
#define PIO_SM0_SHIFTCTRL_FJOIN_RX_GET_ACCESS "RW"
#define PIO_SM0_SHIFTCTRL_IN_COUNT_RESET 0x00u
#define PIO_SM0_SHIFTCTRL_IN_COUNT_BITS 0x0000001fu
#define PIO_SM0_SHIFTCTRL_IN_COUNT_MSB 4u
#define PIO_SM0_SHIFTCTRL_IN_COUNT_LSB 0u
#define PIO_SM0_SHIFTCTRL_IN_COUNT_ACCESS "RW"
#define PIO_SM0_ADDR_OFFSET 0x000000d4u
#define PIO_SM0_ADDR_BITS 0x0000001fu
#define PIO_SM0_ADDR_RESET 0x00000000u
#define PIO_SM0_ADDR_MSB 4u
#define PIO_SM0_ADDR_LSB 0u
#define PIO_SM0_ADDR_ACCESS "RO"
#define PIO_SM0_INSTR_OFFSET 0x000000d8u
#define PIO_SM0_INSTR_BITS 0x0000ffffu
#define PIO_SM0_INSTR_RESET "-"
#define PIO_SM0_INSTR_MSB 15u
#define PIO_SM0_INSTR_LSB 0u
#define PIO_SM0_INSTR_ACCESS "RW"
#define PIO_SM0_PINCTRL_OFFSET 0x000000dcu
#define PIO_SM0_PINCTRL_BITS 0xffffffffu
#define PIO_SM0_PINCTRL_RESET 0x14000000u
#define PIO_SM0_PINCTRL_SIDESET_COUNT_RESET 0x0u
#define PIO_SM0_PINCTRL_SIDESET_COUNT_BITS 0xe0000000u
#define PIO_SM0_PINCTRL_SIDESET_COUNT_MSB 31u
#define PIO_SM0_PINCTRL_SIDESET_COUNT_LSB 29u
#define PIO_SM0_PINCTRL_SIDESET_COUNT_ACCESS "RW"
#define PIO_SM0_PINCTRL_SET_COUNT_RESET 0x5u
#define PIO_SM0_PINCTRL_SET_COUNT_BITS 0x1c000000u
#define PIO_SM0_PINCTRL_SET_COUNT_MSB 28u
#define PIO_SM0_PINCTRL_SET_COUNT_LSB 26u
#define PIO_SM0_PINCTRL_SET_COUNT_ACCESS "RW"
#define PIO_SM0_PINCTRL_OUT_COUNT_RESET 0x00u
#define PIO_SM0_PINCTRL_OUT_COUNT_BITS 0x03f00000u
#define PIO_SM0_PINCTRL_OUT_COUNT_MSB 25u
#define PIO_SM0_PINCTRL_OUT_COUNT_LSB 20u
#define PIO_SM0_PINCTRL_OUT_COUNT_ACCESS "RW"
#define PIO_SM0_PINCTRL_IN_BASE_RESET 0x00u
#define PIO_SM0_PINCTRL_IN_BASE_BITS 0x000f8000u
#define PIO_SM0_PINCTRL_IN_BASE_MSB 19u
#define PIO_SM0_PINCTRL_IN_BASE_LSB 15u
#define PIO_SM0_PINCTRL_IN_BASE_ACCESS "RW"
#define PIO_SM0_PINCTRL_SIDESET_BASE_RESET 0x00u
#define PIO_SM0_PINCTRL_SIDESET_BASE_BITS 0x00007c00u
#define PIO_SM0_PINCTRL_SIDESET_BASE_MSB 14u
#define PIO_SM0_PINCTRL_SIDESET_BASE_LSB 10u
#define PIO_SM0_PINCTRL_SIDESET_BASE_ACCESS "RW"
#define PIO_SM0_PINCTRL_SET_BASE_RESET 0x00u
#define PIO_SM0_PINCTRL_SET_BASE_BITS 0x000003e0u
#define PIO_SM0_PINCTRL_SET_BASE_MSB 9u
#define PIO_SM0_PINCTRL_SET_BASE_LSB 5u
#define PIO_SM0_PINCTRL_SET_BASE_ACCESS "RW"
#define PIO_SM0_PINCTRL_OUT_BASE_RESET 0x00u
#define PIO_SM0_PINCTRL_OUT_BASE_BITS 0x0000001fu
#define PIO_SM0_PINCTRL_OUT_BASE_MSB 4u
#define PIO_SM0_PINCTRL_OUT_BASE_LSB 0u
#define PIO_SM0_PINCTRL_OUT_BASE_ACCESS "RW"
#define PIO_SM1_CLKDIV_OFFSET 0x000000e0u
#define PIO_SM1_CLKDIV_BITS 0xffffff00u
#define PIO_SM1_CLKDIV_RESET 0x00010000u
#define PIO_SM1_CLKDIV_INT_RESET 0x0001u
#define PIO_SM1_CLKDIV_INT_BITS 0xffff0000u
#define PIO_SM1_CLKDIV_INT_MSB 31u
#define PIO_SM1_CLKDIV_INT_LSB 16u
#define PIO_SM1_CLKDIV_INT_ACCESS "RW"
#define PIO_SM1_CLKDIV_FRAC_RESET 0x00u
#define PIO_SM1_CLKDIV_FRAC_BITS 0x0000ff00u
#define PIO_SM1_CLKDIV_FRAC_MSB 15u
#define PIO_SM1_CLKDIV_FRAC_LSB 8u
#define PIO_SM1_CLKDIV_FRAC_ACCESS "RW"
#define PIO_SM1_EXECCTRL_OFFSET 0x000000e4u
#define PIO_SM1_EXECCTRL_BITS 0xffffffffu
#define PIO_SM1_EXECCTRL_RESET 0x0001f000u
#define PIO_SM1_EXECCTRL_EXEC_STALLED_RESET 0x0u
#define PIO_SM1_EXECCTRL_EXEC_STALLED_BITS 0x80000000u
#define PIO_SM1_EXECCTRL_EXEC_STALLED_MSB 31u
#define PIO_SM1_EXECCTRL_EXEC_STALLED_LSB 31u
#define PIO_SM1_EXECCTRL_EXEC_STALLED_ACCESS "RO"
#define PIO_SM1_EXECCTRL_SIDE_EN_RESET 0x0u
#define PIO_SM1_EXECCTRL_SIDE_EN_BITS 0x40000000u
#define PIO_SM1_EXECCTRL_SIDE_EN_MSB 30u
#define PIO_SM1_EXECCTRL_SIDE_EN_LSB 30u
#define PIO_SM1_EXECCTRL_SIDE_EN_ACCESS "RW"
#define PIO_SM1_EXECCTRL_SIDE_PINDIR_RESET 0x0u
#define PIO_SM1_EXECCTRL_SIDE_PINDIR_BITS 0x20000000u
#define PIO_SM1_EXECCTRL_SIDE_PINDIR_MSB 29u
#define PIO_SM1_EXECCTRL_SIDE_PINDIR_LSB 29u
#define PIO_SM1_EXECCTRL_SIDE_PINDIR_ACCESS "RW"
#define PIO_SM1_EXECCTRL_JMP_PIN_RESET 0x00u
#define PIO_SM1_EXECCTRL_JMP_PIN_BITS 0x1f000000u
#define PIO_SM1_EXECCTRL_JMP_PIN_MSB 28u
#define PIO_SM1_EXECCTRL_JMP_PIN_LSB 24u
#define PIO_SM1_EXECCTRL_JMP_PIN_ACCESS "RW"
#define PIO_SM1_EXECCTRL_OUT_EN_SEL_RESET 0x00u
#define PIO_SM1_EXECCTRL_OUT_EN_SEL_BITS 0x00f80000u
#define PIO_SM1_EXECCTRL_OUT_EN_SEL_MSB 23u
#define PIO_SM1_EXECCTRL_OUT_EN_SEL_LSB 19u
#define PIO_SM1_EXECCTRL_OUT_EN_SEL_ACCESS "RW"
#define PIO_SM1_EXECCTRL_INLINE_OUT_EN_RESET 0x0u
#define PIO_SM1_EXECCTRL_INLINE_OUT_EN_BITS 0x00040000u
#define PIO_SM1_EXECCTRL_INLINE_OUT_EN_MSB 18u
#define PIO_SM1_EXECCTRL_INLINE_OUT_EN_LSB 18u
#define PIO_SM1_EXECCTRL_INLINE_OUT_EN_ACCESS "RW"
#define PIO_SM1_EXECCTRL_OUT_STICKY_RESET 0x0u
#define PIO_SM1_EXECCTRL_OUT_STICKY_BITS 0x00020000u
#define PIO_SM1_EXECCTRL_OUT_STICKY_MSB 17u
#define PIO_SM1_EXECCTRL_OUT_STICKY_LSB 17u
#define PIO_SM1_EXECCTRL_OUT_STICKY_ACCESS "RW"
#define PIO_SM1_EXECCTRL_WRAP_TOP_RESET 0x1fu
#define PIO_SM1_EXECCTRL_WRAP_TOP_BITS 0x0001f000u
#define PIO_SM1_EXECCTRL_WRAP_TOP_MSB 16u
#define PIO_SM1_EXECCTRL_WRAP_TOP_LSB 12u
#define PIO_SM1_EXECCTRL_WRAP_TOP_ACCESS "RW"
#define PIO_SM1_EXECCTRL_WRAP_BOTTOM_RESET 0x00u
#define PIO_SM1_EXECCTRL_WRAP_BOTTOM_BITS 0x00000f80u
#define PIO_SM1_EXECCTRL_WRAP_BOTTOM_MSB 11u
#define PIO_SM1_EXECCTRL_WRAP_BOTTOM_LSB 7u
#define PIO_SM1_EXECCTRL_WRAP_BOTTOM_ACCESS "RW"
#define PIO_SM1_EXECCTRL_STATUS_SEL_RESET 0x0u
#define PIO_SM1_EXECCTRL_STATUS_SEL_BITS 0x00000060u
#define PIO_SM1_EXECCTRL_STATUS_SEL_MSB 6u
#define PIO_SM1_EXECCTRL_STATUS_SEL_LSB 5u
#define PIO_SM1_EXECCTRL_STATUS_SEL_ACCESS "RW"
#define PIO_SM1_EXECCTRL_STATUS_SEL_VALUE_TXLEVEL 0x0u
#define PIO_SM1_EXECCTRL_STATUS_SEL_VALUE_RXLEVEL 0x1u
#define PIO_SM1_EXECCTRL_STATUS_SEL_VALUE_IRQ 0x2u
#define PIO_SM1_EXECCTRL_STATUS_N_RESET 0x00u
#define PIO_SM1_EXECCTRL_STATUS_N_BITS 0x0000001fu
#define PIO_SM1_EXECCTRL_STATUS_N_MSB 4u
#define PIO_SM1_EXECCTRL_STATUS_N_LSB 0u
#define PIO_SM1_EXECCTRL_STATUS_N_ACCESS "RW"
#define PIO_SM1_EXECCTRL_STATUS_N_VALUE_IRQ 0x00u
#define PIO_SM1_EXECCTRL_STATUS_N_VALUE_IRQ_PREVPIO 0x08u
#define PIO_SM1_EXECCTRL_STATUS_N_VALUE_IRQ_NEXTPIO 0x10u
#define PIO_SM1_SHIFTCTRL_OFFSET 0x000000e8u
#define PIO_SM1_SHIFTCTRL_BITS 0xffffc01fu
#define PIO_SM1_SHIFTCTRL_RESET 0x000c0000u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_RESET 0x0u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_BITS 0x80000000u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_MSB 31u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_LSB 31u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_FJOIN_TX_RESET 0x0u
#define PIO_SM1_SHIFTCTRL_FJOIN_TX_BITS 0x40000000u
#define PIO_SM1_SHIFTCTRL_FJOIN_TX_MSB 30u
#define PIO_SM1_SHIFTCTRL_FJOIN_TX_LSB 30u
#define PIO_SM1_SHIFTCTRL_FJOIN_TX_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_PULL_THRESH_RESET 0x00u
#define PIO_SM1_SHIFTCTRL_PULL_THRESH_BITS 0x3e000000u
#define PIO_SM1_SHIFTCTRL_PULL_THRESH_MSB 29u
#define PIO_SM1_SHIFTCTRL_PULL_THRESH_LSB 25u
#define PIO_SM1_SHIFTCTRL_PULL_THRESH_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_PUSH_THRESH_RESET 0x00u
#define PIO_SM1_SHIFTCTRL_PUSH_THRESH_BITS 0x01f00000u
#define PIO_SM1_SHIFTCTRL_PUSH_THRESH_MSB 24u
#define PIO_SM1_SHIFTCTRL_PUSH_THRESH_LSB 20u
#define PIO_SM1_SHIFTCTRL_PUSH_THRESH_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_RESET 0x1u
#define PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_BITS 0x00080000u
#define PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_MSB 19u
#define PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_LSB 19u
#define PIO_SM1_SHIFTCTRL_OUT_SHIFTDIR_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_RESET 0x1u
#define PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_BITS 0x00040000u
#define PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_MSB 18u
#define PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_LSB 18u
#define PIO_SM1_SHIFTCTRL_IN_SHIFTDIR_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_AUTOPULL_RESET 0x0u
#define PIO_SM1_SHIFTCTRL_AUTOPULL_BITS 0x00020000u
#define PIO_SM1_SHIFTCTRL_AUTOPULL_MSB 17u
#define PIO_SM1_SHIFTCTRL_AUTOPULL_LSB 17u
#define PIO_SM1_SHIFTCTRL_AUTOPULL_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_AUTOPUSH_RESET 0x0u
#define PIO_SM1_SHIFTCTRL_AUTOPUSH_BITS 0x00010000u
#define PIO_SM1_SHIFTCTRL_AUTOPUSH_MSB 16u
#define PIO_SM1_SHIFTCTRL_AUTOPUSH_LSB 16u
#define PIO_SM1_SHIFTCTRL_AUTOPUSH_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_RESET 0x0u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_BITS 0x00008000u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_MSB 15u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_LSB 15u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_PUT_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_RESET 0x0u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_BITS 0x00004000u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_MSB 14u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_LSB 14u
#define PIO_SM1_SHIFTCTRL_FJOIN_RX_GET_ACCESS "RW"
#define PIO_SM1_SHIFTCTRL_IN_COUNT_RESET 0x00u
#define PIO_SM1_SHIFTCTRL_IN_COUNT_BITS 0x0000001fu
#define PIO_SM1_SHIFTCTRL_IN_COUNT_MSB 4u
#define PIO_SM1_SHIFTCTRL_IN_COUNT_LSB 0u
#define PIO_SM1_SHIFTCTRL_IN_COUNT_ACCESS "RW"
#define PIO_SM1_ADDR_OFFSET 0x000000ecu
#define PIO_SM1_ADDR_BITS 0x0000001fu
#define PIO_SM1_ADDR_RESET 0x00000000u
#define PIO_SM1_ADDR_MSB 4u
#define PIO_SM1_ADDR_LSB 0u
#define PIO_SM1_ADDR_ACCESS "RO"
#define PIO_SM1_INSTR_OFFSET 0x000000f0u
#define PIO_SM1_INSTR_BITS 0x0000ffffu
#define PIO_SM1_INSTR_RESET "-"
#define PIO_SM1_INSTR_MSB 15u
#define PIO_SM1_INSTR_LSB 0u
#define PIO_SM1_INSTR_ACCESS "RW"
#define PIO_SM1_PINCTRL_OFFSET 0x000000f4u
#define PIO_SM1_PINCTRL_BITS 0xffffffffu
#define PIO_SM1_PINCTRL_RESET 0x14000000u
#define PIO_SM1_PINCTRL_SIDESET_COUNT_RESET 0x0u
#define PIO_SM1_PINCTRL_SIDESET_COUNT_BITS 0xe0000000u
#define PIO_SM1_PINCTRL_SIDESET_COUNT_MSB 31u
#define PIO_SM1_PINCTRL_SIDESET_COUNT_LSB 29u
#define PIO_SM1_PINCTRL_SIDESET_COUNT_ACCESS "RW"
#define PIO_SM1_PINCTRL_SET_COUNT_RESET 0x5u
#define PIO_SM1_PINCTRL_SET_COUNT_BITS 0x1c000000u
#define PIO_SM1_PINCTRL_SET_COUNT_MSB 28u
#define PIO_SM1_PINCTRL_SET_COUNT_LSB 26u
#define PIO_SM1_PINCTRL_SET_COUNT_ACCESS "RW"
#define PIO_SM1_PINCTRL_OUT_COUNT_RESET 0x00u
#define PIO_SM1_PINCTRL_OUT_COUNT_BITS 0x03f00000u
#define PIO_SM1_PINCTRL_OUT_COUNT_MSB 25u
#define PIO_SM1_PINCTRL_OUT_COUNT_LSB 20u
#define PIO_SM1_PINCTRL_OUT_COUNT_ACCESS "RW"
#define PIO_SM1_PINCTRL_IN_BASE_RESET 0x00u
#define PIO_SM1_PINCTRL_IN_BASE_BITS 0x000f8000u
#define PIO_SM1_PINCTRL_IN_BASE_MSB 19u
#define PIO_SM1_PINCTRL_IN_BASE_LSB 15u
#define PIO_SM1_PINCTRL_IN_BASE_ACCESS "RW"
#define PIO_SM1_PINCTRL_SIDESET_BASE_RESET 0x00u
#define PIO_SM1_PINCTRL_SIDESET_BASE_BITS 0x00007c00u
#define PIO_SM1_PINCTRL_SIDESET_BASE_MSB 14u
#define PIO_SM1_PINCTRL_SIDESET_BASE_LSB 10u
#define PIO_SM1_PINCTRL_SIDESET_BASE_ACCESS "RW"
#define PIO_SM1_PINCTRL_SET_BASE_RESET 0x00u
#define PIO_SM1_PINCTRL_SET_BASE_BITS 0x000003e0u
#define PIO_SM1_PINCTRL_SET_BASE_MSB 9u
#define PIO_SM1_PINCTRL_SET_BASE_LSB 5u
#define PIO_SM1_PINCTRL_SET_BASE_ACCESS "RW"
#define PIO_SM1_PINCTRL_OUT_BASE_RESET 0x00u
#define PIO_SM1_PINCTRL_OUT_BASE_BITS 0x0000001fu
#define PIO_SM1_PINCTRL_OUT_BASE_MSB 4u
#define PIO_SM1_PINCTRL_OUT_BASE_LSB 0u
#define PIO_SM1_PINCTRL_OUT_BASE_ACCESS "RW"
#define PIO_SM2_CLKDIV_OFFSET 0x000000f8u
#define PIO_SM2_CLKDIV_BITS 0xffffff00u
#define PIO_SM2_CLKDIV_RESET 0x00010000u
#define PIO_SM2_CLKDIV_INT_RESET 0x0001u
#define PIO_SM2_CLKDIV_INT_BITS 0xffff0000u
#define PIO_SM2_CLKDIV_INT_MSB 31u
#define PIO_SM2_CLKDIV_INT_LSB 16u
#define PIO_SM2_CLKDIV_INT_ACCESS "RW"
#define PIO_SM2_CLKDIV_FRAC_RESET 0x00u
#define PIO_SM2_CLKDIV_FRAC_BITS 0x0000ff00u
#define PIO_SM2_CLKDIV_FRAC_MSB 15u
#define PIO_SM2_CLKDIV_FRAC_LSB 8u
#define PIO_SM2_CLKDIV_FRAC_ACCESS "RW"
#define PIO_SM2_EXECCTRL_OFFSET 0x000000fcu
#define PIO_SM2_EXECCTRL_BITS 0xffffffffu
#define PIO_SM2_EXECCTRL_RESET 0x0001f000u
#define PIO_SM2_EXECCTRL_EXEC_STALLED_RESET 0x0u
#define PIO_SM2_EXECCTRL_EXEC_STALLED_BITS 0x80000000u
#define PIO_SM2_EXECCTRL_EXEC_STALLED_MSB 31u
#define PIO_SM2_EXECCTRL_EXEC_STALLED_LSB 31u
#define PIO_SM2_EXECCTRL_EXEC_STALLED_ACCESS "RO"
#define PIO_SM2_EXECCTRL_SIDE_EN_RESET 0x0u
#define PIO_SM2_EXECCTRL_SIDE_EN_BITS 0x40000000u
#define PIO_SM2_EXECCTRL_SIDE_EN_MSB 30u
#define PIO_SM2_EXECCTRL_SIDE_EN_LSB 30u
#define PIO_SM2_EXECCTRL_SIDE_EN_ACCESS "RW"
#define PIO_SM2_EXECCTRL_SIDE_PINDIR_RESET 0x0u
#define PIO_SM2_EXECCTRL_SIDE_PINDIR_BITS 0x20000000u
#define PIO_SM2_EXECCTRL_SIDE_PINDIR_MSB 29u
#define PIO_SM2_EXECCTRL_SIDE_PINDIR_LSB 29u
#define PIO_SM2_EXECCTRL_SIDE_PINDIR_ACCESS "RW"
#define PIO_SM2_EXECCTRL_JMP_PIN_RESET 0x00u
#define PIO_SM2_EXECCTRL_JMP_PIN_BITS 0x1f000000u
#define PIO_SM2_EXECCTRL_JMP_PIN_MSB 28u
#define PIO_SM2_EXECCTRL_JMP_PIN_LSB 24u
#define PIO_SM2_EXECCTRL_JMP_PIN_ACCESS "RW"
#define PIO_SM2_EXECCTRL_OUT_EN_SEL_RESET 0x00u
#define PIO_SM2_EXECCTRL_OUT_EN_SEL_BITS 0x00f80000u
#define PIO_SM2_EXECCTRL_OUT_EN_SEL_MSB 23u
#define PIO_SM2_EXECCTRL_OUT_EN_SEL_LSB 19u
#define PIO_SM2_EXECCTRL_OUT_EN_SEL_ACCESS "RW"
#define PIO_SM2_EXECCTRL_INLINE_OUT_EN_RESET 0x0u
#define PIO_SM2_EXECCTRL_INLINE_OUT_EN_BITS 0x00040000u
#define PIO_SM2_EXECCTRL_INLINE_OUT_EN_MSB 18u
#define PIO_SM2_EXECCTRL_INLINE_OUT_EN_LSB 18u
#define PIO_SM2_EXECCTRL_INLINE_OUT_EN_ACCESS "RW"
#define PIO_SM2_EXECCTRL_OUT_STICKY_RESET 0x0u
#define PIO_SM2_EXECCTRL_OUT_STICKY_BITS 0x00020000u
#define PIO_SM2_EXECCTRL_OUT_STICKY_MSB 17u
#define PIO_SM2_EXECCTRL_OUT_STICKY_LSB 17u
#define PIO_SM2_EXECCTRL_OUT_STICKY_ACCESS "RW"
#define PIO_SM2_EXECCTRL_WRAP_TOP_RESET 0x1fu
#define PIO_SM2_EXECCTRL_WRAP_TOP_BITS 0x0001f000u
#define PIO_SM2_EXECCTRL_WRAP_TOP_MSB 16u
#define PIO_SM2_EXECCTRL_WRAP_TOP_LSB 12u
#define PIO_SM2_EXECCTRL_WRAP_TOP_ACCESS "RW"
#define PIO_SM2_EXECCTRL_WRAP_BOTTOM_RESET 0x00u
#define PIO_SM2_EXECCTRL_WRAP_BOTTOM_BITS 0x00000f80u
#define PIO_SM2_EXECCTRL_WRAP_BOTTOM_MSB 11u
#define PIO_SM2_EXECCTRL_WRAP_BOTTOM_LSB 7u
#define PIO_SM2_EXECCTRL_WRAP_BOTTOM_ACCESS "RW"
#define PIO_SM2_EXECCTRL_STATUS_SEL_RESET 0x0u
#define PIO_SM2_EXECCTRL_STATUS_SEL_BITS 0x00000060u
#define PIO_SM2_EXECCTRL_STATUS_SEL_MSB 6u
#define PIO_SM2_EXECCTRL_STATUS_SEL_LSB 5u
#define PIO_SM2_EXECCTRL_STATUS_SEL_ACCESS "RW"
#define PIO_SM2_EXECCTRL_STATUS_SEL_VALUE_TXLEVEL 0x0u
#define PIO_SM2_EXECCTRL_STATUS_SEL_VALUE_RXLEVEL 0x1u
#define PIO_SM2_EXECCTRL_STATUS_SEL_VALUE_IRQ 0x2u
#define PIO_SM2_EXECCTRL_STATUS_N_RESET 0x00u
#define PIO_SM2_EXECCTRL_STATUS_N_BITS 0x0000001fu
#define PIO_SM2_EXECCTRL_STATUS_N_MSB 4u
#define PIO_SM2_EXECCTRL_STATUS_N_LSB 0u
#define PIO_SM2_EXECCTRL_STATUS_N_ACCESS "RW"
#define PIO_SM2_EXECCTRL_STATUS_N_VALUE_IRQ 0x00u
#define PIO_SM2_EXECCTRL_STATUS_N_VALUE_IRQ_PREVPIO 0x08u
#define PIO_SM2_EXECCTRL_STATUS_N_VALUE_IRQ_NEXTPIO 0x10u
#define PIO_SM2_SHIFTCTRL_OFFSET 0x00000100u
#define PIO_SM2_SHIFTCTRL_BITS 0xffffc01fu
#define PIO_SM2_SHIFTCTRL_RESET 0x000c0000u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_RESET 0x0u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_BITS 0x80000000u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_MSB 31u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_LSB 31u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_FJOIN_TX_RESET 0x0u
#define PIO_SM2_SHIFTCTRL_FJOIN_TX_BITS 0x40000000u
#define PIO_SM2_SHIFTCTRL_FJOIN_TX_MSB 30u
#define PIO_SM2_SHIFTCTRL_FJOIN_TX_LSB 30u
#define PIO_SM2_SHIFTCTRL_FJOIN_TX_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_PULL_THRESH_RESET 0x00u
#define PIO_SM2_SHIFTCTRL_PULL_THRESH_BITS 0x3e000000u
#define PIO_SM2_SHIFTCTRL_PULL_THRESH_MSB 29u
#define PIO_SM2_SHIFTCTRL_PULL_THRESH_LSB 25u
#define PIO_SM2_SHIFTCTRL_PULL_THRESH_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_PUSH_THRESH_RESET 0x00u
#define PIO_SM2_SHIFTCTRL_PUSH_THRESH_BITS 0x01f00000u
#define PIO_SM2_SHIFTCTRL_PUSH_THRESH_MSB 24u
#define PIO_SM2_SHIFTCTRL_PUSH_THRESH_LSB 20u
#define PIO_SM2_SHIFTCTRL_PUSH_THRESH_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_OUT_SHIFTDIR_RESET 0x1u
#define PIO_SM2_SHIFTCTRL_OUT_SHIFTDIR_BITS 0x00080000u
#define PIO_SM2_SHIFTCTRL_OUT_SHIFTDIR_MSB 19u
#define PIO_SM2_SHIFTCTRL_OUT_SHIFTDIR_LSB 19u
#define PIO_SM2_SHIFTCTRL_OUT_SHIFTDIR_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_IN_SHIFTDIR_RESET 0x1u
#define PIO_SM2_SHIFTCTRL_IN_SHIFTDIR_BITS 0x00040000u
#define PIO_SM2_SHIFTCTRL_IN_SHIFTDIR_MSB 18u
#define PIO_SM2_SHIFTCTRL_IN_SHIFTDIR_LSB 18u
#define PIO_SM2_SHIFTCTRL_IN_SHIFTDIR_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_AUTOPULL_RESET 0x0u
#define PIO_SM2_SHIFTCTRL_AUTOPULL_BITS 0x00020000u
#define PIO_SM2_SHIFTCTRL_AUTOPULL_MSB 17u
#define PIO_SM2_SHIFTCTRL_AUTOPULL_LSB 17u
#define PIO_SM2_SHIFTCTRL_AUTOPULL_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_AUTOPUSH_RESET 0x0u
#define PIO_SM2_SHIFTCTRL_AUTOPUSH_BITS 0x00010000u
#define PIO_SM2_SHIFTCTRL_AUTOPUSH_MSB 16u
#define PIO_SM2_SHIFTCTRL_AUTOPUSH_LSB 16u
#define PIO_SM2_SHIFTCTRL_AUTOPUSH_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_PUT_RESET 0x0u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_PUT_BITS 0x00008000u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_PUT_MSB 15u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_PUT_LSB 15u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_PUT_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_GET_RESET 0x0u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_GET_BITS 0x00004000u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_GET_MSB 14u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_GET_LSB 14u
#define PIO_SM2_SHIFTCTRL_FJOIN_RX_GET_ACCESS "RW"
#define PIO_SM2_SHIFTCTRL_IN_COUNT_RESET 0x00u
#define PIO_SM2_SHIFTCTRL_IN_COUNT_BITS 0x0000001fu
#define PIO_SM2_SHIFTCTRL_IN_COUNT_MSB 4u
#define PIO_SM2_SHIFTCTRL_IN_COUNT_LSB 0u
#define PIO_SM2_SHIFTCTRL_IN_COUNT_ACCESS "RW"
#define PIO_SM2_ADDR_OFFSET 0x00000104u
#define PIO_SM2_ADDR_BITS 0x0000001fu
#define PIO_SM2_ADDR_RESET 0x00000000u
#define PIO_SM2_ADDR_MSB 4u
#define PIO_SM2_ADDR_LSB 0u
#define PIO_SM2_ADDR_ACCESS "RO"
#define PIO_SM2_INSTR_OFFSET 0x00000108u
#define PIO_SM2_INSTR_BITS 0x0000ffffu
#define PIO_SM2_INSTR_RESET "-"
#define PIO_SM2_INSTR_MSB 15u
#define PIO_SM2_INSTR_LSB 0u
#define PIO_SM2_INSTR_ACCESS "RW"
#define PIO_SM2_PINCTRL_OFFSET 0x0000010cu
#define PIO_SM2_PINCTRL_BITS 0xffffffffu
#define PIO_SM2_PINCTRL_RESET 0x14000000u
#define PIO_SM2_PINCTRL_SIDESET_COUNT_RESET 0x0u
#define PIO_SM2_PINCTRL_SIDESET_COUNT_BITS 0xe0000000u
#define PIO_SM2_PINCTRL_SIDESET_COUNT_MSB 31u
#define PIO_SM2_PINCTRL_SIDESET_COUNT_LSB 29u
#define PIO_SM2_PINCTRL_SIDESET_COUNT_ACCESS "RW"
#define PIO_SM2_PINCTRL_SET_COUNT_RESET 0x5u
#define PIO_SM2_PINCTRL_SET_COUNT_BITS 0x1c000000u
#define PIO_SM2_PINCTRL_SET_COUNT_MSB 28u
#define PIO_SM2_PINCTRL_SET_COUNT_LSB 26u
#define PIO_SM2_PINCTRL_SET_COUNT_ACCESS "RW"
#define PIO_SM2_PINCTRL_OUT_COUNT_RESET 0x00u
#define PIO_SM2_PINCTRL_OUT_COUNT_BITS 0x03f00000u
#define PIO_SM2_PINCTRL_OUT_COUNT_MSB 25u
#define PIO_SM2_PINCTRL_OUT_COUNT_LSB 20u
#define PIO_SM2_PINCTRL_OUT_COUNT_ACCESS "RW"
#define PIO_SM2_PINCTRL_IN_BASE_RESET 0x00u
#define PIO_SM2_PINCTRL_IN_BASE_BITS 0x000f8000u
#define PIO_SM2_PINCTRL_IN_BASE_MSB 19u
#define PIO_SM2_PINCTRL_IN_BASE_LSB 15u
#define PIO_SM2_PINCTRL_IN_BASE_ACCESS "RW"
#define PIO_SM2_PINCTRL_SIDESET_BASE_RESET 0x00u
#define PIO_SM2_PINCTRL_SIDESET_BASE_BITS 0x00007c00u
#define PIO_SM2_PINCTRL_SIDESET_BASE_MSB 14u
#define PIO_SM2_PINCTRL_SIDESET_BASE_LSB 10u
#define PIO_SM2_PINCTRL_SIDESET_BASE_ACCESS "RW"
#define PIO_SM2_PINCTRL_SET_BASE_RESET 0x00u
#define PIO_SM2_PINCTRL_SET_BASE_BITS 0x000003e0u
#define PIO_SM2_PINCTRL_SET_BASE_MSB 9u
#define PIO_SM2_PINCTRL_SET_BASE_LSB 5u
#define PIO_SM2_PINCTRL_SET_BASE_ACCESS "RW"
#define PIO_SM2_PINCTRL_OUT_BASE_RESET 0x00u
#define PIO_SM2_PINCTRL_OUT_BASE_BITS 0x0000001fu
#define PIO_SM2_PINCTRL_OUT_BASE_MSB 4u
#define PIO_SM2_PINCTRL_OUT_BASE_LSB 0u
#define PIO_SM2_PINCTRL_OUT_BASE_ACCESS "RW"
#define PIO_SM3_CLKDIV_OFFSET 0x00000110u
#define PIO_SM3_CLKDIV_BITS 0xffffff00u
#define PIO_SM3_CLKDIV_RESET 0x00010000u
#define PIO_SM3_CLKDIV_INT_RESET 0x0001u
#define PIO_SM3_CLKDIV_INT_BITS 0xffff0000u
#define PIO_SM3_CLKDIV_INT_MSB 31u
#define PIO_SM3_CLKDIV_INT_LSB 16u
#define PIO_SM3_CLKDIV_INT_ACCESS "RW"
#define PIO_SM3_CLKDIV_FRAC_RESET 0x00u
#define PIO_SM3_CLKDIV_FRAC_BITS 0x0000ff00u
#define PIO_SM3_CLKDIV_FRAC_MSB 15u
#define PIO_SM3_CLKDIV_FRAC_LSB 8u
#define PIO_SM3_CLKDIV_FRAC_ACCESS "RW"
#define PIO_SM3_EXECCTRL_OFFSET 0x00000114u
