gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PIO_IRQ0_INTS_SM0_TXNFULL_BITS 0x00000010u
#define PIO_IRQ0_INTS_SM0_TXNFULL_MSB 4u
#define PIO_IRQ0_INTS_SM0_TXNFULL_LSB 4u
#define PIO_IRQ0_INTS_SM0_TXNFULL_ACCESS "RO"
#define PIO_IRQ0_INTS_SM3_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTS_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_IRQ0_INTS_SM3_RXNEMPTY_MSB 3u
#define PIO_IRQ0_INTS_SM3_RXNEMPTY_LSB 3u
#define PIO_IRQ0_INTS_SM3_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ0_INTS_SM2_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTS_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_IRQ0_INTS_SM2_RXNEMPTY_MSB 2u
#define PIO_IRQ0_INTS_SM2_RXNEMPTY_LSB 2u
#define PIO_IRQ0_INTS_SM2_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ0_INTS_SM1_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTS_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_IRQ0_INTS_SM1_RXNEMPTY_MSB 1u
#define PIO_IRQ0_INTS_SM1_RXNEMPTY_LSB 1u
#define PIO_IRQ0_INTS_SM1_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ0_INTS_SM0_RXNEMPTY_RESET 0x0u
#define PIO_IRQ0_INTS_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_IRQ0_INTS_SM0_RXNEMPTY_MSB 0u
#define PIO_IRQ0_INTS_SM0_RXNEMPTY_LSB 0u
#define PIO_IRQ0_INTS_SM0_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ1_INTE_OFFSET 0x0000017cu
#define PIO_IRQ1_INTE_BITS 0x0000ffffu
#define PIO_IRQ1_INTE_RESET 0x00000000u
#define PIO_IRQ1_INTE_SM7_RESET 0x0u
#define PIO_IRQ1_INTE_SM7_BITS 0x00008000u
#define PIO_IRQ1_INTE_SM7_MSB 15u
#define PIO_IRQ1_INTE_SM7_LSB 15u
#define PIO_IRQ1_INTE_SM7_ACCESS "RW"
#define PIO_IRQ1_INTE_SM6_RESET 0x0u
#define PIO_IRQ1_INTE_SM6_BITS 0x00004000u
#define PIO_IRQ1_INTE_SM6_MSB 14u
#define PIO_IRQ1_INTE_SM6_LSB 14u
#define PIO_IRQ1_INTE_SM6_ACCESS "RW"
#define PIO_IRQ1_INTE_SM5_RESET 0x0u
#define PIO_IRQ1_INTE_SM5_BITS 0x00002000u
#define PIO_IRQ1_INTE_SM5_MSB 13u
#define PIO_IRQ1_INTE_SM5_LSB 13u
#define PIO_IRQ1_INTE_SM5_ACCESS "RW"
#define PIO_IRQ1_INTE_SM4_RESET 0x0u
#define PIO_IRQ1_INTE_SM4_BITS 0x00001000u
#define PIO_IRQ1_INTE_SM4_MSB 12u
#define PIO_IRQ1_INTE_SM4_LSB 12u
#define PIO_IRQ1_INTE_SM4_ACCESS "RW"
#define PIO_IRQ1_INTE_SM3_RESET 0x0u
#define PIO_IRQ1_INTE_SM3_BITS 0x00000800u
#define PIO_IRQ1_INTE_SM3_MSB 11u
#define PIO_IRQ1_INTE_SM3_LSB 11u
#define PIO_IRQ1_INTE_SM3_ACCESS "RW"
#define PIO_IRQ1_INTE_SM2_RESET 0x0u
#define PIO_IRQ1_INTE_SM2_BITS 0x00000400u
#define PIO_IRQ1_INTE_SM2_MSB 10u
#define PIO_IRQ1_INTE_SM2_LSB 10u
#define PIO_IRQ1_INTE_SM2_ACCESS "RW"
#define PIO_IRQ1_INTE_SM1_RESET 0x0u
#define PIO_IRQ1_INTE_SM1_BITS 0x00000200u
#define PIO_IRQ1_INTE_SM1_MSB 9u
#define PIO_IRQ1_INTE_SM1_LSB 9u
#define PIO_IRQ1_INTE_SM1_ACCESS "RW"
#define PIO_IRQ1_INTE_SM0_RESET 0x0u
#define PIO_IRQ1_INTE_SM0_BITS 0x00000100u
#define PIO_IRQ1_INTE_SM0_MSB 8u
#define PIO_IRQ1_INTE_SM0_LSB 8u
#define PIO_IRQ1_INTE_SM0_ACCESS "RW"
#define PIO_IRQ1_INTE_SM3_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTE_SM3_TXNFULL_BITS 0x00000080u
#define PIO_IRQ1_INTE_SM3_TXNFULL_MSB 7u
#define PIO_IRQ1_INTE_SM3_TXNFULL_LSB 7u
#define PIO_IRQ1_INTE_SM3_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTE_SM2_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTE_SM2_TXNFULL_BITS 0x00000040u
#define PIO_IRQ1_INTE_SM2_TXNFULL_MSB 6u
#define PIO_IRQ1_INTE_SM2_TXNFULL_LSB 6u
#define PIO_IRQ1_INTE_SM2_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTE_SM1_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTE_SM1_TXNFULL_BITS 0x00000020u
#define PIO_IRQ1_INTE_SM1_TXNFULL_MSB 5u
#define PIO_IRQ1_INTE_SM1_TXNFULL_LSB 5u
#define PIO_IRQ1_INTE_SM1_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTE_SM0_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTE_SM0_TXNFULL_BITS 0x00000010u
#define PIO_IRQ1_INTE_SM0_TXNFULL_MSB 4u
#define PIO_IRQ1_INTE_SM0_TXNFULL_LSB 4u
#define PIO_IRQ1_INTE_SM0_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTE_SM3_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTE_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_IRQ1_INTE_SM3_RXNEMPTY_MSB 3u
#define PIO_IRQ1_INTE_SM3_RXNEMPTY_LSB 3u
#define PIO_IRQ1_INTE_SM3_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTE_SM2_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTE_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_IRQ1_INTE_SM2_RXNEMPTY_MSB 2u
#define PIO_IRQ1_INTE_SM2_RXNEMPTY_LSB 2u
#define PIO_IRQ1_INTE_SM2_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTE_SM1_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTE_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_IRQ1_INTE_SM1_RXNEMPTY_MSB 1u
#define PIO_IRQ1_INTE_SM1_RXNEMPTY_LSB 1u
#define PIO_IRQ1_INTE_SM1_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTE_SM0_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTE_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_IRQ1_INTE_SM0_RXNEMPTY_MSB 0u
#define PIO_IRQ1_INTE_SM0_RXNEMPTY_LSB 0u
#define PIO_IRQ1_INTE_SM0_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTF_OFFSET 0x00000180u
#define PIO_IRQ1_INTF_BITS 0x0000ffffu
#define PIO_IRQ1_INTF_RESET 0x00000000u
#define PIO_IRQ1_INTF_SM7_RESET 0x0u
#define PIO_IRQ1_INTF_SM7_BITS 0x00008000u
#define PIO_IRQ1_INTF_SM7_MSB 15u
#define PIO_IRQ1_INTF_SM7_LSB 15u
#define PIO_IRQ1_INTF_SM7_ACCESS "RW"
#define PIO_IRQ1_INTF_SM6_RESET 0x0u
#define PIO_IRQ1_INTF_SM6_BITS 0x00004000u
#define PIO_IRQ1_INTF_SM6_MSB 14u
#define PIO_IRQ1_INTF_SM6_LSB 14u
#define PIO_IRQ1_INTF_SM6_ACCESS "RW"
#define PIO_IRQ1_INTF_SM5_RESET 0x0u
#define PIO_IRQ1_INTF_SM5_BITS 0x00002000u
#define PIO_IRQ1_INTF_SM5_MSB 13u
#define PIO_IRQ1_INTF_SM5_LSB 13u
#define PIO_IRQ1_INTF_SM5_ACCESS "RW"
#define PIO_IRQ1_INTF_SM4_RESET 0x0u
#define PIO_IRQ1_INTF_SM4_BITS 0x00001000u
#define PIO_IRQ1_INTF_SM4_MSB 12u
#define PIO_IRQ1_INTF_SM4_LSB 12u
#define PIO_IRQ1_INTF_SM4_ACCESS "RW"
#define PIO_IRQ1_INTF_SM3_RESET 0x0u
#define PIO_IRQ1_INTF_SM3_BITS 0x00000800u
#define PIO_IRQ1_INTF_SM3_MSB 11u
#define PIO_IRQ1_INTF_SM3_LSB 11u
#define PIO_IRQ1_INTF_SM3_ACCESS "RW"
#define PIO_IRQ1_INTF_SM2_RESET 0x0u
#define PIO_IRQ1_INTF_SM2_BITS 0x00000400u
#define PIO_IRQ1_INTF_SM2_MSB 10u
#define PIO_IRQ1_INTF_SM2_LSB 10u
#define PIO_IRQ1_INTF_SM2_ACCESS "RW"
#define PIO_IRQ1_INTF_SM1_RESET 0x0u
#define PIO_IRQ1_INTF_SM1_BITS 0x00000200u
#define PIO_IRQ1_INTF_SM1_MSB 9u
#define PIO_IRQ1_INTF_SM1_LSB 9u
#define PIO_IRQ1_INTF_SM1_ACCESS "RW"
#define PIO_IRQ1_INTF_SM0_RESET 0x0u
#define PIO_IRQ1_INTF_SM0_BITS 0x00000100u
#define PIO_IRQ1_INTF_SM0_MSB 8u
#define PIO_IRQ1_INTF_SM0_LSB 8u
#define PIO_IRQ1_INTF_SM0_ACCESS "RW"
#define PIO_IRQ1_INTF_SM3_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTF_SM3_TXNFULL_BITS 0x00000080u
#define PIO_IRQ1_INTF_SM3_TXNFULL_MSB 7u
#define PIO_IRQ1_INTF_SM3_TXNFULL_LSB 7u
#define PIO_IRQ1_INTF_SM3_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTF_SM2_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTF_SM2_TXNFULL_BITS 0x00000040u
#define PIO_IRQ1_INTF_SM2_TXNFULL_MSB 6u
#define PIO_IRQ1_INTF_SM2_TXNFULL_LSB 6u
#define PIO_IRQ1_INTF_SM2_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTF_SM1_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTF_SM1_TXNFULL_BITS 0x00000020u
#define PIO_IRQ1_INTF_SM1_TXNFULL_MSB 5u
#define PIO_IRQ1_INTF_SM1_TXNFULL_LSB 5u
#define PIO_IRQ1_INTF_SM1_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTF_SM0_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTF_SM0_TXNFULL_BITS 0x00000010u
#define PIO_IRQ1_INTF_SM0_TXNFULL_MSB 4u
#define PIO_IRQ1_INTF_SM0_TXNFULL_LSB 4u
#define PIO_IRQ1_INTF_SM0_TXNFULL_ACCESS "RW"
#define PIO_IRQ1_INTF_SM3_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTF_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_IRQ1_INTF_SM3_RXNEMPTY_MSB 3u
#define PIO_IRQ1_INTF_SM3_RXNEMPTY_LSB 3u
#define PIO_IRQ1_INTF_SM3_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTF_SM2_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTF_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_IRQ1_INTF_SM2_RXNEMPTY_MSB 2u
#define PIO_IRQ1_INTF_SM2_RXNEMPTY_LSB 2u
#define PIO_IRQ1_INTF_SM2_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTF_SM1_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTF_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_IRQ1_INTF_SM1_RXNEMPTY_MSB 1u
#define PIO_IRQ1_INTF_SM1_RXNEMPTY_LSB 1u
#define PIO_IRQ1_INTF_SM1_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTF_SM0_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTF_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_IRQ1_INTF_SM0_RXNEMPTY_MSB 0u
#define PIO_IRQ1_INTF_SM0_RXNEMPTY_LSB 0u
#define PIO_IRQ1_INTF_SM0_RXNEMPTY_ACCESS "RW"
#define PIO_IRQ1_INTS_OFFSET 0x00000184u
#define PIO_IRQ1_INTS_BITS 0x0000ffffu
#define PIO_IRQ1_INTS_RESET 0x00000000u
#define PIO_IRQ1_INTS_SM7_RESET 0x0u
#define PIO_IRQ1_INTS_SM7_BITS 0x00008000u
#define PIO_IRQ1_INTS_SM7_MSB 15u
#define PIO_IRQ1_INTS_SM7_LSB 15u
#define PIO_IRQ1_INTS_SM7_ACCESS "RO"
#define PIO_IRQ1_INTS_SM6_RESET 0x0u
#define PIO_IRQ1_INTS_SM6_BITS 0x00004000u
#define PIO_IRQ1_INTS_SM6_MSB 14u
#define PIO_IRQ1_INTS_SM6_LSB 14u
#define PIO_IRQ1_INTS_SM6_ACCESS "RO"
#define PIO_IRQ1_INTS_SM5_RESET 0x0u
#define PIO_IRQ1_INTS_SM5_BITS 0x00002000u
#define PIO_IRQ1_INTS_SM5_MSB 13u
#define PIO_IRQ1_INTS_SM5_LSB 13u
#define PIO_IRQ1_INTS_SM5_ACCESS "RO"
#define PIO_IRQ1_INTS_SM4_RESET 0x0u
#define PIO_IRQ1_INTS_SM4_BITS 0x00001000u
#define PIO_IRQ1_INTS_SM4_MSB 12u
#define PIO_IRQ1_INTS_SM4_LSB 12u
#define PIO_IRQ1_INTS_SM4_ACCESS "RO"
#define PIO_IRQ1_INTS_SM3_RESET 0x0u
#define PIO_IRQ1_INTS_SM3_BITS 0x00000800u
#define PIO_IRQ1_INTS_SM3_MSB 11u
#define PIO_IRQ1_INTS_SM3_LSB 11u
#define PIO_IRQ1_INTS_SM3_ACCESS "RO"
#define PIO_IRQ1_INTS_SM2_RESET 0x0u
#define PIO_IRQ1_INTS_SM2_BITS 0x00000400u
#define PIO_IRQ1_INTS_SM2_MSB 10u
#define PIO_IRQ1_INTS_SM2_LSB 10u
#define PIO_IRQ1_INTS_SM2_ACCESS "RO"
#define PIO_IRQ1_INTS_SM1_RESET 0x0u
#define PIO_IRQ1_INTS_SM1_BITS 0x00000200u
#define PIO_IRQ1_INTS_SM1_MSB 9u
#define PIO_IRQ1_INTS_SM1_LSB 9u
#define PIO_IRQ1_INTS_SM1_ACCESS "RO"
#define PIO_IRQ1_INTS_SM0_RESET 0x0u
#define PIO_IRQ1_INTS_SM0_BITS 0x00000100u
#define PIO_IRQ1_INTS_SM0_MSB 8u
#define PIO_IRQ1_INTS_SM0_LSB 8u
#define PIO_IRQ1_INTS_SM0_ACCESS "RO"
#define PIO_IRQ1_INTS_SM3_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTS_SM3_TXNFULL_BITS 0x00000080u
#define PIO_IRQ1_INTS_SM3_TXNFULL_MSB 7u
#define PIO_IRQ1_INTS_SM3_TXNFULL_LSB 7u
#define PIO_IRQ1_INTS_SM3_TXNFULL_ACCESS "RO"
#define PIO_IRQ1_INTS_SM2_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTS_SM2_TXNFULL_BITS 0x00000040u
#define PIO_IRQ1_INTS_SM2_TXNFULL_MSB 6u
#define PIO_IRQ1_INTS_SM2_TXNFULL_LSB 6u
#define PIO_IRQ1_INTS_SM2_TXNFULL_ACCESS "RO"
#define PIO_IRQ1_INTS_SM1_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTS_SM1_TXNFULL_BITS 0x00000020u
#define PIO_IRQ1_INTS_SM1_TXNFULL_MSB 5u
#define PIO_IRQ1_INTS_SM1_TXNFULL_LSB 5u
#define PIO_IRQ1_INTS_SM1_TXNFULL_ACCESS "RO"
#define PIO_IRQ1_INTS_SM0_TXNFULL_RESET 0x0u
#define PIO_IRQ1_INTS_SM0_TXNFULL_BITS 0x00000010u
#define PIO_IRQ1_INTS_SM0_TXNFULL_MSB 4u
#define PIO_IRQ1_INTS_SM0_TXNFULL_LSB 4u
#define PIO_IRQ1_INTS_SM0_TXNFULL_ACCESS "RO"
#define PIO_IRQ1_INTS_SM3_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTS_SM3_RXNEMPTY_BITS 0x00000008u
#define PIO_IRQ1_INTS_SM3_RXNEMPTY_MSB 3u
#define PIO_IRQ1_INTS_SM3_RXNEMPTY_LSB 3u
#define PIO_IRQ1_INTS_SM3_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ1_INTS_SM2_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTS_SM2_RXNEMPTY_BITS 0x00000004u
#define PIO_IRQ1_INTS_SM2_RXNEMPTY_MSB 2u
#define PIO_IRQ1_INTS_SM2_RXNEMPTY_LSB 2u
#define PIO_IRQ1_INTS_SM2_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ1_INTS_SM1_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTS_SM1_RXNEMPTY_BITS 0x00000002u
#define PIO_IRQ1_INTS_SM1_RXNEMPTY_MSB 1u
#define PIO_IRQ1_INTS_SM1_RXNEMPTY_LSB 1u
#define PIO_IRQ1_INTS_SM1_RXNEMPTY_ACCESS "RO"
#define PIO_IRQ1_INTS_SM0_RXNEMPTY_RESET 0x0u
#define PIO_IRQ1_INTS_SM0_RXNEMPTY_BITS 0x00000001u
#define PIO_IRQ1_INTS_SM0_RXNEMPTY_MSB 0u
#define PIO_IRQ1_INTS_SM0_RXNEMPTY_LSB 0u
#define PIO_IRQ1_INTS_SM0_RXNEMPTY_ACCESS "RO"
typedef struct {
   
