gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 pwr;
   
    io_rw_32 fbdiv_int;
   
    io_rw_32 prim;
   
    io_rw_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} pll_hw_t;
static pll_hw_t * const pll_sys_hw = (pll_hw_t *)PLL_SYS_BASE; // ORIGINAL: #define pll_sys_hw ((pll_hw_t *)PLL_SYS_BASE)
static pll_hw_t * const pll_usb_hw = (pll_hw_t *)PLL_USB_BASE; // ORIGINAL: #define pll_usb_hw ((pll_hw_t *)PLL_USB_BASE)
_Static_assert(sizeof (pll_hw_t) == 0x0020, "");
typedef pll_hw_t *PLL;
static __typeof__(pll_sys_hw) const pll_sys = pll_sys_hw; // ORIGINAL: #define pll_sys pll_sys_hw
static __typeof__(pll_usb_hw) const pll_usb = pll_usb_hw; // ORIGINAL: #define pll_usb pll_usb_hw
#define PICO_PLL_VCO_MIN_FREQ_HZ (750 * MHZ)
#define PICO_PLL_VCO_MAX_FREQ_HZ (1600 * MHZ)
void pll_init(PLL pll, uint ref_div, uint vco_freq, uint post_div1, uint post_div2);
void pll_deinit(PLL pll);
#define PLL_RESET_NUM(pll) ((pll_usb_hw == (pll)) ? RESET_PLL_USB : RESET_PLL_SYS)
#define _HARDWARE_POWMAN_H 
#define _HARDWARE_STRUCTS_POWMAN_H 
#define _HARDWARE_REGS_POWMAN_H 
#define POWMAN_BADPASSWD_OFFSET 0x00000000u
#define POWMAN_BADPASSWD_BITS 0x00000001u
#define POWMAN_BADPASSWD_RESET 0x00000000u
#define POWMAN_BADPASSWD_MSB 0u
#define POWMAN_BADPASSWD_LSB 0u
#define POWMAN_BADPASSWD_ACCESS "WC"
#define POWMAN_VREG_CTRL_OFFSET 0x00000004u
#define POWMAN_VREG_CTRL_BITS 0x0000b170u
#define POWMAN_VREG_CTRL_RESET 0x00008050u
#define POWMAN_VREG_CTRL_RST_N_RESET 0x1u
#define POWMAN_VREG_CTRL_RST_N_BITS 0x00008000u
#define POWMAN_VREG_CTRL_RST_N_MSB 15u
#define POWMAN_VREG_CTRL_RST_N_LSB 15u
#define POWMAN_VREG_CTRL_RST_N_ACCESS "RW"
#define POWMAN_VREG_CTRL_UNLOCK_RESET 0x0u
#define POWMAN_VREG_CTRL_UNLOCK_BITS 0x00002000u
#define POWMAN_VREG_CTRL_UNLOCK_MSB 13u
#define POWMAN_VREG_CTRL_UNLOCK_LSB 13u
#define POWMAN_VREG_CTRL_UNLOCK_ACCESS "RW"
#define POWMAN_VREG_CTRL_ISOLATE_RESET 0x0u
#define POWMAN_VREG_CTRL_ISOLATE_BITS 0x00001000u
#define POWMAN_VREG_CTRL_ISOLATE_MSB 12u
#define POWMAN_VREG_CTRL_ISOLATE_LSB 12u
#define POWMAN_VREG_CTRL_ISOLATE_ACCESS "RW"
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_RESET 0x0u
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_BITS 0x00000100u
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_MSB 8u
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_LSB 8u
#define POWMAN_VREG_CTRL_DISABLE_VOLTAGE_LIMIT_ACCESS "RW"
#define POWMAN_VREG_CTRL_HT_TH_RESET 0x5u
#define POWMAN_VREG_CTRL_HT_TH_BITS 0x00000070u
#define POWMAN_VREG_CTRL_HT_TH_MSB 6u
#define POWMAN_VREG_CTRL_HT_TH_LSB 4u
#define POWMAN_VREG_CTRL_HT_TH_ACCESS "RW"
#define POWMAN_VREG_STS_OFFSET 0x00000008u
#define POWMAN_VREG_STS_BITS 0x00000011u
#define POWMAN_VREG_STS_RESET 0x00000000u
#define POWMAN_VREG_STS_VOUT_OK_RESET 0x0u
#define POWMAN_VREG_STS_VOUT_OK_BITS 0x00000010u
#define POWMAN_VREG_STS_VOUT_OK_MSB 4u
#define POWMAN_VREG_STS_VOUT_OK_LSB 4u
#define POWMAN_VREG_STS_VOUT_OK_ACCESS "RO"
#define POWMAN_VREG_STS_STARTUP_RESET 0x0u
#define POWMAN_VREG_STS_STARTUP_BITS 0x00000001u
#define POWMAN_VREG_STS_STARTUP_MSB 0u
#define POWMAN_VREG_STS_STARTUP_LSB 0u
#define POWMAN_VREG_STS_STARTUP_ACCESS "RO"
#define POWMAN_VREG_OFFSET 0x0000000cu
#define POWMAN_VREG_BITS 0x000081f2u
#define POWMAN_VREG_RESET 0x000000b0u
#define POWMAN_VREG_UPDATE_IN_PROGRESS_RESET 0x0u
#define POWMAN_VREG_UPDATE_IN_PROGRESS_BITS 0x00008000u
#define POWMAN_VREG_UPDATE_IN_PROGRESS_MSB 15u
#define POWMAN_VREG_UPDATE_IN_PROGRESS_LSB 15u
#define POWMAN_VREG_UPDATE_IN_PROGRESS_ACCESS "RO"
#define POWMAN_VREG_VSEL_RESET 0x0bu
#define POWMAN_VREG_VSEL_BITS 0x000001f0u
#define POWMAN_VREG_VSEL_MSB 8u
#define POWMAN_VREG_VSEL_LSB 4u
#define POWMAN_VREG_VSEL_ACCESS "RW"
#define POWMAN_VREG_HIZ_RESET 0x0u
#define POWMAN_VREG_HIZ_BITS 0x00000002u
#define POWMAN_VREG_HIZ_MSB 1u
#define POWMAN_VREG_HIZ_LSB 1u
#define POWMAN_VREG_HIZ_ACCESS "RW"
#define POWMAN_VREG_LP_ENTRY_OFFSET 0x00000010u
#define POWMAN_VREG_LP_ENTRY_BITS 0x000001f6u
#define POWMAN_VREG_LP_ENTRY_RESET 0x000000b4u
#define POWMAN_VREG_LP_ENTRY_VSEL_RESET 0x0bu
#define POWMAN_VREG_LP_ENTRY_VSEL_BITS 0x000001f0u
#define POWMAN_VREG_LP_ENTRY_VSEL_MSB 8u
#define POWMAN_VREG_LP_ENTRY_VSEL_LSB 4u
#define POWMAN_VREG_LP_ENTRY_VSEL_ACCESS "RW"
#define POWMAN_VREG_LP_ENTRY_MODE_RESET 0x1u
#define POWMAN_VREG_LP_ENTRY_MODE_BITS 0x00000004u
#define POWMAN_VREG_LP_ENTRY_MODE_MSB 2u
#define POWMAN_VREG_LP_ENTRY_MODE_LSB 2u
#define POWMAN_VREG_LP_ENTRY_MODE_ACCESS "RW"
#define POWMAN_VREG_LP_ENTRY_HIZ_RESET 0x0u
#define POWMAN_VREG_LP_ENTRY_HIZ_BITS 0x00000002u
#define POWMAN_VREG_LP_ENTRY_HIZ_MSB 1u
#define POWMAN_VREG_LP_ENTRY_HIZ_LSB 1u
#define POWMAN_VREG_LP_ENTRY_HIZ_ACCESS "RW"
#define POWMAN_VREG_LP_EXIT_OFFSET 0x00000014u
#define POWMAN_VREG_LP_EXIT_BITS 0x000001f6u
#define POWMAN_VREG_LP_EXIT_RESET 0x000000b0u
#define POWMAN_VREG_LP_EXIT_VSEL_RESET 0x0bu
#define POWMAN_VREG_LP_EXIT_VSEL_BITS 0x000001f0u
#define POWMAN_VREG_LP_EXIT_VSEL_MSB 8u
#define POWMAN_VREG_LP_EXIT_VSEL_LSB 4u
#define POWMAN_VREG_LP_EXIT_VSEL_ACCESS "RW"
#define POWMAN_VREG_LP_EXIT_MODE_RESET 0x0u
#define POWMAN_VREG_LP_EXIT_MODE_BITS 0x00000004u
#define POWMAN_VREG_LP_EXIT_MODE_MSB 2u
#define POWMAN_VREG_LP_EXIT_MODE_LSB 2u
#define POWMAN_VREG_LP_EXIT_MODE_ACCESS "RW"
#define POWMAN_VREG_LP_EXIT_HIZ_RESET 0x0u
#define POWMAN_VREG_LP_EXIT_HIZ_BITS 0x00000002u
#define POWMAN_VREG_LP_EXIT_HIZ_MSB 1u
#define POWMAN_VREG_LP_EXIT_HIZ_LSB 1u
#define POWMAN_VREG_LP_EXIT_HIZ_ACCESS "RW"
#define POWMAN_BOD_CTRL_OFFSET 0x00000018u
#define POWMAN_BOD_CTRL_BITS 0x00001000u
#define POWMAN_BOD_CTRL_RESET 0x00000000u
#define POWMAN_BOD_CTRL_ISOLATE_RESET 0x0u
#define POWMAN_BOD_CTRL_ISOLATE_BITS 0x00001000u
#define POWMAN_BOD_CTRL_ISOLATE_MSB 12u
#define POWMAN_BOD_CTRL_ISOLATE_LSB 12u
#define POWMAN_BOD_CTRL_ISOLATE_ACCESS "RW"
#define POWMAN_BOD_OFFSET 0x0000001cu
#define POWMAN_BOD_BITS 0x000001f1u
#define POWMAN_BOD_RESET 0x000000b1u
#define POWMAN_BOD_VSEL_RESET 0x0bu
#define POWMAN_BOD_VSEL_BITS 0x000001f0u
#define POWMAN_BOD_VSEL_MSB 8u
#define POWMAN_BOD_VSEL_LSB 4u
#define POWMAN_BOD_VSEL_ACCESS "RW"
#define POWMAN_BOD_EN_RESET 0x1u
#define POWMAN_BOD_EN_BITS 0x00000001u
#define POWMAN_BOD_EN_MSB 0u
#define POWMAN_BOD_EN_LSB 0u
#define POWMAN_BOD_EN_ACCESS "RW"
#define POWMAN_BOD_LP_ENTRY_OFFSET 0x00000020u
#define POWMAN_BOD_LP_ENTRY_BITS 0x000001f1u
#define POWMAN_BOD_LP_ENTRY_RESET 0x000000b0u
#define POWMAN_BOD_LP_ENTRY_VSEL_RESET 0x0bu
#define POWMAN_BOD_LP_ENTRY_VSEL_BITS 0x000001f0u
#define POWMAN_BOD_LP_ENTRY_VSEL_MSB 8u
#define POWMAN_BOD_LP_ENTRY_VSEL_LSB 4u
#define POWMAN_BOD_LP_ENTRY_VSEL_ACCESS "RW"
#define POWMAN_BOD_LP_ENTRY_EN_RESET 0x0u
#define POWMAN_BOD_LP_ENTRY_EN_BITS 0x00000001u
#define POWMAN_BOD_LP_ENTRY_EN_MSB 0u
#define POWMAN_BOD_LP_ENTRY_EN_LSB 0u
#define POWMAN_BOD_LP_ENTRY_EN_ACCESS "RW"
#define POWMAN_BOD_LP_EXIT_OFFSET 0x00000024u
#define POWMAN_BOD_LP_EXIT_BITS 0x000001f1u
#define POWMAN_BOD_LP_EXIT_RESET 0x000000b1u
#define POWMAN_BOD_LP_EXIT_VSEL_RESET 0x0bu
#define POWMAN_BOD_LP_EXIT_VSEL_BITS 0x000001f0u
#define POWMAN_BOD_LP_EXIT_VSEL_MSB 8u
#define POWMAN_BOD_LP_EXIT_VSEL_LSB 4u
#define POWMAN_BOD_LP_EXIT_VSEL_ACCESS "RW"
#define POWMAN_BOD_LP_EXIT_EN_RESET 0x1u
#define POWMAN_BOD_LP_EXIT_EN_BITS 0x00000001u
#define POWMAN_BOD_LP_EXIT_EN_MSB 0u
#define POWMAN_BOD_LP_EXIT_EN_LSB 0u
#define POWMAN_BOD_LP_EXIT_EN_ACCESS "RW"
#define POWMAN_LPOSC_OFFSET 0x00000028u
#define POWMAN_LPOSC_BITS 0x000003f3u
#define POWMAN_LPOSC_RESET 0x00000203u
#define POWMAN_LPOSC_TRIM_RESET 0x20u
#define POWMAN_LPOSC_TRIM_BITS 0x000003f0u
#define POWMAN_LPOSC_TRIM_MSB 9u
#define POWMAN_LPOSC_TRIM_LSB 4u
#define POWMAN_LPOSC_TRIM_ACCESS "RW"
#define POWMAN_LPOSC_MODE_RESET 0x3u
#define POWMAN_LPOSC_MODE_BITS 0x00000003u
#define POWMAN_LPOSC_MODE_MSB 1u
#define POWMAN_LPOSC_MODE_LSB 0u
#define POWMAN_LPOSC_MODE_ACCESS "RW"
#define POWMAN_CHIP_RESET_OFFSET 0x0000002cu
#define POWMAN_CHIP_RESET_BITS 0x1fef0011u
#define POWMAN_CHIP_RESET_RESET 0x00000000u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_BITS 0x10000000u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_MSB 28u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_LSB 28u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_RSM_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_BITS 0x08000000u
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_MSB 27u
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_LSB 27u
#define POWMAN_CHIP_RESET_HAD_HZD_SYS_RESET_REQ_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_BITS 0x04000000u
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_MSB 26u
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_LSB 26u
#define POWMAN_CHIP_RESET_HAD_GLITCH_DETECT_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_BITS 0x02000000u
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_MSB 25u
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_LSB 25u
#define POWMAN_CHIP_RESET_HAD_SWCORE_PD_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_BITS 0x01000000u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_MSB 24u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_LSB 24u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_SWCORE_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_BITS 0x00800000u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_MSB 23u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_LSB 23u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_BITS 0x00400000u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_MSB 22u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_LSB 22u
#define POWMAN_CHIP_RESET_HAD_WATCHDOG_RESET_POWMAN_ASYNC_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_RESCUE_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_RESCUE_BITS 0x00200000u
#define POWMAN_CHIP_RESET_HAD_RESCUE_MSB 21u
#define POWMAN_CHIP_RESET_HAD_RESCUE_LSB 21u
#define POWMAN_CHIP_RESET_HAD_RESCUE_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_BITS 0x00080000u
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_MSB 19u
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_LSB 19u
#define POWMAN_CHIP_RESET_HAD_DP_RESET_REQ_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_BITS 0x00040000u
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_MSB 18u
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_LSB 18u
#define POWMAN_CHIP_RESET_HAD_RUN_LOW_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_BOR_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_BOR_BITS 0x00020000u
#define POWMAN_CHIP_RESET_HAD_BOR_MSB 17u
#define POWMAN_CHIP_RESET_HAD_BOR_LSB 17u
#define POWMAN_CHIP_RESET_HAD_BOR_ACCESS "RO"
#define POWMAN_CHIP_RESET_HAD_POR_RESET 0x0u
#define POWMAN_CHIP_RESET_HAD_POR_BITS 0x00010000u
#define POWMAN_CHIP_RESET_HAD_POR_MSB 16u
#define POWMAN_CHIP_RESET_HAD_POR_LSB 16u
#define POWMAN_CHIP_RESET_HAD_POR_ACCESS "RO"
#define POWMAN_CHIP_RESET_RESCUE_FLAG_RESET 0x0u
#define POWMAN_CHIP_RESET_RESCUE_FLAG_BITS 0x00000010u
#define POWMAN_CHIP_RESET_RESCUE_FLAG_MSB 4u
#define POWMAN_CHIP_RESET_RESCUE_FLAG_LSB 4u
#define POWMAN_CHIP_RESET_RESCUE_FLAG_ACCESS "WC"
#define POWMAN_CHIP_RESET_DOUBLE_TAP_RESET 0x0u
#define POWMAN_CHIP_RESET_DOUBLE_TAP_BITS 0x00000001u
#define POWMAN_CHIP_RESET_DOUBLE_TAP_MSB 0u
#define POWMAN_CHIP_RESET_DOUBLE_TAP_LSB 0u
#define POWMAN_CHIP_RESET_DOUBLE_TAP_ACCESS "RW"
#define POWMAN_WDSEL_OFFSET 0x00000030u
#define POWMAN_WDSEL_BITS 0x00001111u
#define POWMAN_WDSEL_RESET 0x00000000u
#define POWMAN_WDSEL_RESET_RSM_RESET 0x0u
#define POWMAN_WDSEL_RESET_RSM_BITS 0x00001000u
#define POWMAN_WDSEL_RESET_RSM_MSB 12u
#define POWMAN_WDSEL_RESET_RSM_LSB 12u
#define POWMAN_WDSEL_RESET_RSM_ACCESS "RW"
#define POWMAN_WDSEL_RESET_SWCORE_RESET 0x0u
#define POWMAN_WDSEL_RESET_SWCORE_BITS 0x00000100u
#define POWMAN_WDSEL_RESET_SWCORE_MSB 8u
#define POWMAN_WDSEL_RESET_SWCORE_LSB 8u
#define POWMAN_WDSEL_RESET_SWCORE_ACCESS "RW"
#define POWMAN_WDSEL_RESET_POWMAN_RESET 0x0u
#define POWMAN_WDSEL_RESET_POWMAN_BITS 0x00000010u
#define POWMAN_WDSEL_RESET_POWMAN_MSB 4u
#define POWMAN_WDSEL_RESET_POWMAN_LSB 4u
#define POWMAN_WDSEL_RESET_POWMAN_ACCESS "RW"
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_RESET 0x0u
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_BITS 0x00000001u
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_MSB 0u
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_LSB 0u
#define POWMAN_WDSEL_RESET_POWMAN_ASYNC_ACCESS "RW"
#define POWMAN_SEQ_CFG_OFFSET 0x00000034u
#define POWMAN_SEQ_CFG_BITS 0x001311f3u
#define POWMAN_SEQ_CFG_RESET 0x001011f0u
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_RESET 0x1u
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_BITS 0x00100000u
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_MSB 20u
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_LSB 20u
#define POWMAN_SEQ_CFG_USING_FAST_POWCK_ACCESS "RO"
#define POWMAN_SEQ_CFG_USING_BOD_LP_RESET 0x0u
#define POWMAN_SEQ_CFG_USING_BOD_LP_BITS 0x00020000u
#define POWMAN_SEQ_CFG_USING_BOD_LP_MSB 17u
#define POWMAN_SEQ_CFG_USING_BOD_LP_LSB 17u
#define POWMAN_SEQ_CFG_USING_BOD_LP_ACCESS "RO"
#define POWMAN_SEQ_CFG_USING_VREG_LP_RESET 0x0u
#define POWMAN_SEQ_CFG_USING_VREG_LP_BITS 0x00010000u
#define POWMAN_SEQ_CFG_USING_VREG_LP_MSB 16u
#define POWMAN_SEQ_CFG_USING_VREG_LP_LSB 16u
#define POWMAN_SEQ_CFG_USING_VREG_LP_ACCESS "RO"
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_RESET 0x1u
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_BITS 0x00001000u
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_MSB 12u
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_LSB 12u
#define POWMAN_SEQ_CFG_USE_FAST_POWCK_ACCESS "RW"
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_RESET 0x1u
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_BITS 0x00000100u
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_MSB 8u
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_LSB 8u
#define POWMAN_SEQ_CFG_RUN_LPOSC_IN_LP_ACCESS "RW"
#define POWMAN_SEQ_CFG_USE_BOD_HP_RESET 0x1u
#define POWMAN_SEQ_CFG_USE_BOD_HP_BITS 0x00000080u
#define POWMAN_SEQ_CFG_USE_BOD_HP_MSB 7u
#define POWMAN_SEQ_CFG_USE_BOD_HP_LSB 7u
#define POWMAN_SEQ_CFG_USE_BOD_HP_ACCESS "RW"
#define POWMAN_SEQ_CFG_USE_BOD_LP_RESET 0x1u
#define POWMAN_SEQ_CFG_USE_BOD_LP_BITS 0x00000040u
#define POWMAN_SEQ_CFG_USE_BOD_LP_MSB 6u
#define POWMAN_SEQ_CFG_USE_BOD_LP_LSB 6u
#define POWMAN_SEQ_CFG_USE_BOD_LP_ACCESS "RW"
#define POWMAN_SEQ_CFG_USE_VREG_HP_RESET 0x1u
#define POWMAN_SEQ_CFG_USE_VREG_HP_BITS 0x00000020u
#define POWMAN_SEQ_CFG_USE_VREG_HP_MSB 5u
#define POWMAN_SEQ_CFG_USE_VREG_HP_LSB 5u
#define POWMAN_SEQ_CFG_USE_VREG_HP_ACCESS "RW"
#define POWMAN_SEQ_CFG_USE_VREG_LP_RESET 0x1u
#define POWMAN_SEQ_CFG_USE_VREG_LP_BITS 0x00000010u
#define POWMAN_SEQ_CFG_USE_VREG_LP_MSB 4u
#define POWMAN_SEQ_CFG_USE_VREG_LP_LSB 4u
#define POWMAN_SEQ_CFG_USE_VREG_LP_ACCESS "RW"
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_RESET 0x0u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_BITS 0x00000002u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_MSB 1u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_LSB 1u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM0_ACCESS "RW"
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_RESET 0x0u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_BITS 0x00000001u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_MSB 0u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_LSB 0u
#define POWMAN_SEQ_CFG_HW_PWRUP_SRAM1_ACCESS "RW"
#define POWMAN_STATE_OFFSET 0x00000038u
#define POWMAN_STATE_BITS 0x00003fffu
#define POWMAN_STATE_RESET 0x0000000fu
#define POWMAN_STATE_CHANGING_RESET 0x0u
#define POWMAN_STATE_CHANGING_BITS 0x00002000u
#define POWMAN_STATE_CHANGING_MSB 13u
#define POWMAN_STATE_CHANGING_LSB 13u
#define POWMAN_STATE_CHANGING_ACCESS "RO"
#define POWMAN_STATE_WAITING_RESET 0x0u
#define POWMAN_STATE_WAITING_BITS 0x00001000u
#define POWMAN_STATE_WAITING_MSB 12u
#define POWMAN_STATE_WAITING_LSB 12u
#define POWMAN_STATE_WAITING_ACCESS "RO"
#define POWMAN_STATE_BAD_HW_REQ_RESET 0x0u
#define POWMAN_STATE_BAD_HW_REQ_BITS 0x00000800u
#define POWMAN_STATE_BAD_HW_REQ_MSB 11u
#define POWMAN_STATE_BAD_HW_REQ_LSB 11u
#define POWMAN_STATE_BAD_HW_REQ_ACCESS "RO"
#define POWMAN_STATE_BAD_SW_REQ_RESET 0x0u
#define POWMAN_STATE_BAD_SW_REQ_BITS 0x00000400u
#define POWMAN_STATE_BAD_SW_REQ_MSB 10u
#define POWMAN_STATE_BAD_SW_REQ_LSB 10u
#define POWMAN_STATE_BAD_SW_REQ_ACCESS "RO"
#define POWMAN_STATE_PWRUP_WHILE_WAITING_RESET 0x0u
#define POWMAN_STATE_PWRUP_WHILE_WAITING_BITS 0x00000200u
#define POWMAN_STATE_PWRUP_WHILE_WAITING_MSB 9u
#define POWMAN_STATE_PWRUP_WHILE_WAITING_LSB 9u
#define POWMAN_STATE_PWRUP_WHILE_WAITING_ACCESS "WC"
#define POWMAN_STATE_REQ_IGNORED_RESET 0x0u
#define POWMAN_STATE_REQ_IGNORED_BITS 0x00000100u
#define POWMAN_STATE_REQ_IGNORED_MSB 8u
#define POWMAN_STATE_REQ_IGNORED_LSB 8u
#define POWMAN_STATE_REQ_IGNORED_ACCESS "WC"
#define POWMAN_STATE_REQ_RESET 0x0u
#define POWMAN_STATE_REQ_BITS 0x000000f0u
#define POWMAN_STATE_REQ_MSB 7u
#define POWMAN_STATE_REQ_LSB 4u
#define POWMAN_STATE_REQ_ACCESS "RW"
#define POWMAN_STATE_CURRENT_RESET 0xfu
#define POWMAN_STATE_CURRENT_BITS 0x0000000fu
#define POWMAN_STATE_CURRENT_MSB 3u
#define POWMAN_STATE_CURRENT_LSB 0u
#define POWMAN_STATE_CURRENT_ACCESS "RO"
#define POWMAN_POW_FASTDIV_OFFSET 0x0000003cu
#define POWMAN_POW_FASTDIV_BITS 0x000007ffu
#define POWMAN_POW_FASTDIV_RESET 0x00000040u
#define POWMAN_POW_FASTDIV_MSB 10u
#define POWMAN_POW_FASTDIV_LSB 0u
#define POWMAN_POW_FASTDIV_ACCESS "RW"
#define POWMAN_POW_DELAY_OFFSET 0x00000040u
#define POWMAN_POW_DELAY_BITS 0x0000ffffu
#define POWMAN_POW_DELAY_RESET 0x00002011u
#define POWMAN_POW_DELAY_SRAM_STEP_RESET 0x20u
#define POWMAN_POW_DELAY_SRAM_STEP_BITS 0x0000ff00u
#define POWMAN_POW_DELAY_SRAM_STEP_MSB 15u
#define POWMAN_POW_DELAY_SRAM_STEP_LSB 8u
#define POWMAN_POW_DELAY_SRAM_STEP_ACCESS "RW"
#define POWMAN_POW_DELAY_XIP_STEP_RESET 0x1u
#define POWMAN_POW_DELAY_XIP_STEP_BITS 0x000000f0u
#define POWMAN_POW_DELAY_XIP_STEP_MSB 7u
#define POWMAN_POW_DELAY_XIP_STEP_LSB 4u
#define POWMAN_POW_DELAY_XIP_STEP_ACCESS "RW"
#define POWMAN_POW_DELAY_SWCORE_STEP_RESET 0x1u
#define POWMAN_POW_DELAY_SWCORE_STEP_BITS 0x0000000fu
#define POWMAN_POW_DELAY_SWCORE_STEP_MSB 3u
#define POWMAN_POW_DELAY_SWCORE_STEP_LSB 0u
#define POWMAN_POW_DELAY_SWCORE_STEP_ACCESS "RW"
#define POWMAN_EXT_CTRL0_OFFSET 0x00000044u
#define POWMAN_EXT_CTRL0_BITS 0x0000713fu
#define POWMAN_EXT_CTRL0_RESET 0x0000003fu
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_RESET 0x0u
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_BITS 0x00004000u
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_MSB 14u
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_LSB 14u
#define POWMAN_EXT_CTRL0_LP_EXIT_STATE_ACCESS "RW"
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_RESET 0x0u
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_BITS 0x00002000u
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_MSB 13u
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_LSB 13u
#define POWMAN_EXT_CTRL0_LP_ENTRY_STATE_ACCESS "RW"
#define POWMAN_EXT_CTRL0_INIT_STATE_RESET 0x0u
#define POWMAN_EXT_CTRL0_INIT_STATE_BITS 0x00001000u
#define POWMAN_EXT_CTRL0_INIT_STATE_MSB 12u
#define POWMAN_EXT_CTRL0_INIT_STATE_LSB 12u
#define POWMAN_EXT_CTRL0_INIT_STATE_ACCESS "RW"
#define POWMAN_EXT_CTRL0_INIT_RESET 0x0u
#define POWMAN_EXT_CTRL0_INIT_BITS 0x00000100u
#define POWMAN_EXT_CTRL0_INIT_MSB 8u
#define POWMAN_EXT_CTRL0_INIT_LSB 8u
#define POWMAN_EXT_CTRL0_INIT_ACCESS "RW"
#define POWMAN_EXT_CTRL0_GPIO_SELECT_RESET 0x3fu
#define POWMAN_EXT_CTRL0_GPIO_SELECT_BITS 0x0000003fu
#define POWMAN_EXT_CTRL0_GPIO_SELECT_MSB 5u
#define POWMAN_EXT_CTRL0_GPIO_SELECT_LSB 0u
#define POWMAN_EXT_CTRL0_GPIO_SELECT_ACCESS "RW"
#define POWMAN_EXT_CTRL1_OFFSET 0x00000048u
#define POWMAN_EXT_CTRL1_BITS 0x0000713fu
#define POWMAN_EXT_CTRL1_RESET 0x0000003fu
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_RESET 0x0u
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_BITS 0x00004000u
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_MSB 14u
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_LSB 14u
#define POWMAN_EXT_CTRL1_LP_EXIT_STATE_ACCESS "RW"
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_RESET 0x0u
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_BITS 0x00002000u
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_MSB 13u
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_LSB 13u
#define POWMAN_EXT_CTRL1_LP_ENTRY_STATE_ACCESS "RW"
#define POWMAN_EXT_CTRL1_INIT_STATE_RESET 0x0u
#define POWMAN_EXT_CTRL1_INIT_STATE_BITS 0x00001000u
#define POWMAN_EXT_CTRL1_INIT_STATE_MSB 12u
#define POWMAN_EXT_CTRL1_INIT_STATE_LSB 12u
#define POWMAN_EXT_CTRL1_INIT_STATE_ACCESS "RW"
#define POWMAN_EXT_CTRL1_INIT_RESET 0x0u
#define POWMAN_EXT_CTRL1_INIT_BITS 0x00000100u
#define POWMAN_EXT_CTRL1_INIT_MSB 8u
#define POWMAN_EXT_CTRL1_INIT_LSB 8u
#define POWMAN_EXT_CTRL1_INIT_ACCESS "RW"
#define POWMAN_EXT_CTRL1_GPIO_SELECT_RESET 0x3fu
#define POWMAN_EXT_CTRL1_GPIO_SELECT_BITS 0x0000003fu
#define POWMAN_EXT_CTRL1_GPIO_SELECT_MSB 5u
#define POWMAN_EXT_CTRL1_GPIO_SELECT_LSB 0u
#define POWMAN_EXT_CTRL1_GPIO_SELECT_ACCESS "RW"
#define POWMAN_EXT_TIME_REF_OFFSET 0x0000004cu
#define POWMAN_EXT_TIME_REF_BITS 0x00000013u
#define POWMAN_EXT_TIME_REF_RESET 0x00000000u
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_RESET 0x0u
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_BITS 0x00000010u
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_MSB 4u
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_LSB 4u
#define POWMAN_EXT_TIME_REF_DRIVE_LPCK_ACCESS "RW"
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_RESET 0x0u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_BITS 0x00000003u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_MSB 1u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_LSB 0u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_ACCESS "RW"
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO12 0x0u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO20 0x1u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO14 0x2u
#define POWMAN_EXT_TIME_REF_SOURCE_SEL_VALUE_GPIO22 0x3u
#define POWMAN_LPOSC_FREQ_KHZ_INT_OFFSET 0x00000050u
#define POWMAN_LPOSC_FREQ_KHZ_INT_BITS 0x0000003fu
#define POWMAN_LPOSC_FREQ_KHZ_INT_RESET 0x00000020u
#define POWMAN_LPOSC_FREQ_KHZ_INT_MSB 5u
#define POWMAN_LPOSC_FREQ_KHZ_INT_LSB 0u
#define POWMAN_LPOSC_FREQ_KHZ_INT_ACCESS "RW"
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_OFFSET 0x00000054u
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_BITS 0x0000ffffu
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_RESET 0x0000c49cu
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_MSB 15u
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_LSB 0u
#define POWMAN_LPOSC_FREQ_KHZ_FRAC_ACCESS "RW"
#define POWMAN_XOSC_FREQ_KHZ_INT_OFFSET 0x00000058u
#define POWMAN_XOSC_FREQ_KHZ_INT_BITS 0x0000ffffu
#define POWMAN_XOSC_FREQ_KHZ_INT_RESET 0x00002ee0u
#define POWMAN_XOSC_FREQ_KHZ_INT_MSB 15u
#define POWMAN_XOSC_FREQ_KHZ_INT_LSB 0u
#define POWMAN_XOSC_FREQ_KHZ_INT_ACCESS "RW"
#define POWMAN_XOSC_FREQ_KHZ_FRAC_OFFSET 0x0000005cu
#define POWMAN_XOSC_FREQ_KHZ_FRAC_BITS 0x0000ffffu
#define POWMAN_XOSC_FREQ_KHZ_FRAC_RESET 0x00000000u
#define POWMAN_XOSC_FREQ_KHZ_FRAC_MSB 15u
#define POWMAN_XOSC_FREQ_KHZ_FRAC_LSB 0u
#define POWMAN_XOSC_FREQ_KHZ_FRAC_ACCESS "RW"
#define POWMAN_SET_TIME_63TO48_OFFSET 0x00000060u
#define POWMAN_SET_TIME_63TO48_BITS 0x0000ffffu
#define POWMAN_SET_TIME_63TO48_RESET 0x00000000u
#define POWMAN_SET_TIME_63TO48_MSB 15u
#define POWMAN_SET_TIME_63TO48_LSB 0u
#define POWMAN_SET_TIME_63TO48_ACCESS "RW"
#define POWMAN_SET_TIME_47TO32_OFFSET 0x00000064u
#define POWMAN_SET_TIME_47TO32_BITS 0x0000ffffu
#define POWMAN_SET_TIME_47TO32_RESET 0x00000000u
#define POWMAN_SET_TIME_47TO32_MSB 15u
#define POWMAN_SET_TIME_47TO32_LSB 0u
#define POWMAN_SET_TIME_47TO32_ACCESS "RW"
#define POWMAN_SET_TIME_31TO16_OFFSET 0x00000068u
#define POWMAN_SET_TIME_31TO16_BITS 0x0000ffffu
#define POWMAN_SET_TIME_31TO16_RESET 0x00000000u
#define POWMAN_SET_TIME_31TO16_MSB 15u
#define POWMAN_SET_TIME_31TO16_LSB 0u
#define POWMAN_SET_TIME_31TO16_ACCESS "RW"
#define POWMAN_SET_TIME_15TO0_OFFSET 0x0000006cu
#define POWMAN_SET_TIME_15TO0_BITS 0x0000ffffu
