gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define POWMAN_SET_TIME_15TO0_RESET 0x00000000u
#define POWMAN_SET_TIME_15TO0_MSB 15u
#define POWMAN_SET_TIME_15TO0_LSB 0u
#define POWMAN_SET_TIME_15TO0_ACCESS "RW"
#define POWMAN_READ_TIME_UPPER_OFFSET 0x00000070u
#define POWMAN_READ_TIME_UPPER_BITS 0xffffffffu
#define POWMAN_READ_TIME_UPPER_RESET 0x00000000u
#define POWMAN_READ_TIME_UPPER_MSB 31u
#define POWMAN_READ_TIME_UPPER_LSB 0u
#define POWMAN_READ_TIME_UPPER_ACCESS "RO"
#define POWMAN_READ_TIME_LOWER_OFFSET 0x00000074u
#define POWMAN_READ_TIME_LOWER_BITS 0xffffffffu
#define POWMAN_READ_TIME_LOWER_RESET 0x00000000u
#define POWMAN_READ_TIME_LOWER_MSB 31u
#define POWMAN_READ_TIME_LOWER_LSB 0u
#define POWMAN_READ_TIME_LOWER_ACCESS "RO"
#define POWMAN_ALARM_TIME_63TO48_OFFSET 0x00000078u
#define POWMAN_ALARM_TIME_63TO48_BITS 0x0000ffffu
#define POWMAN_ALARM_TIME_63TO48_RESET 0x00000000u
#define POWMAN_ALARM_TIME_63TO48_MSB 15u
#define POWMAN_ALARM_TIME_63TO48_LSB 0u
#define POWMAN_ALARM_TIME_63TO48_ACCESS "RW"
#define POWMAN_ALARM_TIME_47TO32_OFFSET 0x0000007cu
#define POWMAN_ALARM_TIME_47TO32_BITS 0x0000ffffu
#define POWMAN_ALARM_TIME_47TO32_RESET 0x00000000u
#define POWMAN_ALARM_TIME_47TO32_MSB 15u
#define POWMAN_ALARM_TIME_47TO32_LSB 0u
#define POWMAN_ALARM_TIME_47TO32_ACCESS "RW"
#define POWMAN_ALARM_TIME_31TO16_OFFSET 0x00000080u
#define POWMAN_ALARM_TIME_31TO16_BITS 0x0000ffffu
#define POWMAN_ALARM_TIME_31TO16_RESET 0x00000000u
#define POWMAN_ALARM_TIME_31TO16_MSB 15u
#define POWMAN_ALARM_TIME_31TO16_LSB 0u
#define POWMAN_ALARM_TIME_31TO16_ACCESS "RW"
#define POWMAN_ALARM_TIME_15TO0_OFFSET 0x00000084u
#define POWMAN_ALARM_TIME_15TO0_BITS 0x0000ffffu
#define POWMAN_ALARM_TIME_15TO0_RESET 0x00000000u
#define POWMAN_ALARM_TIME_15TO0_MSB 15u
#define POWMAN_ALARM_TIME_15TO0_LSB 0u
#define POWMAN_ALARM_TIME_15TO0_ACCESS "RW"
#define POWMAN_TIMER_OFFSET 0x00000088u
#define POWMAN_TIMER_BITS 0x000f2777u
#define POWMAN_TIMER_RESET 0x00000000u
#define POWMAN_TIMER_USING_GPIO_1HZ_RESET 0x0u
#define POWMAN_TIMER_USING_GPIO_1HZ_BITS 0x00080000u
#define POWMAN_TIMER_USING_GPIO_1HZ_MSB 19u
#define POWMAN_TIMER_USING_GPIO_1HZ_LSB 19u
#define POWMAN_TIMER_USING_GPIO_1HZ_ACCESS "RO"
#define POWMAN_TIMER_USING_GPIO_1KHZ_RESET 0x0u
#define POWMAN_TIMER_USING_GPIO_1KHZ_BITS 0x00040000u
#define POWMAN_TIMER_USING_GPIO_1KHZ_MSB 18u
#define POWMAN_TIMER_USING_GPIO_1KHZ_LSB 18u
#define POWMAN_TIMER_USING_GPIO_1KHZ_ACCESS "RO"
#define POWMAN_TIMER_USING_LPOSC_RESET 0x0u
#define POWMAN_TIMER_USING_LPOSC_BITS 0x00020000u
#define POWMAN_TIMER_USING_LPOSC_MSB 17u
#define POWMAN_TIMER_USING_LPOSC_LSB 17u
#define POWMAN_TIMER_USING_LPOSC_ACCESS "RO"
#define POWMAN_TIMER_USING_XOSC_RESET 0x0u
#define POWMAN_TIMER_USING_XOSC_BITS 0x00010000u
#define POWMAN_TIMER_USING_XOSC_MSB 16u
#define POWMAN_TIMER_USING_XOSC_LSB 16u
#define POWMAN_TIMER_USING_XOSC_ACCESS "RO"
#define POWMAN_TIMER_USE_GPIO_1HZ_RESET 0x0u
#define POWMAN_TIMER_USE_GPIO_1HZ_BITS 0x00002000u
#define POWMAN_TIMER_USE_GPIO_1HZ_MSB 13u
#define POWMAN_TIMER_USE_GPIO_1HZ_LSB 13u
#define POWMAN_TIMER_USE_GPIO_1HZ_ACCESS "RW"
#define POWMAN_TIMER_USE_GPIO_1KHZ_RESET 0x0u
#define POWMAN_TIMER_USE_GPIO_1KHZ_BITS 0x00000400u
#define POWMAN_TIMER_USE_GPIO_1KHZ_MSB 10u
#define POWMAN_TIMER_USE_GPIO_1KHZ_LSB 10u
#define POWMAN_TIMER_USE_GPIO_1KHZ_ACCESS "SC"
#define POWMAN_TIMER_USE_XOSC_RESET 0x0u
#define POWMAN_TIMER_USE_XOSC_BITS 0x00000200u
#define POWMAN_TIMER_USE_XOSC_MSB 9u
#define POWMAN_TIMER_USE_XOSC_LSB 9u
#define POWMAN_TIMER_USE_XOSC_ACCESS "SC"
#define POWMAN_TIMER_USE_LPOSC_RESET 0x0u
#define POWMAN_TIMER_USE_LPOSC_BITS 0x00000100u
#define POWMAN_TIMER_USE_LPOSC_MSB 8u
#define POWMAN_TIMER_USE_LPOSC_LSB 8u
#define POWMAN_TIMER_USE_LPOSC_ACCESS "SC"
#define POWMAN_TIMER_ALARM_RESET 0x0u
#define POWMAN_TIMER_ALARM_BITS 0x00000040u
#define POWMAN_TIMER_ALARM_MSB 6u
#define POWMAN_TIMER_ALARM_LSB 6u
#define POWMAN_TIMER_ALARM_ACCESS "WC"
#define POWMAN_TIMER_PWRUP_ON_ALARM_RESET 0x0u
#define POWMAN_TIMER_PWRUP_ON_ALARM_BITS 0x00000020u
#define POWMAN_TIMER_PWRUP_ON_ALARM_MSB 5u
#define POWMAN_TIMER_PWRUP_ON_ALARM_LSB 5u
#define POWMAN_TIMER_PWRUP_ON_ALARM_ACCESS "RW"
#define POWMAN_TIMER_ALARM_ENAB_RESET 0x0u
#define POWMAN_TIMER_ALARM_ENAB_BITS 0x00000010u
#define POWMAN_TIMER_ALARM_ENAB_MSB 4u
#define POWMAN_TIMER_ALARM_ENAB_LSB 4u
#define POWMAN_TIMER_ALARM_ENAB_ACCESS "RW"
#define POWMAN_TIMER_CLEAR_RESET 0x0u
#define POWMAN_TIMER_CLEAR_BITS 0x00000004u
#define POWMAN_TIMER_CLEAR_MSB 2u
#define POWMAN_TIMER_CLEAR_LSB 2u
#define POWMAN_TIMER_CLEAR_ACCESS "SC"
#define POWMAN_TIMER_RUN_RESET 0x0u
#define POWMAN_TIMER_RUN_BITS 0x00000002u
#define POWMAN_TIMER_RUN_MSB 1u
#define POWMAN_TIMER_RUN_LSB 1u
#define POWMAN_TIMER_RUN_ACCESS "RW"
#define POWMAN_TIMER_NONSEC_WRITE_RESET 0x0u
#define POWMAN_TIMER_NONSEC_WRITE_BITS 0x00000001u
#define POWMAN_TIMER_NONSEC_WRITE_MSB 0u
#define POWMAN_TIMER_NONSEC_WRITE_LSB 0u
#define POWMAN_TIMER_NONSEC_WRITE_ACCESS "RW"
#define POWMAN_PWRUP0_OFFSET 0x0000008cu
#define POWMAN_PWRUP0_BITS 0x000007ffu
#define POWMAN_PWRUP0_RESET 0x0000003fu
#define POWMAN_PWRUP0_RAW_STATUS_RESET 0x0u
#define POWMAN_PWRUP0_RAW_STATUS_BITS 0x00000400u
#define POWMAN_PWRUP0_RAW_STATUS_MSB 10u
#define POWMAN_PWRUP0_RAW_STATUS_LSB 10u
#define POWMAN_PWRUP0_RAW_STATUS_ACCESS "RO"
#define POWMAN_PWRUP0_STATUS_RESET 0x0u
#define POWMAN_PWRUP0_STATUS_BITS 0x00000200u
#define POWMAN_PWRUP0_STATUS_MSB 9u
#define POWMAN_PWRUP0_STATUS_LSB 9u
#define POWMAN_PWRUP0_STATUS_ACCESS "WC"
#define POWMAN_PWRUP0_MODE_RESET 0x0u
#define POWMAN_PWRUP0_MODE_BITS 0x00000100u
#define POWMAN_PWRUP0_MODE_MSB 8u
#define POWMAN_PWRUP0_MODE_LSB 8u
#define POWMAN_PWRUP0_MODE_ACCESS "RW"
#define POWMAN_PWRUP0_MODE_VALUE_LEVEL 0x0u
#define POWMAN_PWRUP0_MODE_VALUE_EDGE 0x1u
#define POWMAN_PWRUP0_DIRECTION_RESET 0x0u
#define POWMAN_PWRUP0_DIRECTION_BITS 0x00000080u
#define POWMAN_PWRUP0_DIRECTION_MSB 7u
#define POWMAN_PWRUP0_DIRECTION_LSB 7u
#define POWMAN_PWRUP0_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP0_DIRECTION_VALUE_LOW_FALLING 0x0u
#define POWMAN_PWRUP0_DIRECTION_VALUE_HIGH_RISING 0x1u
#define POWMAN_PWRUP0_ENABLE_RESET 0x0u
#define POWMAN_PWRUP0_ENABLE_BITS 0x00000040u
#define POWMAN_PWRUP0_ENABLE_MSB 6u
#define POWMAN_PWRUP0_ENABLE_LSB 6u
#define POWMAN_PWRUP0_ENABLE_ACCESS "RW"
#define POWMAN_PWRUP0_SOURCE_RESET 0x3fu
#define POWMAN_PWRUP0_SOURCE_BITS 0x0000003fu
#define POWMAN_PWRUP0_SOURCE_MSB 5u
#define POWMAN_PWRUP0_SOURCE_LSB 0u
#define POWMAN_PWRUP0_SOURCE_ACCESS "RW"
#define POWMAN_PWRUP1_OFFSET 0x00000090u
#define POWMAN_PWRUP1_BITS 0x000007ffu
#define POWMAN_PWRUP1_RESET 0x0000003fu
#define POWMAN_PWRUP1_RAW_STATUS_RESET 0x0u
#define POWMAN_PWRUP1_RAW_STATUS_BITS 0x00000400u
#define POWMAN_PWRUP1_RAW_STATUS_MSB 10u
#define POWMAN_PWRUP1_RAW_STATUS_LSB 10u
#define POWMAN_PWRUP1_RAW_STATUS_ACCESS "RO"
#define POWMAN_PWRUP1_STATUS_RESET 0x0u
#define POWMAN_PWRUP1_STATUS_BITS 0x00000200u
#define POWMAN_PWRUP1_STATUS_MSB 9u
#define POWMAN_PWRUP1_STATUS_LSB 9u
#define POWMAN_PWRUP1_STATUS_ACCESS "WC"
#define POWMAN_PWRUP1_MODE_RESET 0x0u
#define POWMAN_PWRUP1_MODE_BITS 0x00000100u
#define POWMAN_PWRUP1_MODE_MSB 8u
#define POWMAN_PWRUP1_MODE_LSB 8u
#define POWMAN_PWRUP1_MODE_ACCESS "RW"
#define POWMAN_PWRUP1_MODE_VALUE_LEVEL 0x0u
#define POWMAN_PWRUP1_MODE_VALUE_EDGE 0x1u
#define POWMAN_PWRUP1_DIRECTION_RESET 0x0u
#define POWMAN_PWRUP1_DIRECTION_BITS 0x00000080u
#define POWMAN_PWRUP1_DIRECTION_MSB 7u
#define POWMAN_PWRUP1_DIRECTION_LSB 7u
#define POWMAN_PWRUP1_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP1_DIRECTION_VALUE_LOW_FALLING 0x0u
#define POWMAN_PWRUP1_DIRECTION_VALUE_HIGH_RISING 0x1u
#define POWMAN_PWRUP1_ENABLE_RESET 0x0u
#define POWMAN_PWRUP1_ENABLE_BITS 0x00000040u
#define POWMAN_PWRUP1_ENABLE_MSB 6u
#define POWMAN_PWRUP1_ENABLE_LSB 6u
#define POWMAN_PWRUP1_ENABLE_ACCESS "RW"
#define POWMAN_PWRUP1_SOURCE_RESET 0x3fu
#define POWMAN_PWRUP1_SOURCE_BITS 0x0000003fu
#define POWMAN_PWRUP1_SOURCE_MSB 5u
#define POWMAN_PWRUP1_SOURCE_LSB 0u
#define POWMAN_PWRUP1_SOURCE_ACCESS "RW"
#define POWMAN_PWRUP2_OFFSET 0x00000094u
#define POWMAN_PWRUP2_BITS 0x000007ffu
#define POWMAN_PWRUP2_RESET 0x0000003fu
#define POWMAN_PWRUP2_RAW_STATUS_RESET 0x0u
#define POWMAN_PWRUP2_RAW_STATUS_BITS 0x00000400u
#define POWMAN_PWRUP2_RAW_STATUS_MSB 10u
#define POWMAN_PWRUP2_RAW_STATUS_LSB 10u
#define POWMAN_PWRUP2_RAW_STATUS_ACCESS "RO"
#define POWMAN_PWRUP2_STATUS_RESET 0x0u
#define POWMAN_PWRUP2_STATUS_BITS 0x00000200u
#define POWMAN_PWRUP2_STATUS_MSB 9u
#define POWMAN_PWRUP2_STATUS_LSB 9u
#define POWMAN_PWRUP2_STATUS_ACCESS "WC"
#define POWMAN_PWRUP2_MODE_RESET 0x0u
#define POWMAN_PWRUP2_MODE_BITS 0x00000100u
#define POWMAN_PWRUP2_MODE_MSB 8u
#define POWMAN_PWRUP2_MODE_LSB 8u
#define POWMAN_PWRUP2_MODE_ACCESS "RW"
#define POWMAN_PWRUP2_MODE_VALUE_LEVEL 0x0u
#define POWMAN_PWRUP2_MODE_VALUE_EDGE 0x1u
#define POWMAN_PWRUP2_DIRECTION_RESET 0x0u
#define POWMAN_PWRUP2_DIRECTION_BITS 0x00000080u
#define POWMAN_PWRUP2_DIRECTION_MSB 7u
#define POWMAN_PWRUP2_DIRECTION_LSB 7u
#define POWMAN_PWRUP2_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP2_DIRECTION_VALUE_LOW_FALLING 0x0u
#define POWMAN_PWRUP2_DIRECTION_VALUE_HIGH_RISING 0x1u
#define POWMAN_PWRUP2_ENABLE_RESET 0x0u
#define POWMAN_PWRUP2_ENABLE_BITS 0x00000040u
#define POWMAN_PWRUP2_ENABLE_MSB 6u
#define POWMAN_PWRUP2_ENABLE_LSB 6u
#define POWMAN_PWRUP2_ENABLE_ACCESS "RW"
#define POWMAN_PWRUP2_SOURCE_RESET 0x3fu
#define POWMAN_PWRUP2_SOURCE_BITS 0x0000003fu
#define POWMAN_PWRUP2_SOURCE_MSB 5u
#define POWMAN_PWRUP2_SOURCE_LSB 0u
#define POWMAN_PWRUP2_SOURCE_ACCESS "RW"
#define POWMAN_PWRUP3_OFFSET 0x00000098u
#define POWMAN_PWRUP3_BITS 0x000007ffu
#define POWMAN_PWRUP3_RESET 0x0000003fu
#define POWMAN_PWRUP3_RAW_STATUS_RESET 0x0u
#define POWMAN_PWRUP3_RAW_STATUS_BITS 0x00000400u
#define POWMAN_PWRUP3_RAW_STATUS_MSB 10u
#define POWMAN_PWRUP3_RAW_STATUS_LSB 10u
#define POWMAN_PWRUP3_RAW_STATUS_ACCESS "RO"
#define POWMAN_PWRUP3_STATUS_RESET 0x0u
#define POWMAN_PWRUP3_STATUS_BITS 0x00000200u
#define POWMAN_PWRUP3_STATUS_MSB 9u
#define POWMAN_PWRUP3_STATUS_LSB 9u
#define POWMAN_PWRUP3_STATUS_ACCESS "WC"
#define POWMAN_PWRUP3_MODE_RESET 0x0u
#define POWMAN_PWRUP3_MODE_BITS 0x00000100u
#define POWMAN_PWRUP3_MODE_MSB 8u
#define POWMAN_PWRUP3_MODE_LSB 8u
#define POWMAN_PWRUP3_MODE_ACCESS "RW"
#define POWMAN_PWRUP3_MODE_VALUE_LEVEL 0x0u
#define POWMAN_PWRUP3_MODE_VALUE_EDGE 0x1u
#define POWMAN_PWRUP3_DIRECTION_RESET 0x0u
#define POWMAN_PWRUP3_DIRECTION_BITS 0x00000080u
#define POWMAN_PWRUP3_DIRECTION_MSB 7u
#define POWMAN_PWRUP3_DIRECTION_LSB 7u
#define POWMAN_PWRUP3_DIRECTION_ACCESS "RW"
#define POWMAN_PWRUP3_DIRECTION_VALUE_LOW_FALLING 0x0u
#define POWMAN_PWRUP3_DIRECTION_VALUE_HIGH_RISING 0x1u
#define POWMAN_PWRUP3_ENABLE_RESET 0x0u
#define POWMAN_PWRUP3_ENABLE_BITS 0x00000040u
#define POWMAN_PWRUP3_ENABLE_MSB 6u
#define POWMAN_PWRUP3_ENABLE_LSB 6u
#define POWMAN_PWRUP3_ENABLE_ACCESS "RW"
#define POWMAN_PWRUP3_SOURCE_RESET 0x3fu
#define POWMAN_PWRUP3_SOURCE_BITS 0x0000003fu
#define POWMAN_PWRUP3_SOURCE_MSB 5u
#define POWMAN_PWRUP3_SOURCE_LSB 0u
#define POWMAN_PWRUP3_SOURCE_ACCESS "RW"
#define POWMAN_CURRENT_PWRUP_REQ_OFFSET 0x0000009cu
#define POWMAN_CURRENT_PWRUP_REQ_BITS 0x0000007fu
#define POWMAN_CURRENT_PWRUP_REQ_RESET 0x00000000u
#define POWMAN_CURRENT_PWRUP_REQ_MSB 6u
#define POWMAN_CURRENT_PWRUP_REQ_LSB 0u
#define POWMAN_CURRENT_PWRUP_REQ_ACCESS "RO"
#define POWMAN_LAST_SWCORE_PWRUP_OFFSET 0x000000a0u
#define POWMAN_LAST_SWCORE_PWRUP_BITS 0x0000007fu
#define POWMAN_LAST_SWCORE_PWRUP_RESET 0x00000000u
#define POWMAN_LAST_SWCORE_PWRUP_MSB 6u
#define POWMAN_LAST_SWCORE_PWRUP_LSB 0u
#define POWMAN_LAST_SWCORE_PWRUP_ACCESS "RO"
#define POWMAN_DBG_PWRCFG_OFFSET 0x000000a4u
#define POWMAN_DBG_PWRCFG_BITS 0x00000001u
#define POWMAN_DBG_PWRCFG_RESET 0x00000000u
#define POWMAN_DBG_PWRCFG_IGNORE_RESET 0x0u
#define POWMAN_DBG_PWRCFG_IGNORE_BITS 0x00000001u
#define POWMAN_DBG_PWRCFG_IGNORE_MSB 0u
#define POWMAN_DBG_PWRCFG_IGNORE_LSB 0u
#define POWMAN_DBG_PWRCFG_IGNORE_ACCESS "RW"
#define POWMAN_BOOTDIS_OFFSET 0x000000a8u
#define POWMAN_BOOTDIS_BITS 0x00000003u
#define POWMAN_BOOTDIS_RESET 0x00000000u
#define POWMAN_BOOTDIS_NEXT_RESET 0x0u
#define POWMAN_BOOTDIS_NEXT_BITS 0x00000002u
#define POWMAN_BOOTDIS_NEXT_MSB 1u
#define POWMAN_BOOTDIS_NEXT_LSB 1u
#define POWMAN_BOOTDIS_NEXT_ACCESS "RW"
#define POWMAN_BOOTDIS_NOW_RESET 0x0u
#define POWMAN_BOOTDIS_NOW_BITS 0x00000001u
#define POWMAN_BOOTDIS_NOW_MSB 0u
#define POWMAN_BOOTDIS_NOW_LSB 0u
#define POWMAN_BOOTDIS_NOW_ACCESS "WC"
#define POWMAN_DBGCONFIG_OFFSET 0x000000acu
#define POWMAN_DBGCONFIG_BITS 0x0000000fu
#define POWMAN_DBGCONFIG_RESET 0x00000000u
#define POWMAN_DBGCONFIG_DP_INSTID_RESET 0x0u
#define POWMAN_DBGCONFIG_DP_INSTID_BITS 0x0000000fu
#define POWMAN_DBGCONFIG_DP_INSTID_MSB 3u
#define POWMAN_DBGCONFIG_DP_INSTID_LSB 0u
#define POWMAN_DBGCONFIG_DP_INSTID_ACCESS "RW"
#define POWMAN_SCRATCH0_OFFSET 0x000000b0u
#define POWMAN_SCRATCH0_BITS 0xffffffffu
#define POWMAN_SCRATCH0_RESET 0x00000000u
#define POWMAN_SCRATCH0_MSB 31u
#define POWMAN_SCRATCH0_LSB 0u
#define POWMAN_SCRATCH0_ACCESS "RW"
#define POWMAN_SCRATCH1_OFFSET 0x000000b4u
#define POWMAN_SCRATCH1_BITS 0xffffffffu
#define POWMAN_SCRATCH1_RESET 0x00000000u
#define POWMAN_SCRATCH1_MSB 31u
#define POWMAN_SCRATCH1_LSB 0u
#define POWMAN_SCRATCH1_ACCESS "RW"
#define POWMAN_SCRATCH2_OFFSET 0x000000b8u
#define POWMAN_SCRATCH2_BITS 0xffffffffu
#define POWMAN_SCRATCH2_RESET 0x00000000u
#define POWMAN_SCRATCH2_MSB 31u
#define POWMAN_SCRATCH2_LSB 0u
#define POWMAN_SCRATCH2_ACCESS "RW"
#define POWMAN_SCRATCH3_OFFSET 0x000000bcu
#define POWMAN_SCRATCH3_BITS 0xffffffffu
#define POWMAN_SCRATCH3_RESET 0x00000000u
#define POWMAN_SCRATCH3_MSB 31u
#define POWMAN_SCRATCH3_LSB 0u
#define POWMAN_SCRATCH3_ACCESS "RW"
#define POWMAN_SCRATCH4_OFFSET 0x000000c0u
#define POWMAN_SCRATCH4_BITS 0xffffffffu
#define POWMAN_SCRATCH4_RESET 0x00000000u
#define POWMAN_SCRATCH4_MSB 31u
#define POWMAN_SCRATCH4_LSB 0u
#define POWMAN_SCRATCH4_ACCESS "RW"
#define POWMAN_SCRATCH5_OFFSET 0x000000c4u
#define POWMAN_SCRATCH5_BITS 0xffffffffu
#define POWMAN_SCRATCH5_RESET 0x00000000u
#define POWMAN_SCRATCH5_MSB 31u
#define POWMAN_SCRATCH5_LSB 0u
#define POWMAN_SCRATCH5_ACCESS "RW"
#define POWMAN_SCRATCH6_OFFSET 0x000000c8u
#define POWMAN_SCRATCH6_BITS 0xffffffffu
#define POWMAN_SCRATCH6_RESET 0x00000000u
#define POWMAN_SCRATCH6_MSB 31u
#define POWMAN_SCRATCH6_LSB 0u
#define POWMAN_SCRATCH6_ACCESS "RW"
#define POWMAN_SCRATCH7_OFFSET 0x000000ccu
#define POWMAN_SCRATCH7_BITS 0xffffffffu
#define POWMAN_SCRATCH7_RESET 0x00000000u
#define POWMAN_SCRATCH7_MSB 31u
#define POWMAN_SCRATCH7_LSB 0u
#define POWMAN_SCRATCH7_ACCESS "RW"
#define POWMAN_BOOT0_OFFSET 0x000000d0u
#define POWMAN_BOOT0_BITS 0xffffffffu
#define POWMAN_BOOT0_RESET 0x00000000u
#define POWMAN_BOOT0_MSB 31u
#define POWMAN_BOOT0_LSB 0u
#define POWMAN_BOOT0_ACCESS "RW"
#define POWMAN_BOOT1_OFFSET 0x000000d4u
#define POWMAN_BOOT1_BITS 0xffffffffu
#define POWMAN_BOOT1_RESET 0x00000000u
#define POWMAN_BOOT1_MSB 31u
#define POWMAN_BOOT1_LSB 0u
#define POWMAN_BOOT1_ACCESS "RW"
#define POWMAN_BOOT2_OFFSET 0x000000d8u
#define POWMAN_BOOT2_BITS 0xffffffffu
#define POWMAN_BOOT2_RESET 0x00000000u
#define POWMAN_BOOT2_MSB 31u
#define POWMAN_BOOT2_LSB 0u
#define POWMAN_BOOT2_ACCESS "RW"
#define POWMAN_BOOT3_OFFSET 0x000000dcu
#define POWMAN_BOOT3_BITS 0xffffffffu
#define POWMAN_BOOT3_RESET 0x00000000u
#define POWMAN_BOOT3_MSB 31u
#define POWMAN_BOOT3_LSB 0u
#define POWMAN_BOOT3_ACCESS "RW"
#define POWMAN_INTR_OFFSET 0x000000e0u
#define POWMAN_INTR_BITS 0x0000000fu
#define POWMAN_INTR_RESET 0x00000000u
#define POWMAN_INTR_PWRUP_WHILE_WAITING_RESET 0x0u
#define POWMAN_INTR_PWRUP_WHILE_WAITING_BITS 0x00000008u
#define POWMAN_INTR_PWRUP_WHILE_WAITING_MSB 3u
#define POWMAN_INTR_PWRUP_WHILE_WAITING_LSB 3u
#define POWMAN_INTR_PWRUP_WHILE_WAITING_ACCESS "RO"
#define POWMAN_INTR_STATE_REQ_IGNORED_RESET 0x0u
#define POWMAN_INTR_STATE_REQ_IGNORED_BITS 0x00000004u
#define POWMAN_INTR_STATE_REQ_IGNORED_MSB 2u
#define POWMAN_INTR_STATE_REQ_IGNORED_LSB 2u
#define POWMAN_INTR_STATE_REQ_IGNORED_ACCESS "RO"
#define POWMAN_INTR_TIMER_RESET 0x0u
#define POWMAN_INTR_TIMER_BITS 0x00000002u
#define POWMAN_INTR_TIMER_MSB 1u
#define POWMAN_INTR_TIMER_LSB 1u
#define POWMAN_INTR_TIMER_ACCESS "RO"
#define POWMAN_INTR_VREG_OUTPUT_LOW_RESET 0x0u
#define POWMAN_INTR_VREG_OUTPUT_LOW_BITS 0x00000001u
#define POWMAN_INTR_VREG_OUTPUT_LOW_MSB 0u
#define POWMAN_INTR_VREG_OUTPUT_LOW_LSB 0u
#define POWMAN_INTR_VREG_OUTPUT_LOW_ACCESS "WC"
#define POWMAN_INTE_OFFSET 0x000000e4u
#define POWMAN_INTE_BITS 0x0000000fu
#define POWMAN_INTE_RESET 0x00000000u
#define POWMAN_INTE_PWRUP_WHILE_WAITING_RESET 0x0u
#define POWMAN_INTE_PWRUP_WHILE_WAITING_BITS 0x00000008u
#define POWMAN_INTE_PWRUP_WHILE_WAITING_MSB 3u
#define POWMAN_INTE_PWRUP_WHILE_WAITING_LSB 3u
#define POWMAN_INTE_PWRUP_WHILE_WAITING_ACCESS "RW"
#define POWMAN_INTE_STATE_REQ_IGNORED_RESET 0x0u
#define POWMAN_INTE_STATE_REQ_IGNORED_BITS 0x00000004u
#define POWMAN_INTE_STATE_REQ_IGNORED_MSB 2u
#define POWMAN_INTE_STATE_REQ_IGNORED_LSB 2u
#define POWMAN_INTE_STATE_REQ_IGNORED_ACCESS "RW"
#define POWMAN_INTE_TIMER_RESET 0x0u
#define POWMAN_INTE_TIMER_BITS 0x00000002u
#define POWMAN_INTE_TIMER_MSB 1u
#define POWMAN_INTE_TIMER_LSB 1u
#define POWMAN_INTE_TIMER_ACCESS "RW"
#define POWMAN_INTE_VREG_OUTPUT_LOW_RESET 0x0u
#define POWMAN_INTE_VREG_OUTPUT_LOW_BITS 0x00000001u
#define POWMAN_INTE_VREG_OUTPUT_LOW_MSB 0u
#define POWMAN_INTE_VREG_OUTPUT_LOW_LSB 0u
#define POWMAN_INTE_VREG_OUTPUT_LOW_ACCESS "RW"
#define POWMAN_INTF_OFFSET 0x000000e8u
#define POWMAN_INTF_BITS 0x0000000fu
#define POWMAN_INTF_RESET 0x00000000u
#define POWMAN_INTF_PWRUP_WHILE_WAITING_RESET 0x0u
#define POWMAN_INTF_PWRUP_WHILE_WAITING_BITS 0x00000008u
#define POWMAN_INTF_PWRUP_WHILE_WAITING_MSB 3u
#define POWMAN_INTF_PWRUP_WHILE_WAITING_LSB 3u
#define POWMAN_INTF_PWRUP_WHILE_WAITING_ACCESS "RW"
#define POWMAN_INTF_STATE_REQ_IGNORED_RESET 0x0u
#define POWMAN_INTF_STATE_REQ_IGNORED_BITS 0x00000004u
#define POWMAN_INTF_STATE_REQ_IGNORED_MSB 2u
#define POWMAN_INTF_STATE_REQ_IGNORED_LSB 2u
#define POWMAN_INTF_STATE_REQ_IGNORED_ACCESS "RW"
#define POWMAN_INTF_TIMER_RESET 0x0u
#define POWMAN_INTF_TIMER_BITS 0x00000002u
#define POWMAN_INTF_TIMER_MSB 1u
#define POWMAN_INTF_TIMER_LSB 1u
#define POWMAN_INTF_TIMER_ACCESS "RW"
#define POWMAN_INTF_VREG_OUTPUT_LOW_RESET 0x0u
#define POWMAN_INTF_VREG_OUTPUT_LOW_BITS 0x00000001u
#define POWMAN_INTF_VREG_OUTPUT_LOW_MSB 0u
#define POWMAN_INTF_VREG_OUTPUT_LOW_LSB 0u
#define POWMAN_INTF_VREG_OUTPUT_LOW_ACCESS "RW"
#define POWMAN_INTS_OFFSET 0x000000ecu
#define POWMAN_INTS_BITS 0x0000000fu
#define POWMAN_INTS_RESET 0x00000000u
#define POWMAN_INTS_PWRUP_WHILE_WAITING_RESET 0x0u
#define POWMAN_INTS_PWRUP_WHILE_WAITING_BITS 0x00000008u
#define POWMAN_INTS_PWRUP_WHILE_WAITING_MSB 3u
#define POWMAN_INTS_PWRUP_WHILE_WAITING_LSB 3u
#define POWMAN_INTS_PWRUP_WHILE_WAITING_ACCESS "RO"
#define POWMAN_INTS_STATE_REQ_IGNORED_RESET 0x0u
#define POWMAN_INTS_STATE_REQ_IGNORED_BITS 0x00000004u
#define POWMAN_INTS_STATE_REQ_IGNORED_MSB 2u
#define POWMAN_INTS_STATE_REQ_IGNORED_LSB 2u
#define POWMAN_INTS_STATE_REQ_IGNORED_ACCESS "RO"
#define POWMAN_INTS_TIMER_RESET 0x0u
#define POWMAN_INTS_TIMER_BITS 0x00000002u
#define POWMAN_INTS_TIMER_MSB 1u
#define POWMAN_INTS_TIMER_LSB 1u
#define POWMAN_INTS_TIMER_ACCESS "RO"
#define POWMAN_INTS_VREG_OUTPUT_LOW_RESET 0x0u
#define POWMAN_INTS_VREG_OUTPUT_LOW_BITS 0x00000001u
#define POWMAN_INTS_VREG_OUTPUT_LOW_MSB 0u
#define POWMAN_INTS_VREG_OUTPUT_LOW_LSB 0u
#define POWMAN_INTS_VREG_OUTPUT_LOW_ACCESS "RO"
typedef struct {
   
