gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 badpasswd;
   
    io_rw_32 vreg_ctrl;
   
    io_ro_32 vreg_sts;
   
    io_rw_32 vreg;
   
    io_rw_32 vreg_lp_entry;
   
    io_rw_32 vreg_lp_exit;
   
    io_rw_32 bod_ctrl;
   
    io_rw_32 bod;
   
    io_rw_32 bod_lp_entry;
   
    io_rw_32 bod_lp_exit;
   
    io_rw_32 lposc;
   
    io_rw_32 chip_reset;
   
    io_rw_32 wdsel;
   
    io_rw_32 seq_cfg;
   
    io_rw_32 state;
   
    io_rw_32 pow_fastdiv;
   
    io_rw_32 pow_delay;
   
    io_rw_32 ext_ctrl[2];
   
    io_rw_32 ext_time_ref;
   
    io_rw_32 lposc_freq_khz_int;
   
    io_rw_32 lposc_freq_khz_frac;
   
    io_rw_32 xosc_freq_khz_int;
   
    io_rw_32 xosc_freq_khz_frac;
   
    io_rw_32 set_time_63to48;
   
    io_rw_32 set_time_47to32;
   
    io_rw_32 set_time_31to16;
   
    io_rw_32 set_time_15to0;
   
    io_ro_32 read_time_upper;
   
    io_ro_32 read_time_lower;
   
    io_rw_32 alarm_time_63to48;
   
    io_rw_32 alarm_time_47to32;
   
    io_rw_32 alarm_time_31to16;
   
    io_rw_32 alarm_time_15to0;
   
    io_rw_32 timer;
   
    io_rw_32 pwrup[4];
   
    io_ro_32 current_pwrup_req;
   
    io_ro_32 last_swcore_pwrup;
   
    io_rw_32 dbg_pwrcfg;
   
    io_rw_32 bootdis;
   
    io_rw_32 dbgconfig;
   
    io_rw_32 scratch[8];
   
    io_rw_32 boot[4];
   
    io_rw_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} powman_hw_t;
static powman_hw_t * const powman_hw = (powman_hw_t *)POWMAN_BASE; // ORIGINAL: #define powman_hw ((powman_hw_t *)POWMAN_BASE)
_Static_assert(sizeof (powman_hw_t) == 0x00f0, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_POWMAN 0
void powman_timer_set_1khz_tick_source_lposc(void);
void powman_timer_set_1khz_tick_source_lposc_with_hz(uint32_t lposc_freq_hz);
void powman_timer_set_1khz_tick_source_xosc(void);
void powman_timer_set_1khz_tick_source_xosc_with_hz(uint32_t xosc_freq_hz);
void powman_timer_set_1khz_tick_source_gpio(uint32_t gpio);
void powman_timer_enable_gpio_1hz_sync(uint32_t gpio);
void powman_timer_disable_gpio_1hz_sync(void);
uint64_t powman_timer_get_ms(void);
void powman_timer_set_ms(uint64_t time_ms);
void powman_timer_enable_alarm_at_ms(uint64_t alarm_time_ms);
void powman_timer_disable_alarm(void);
static inline void powman_set_bits(volatile uint32_t *reg, uint32_t bits) {
    ({if (((0 || 0) && !0)) ((!(bits >> 16)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_powman/include/hardware/powman.h", 111, __func__, "!(bits >> 16)"));});
    hw_set_bits(reg, 0x5afe0000u | bits);
}
static inline void powman_clear_bits(volatile uint32_t *reg, uint32_t bits) {
    ({if (((0 || 0) && !0)) ((!(bits >> 16)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_powman/include/hardware/powman.h", 125, __func__, "!(bits >> 16)"));});
    hw_clear_bits(reg, 0x5afe0000u | bits);
}
static inline _Bool powman_timer_is_running(void) {
    return ((powman_hw_t *)0x40100000u)->timer & 0x00000002u;
}
static inline void powman_timer_stop(void) {
    powman_clear_bits(&((powman_hw_t *)0x40100000u)->timer, 0x00000002u);
}
static inline void powman_timer_start(void) {
    powman_set_bits(&((powman_hw_t *)0x40100000u)->timer, 0x00000002u);
}
static inline void powman_clear_alarm(void) {
    powman_clear_bits(&((powman_hw_t *)0x40100000u)->timer, 0x00000040u);
}
enum powman_power_domains {
    POWMAN_POWER_DOMAIN_SRAM_BANK1 = 0,
    POWMAN_POWER_DOMAIN_SRAM_BANK0 = 1,
    POWMAN_POWER_DOMAIN_XIP_CACHE = 2,
    POWMAN_POWER_DOMAIN_SWITCHED_CORE = 3,
    POWMAN_POWER_DOMAIN_COUNT = 4,
};
typedef uint32_t powman_power_state;
powman_power_state powman_get_power_state(void);
int powman_set_power_state(powman_power_state state);
#define POWMAN_POWER_STATE_NONE 0
static inline powman_power_state powman_power_state_with_domain_on(powman_power_state orig, enum powman_power_domains domain) {
    ({if (((0 || 0) && !0)) ((!(domain >= POWMAN_POWER_DOMAIN_COUNT)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_powman/include/hardware/powman.h", 199, __func__, "!(domain >= POWMAN_POWER_DOMAIN_COUNT)"));});
    return orig | (1u << domain);
}
static inline powman_power_state powman_power_state_with_domain_off(powman_power_state orig, enum powman_power_domains domain) {
    ({if (((0 || 0) && !0)) ((!(domain >= POWMAN_POWER_DOMAIN_COUNT)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_powman/include/hardware/powman.h", 209, __func__, "!(domain >= POWMAN_POWER_DOMAIN_COUNT)"));});
    return orig &= ~(1u << domain);
}
static inline _Bool powman_power_state_is_domain_on(powman_power_state state, enum powman_power_domains domain) {
    ({if (((0 || 0) && !0)) ((!(domain >= POWMAN_POWER_DOMAIN_COUNT)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_powman/include/hardware/powman.h", 219, __func__, "!(domain >= POWMAN_POWER_DOMAIN_COUNT)"));});
    return state & (1u << domain);
}
void powman_enable_alarm_wakeup_at_ms(uint64_t alarm_time_ms);
void powman_enable_gpio_wakeup(uint gpio_wakeup_num, uint32_t gpio, _Bool edge, _Bool high);
void powman_disable_alarm_wakeup(void);
void powman_disable_gpio_wakeup(uint gpio_wakeup_num);
void powman_disable_all_wakeups(void);
_Bool powman_configure_wakeup_state(powman_power_state sleep_state, powman_power_state wakeup_state);
static inline void powman_set_debug_power_request_ignored(_Bool ignored) {
    if (ignored)
        powman_set_bits(&((powman_hw_t *)0x40100000u)->dbg_pwrcfg, 1);
    else
        powman_clear_bits(&((powman_hw_t *)0x40100000u)->dbg_pwrcfg, 0);
}
#define _HARDWARE_PWM_H 
#define _HARDWARE_STRUCTS_PWM_H 
#define _HARDWARE_REGS_PWM_H 
#define PWM_CH0_CSR_OFFSET 0x00000000u
#define PWM_CH0_CSR_BITS 0x000000ffu
#define PWM_CH0_CSR_RESET 0x00000000u
#define PWM_CH0_CSR_PH_ADV_RESET 0x0u
#define PWM_CH0_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH0_CSR_PH_ADV_MSB 7u
#define PWM_CH0_CSR_PH_ADV_LSB 7u
#define PWM_CH0_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH0_CSR_PH_RET_RESET 0x0u
#define PWM_CH0_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH0_CSR_PH_RET_MSB 6u
#define PWM_CH0_CSR_PH_RET_LSB 6u
#define PWM_CH0_CSR_PH_RET_ACCESS "SC"
#define PWM_CH0_CSR_DIVMODE_RESET 0x0u
#define PWM_CH0_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH0_CSR_DIVMODE_MSB 5u
#define PWM_CH0_CSR_DIVMODE_LSB 4u
#define PWM_CH0_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH0_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH0_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH0_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH0_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH0_CSR_B_INV_RESET 0x0u
#define PWM_CH0_CSR_B_INV_BITS 0x00000008u
#define PWM_CH0_CSR_B_INV_MSB 3u
#define PWM_CH0_CSR_B_INV_LSB 3u
#define PWM_CH0_CSR_B_INV_ACCESS "RW"
#define PWM_CH0_CSR_A_INV_RESET 0x0u
#define PWM_CH0_CSR_A_INV_BITS 0x00000004u
#define PWM_CH0_CSR_A_INV_MSB 2u
#define PWM_CH0_CSR_A_INV_LSB 2u
#define PWM_CH0_CSR_A_INV_ACCESS "RW"
#define PWM_CH0_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH0_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH0_CSR_PH_CORRECT_MSB 1u
#define PWM_CH0_CSR_PH_CORRECT_LSB 1u
#define PWM_CH0_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH0_CSR_EN_RESET 0x0u
#define PWM_CH0_CSR_EN_BITS 0x00000001u
#define PWM_CH0_CSR_EN_MSB 0u
#define PWM_CH0_CSR_EN_LSB 0u
#define PWM_CH0_CSR_EN_ACCESS "RW"
#define PWM_CH0_DIV_OFFSET 0x00000004u
#define PWM_CH0_DIV_BITS 0x00000fffu
#define PWM_CH0_DIV_RESET 0x00000010u
#define PWM_CH0_DIV_INT_RESET 0x01u
#define PWM_CH0_DIV_INT_BITS 0x00000ff0u
#define PWM_CH0_DIV_INT_MSB 11u
#define PWM_CH0_DIV_INT_LSB 4u
#define PWM_CH0_DIV_INT_ACCESS "RW"
#define PWM_CH0_DIV_FRAC_RESET 0x0u
#define PWM_CH0_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH0_DIV_FRAC_MSB 3u
#define PWM_CH0_DIV_FRAC_LSB 0u
#define PWM_CH0_DIV_FRAC_ACCESS "RW"
#define PWM_CH0_CTR_OFFSET 0x00000008u
#define PWM_CH0_CTR_BITS 0x0000ffffu
#define PWM_CH0_CTR_RESET 0x00000000u
#define PWM_CH0_CTR_MSB 15u
#define PWM_CH0_CTR_LSB 0u
#define PWM_CH0_CTR_ACCESS "RW"
#define PWM_CH0_CC_OFFSET 0x0000000cu
#define PWM_CH0_CC_BITS 0xffffffffu
#define PWM_CH0_CC_RESET 0x00000000u
#define PWM_CH0_CC_B_RESET 0x0000u
#define PWM_CH0_CC_B_BITS 0xffff0000u
#define PWM_CH0_CC_B_MSB 31u
#define PWM_CH0_CC_B_LSB 16u
#define PWM_CH0_CC_B_ACCESS "RW"
#define PWM_CH0_CC_A_RESET 0x0000u
#define PWM_CH0_CC_A_BITS 0x0000ffffu
#define PWM_CH0_CC_A_MSB 15u
#define PWM_CH0_CC_A_LSB 0u
#define PWM_CH0_CC_A_ACCESS "RW"
#define PWM_CH0_TOP_OFFSET 0x00000010u
#define PWM_CH0_TOP_BITS 0x0000ffffu
#define PWM_CH0_TOP_RESET 0x0000ffffu
#define PWM_CH0_TOP_MSB 15u
#define PWM_CH0_TOP_LSB 0u
#define PWM_CH0_TOP_ACCESS "RW"
#define PWM_CH1_CSR_OFFSET 0x00000014u
#define PWM_CH1_CSR_BITS 0x000000ffu
#define PWM_CH1_CSR_RESET 0x00000000u
#define PWM_CH1_CSR_PH_ADV_RESET 0x0u
#define PWM_CH1_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH1_CSR_PH_ADV_MSB 7u
#define PWM_CH1_CSR_PH_ADV_LSB 7u
#define PWM_CH1_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH1_CSR_PH_RET_RESET 0x0u
#define PWM_CH1_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH1_CSR_PH_RET_MSB 6u
#define PWM_CH1_CSR_PH_RET_LSB 6u
#define PWM_CH1_CSR_PH_RET_ACCESS "SC"
#define PWM_CH1_CSR_DIVMODE_RESET 0x0u
#define PWM_CH1_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH1_CSR_DIVMODE_MSB 5u
#define PWM_CH1_CSR_DIVMODE_LSB 4u
#define PWM_CH1_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH1_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH1_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH1_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH1_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH1_CSR_B_INV_RESET 0x0u
#define PWM_CH1_CSR_B_INV_BITS 0x00000008u
#define PWM_CH1_CSR_B_INV_MSB 3u
#define PWM_CH1_CSR_B_INV_LSB 3u
#define PWM_CH1_CSR_B_INV_ACCESS "RW"
#define PWM_CH1_CSR_A_INV_RESET 0x0u
#define PWM_CH1_CSR_A_INV_BITS 0x00000004u
#define PWM_CH1_CSR_A_INV_MSB 2u
#define PWM_CH1_CSR_A_INV_LSB 2u
#define PWM_CH1_CSR_A_INV_ACCESS "RW"
#define PWM_CH1_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH1_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH1_CSR_PH_CORRECT_MSB 1u
#define PWM_CH1_CSR_PH_CORRECT_LSB 1u
#define PWM_CH1_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH1_CSR_EN_RESET 0x0u
#define PWM_CH1_CSR_EN_BITS 0x00000001u
#define PWM_CH1_CSR_EN_MSB 0u
#define PWM_CH1_CSR_EN_LSB 0u
#define PWM_CH1_CSR_EN_ACCESS "RW"
#define PWM_CH1_DIV_OFFSET 0x00000018u
#define PWM_CH1_DIV_BITS 0x00000fffu
#define PWM_CH1_DIV_RESET 0x00000010u
#define PWM_CH1_DIV_INT_RESET 0x01u
#define PWM_CH1_DIV_INT_BITS 0x00000ff0u
#define PWM_CH1_DIV_INT_MSB 11u
#define PWM_CH1_DIV_INT_LSB 4u
#define PWM_CH1_DIV_INT_ACCESS "RW"
#define PWM_CH1_DIV_FRAC_RESET 0x0u
#define PWM_CH1_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH1_DIV_FRAC_MSB 3u
#define PWM_CH1_DIV_FRAC_LSB 0u
#define PWM_CH1_DIV_FRAC_ACCESS "RW"
#define PWM_CH1_CTR_OFFSET 0x0000001cu
#define PWM_CH1_CTR_BITS 0x0000ffffu
#define PWM_CH1_CTR_RESET 0x00000000u
#define PWM_CH1_CTR_MSB 15u
#define PWM_CH1_CTR_LSB 0u
#define PWM_CH1_CTR_ACCESS "RW"
#define PWM_CH1_CC_OFFSET 0x00000020u
#define PWM_CH1_CC_BITS 0xffffffffu
#define PWM_CH1_CC_RESET 0x00000000u
#define PWM_CH1_CC_B_RESET 0x0000u
#define PWM_CH1_CC_B_BITS 0xffff0000u
#define PWM_CH1_CC_B_MSB 31u
#define PWM_CH1_CC_B_LSB 16u
#define PWM_CH1_CC_B_ACCESS "RW"
#define PWM_CH1_CC_A_RESET 0x0000u
#define PWM_CH1_CC_A_BITS 0x0000ffffu
#define PWM_CH1_CC_A_MSB 15u
#define PWM_CH1_CC_A_LSB 0u
#define PWM_CH1_CC_A_ACCESS "RW"
#define PWM_CH1_TOP_OFFSET 0x00000024u
#define PWM_CH1_TOP_BITS 0x0000ffffu
#define PWM_CH1_TOP_RESET 0x0000ffffu
#define PWM_CH1_TOP_MSB 15u
#define PWM_CH1_TOP_LSB 0u
#define PWM_CH1_TOP_ACCESS "RW"
#define PWM_CH2_CSR_OFFSET 0x00000028u
#define PWM_CH2_CSR_BITS 0x000000ffu
#define PWM_CH2_CSR_RESET 0x00000000u
#define PWM_CH2_CSR_PH_ADV_RESET 0x0u
#define PWM_CH2_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH2_CSR_PH_ADV_MSB 7u
#define PWM_CH2_CSR_PH_ADV_LSB 7u
#define PWM_CH2_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH2_CSR_PH_RET_RESET 0x0u
#define PWM_CH2_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH2_CSR_PH_RET_MSB 6u
#define PWM_CH2_CSR_PH_RET_LSB 6u
#define PWM_CH2_CSR_PH_RET_ACCESS "SC"
#define PWM_CH2_CSR_DIVMODE_RESET 0x0u
#define PWM_CH2_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH2_CSR_DIVMODE_MSB 5u
#define PWM_CH2_CSR_DIVMODE_LSB 4u
#define PWM_CH2_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH2_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH2_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH2_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH2_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH2_CSR_B_INV_RESET 0x0u
#define PWM_CH2_CSR_B_INV_BITS 0x00000008u
#define PWM_CH2_CSR_B_INV_MSB 3u
#define PWM_CH2_CSR_B_INV_LSB 3u
#define PWM_CH2_CSR_B_INV_ACCESS "RW"
#define PWM_CH2_CSR_A_INV_RESET 0x0u
#define PWM_CH2_CSR_A_INV_BITS 0x00000004u
#define PWM_CH2_CSR_A_INV_MSB 2u
#define PWM_CH2_CSR_A_INV_LSB 2u
#define PWM_CH2_CSR_A_INV_ACCESS "RW"
#define PWM_CH2_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH2_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH2_CSR_PH_CORRECT_MSB 1u
#define PWM_CH2_CSR_PH_CORRECT_LSB 1u
#define PWM_CH2_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH2_CSR_EN_RESET 0x0u
#define PWM_CH2_CSR_EN_BITS 0x00000001u
#define PWM_CH2_CSR_EN_MSB 0u
#define PWM_CH2_CSR_EN_LSB 0u
#define PWM_CH2_CSR_EN_ACCESS "RW"
#define PWM_CH2_DIV_OFFSET 0x0000002cu
#define PWM_CH2_DIV_BITS 0x00000fffu
#define PWM_CH2_DIV_RESET 0x00000010u
#define PWM_CH2_DIV_INT_RESET 0x01u
#define PWM_CH2_DIV_INT_BITS 0x00000ff0u
#define PWM_CH2_DIV_INT_MSB 11u
#define PWM_CH2_DIV_INT_LSB 4u
#define PWM_CH2_DIV_INT_ACCESS "RW"
#define PWM_CH2_DIV_FRAC_RESET 0x0u
#define PWM_CH2_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH2_DIV_FRAC_MSB 3u
#define PWM_CH2_DIV_FRAC_LSB 0u
#define PWM_CH2_DIV_FRAC_ACCESS "RW"
#define PWM_CH2_CTR_OFFSET 0x00000030u
#define PWM_CH2_CTR_BITS 0x0000ffffu
#define PWM_CH2_CTR_RESET 0x00000000u
#define PWM_CH2_CTR_MSB 15u
#define PWM_CH2_CTR_LSB 0u
#define PWM_CH2_CTR_ACCESS "RW"
#define PWM_CH2_CC_OFFSET 0x00000034u
#define PWM_CH2_CC_BITS 0xffffffffu
#define PWM_CH2_CC_RESET 0x00000000u
#define PWM_CH2_CC_B_RESET 0x0000u
#define PWM_CH2_CC_B_BITS 0xffff0000u
#define PWM_CH2_CC_B_MSB 31u
#define PWM_CH2_CC_B_LSB 16u
#define PWM_CH2_CC_B_ACCESS "RW"
#define PWM_CH2_CC_A_RESET 0x0000u
#define PWM_CH2_CC_A_BITS 0x0000ffffu
#define PWM_CH2_CC_A_MSB 15u
#define PWM_CH2_CC_A_LSB 0u
#define PWM_CH2_CC_A_ACCESS "RW"
#define PWM_CH2_TOP_OFFSET 0x00000038u
#define PWM_CH2_TOP_BITS 0x0000ffffu
#define PWM_CH2_TOP_RESET 0x0000ffffu
#define PWM_CH2_TOP_MSB 15u
#define PWM_CH2_TOP_LSB 0u
#define PWM_CH2_TOP_ACCESS "RW"
#define PWM_CH3_CSR_OFFSET 0x0000003cu
#define PWM_CH3_CSR_BITS 0x000000ffu
#define PWM_CH3_CSR_RESET 0x00000000u
#define PWM_CH3_CSR_PH_ADV_RESET 0x0u
#define PWM_CH3_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH3_CSR_PH_ADV_MSB 7u
#define PWM_CH3_CSR_PH_ADV_LSB 7u
#define PWM_CH3_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH3_CSR_PH_RET_RESET 0x0u
#define PWM_CH3_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH3_CSR_PH_RET_MSB 6u
#define PWM_CH3_CSR_PH_RET_LSB 6u
#define PWM_CH3_CSR_PH_RET_ACCESS "SC"
#define PWM_CH3_CSR_DIVMODE_RESET 0x0u
#define PWM_CH3_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH3_CSR_DIVMODE_MSB 5u
#define PWM_CH3_CSR_DIVMODE_LSB 4u
#define PWM_CH3_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH3_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH3_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH3_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH3_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH3_CSR_B_INV_RESET 0x0u
#define PWM_CH3_CSR_B_INV_BITS 0x00000008u
#define PWM_CH3_CSR_B_INV_MSB 3u
#define PWM_CH3_CSR_B_INV_LSB 3u
#define PWM_CH3_CSR_B_INV_ACCESS "RW"
#define PWM_CH3_CSR_A_INV_RESET 0x0u
#define PWM_CH3_CSR_A_INV_BITS 0x00000004u
#define PWM_CH3_CSR_A_INV_MSB 2u
#define PWM_CH3_CSR_A_INV_LSB 2u
#define PWM_CH3_CSR_A_INV_ACCESS "RW"
#define PWM_CH3_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH3_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH3_CSR_PH_CORRECT_MSB 1u
#define PWM_CH3_CSR_PH_CORRECT_LSB 1u
#define PWM_CH3_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH3_CSR_EN_RESET 0x0u
#define PWM_CH3_CSR_EN_BITS 0x00000001u
#define PWM_CH3_CSR_EN_MSB 0u
#define PWM_CH3_CSR_EN_LSB 0u
#define PWM_CH3_CSR_EN_ACCESS "RW"
#define PWM_CH3_DIV_OFFSET 0x00000040u
#define PWM_CH3_DIV_BITS 0x00000fffu
#define PWM_CH3_DIV_RESET 0x00000010u
#define PWM_CH3_DIV_INT_RESET 0x01u
#define PWM_CH3_DIV_INT_BITS 0x00000ff0u
#define PWM_CH3_DIV_INT_MSB 11u
#define PWM_CH3_DIV_INT_LSB 4u
#define PWM_CH3_DIV_INT_ACCESS "RW"
#define PWM_CH3_DIV_FRAC_RESET 0x0u
#define PWM_CH3_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH3_DIV_FRAC_MSB 3u
#define PWM_CH3_DIV_FRAC_LSB 0u
#define PWM_CH3_DIV_FRAC_ACCESS "RW"
#define PWM_CH3_CTR_OFFSET 0x00000044u
#define PWM_CH3_CTR_BITS 0x0000ffffu
#define PWM_CH3_CTR_RESET 0x00000000u
#define PWM_CH3_CTR_MSB 15u
#define PWM_CH3_CTR_LSB 0u
#define PWM_CH3_CTR_ACCESS "RW"
#define PWM_CH3_CC_OFFSET 0x00000048u
#define PWM_CH3_CC_BITS 0xffffffffu
#define PWM_CH3_CC_RESET 0x00000000u
#define PWM_CH3_CC_B_RESET 0x0000u
#define PWM_CH3_CC_B_BITS 0xffff0000u
#define PWM_CH3_CC_B_MSB 31u
#define PWM_CH3_CC_B_LSB 16u
#define PWM_CH3_CC_B_ACCESS "RW"
#define PWM_CH3_CC_A_RESET 0x0000u
#define PWM_CH3_CC_A_BITS 0x0000ffffu
#define PWM_CH3_CC_A_MSB 15u
#define PWM_CH3_CC_A_LSB 0u
#define PWM_CH3_CC_A_ACCESS "RW"
#define PWM_CH3_TOP_OFFSET 0x0000004cu
#define PWM_CH3_TOP_BITS 0x0000ffffu
#define PWM_CH3_TOP_RESET 0x0000ffffu
#define PWM_CH3_TOP_MSB 15u
#define PWM_CH3_TOP_LSB 0u
#define PWM_CH3_TOP_ACCESS "RW"
#define PWM_CH4_CSR_OFFSET 0x00000050u
#define PWM_CH4_CSR_BITS 0x000000ffu
#define PWM_CH4_CSR_RESET 0x00000000u
#define PWM_CH4_CSR_PH_ADV_RESET 0x0u
#define PWM_CH4_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH4_CSR_PH_ADV_MSB 7u
#define PWM_CH4_CSR_PH_ADV_LSB 7u
#define PWM_CH4_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH4_CSR_PH_RET_RESET 0x0u
#define PWM_CH4_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH4_CSR_PH_RET_MSB 6u
#define PWM_CH4_CSR_PH_RET_LSB 6u
#define PWM_CH4_CSR_PH_RET_ACCESS "SC"
#define PWM_CH4_CSR_DIVMODE_RESET 0x0u
#define PWM_CH4_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH4_CSR_DIVMODE_MSB 5u
#define PWM_CH4_CSR_DIVMODE_LSB 4u
#define PWM_CH4_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH4_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH4_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH4_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH4_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH4_CSR_B_INV_RESET 0x0u
#define PWM_CH4_CSR_B_INV_BITS 0x00000008u
#define PWM_CH4_CSR_B_INV_MSB 3u
#define PWM_CH4_CSR_B_INV_LSB 3u
#define PWM_CH4_CSR_B_INV_ACCESS "RW"
#define PWM_CH4_CSR_A_INV_RESET 0x0u
#define PWM_CH4_CSR_A_INV_BITS 0x00000004u
#define PWM_CH4_CSR_A_INV_MSB 2u
#define PWM_CH4_CSR_A_INV_LSB 2u
#define PWM_CH4_CSR_A_INV_ACCESS "RW"
#define PWM_CH4_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH4_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH4_CSR_PH_CORRECT_MSB 1u
#define PWM_CH4_CSR_PH_CORRECT_LSB 1u
#define PWM_CH4_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH4_CSR_EN_RESET 0x0u
#define PWM_CH4_CSR_EN_BITS 0x00000001u
#define PWM_CH4_CSR_EN_MSB 0u
#define PWM_CH4_CSR_EN_LSB 0u
#define PWM_CH4_CSR_EN_ACCESS "RW"
#define PWM_CH4_DIV_OFFSET 0x00000054u
#define PWM_CH4_DIV_BITS 0x00000fffu
#define PWM_CH4_DIV_RESET 0x00000010u
#define PWM_CH4_DIV_INT_RESET 0x01u
#define PWM_CH4_DIV_INT_BITS 0x00000ff0u
#define PWM_CH4_DIV_INT_MSB 11u
#define PWM_CH4_DIV_INT_LSB 4u
#define PWM_CH4_DIV_INT_ACCESS "RW"
#define PWM_CH4_DIV_FRAC_RESET 0x0u
#define PWM_CH4_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH4_DIV_FRAC_MSB 3u
#define PWM_CH4_DIV_FRAC_LSB 0u
#define PWM_CH4_DIV_FRAC_ACCESS "RW"
#define PWM_CH4_CTR_OFFSET 0x00000058u
#define PWM_CH4_CTR_BITS 0x0000ffffu
#define PWM_CH4_CTR_RESET 0x00000000u
#define PWM_CH4_CTR_MSB 15u
#define PWM_CH4_CTR_LSB 0u
#define PWM_CH4_CTR_ACCESS "RW"
#define PWM_CH4_CC_OFFSET 0x0000005cu
#define PWM_CH4_CC_BITS 0xffffffffu
#define PWM_CH4_CC_RESET 0x00000000u
#define PWM_CH4_CC_B_RESET 0x0000u
#define PWM_CH4_CC_B_BITS 0xffff0000u
#define PWM_CH4_CC_B_MSB 31u
#define PWM_CH4_CC_B_LSB 16u
#define PWM_CH4_CC_B_ACCESS "RW"
#define PWM_CH4_CC_A_RESET 0x0000u
#define PWM_CH4_CC_A_BITS 0x0000ffffu
#define PWM_CH4_CC_A_MSB 15u
#define PWM_CH4_CC_A_LSB 0u
#define PWM_CH4_CC_A_ACCESS "RW"
#define PWM_CH4_TOP_OFFSET 0x00000060u
#define PWM_CH4_TOP_BITS 0x0000ffffu
#define PWM_CH4_TOP_RESET 0x0000ffffu
#define PWM_CH4_TOP_MSB 15u
#define PWM_CH4_TOP_LSB 0u
#define PWM_CH4_TOP_ACCESS "RW"
#define PWM_CH5_CSR_OFFSET 0x00000064u
#define PWM_CH5_CSR_BITS 0x000000ffu
#define PWM_CH5_CSR_RESET 0x00000000u
#define PWM_CH5_CSR_PH_ADV_RESET 0x0u
#define PWM_CH5_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH5_CSR_PH_ADV_MSB 7u
#define PWM_CH5_CSR_PH_ADV_LSB 7u
#define PWM_CH5_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH5_CSR_PH_RET_RESET 0x0u
#define PWM_CH5_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH5_CSR_PH_RET_MSB 6u
#define PWM_CH5_CSR_PH_RET_LSB 6u
#define PWM_CH5_CSR_PH_RET_ACCESS "SC"
#define PWM_CH5_CSR_DIVMODE_RESET 0x0u
#define PWM_CH5_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH5_CSR_DIVMODE_MSB 5u
#define PWM_CH5_CSR_DIVMODE_LSB 4u
#define PWM_CH5_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH5_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH5_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH5_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH5_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH5_CSR_B_INV_RESET 0x0u
#define PWM_CH5_CSR_B_INV_BITS 0x00000008u
#define PWM_CH5_CSR_B_INV_MSB 3u
#define PWM_CH5_CSR_B_INV_LSB 3u
#define PWM_CH5_CSR_B_INV_ACCESS "RW"
#define PWM_CH5_CSR_A_INV_RESET 0x0u
#define PWM_CH5_CSR_A_INV_BITS 0x00000004u
#define PWM_CH5_CSR_A_INV_MSB 2u
#define PWM_CH5_CSR_A_INV_LSB 2u
#define PWM_CH5_CSR_A_INV_ACCESS "RW"
#define PWM_CH5_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH5_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH5_CSR_PH_CORRECT_MSB 1u
#define PWM_CH5_CSR_PH_CORRECT_LSB 1u
#define PWM_CH5_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH5_CSR_EN_RESET 0x0u
#define PWM_CH5_CSR_EN_BITS 0x00000001u
#define PWM_CH5_CSR_EN_MSB 0u
#define PWM_CH5_CSR_EN_LSB 0u
#define PWM_CH5_CSR_EN_ACCESS "RW"
#define PWM_CH5_DIV_OFFSET 0x00000068u
#define PWM_CH5_DIV_BITS 0x00000fffu
#define PWM_CH5_DIV_RESET 0x00000010u
#define PWM_CH5_DIV_INT_RESET 0x01u
#define PWM_CH5_DIV_INT_BITS 0x00000ff0u
#define PWM_CH5_DIV_INT_MSB 11u
#define PWM_CH5_DIV_INT_LSB 4u
#define PWM_CH5_DIV_INT_ACCESS "RW"
#define PWM_CH5_DIV_FRAC_RESET 0x0u
#define PWM_CH5_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH5_DIV_FRAC_MSB 3u
#define PWM_CH5_DIV_FRAC_LSB 0u
#define PWM_CH5_DIV_FRAC_ACCESS "RW"
#define PWM_CH5_CTR_OFFSET 0x0000006cu
#define PWM_CH5_CTR_BITS 0x0000ffffu
#define PWM_CH5_CTR_RESET 0x00000000u
#define PWM_CH5_CTR_MSB 15u
#define PWM_CH5_CTR_LSB 0u
#define PWM_CH5_CTR_ACCESS "RW"
#define PWM_CH5_CC_OFFSET 0x00000070u
#define PWM_CH5_CC_BITS 0xffffffffu
#define PWM_CH5_CC_RESET 0x00000000u
#define PWM_CH5_CC_B_RESET 0x0000u
#define PWM_CH5_CC_B_BITS 0xffff0000u
#define PWM_CH5_CC_B_MSB 31u
#define PWM_CH5_CC_B_LSB 16u
#define PWM_CH5_CC_B_ACCESS "RW"
#define PWM_CH5_CC_A_RESET 0x0000u
#define PWM_CH5_CC_A_BITS 0x0000ffffu
#define PWM_CH5_CC_A_MSB 15u
#define PWM_CH5_CC_A_LSB 0u
#define PWM_CH5_CC_A_ACCESS "RW"
#define PWM_CH5_TOP_OFFSET 0x00000074u
#define PWM_CH5_TOP_BITS 0x0000ffffu
#define PWM_CH5_TOP_RESET 0x0000ffffu
#define PWM_CH5_TOP_MSB 15u
#define PWM_CH5_TOP_LSB 0u
#define PWM_CH5_TOP_ACCESS "RW"
#define PWM_CH6_CSR_OFFSET 0x00000078u
#define PWM_CH6_CSR_BITS 0x000000ffu
#define PWM_CH6_CSR_RESET 0x00000000u
#define PWM_CH6_CSR_PH_ADV_RESET 0x0u
#define PWM_CH6_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH6_CSR_PH_ADV_MSB 7u
#define PWM_CH6_CSR_PH_ADV_LSB 7u
#define PWM_CH6_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH6_CSR_PH_RET_RESET 0x0u
#define PWM_CH6_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH6_CSR_PH_RET_MSB 6u
#define PWM_CH6_CSR_PH_RET_LSB 6u
#define PWM_CH6_CSR_PH_RET_ACCESS "SC"
#define PWM_CH6_CSR_DIVMODE_RESET 0x0u
#define PWM_CH6_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH6_CSR_DIVMODE_MSB 5u
#define PWM_CH6_CSR_DIVMODE_LSB 4u
#define PWM_CH6_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH6_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH6_CSR_DIVMODE_VALUE_LEVEL 0x1u
