gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PWM_CH6_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH6_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH6_CSR_B_INV_RESET 0x0u
#define PWM_CH6_CSR_B_INV_BITS 0x00000008u
#define PWM_CH6_CSR_B_INV_MSB 3u
#define PWM_CH6_CSR_B_INV_LSB 3u
#define PWM_CH6_CSR_B_INV_ACCESS "RW"
#define PWM_CH6_CSR_A_INV_RESET 0x0u
#define PWM_CH6_CSR_A_INV_BITS 0x00000004u
#define PWM_CH6_CSR_A_INV_MSB 2u
#define PWM_CH6_CSR_A_INV_LSB 2u
#define PWM_CH6_CSR_A_INV_ACCESS "RW"
#define PWM_CH6_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH6_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH6_CSR_PH_CORRECT_MSB 1u
#define PWM_CH6_CSR_PH_CORRECT_LSB 1u
#define PWM_CH6_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH6_CSR_EN_RESET 0x0u
#define PWM_CH6_CSR_EN_BITS 0x00000001u
#define PWM_CH6_CSR_EN_MSB 0u
#define PWM_CH6_CSR_EN_LSB 0u
#define PWM_CH6_CSR_EN_ACCESS "RW"
#define PWM_CH6_DIV_OFFSET 0x0000007cu
#define PWM_CH6_DIV_BITS 0x00000fffu
#define PWM_CH6_DIV_RESET 0x00000010u
#define PWM_CH6_DIV_INT_RESET 0x01u
#define PWM_CH6_DIV_INT_BITS 0x00000ff0u
#define PWM_CH6_DIV_INT_MSB 11u
#define PWM_CH6_DIV_INT_LSB 4u
#define PWM_CH6_DIV_INT_ACCESS "RW"
#define PWM_CH6_DIV_FRAC_RESET 0x0u
#define PWM_CH6_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH6_DIV_FRAC_MSB 3u
#define PWM_CH6_DIV_FRAC_LSB 0u
#define PWM_CH6_DIV_FRAC_ACCESS "RW"
#define PWM_CH6_CTR_OFFSET 0x00000080u
#define PWM_CH6_CTR_BITS 0x0000ffffu
#define PWM_CH6_CTR_RESET 0x00000000u
#define PWM_CH6_CTR_MSB 15u
#define PWM_CH6_CTR_LSB 0u
#define PWM_CH6_CTR_ACCESS "RW"
#define PWM_CH6_CC_OFFSET 0x00000084u
#define PWM_CH6_CC_BITS 0xffffffffu
#define PWM_CH6_CC_RESET 0x00000000u
#define PWM_CH6_CC_B_RESET 0x0000u
#define PWM_CH6_CC_B_BITS 0xffff0000u
#define PWM_CH6_CC_B_MSB 31u
#define PWM_CH6_CC_B_LSB 16u
#define PWM_CH6_CC_B_ACCESS "RW"
#define PWM_CH6_CC_A_RESET 0x0000u
#define PWM_CH6_CC_A_BITS 0x0000ffffu
#define PWM_CH6_CC_A_MSB 15u
#define PWM_CH6_CC_A_LSB 0u
#define PWM_CH6_CC_A_ACCESS "RW"
#define PWM_CH6_TOP_OFFSET 0x00000088u
#define PWM_CH6_TOP_BITS 0x0000ffffu
#define PWM_CH6_TOP_RESET 0x0000ffffu
#define PWM_CH6_TOP_MSB 15u
#define PWM_CH6_TOP_LSB 0u
#define PWM_CH6_TOP_ACCESS "RW"
#define PWM_CH7_CSR_OFFSET 0x0000008cu
#define PWM_CH7_CSR_BITS 0x000000ffu
#define PWM_CH7_CSR_RESET 0x00000000u
#define PWM_CH7_CSR_PH_ADV_RESET 0x0u
#define PWM_CH7_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH7_CSR_PH_ADV_MSB 7u
#define PWM_CH7_CSR_PH_ADV_LSB 7u
#define PWM_CH7_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH7_CSR_PH_RET_RESET 0x0u
#define PWM_CH7_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH7_CSR_PH_RET_MSB 6u
#define PWM_CH7_CSR_PH_RET_LSB 6u
#define PWM_CH7_CSR_PH_RET_ACCESS "SC"
#define PWM_CH7_CSR_DIVMODE_RESET 0x0u
#define PWM_CH7_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH7_CSR_DIVMODE_MSB 5u
#define PWM_CH7_CSR_DIVMODE_LSB 4u
#define PWM_CH7_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH7_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH7_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH7_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH7_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH7_CSR_B_INV_RESET 0x0u
#define PWM_CH7_CSR_B_INV_BITS 0x00000008u
#define PWM_CH7_CSR_B_INV_MSB 3u
#define PWM_CH7_CSR_B_INV_LSB 3u
#define PWM_CH7_CSR_B_INV_ACCESS "RW"
#define PWM_CH7_CSR_A_INV_RESET 0x0u
#define PWM_CH7_CSR_A_INV_BITS 0x00000004u
#define PWM_CH7_CSR_A_INV_MSB 2u
#define PWM_CH7_CSR_A_INV_LSB 2u
#define PWM_CH7_CSR_A_INV_ACCESS "RW"
#define PWM_CH7_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH7_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH7_CSR_PH_CORRECT_MSB 1u
#define PWM_CH7_CSR_PH_CORRECT_LSB 1u
#define PWM_CH7_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH7_CSR_EN_RESET 0x0u
#define PWM_CH7_CSR_EN_BITS 0x00000001u
#define PWM_CH7_CSR_EN_MSB 0u
#define PWM_CH7_CSR_EN_LSB 0u
#define PWM_CH7_CSR_EN_ACCESS "RW"
#define PWM_CH7_DIV_OFFSET 0x00000090u
#define PWM_CH7_DIV_BITS 0x00000fffu
#define PWM_CH7_DIV_RESET 0x00000010u
#define PWM_CH7_DIV_INT_RESET 0x01u
#define PWM_CH7_DIV_INT_BITS 0x00000ff0u
#define PWM_CH7_DIV_INT_MSB 11u
#define PWM_CH7_DIV_INT_LSB 4u
#define PWM_CH7_DIV_INT_ACCESS "RW"
#define PWM_CH7_DIV_FRAC_RESET 0x0u
#define PWM_CH7_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH7_DIV_FRAC_MSB 3u
#define PWM_CH7_DIV_FRAC_LSB 0u
#define PWM_CH7_DIV_FRAC_ACCESS "RW"
#define PWM_CH7_CTR_OFFSET 0x00000094u
#define PWM_CH7_CTR_BITS 0x0000ffffu
#define PWM_CH7_CTR_RESET 0x00000000u
#define PWM_CH7_CTR_MSB 15u
#define PWM_CH7_CTR_LSB 0u
#define PWM_CH7_CTR_ACCESS "RW"
#define PWM_CH7_CC_OFFSET 0x00000098u
#define PWM_CH7_CC_BITS 0xffffffffu
#define PWM_CH7_CC_RESET 0x00000000u
#define PWM_CH7_CC_B_RESET 0x0000u
#define PWM_CH7_CC_B_BITS 0xffff0000u
#define PWM_CH7_CC_B_MSB 31u
#define PWM_CH7_CC_B_LSB 16u
#define PWM_CH7_CC_B_ACCESS "RW"
#define PWM_CH7_CC_A_RESET 0x0000u
#define PWM_CH7_CC_A_BITS 0x0000ffffu
#define PWM_CH7_CC_A_MSB 15u
#define PWM_CH7_CC_A_LSB 0u
#define PWM_CH7_CC_A_ACCESS "RW"
#define PWM_CH7_TOP_OFFSET 0x0000009cu
#define PWM_CH7_TOP_BITS 0x0000ffffu
#define PWM_CH7_TOP_RESET 0x0000ffffu
#define PWM_CH7_TOP_MSB 15u
#define PWM_CH7_TOP_LSB 0u
#define PWM_CH7_TOP_ACCESS "RW"
#define PWM_CH8_CSR_OFFSET 0x000000a0u
#define PWM_CH8_CSR_BITS 0x000000ffu
#define PWM_CH8_CSR_RESET 0x00000000u
#define PWM_CH8_CSR_PH_ADV_RESET 0x0u
#define PWM_CH8_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH8_CSR_PH_ADV_MSB 7u
#define PWM_CH8_CSR_PH_ADV_LSB 7u
#define PWM_CH8_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH8_CSR_PH_RET_RESET 0x0u
#define PWM_CH8_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH8_CSR_PH_RET_MSB 6u
#define PWM_CH8_CSR_PH_RET_LSB 6u
#define PWM_CH8_CSR_PH_RET_ACCESS "SC"
#define PWM_CH8_CSR_DIVMODE_RESET 0x0u
#define PWM_CH8_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH8_CSR_DIVMODE_MSB 5u
#define PWM_CH8_CSR_DIVMODE_LSB 4u
#define PWM_CH8_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH8_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH8_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH8_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH8_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH8_CSR_B_INV_RESET 0x0u
#define PWM_CH8_CSR_B_INV_BITS 0x00000008u
#define PWM_CH8_CSR_B_INV_MSB 3u
#define PWM_CH8_CSR_B_INV_LSB 3u
#define PWM_CH8_CSR_B_INV_ACCESS "RW"
#define PWM_CH8_CSR_A_INV_RESET 0x0u
#define PWM_CH8_CSR_A_INV_BITS 0x00000004u
#define PWM_CH8_CSR_A_INV_MSB 2u
#define PWM_CH8_CSR_A_INV_LSB 2u
#define PWM_CH8_CSR_A_INV_ACCESS "RW"
#define PWM_CH8_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH8_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH8_CSR_PH_CORRECT_MSB 1u
#define PWM_CH8_CSR_PH_CORRECT_LSB 1u
#define PWM_CH8_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH8_CSR_EN_RESET 0x0u
#define PWM_CH8_CSR_EN_BITS 0x00000001u
#define PWM_CH8_CSR_EN_MSB 0u
#define PWM_CH8_CSR_EN_LSB 0u
#define PWM_CH8_CSR_EN_ACCESS "RW"
#define PWM_CH8_DIV_OFFSET 0x000000a4u
#define PWM_CH8_DIV_BITS 0x00000fffu
#define PWM_CH8_DIV_RESET 0x00000010u
#define PWM_CH8_DIV_INT_RESET 0x01u
#define PWM_CH8_DIV_INT_BITS 0x00000ff0u
#define PWM_CH8_DIV_INT_MSB 11u
#define PWM_CH8_DIV_INT_LSB 4u
#define PWM_CH8_DIV_INT_ACCESS "RW"
#define PWM_CH8_DIV_FRAC_RESET 0x0u
#define PWM_CH8_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH8_DIV_FRAC_MSB 3u
#define PWM_CH8_DIV_FRAC_LSB 0u
#define PWM_CH8_DIV_FRAC_ACCESS "RW"
#define PWM_CH8_CTR_OFFSET 0x000000a8u
#define PWM_CH8_CTR_BITS 0x0000ffffu
#define PWM_CH8_CTR_RESET 0x00000000u
#define PWM_CH8_CTR_MSB 15u
#define PWM_CH8_CTR_LSB 0u
#define PWM_CH8_CTR_ACCESS "RW"
#define PWM_CH8_CC_OFFSET 0x000000acu
#define PWM_CH8_CC_BITS 0xffffffffu
#define PWM_CH8_CC_RESET 0x00000000u
#define PWM_CH8_CC_B_RESET 0x0000u
#define PWM_CH8_CC_B_BITS 0xffff0000u
#define PWM_CH8_CC_B_MSB 31u
#define PWM_CH8_CC_B_LSB 16u
#define PWM_CH8_CC_B_ACCESS "RW"
#define PWM_CH8_CC_A_RESET 0x0000u
#define PWM_CH8_CC_A_BITS 0x0000ffffu
#define PWM_CH8_CC_A_MSB 15u
#define PWM_CH8_CC_A_LSB 0u
#define PWM_CH8_CC_A_ACCESS "RW"
#define PWM_CH8_TOP_OFFSET 0x000000b0u
#define PWM_CH8_TOP_BITS 0x0000ffffu
#define PWM_CH8_TOP_RESET 0x0000ffffu
#define PWM_CH8_TOP_MSB 15u
#define PWM_CH8_TOP_LSB 0u
#define PWM_CH8_TOP_ACCESS "RW"
#define PWM_CH9_CSR_OFFSET 0x000000b4u
#define PWM_CH9_CSR_BITS 0x000000ffu
#define PWM_CH9_CSR_RESET 0x00000000u
#define PWM_CH9_CSR_PH_ADV_RESET 0x0u
#define PWM_CH9_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH9_CSR_PH_ADV_MSB 7u
#define PWM_CH9_CSR_PH_ADV_LSB 7u
#define PWM_CH9_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH9_CSR_PH_RET_RESET 0x0u
#define PWM_CH9_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH9_CSR_PH_RET_MSB 6u
#define PWM_CH9_CSR_PH_RET_LSB 6u
#define PWM_CH9_CSR_PH_RET_ACCESS "SC"
#define PWM_CH9_CSR_DIVMODE_RESET 0x0u
#define PWM_CH9_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH9_CSR_DIVMODE_MSB 5u
#define PWM_CH9_CSR_DIVMODE_LSB 4u
#define PWM_CH9_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH9_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH9_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH9_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH9_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH9_CSR_B_INV_RESET 0x0u
#define PWM_CH9_CSR_B_INV_BITS 0x00000008u
#define PWM_CH9_CSR_B_INV_MSB 3u
#define PWM_CH9_CSR_B_INV_LSB 3u
#define PWM_CH9_CSR_B_INV_ACCESS "RW"
#define PWM_CH9_CSR_A_INV_RESET 0x0u
#define PWM_CH9_CSR_A_INV_BITS 0x00000004u
#define PWM_CH9_CSR_A_INV_MSB 2u
#define PWM_CH9_CSR_A_INV_LSB 2u
#define PWM_CH9_CSR_A_INV_ACCESS "RW"
#define PWM_CH9_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH9_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH9_CSR_PH_CORRECT_MSB 1u
#define PWM_CH9_CSR_PH_CORRECT_LSB 1u
#define PWM_CH9_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH9_CSR_EN_RESET 0x0u
#define PWM_CH9_CSR_EN_BITS 0x00000001u
#define PWM_CH9_CSR_EN_MSB 0u
#define PWM_CH9_CSR_EN_LSB 0u
#define PWM_CH9_CSR_EN_ACCESS "RW"
#define PWM_CH9_DIV_OFFSET 0x000000b8u
#define PWM_CH9_DIV_BITS 0x00000fffu
#define PWM_CH9_DIV_RESET 0x00000010u
#define PWM_CH9_DIV_INT_RESET 0x01u
#define PWM_CH9_DIV_INT_BITS 0x00000ff0u
#define PWM_CH9_DIV_INT_MSB 11u
#define PWM_CH9_DIV_INT_LSB 4u
#define PWM_CH9_DIV_INT_ACCESS "RW"
#define PWM_CH9_DIV_FRAC_RESET 0x0u
#define PWM_CH9_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH9_DIV_FRAC_MSB 3u
#define PWM_CH9_DIV_FRAC_LSB 0u
#define PWM_CH9_DIV_FRAC_ACCESS "RW"
#define PWM_CH9_CTR_OFFSET 0x000000bcu
#define PWM_CH9_CTR_BITS 0x0000ffffu
#define PWM_CH9_CTR_RESET 0x00000000u
#define PWM_CH9_CTR_MSB 15u
#define PWM_CH9_CTR_LSB 0u
#define PWM_CH9_CTR_ACCESS "RW"
#define PWM_CH9_CC_OFFSET 0x000000c0u
#define PWM_CH9_CC_BITS 0xffffffffu
#define PWM_CH9_CC_RESET 0x00000000u
#define PWM_CH9_CC_B_RESET 0x0000u
#define PWM_CH9_CC_B_BITS 0xffff0000u
#define PWM_CH9_CC_B_MSB 31u
#define PWM_CH9_CC_B_LSB 16u
#define PWM_CH9_CC_B_ACCESS "RW"
#define PWM_CH9_CC_A_RESET 0x0000u
#define PWM_CH9_CC_A_BITS 0x0000ffffu
#define PWM_CH9_CC_A_MSB 15u
#define PWM_CH9_CC_A_LSB 0u
#define PWM_CH9_CC_A_ACCESS "RW"
#define PWM_CH9_TOP_OFFSET 0x000000c4u
#define PWM_CH9_TOP_BITS 0x0000ffffu
#define PWM_CH9_TOP_RESET 0x0000ffffu
#define PWM_CH9_TOP_MSB 15u
#define PWM_CH9_TOP_LSB 0u
#define PWM_CH9_TOP_ACCESS "RW"
#define PWM_CH10_CSR_OFFSET 0x000000c8u
#define PWM_CH10_CSR_BITS 0x000000ffu
#define PWM_CH10_CSR_RESET 0x00000000u
#define PWM_CH10_CSR_PH_ADV_RESET 0x0u
#define PWM_CH10_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH10_CSR_PH_ADV_MSB 7u
#define PWM_CH10_CSR_PH_ADV_LSB 7u
#define PWM_CH10_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH10_CSR_PH_RET_RESET 0x0u
#define PWM_CH10_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH10_CSR_PH_RET_MSB 6u
#define PWM_CH10_CSR_PH_RET_LSB 6u
#define PWM_CH10_CSR_PH_RET_ACCESS "SC"
#define PWM_CH10_CSR_DIVMODE_RESET 0x0u
#define PWM_CH10_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH10_CSR_DIVMODE_MSB 5u
#define PWM_CH10_CSR_DIVMODE_LSB 4u
#define PWM_CH10_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH10_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH10_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH10_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH10_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH10_CSR_B_INV_RESET 0x0u
#define PWM_CH10_CSR_B_INV_BITS 0x00000008u
#define PWM_CH10_CSR_B_INV_MSB 3u
#define PWM_CH10_CSR_B_INV_LSB 3u
#define PWM_CH10_CSR_B_INV_ACCESS "RW"
#define PWM_CH10_CSR_A_INV_RESET 0x0u
#define PWM_CH10_CSR_A_INV_BITS 0x00000004u
#define PWM_CH10_CSR_A_INV_MSB 2u
#define PWM_CH10_CSR_A_INV_LSB 2u
#define PWM_CH10_CSR_A_INV_ACCESS "RW"
#define PWM_CH10_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH10_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH10_CSR_PH_CORRECT_MSB 1u
#define PWM_CH10_CSR_PH_CORRECT_LSB 1u
#define PWM_CH10_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH10_CSR_EN_RESET 0x0u
#define PWM_CH10_CSR_EN_BITS 0x00000001u
#define PWM_CH10_CSR_EN_MSB 0u
#define PWM_CH10_CSR_EN_LSB 0u
#define PWM_CH10_CSR_EN_ACCESS "RW"
#define PWM_CH10_DIV_OFFSET 0x000000ccu
#define PWM_CH10_DIV_BITS 0x00000fffu
#define PWM_CH10_DIV_RESET 0x00000010u
#define PWM_CH10_DIV_INT_RESET 0x01u
#define PWM_CH10_DIV_INT_BITS 0x00000ff0u
#define PWM_CH10_DIV_INT_MSB 11u
#define PWM_CH10_DIV_INT_LSB 4u
#define PWM_CH10_DIV_INT_ACCESS "RW"
#define PWM_CH10_DIV_FRAC_RESET 0x0u
#define PWM_CH10_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH10_DIV_FRAC_MSB 3u
#define PWM_CH10_DIV_FRAC_LSB 0u
#define PWM_CH10_DIV_FRAC_ACCESS "RW"
#define PWM_CH10_CTR_OFFSET 0x000000d0u
#define PWM_CH10_CTR_BITS 0x0000ffffu
#define PWM_CH10_CTR_RESET 0x00000000u
#define PWM_CH10_CTR_MSB 15u
#define PWM_CH10_CTR_LSB 0u
#define PWM_CH10_CTR_ACCESS "RW"
#define PWM_CH10_CC_OFFSET 0x000000d4u
#define PWM_CH10_CC_BITS 0xffffffffu
#define PWM_CH10_CC_RESET 0x00000000u
#define PWM_CH10_CC_B_RESET 0x0000u
#define PWM_CH10_CC_B_BITS 0xffff0000u
#define PWM_CH10_CC_B_MSB 31u
#define PWM_CH10_CC_B_LSB 16u
#define PWM_CH10_CC_B_ACCESS "RW"
#define PWM_CH10_CC_A_RESET 0x0000u
#define PWM_CH10_CC_A_BITS 0x0000ffffu
#define PWM_CH10_CC_A_MSB 15u
#define PWM_CH10_CC_A_LSB 0u
#define PWM_CH10_CC_A_ACCESS "RW"
#define PWM_CH10_TOP_OFFSET 0x000000d8u
#define PWM_CH10_TOP_BITS 0x0000ffffu
#define PWM_CH10_TOP_RESET 0x0000ffffu
#define PWM_CH10_TOP_MSB 15u
#define PWM_CH10_TOP_LSB 0u
#define PWM_CH10_TOP_ACCESS "RW"
#define PWM_CH11_CSR_OFFSET 0x000000dcu
#define PWM_CH11_CSR_BITS 0x000000ffu
#define PWM_CH11_CSR_RESET 0x00000000u
#define PWM_CH11_CSR_PH_ADV_RESET 0x0u
#define PWM_CH11_CSR_PH_ADV_BITS 0x00000080u
#define PWM_CH11_CSR_PH_ADV_MSB 7u
#define PWM_CH11_CSR_PH_ADV_LSB 7u
#define PWM_CH11_CSR_PH_ADV_ACCESS "SC"
#define PWM_CH11_CSR_PH_RET_RESET 0x0u
#define PWM_CH11_CSR_PH_RET_BITS 0x00000040u
#define PWM_CH11_CSR_PH_RET_MSB 6u
#define PWM_CH11_CSR_PH_RET_LSB 6u
#define PWM_CH11_CSR_PH_RET_ACCESS "SC"
#define PWM_CH11_CSR_DIVMODE_RESET 0x0u
#define PWM_CH11_CSR_DIVMODE_BITS 0x00000030u
#define PWM_CH11_CSR_DIVMODE_MSB 5u
#define PWM_CH11_CSR_DIVMODE_LSB 4u
#define PWM_CH11_CSR_DIVMODE_ACCESS "RW"
#define PWM_CH11_CSR_DIVMODE_VALUE_DIV 0x0u
#define PWM_CH11_CSR_DIVMODE_VALUE_LEVEL 0x1u
#define PWM_CH11_CSR_DIVMODE_VALUE_RISE 0x2u
#define PWM_CH11_CSR_DIVMODE_VALUE_FALL 0x3u
#define PWM_CH11_CSR_B_INV_RESET 0x0u
#define PWM_CH11_CSR_B_INV_BITS 0x00000008u
#define PWM_CH11_CSR_B_INV_MSB 3u
#define PWM_CH11_CSR_B_INV_LSB 3u
#define PWM_CH11_CSR_B_INV_ACCESS "RW"
#define PWM_CH11_CSR_A_INV_RESET 0x0u
#define PWM_CH11_CSR_A_INV_BITS 0x00000004u
#define PWM_CH11_CSR_A_INV_MSB 2u
#define PWM_CH11_CSR_A_INV_LSB 2u
#define PWM_CH11_CSR_A_INV_ACCESS "RW"
#define PWM_CH11_CSR_PH_CORRECT_RESET 0x0u
#define PWM_CH11_CSR_PH_CORRECT_BITS 0x00000002u
#define PWM_CH11_CSR_PH_CORRECT_MSB 1u
#define PWM_CH11_CSR_PH_CORRECT_LSB 1u
#define PWM_CH11_CSR_PH_CORRECT_ACCESS "RW"
#define PWM_CH11_CSR_EN_RESET 0x0u
#define PWM_CH11_CSR_EN_BITS 0x00000001u
#define PWM_CH11_CSR_EN_MSB 0u
#define PWM_CH11_CSR_EN_LSB 0u
#define PWM_CH11_CSR_EN_ACCESS "RW"
#define PWM_CH11_DIV_OFFSET 0x000000e0u
#define PWM_CH11_DIV_BITS 0x00000fffu
#define PWM_CH11_DIV_RESET 0x00000010u
#define PWM_CH11_DIV_INT_RESET 0x01u
#define PWM_CH11_DIV_INT_BITS 0x00000ff0u
#define PWM_CH11_DIV_INT_MSB 11u
#define PWM_CH11_DIV_INT_LSB 4u
#define PWM_CH11_DIV_INT_ACCESS "RW"
#define PWM_CH11_DIV_FRAC_RESET 0x0u
#define PWM_CH11_DIV_FRAC_BITS 0x0000000fu
#define PWM_CH11_DIV_FRAC_MSB 3u
#define PWM_CH11_DIV_FRAC_LSB 0u
#define PWM_CH11_DIV_FRAC_ACCESS "RW"
#define PWM_CH11_CTR_OFFSET 0x000000e4u
#define PWM_CH11_CTR_BITS 0x0000ffffu
#define PWM_CH11_CTR_RESET 0x00000000u
#define PWM_CH11_CTR_MSB 15u
#define PWM_CH11_CTR_LSB 0u
#define PWM_CH11_CTR_ACCESS "RW"
#define PWM_CH11_CC_OFFSET 0x000000e8u
#define PWM_CH11_CC_BITS 0xffffffffu
#define PWM_CH11_CC_RESET 0x00000000u
#define PWM_CH11_CC_B_RESET 0x0000u
#define PWM_CH11_CC_B_BITS 0xffff0000u
#define PWM_CH11_CC_B_MSB 31u
#define PWM_CH11_CC_B_LSB 16u
#define PWM_CH11_CC_B_ACCESS "RW"
#define PWM_CH11_CC_A_RESET 0x0000u
#define PWM_CH11_CC_A_BITS 0x0000ffffu
#define PWM_CH11_CC_A_MSB 15u
#define PWM_CH11_CC_A_LSB 0u
#define PWM_CH11_CC_A_ACCESS "RW"
#define PWM_CH11_TOP_OFFSET 0x000000ecu
#define PWM_CH11_TOP_BITS 0x0000ffffu
#define PWM_CH11_TOP_RESET 0x0000ffffu
#define PWM_CH11_TOP_MSB 15u
#define PWM_CH11_TOP_LSB 0u
#define PWM_CH11_TOP_ACCESS "RW"
#define PWM_EN_OFFSET 0x000000f0u
#define PWM_EN_BITS 0x00000fffu
#define PWM_EN_RESET 0x00000000u
#define PWM_EN_CH11_RESET 0x0u
#define PWM_EN_CH11_BITS 0x00000800u
#define PWM_EN_CH11_MSB 11u
#define PWM_EN_CH11_LSB 11u
#define PWM_EN_CH11_ACCESS "RW"
#define PWM_EN_CH10_RESET 0x0u
#define PWM_EN_CH10_BITS 0x00000400u
#define PWM_EN_CH10_MSB 10u
#define PWM_EN_CH10_LSB 10u
#define PWM_EN_CH10_ACCESS "RW"
#define PWM_EN_CH9_RESET 0x0u
#define PWM_EN_CH9_BITS 0x00000200u
#define PWM_EN_CH9_MSB 9u
#define PWM_EN_CH9_LSB 9u
#define PWM_EN_CH9_ACCESS "RW"
#define PWM_EN_CH8_RESET 0x0u
#define PWM_EN_CH8_BITS 0x00000100u
#define PWM_EN_CH8_MSB 8u
#define PWM_EN_CH8_LSB 8u
#define PWM_EN_CH8_ACCESS "RW"
#define PWM_EN_CH7_RESET 0x0u
#define PWM_EN_CH7_BITS 0x00000080u
#define PWM_EN_CH7_MSB 7u
#define PWM_EN_CH7_LSB 7u
#define PWM_EN_CH7_ACCESS "RW"
#define PWM_EN_CH6_RESET 0x0u
#define PWM_EN_CH6_BITS 0x00000040u
#define PWM_EN_CH6_MSB 6u
#define PWM_EN_CH6_LSB 6u
#define PWM_EN_CH6_ACCESS "RW"
#define PWM_EN_CH5_RESET 0x0u
#define PWM_EN_CH5_BITS 0x00000020u
#define PWM_EN_CH5_MSB 5u
#define PWM_EN_CH5_LSB 5u
#define PWM_EN_CH5_ACCESS "RW"
#define PWM_EN_CH4_RESET 0x0u
#define PWM_EN_CH4_BITS 0x00000010u
#define PWM_EN_CH4_MSB 4u
#define PWM_EN_CH4_LSB 4u
#define PWM_EN_CH4_ACCESS "RW"
#define PWM_EN_CH3_RESET 0x0u
#define PWM_EN_CH3_BITS 0x00000008u
#define PWM_EN_CH3_MSB 3u
#define PWM_EN_CH3_LSB 3u
#define PWM_EN_CH3_ACCESS "RW"
#define PWM_EN_CH2_RESET 0x0u
#define PWM_EN_CH2_BITS 0x00000004u
#define PWM_EN_CH2_MSB 2u
#define PWM_EN_CH2_LSB 2u
#define PWM_EN_CH2_ACCESS "RW"
#define PWM_EN_CH1_RESET 0x0u
#define PWM_EN_CH1_BITS 0x00000002u
#define PWM_EN_CH1_MSB 1u
#define PWM_EN_CH1_LSB 1u
#define PWM_EN_CH1_ACCESS "RW"
#define PWM_EN_CH0_RESET 0x0u
#define PWM_EN_CH0_BITS 0x00000001u
#define PWM_EN_CH0_MSB 0u
#define PWM_EN_CH0_LSB 0u
#define PWM_EN_CH0_ACCESS "RW"
#define PWM_INTR_OFFSET 0x000000f4u
#define PWM_INTR_BITS 0x00000fffu
#define PWM_INTR_RESET 0x00000000u
#define PWM_INTR_CH11_RESET 0x0u
#define PWM_INTR_CH11_BITS 0x00000800u
#define PWM_INTR_CH11_MSB 11u
#define PWM_INTR_CH11_LSB 11u
#define PWM_INTR_CH11_ACCESS "WC"
#define PWM_INTR_CH10_RESET 0x0u
#define PWM_INTR_CH10_BITS 0x00000400u
#define PWM_INTR_CH10_MSB 10u
#define PWM_INTR_CH10_LSB 10u
#define PWM_INTR_CH10_ACCESS "WC"
#define PWM_INTR_CH9_RESET 0x0u
#define PWM_INTR_CH9_BITS 0x00000200u
#define PWM_INTR_CH9_MSB 9u
#define PWM_INTR_CH9_LSB 9u
#define PWM_INTR_CH9_ACCESS "WC"
#define PWM_INTR_CH8_RESET 0x0u
#define PWM_INTR_CH8_BITS 0x00000100u
#define PWM_INTR_CH8_MSB 8u
#define PWM_INTR_CH8_LSB 8u
#define PWM_INTR_CH8_ACCESS "WC"
#define PWM_INTR_CH7_RESET 0x0u
#define PWM_INTR_CH7_BITS 0x00000080u
#define PWM_INTR_CH7_MSB 7u
#define PWM_INTR_CH7_LSB 7u
#define PWM_INTR_CH7_ACCESS "WC"
#define PWM_INTR_CH6_RESET 0x0u
#define PWM_INTR_CH6_BITS 0x00000040u
#define PWM_INTR_CH6_MSB 6u
#define PWM_INTR_CH6_LSB 6u
#define PWM_INTR_CH6_ACCESS "WC"
#define PWM_INTR_CH5_RESET 0x0u
#define PWM_INTR_CH5_BITS 0x00000020u
#define PWM_INTR_CH5_MSB 5u
#define PWM_INTR_CH5_LSB 5u
#define PWM_INTR_CH5_ACCESS "WC"
#define PWM_INTR_CH4_RESET 0x0u
#define PWM_INTR_CH4_BITS 0x00000010u
#define PWM_INTR_CH4_MSB 4u
#define PWM_INTR_CH4_LSB 4u
#define PWM_INTR_CH4_ACCESS "WC"
#define PWM_INTR_CH3_RESET 0x0u
#define PWM_INTR_CH3_BITS 0x00000008u
#define PWM_INTR_CH3_MSB 3u
#define PWM_INTR_CH3_LSB 3u
#define PWM_INTR_CH3_ACCESS "WC"
#define PWM_INTR_CH2_RESET 0x0u
#define PWM_INTR_CH2_BITS 0x00000004u
#define PWM_INTR_CH2_MSB 2u
#define PWM_INTR_CH2_LSB 2u
#define PWM_INTR_CH2_ACCESS "WC"
#define PWM_INTR_CH1_RESET 0x0u
#define PWM_INTR_CH1_BITS 0x00000002u
#define PWM_INTR_CH1_MSB 1u
#define PWM_INTR_CH1_LSB 1u
#define PWM_INTR_CH1_ACCESS "WC"
#define PWM_INTR_CH0_RESET 0x0u
#define PWM_INTR_CH0_BITS 0x00000001u
#define PWM_INTR_CH0_MSB 0u
#define PWM_INTR_CH0_LSB 0u
#define PWM_INTR_CH0_ACCESS "WC"
#define PWM_IRQ0_INTE_OFFSET 0x000000f8u
#define PWM_IRQ0_INTE_BITS 0x00000fffu
#define PWM_IRQ0_INTE_RESET 0x00000000u
#define PWM_IRQ0_INTE_CH11_RESET 0x0u
#define PWM_IRQ0_INTE_CH11_BITS 0x00000800u
#define PWM_IRQ0_INTE_CH11_MSB 11u
#define PWM_IRQ0_INTE_CH11_LSB 11u
#define PWM_IRQ0_INTE_CH11_ACCESS "RW"
#define PWM_IRQ0_INTE_CH10_RESET 0x0u
#define PWM_IRQ0_INTE_CH10_BITS 0x00000400u
#define PWM_IRQ0_INTE_CH10_MSB 10u
#define PWM_IRQ0_INTE_CH10_LSB 10u
#define PWM_IRQ0_INTE_CH10_ACCESS "RW"
#define PWM_IRQ0_INTE_CH9_RESET 0x0u
#define PWM_IRQ0_INTE_CH9_BITS 0x00000200u
#define PWM_IRQ0_INTE_CH9_MSB 9u
#define PWM_IRQ0_INTE_CH9_LSB 9u
#define PWM_IRQ0_INTE_CH9_ACCESS "RW"
#define PWM_IRQ0_INTE_CH8_RESET 0x0u
#define PWM_IRQ0_INTE_CH8_BITS 0x00000100u
#define PWM_IRQ0_INTE_CH8_MSB 8u
#define PWM_IRQ0_INTE_CH8_LSB 8u
#define PWM_IRQ0_INTE_CH8_ACCESS "RW"
#define PWM_IRQ0_INTE_CH7_RESET 0x0u
#define PWM_IRQ0_INTE_CH7_BITS 0x00000080u
#define PWM_IRQ0_INTE_CH7_MSB 7u
#define PWM_IRQ0_INTE_CH7_LSB 7u
#define PWM_IRQ0_INTE_CH7_ACCESS "RW"
#define PWM_IRQ0_INTE_CH6_RESET 0x0u
#define PWM_IRQ0_INTE_CH6_BITS 0x00000040u
#define PWM_IRQ0_INTE_CH6_MSB 6u
#define PWM_IRQ0_INTE_CH6_LSB 6u
#define PWM_IRQ0_INTE_CH6_ACCESS "RW"
#define PWM_IRQ0_INTE_CH5_RESET 0x0u
#define PWM_IRQ0_INTE_CH5_BITS 0x00000020u
#define PWM_IRQ0_INTE_CH5_MSB 5u
#define PWM_IRQ0_INTE_CH5_LSB 5u
#define PWM_IRQ0_INTE_CH5_ACCESS "RW"
#define PWM_IRQ0_INTE_CH4_RESET 0x0u
#define PWM_IRQ0_INTE_CH4_BITS 0x00000010u
#define PWM_IRQ0_INTE_CH4_MSB 4u
#define PWM_IRQ0_INTE_CH4_LSB 4u
#define PWM_IRQ0_INTE_CH4_ACCESS "RW"
#define PWM_IRQ0_INTE_CH3_RESET 0x0u
#define PWM_IRQ0_INTE_CH3_BITS 0x00000008u
#define PWM_IRQ0_INTE_CH3_MSB 3u
#define PWM_IRQ0_INTE_CH3_LSB 3u
#define PWM_IRQ0_INTE_CH3_ACCESS "RW"
#define PWM_IRQ0_INTE_CH2_RESET 0x0u
#define PWM_IRQ0_INTE_CH2_BITS 0x00000004u
#define PWM_IRQ0_INTE_CH2_MSB 2u
#define PWM_IRQ0_INTE_CH2_LSB 2u
#define PWM_IRQ0_INTE_CH2_ACCESS "RW"
#define PWM_IRQ0_INTE_CH1_RESET 0x0u
#define PWM_IRQ0_INTE_CH1_BITS 0x00000002u
#define PWM_IRQ0_INTE_CH1_MSB 1u
#define PWM_IRQ0_INTE_CH1_LSB 1u
#define PWM_IRQ0_INTE_CH1_ACCESS "RW"
#define PWM_IRQ0_INTE_CH0_RESET 0x0u
#define PWM_IRQ0_INTE_CH0_BITS 0x00000001u
#define PWM_IRQ0_INTE_CH0_MSB 0u
#define PWM_IRQ0_INTE_CH0_LSB 0u
#define PWM_IRQ0_INTE_CH0_ACCESS "RW"
#define PWM_IRQ0_INTF_OFFSET 0x000000fcu
#define PWM_IRQ0_INTF_BITS 0x00000fffu
#define PWM_IRQ0_INTF_RESET 0x00000000u
#define PWM_IRQ0_INTF_CH11_RESET 0x0u
#define PWM_IRQ0_INTF_CH11_BITS 0x00000800u
#define PWM_IRQ0_INTF_CH11_MSB 11u
#define PWM_IRQ0_INTF_CH11_LSB 11u
#define PWM_IRQ0_INTF_CH11_ACCESS "RW"
#define PWM_IRQ0_INTF_CH10_RESET 0x0u
#define PWM_IRQ0_INTF_CH10_BITS 0x00000400u
#define PWM_IRQ0_INTF_CH10_MSB 10u
#define PWM_IRQ0_INTF_CH10_LSB 10u
#define PWM_IRQ0_INTF_CH10_ACCESS "RW"
#define PWM_IRQ0_INTF_CH9_RESET 0x0u
#define PWM_IRQ0_INTF_CH9_BITS 0x00000200u
#define PWM_IRQ0_INTF_CH9_MSB 9u
#define PWM_IRQ0_INTF_CH9_LSB 9u
#define PWM_IRQ0_INTF_CH9_ACCESS "RW"
#define PWM_IRQ0_INTF_CH8_RESET 0x0u
#define PWM_IRQ0_INTF_CH8_BITS 0x00000100u
#define PWM_IRQ0_INTF_CH8_MSB 8u
#define PWM_IRQ0_INTF_CH8_LSB 8u
