gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define PWM_IRQ0_INTF_CH8_ACCESS "RW"
#define PWM_IRQ0_INTF_CH7_RESET 0x0u
#define PWM_IRQ0_INTF_CH7_BITS 0x00000080u
#define PWM_IRQ0_INTF_CH7_MSB 7u
#define PWM_IRQ0_INTF_CH7_LSB 7u
#define PWM_IRQ0_INTF_CH7_ACCESS "RW"
#define PWM_IRQ0_INTF_CH6_RESET 0x0u
#define PWM_IRQ0_INTF_CH6_BITS 0x00000040u
#define PWM_IRQ0_INTF_CH6_MSB 6u
#define PWM_IRQ0_INTF_CH6_LSB 6u
#define PWM_IRQ0_INTF_CH6_ACCESS "RW"
#define PWM_IRQ0_INTF_CH5_RESET 0x0u
#define PWM_IRQ0_INTF_CH5_BITS 0x00000020u
#define PWM_IRQ0_INTF_CH5_MSB 5u
#define PWM_IRQ0_INTF_CH5_LSB 5u
#define PWM_IRQ0_INTF_CH5_ACCESS "RW"
#define PWM_IRQ0_INTF_CH4_RESET 0x0u
#define PWM_IRQ0_INTF_CH4_BITS 0x00000010u
#define PWM_IRQ0_INTF_CH4_MSB 4u
#define PWM_IRQ0_INTF_CH4_LSB 4u
#define PWM_IRQ0_INTF_CH4_ACCESS "RW"
#define PWM_IRQ0_INTF_CH3_RESET 0x0u
#define PWM_IRQ0_INTF_CH3_BITS 0x00000008u
#define PWM_IRQ0_INTF_CH3_MSB 3u
#define PWM_IRQ0_INTF_CH3_LSB 3u
#define PWM_IRQ0_INTF_CH3_ACCESS "RW"
#define PWM_IRQ0_INTF_CH2_RESET 0x0u
#define PWM_IRQ0_INTF_CH2_BITS 0x00000004u
#define PWM_IRQ0_INTF_CH2_MSB 2u
#define PWM_IRQ0_INTF_CH2_LSB 2u
#define PWM_IRQ0_INTF_CH2_ACCESS "RW"
#define PWM_IRQ0_INTF_CH1_RESET 0x0u
#define PWM_IRQ0_INTF_CH1_BITS 0x00000002u
#define PWM_IRQ0_INTF_CH1_MSB 1u
#define PWM_IRQ0_INTF_CH1_LSB 1u
#define PWM_IRQ0_INTF_CH1_ACCESS "RW"
#define PWM_IRQ0_INTF_CH0_RESET 0x0u
#define PWM_IRQ0_INTF_CH0_BITS 0x00000001u
#define PWM_IRQ0_INTF_CH0_MSB 0u
#define PWM_IRQ0_INTF_CH0_LSB 0u
#define PWM_IRQ0_INTF_CH0_ACCESS "RW"
#define PWM_IRQ0_INTS_OFFSET 0x00000100u
#define PWM_IRQ0_INTS_BITS 0x00000fffu
#define PWM_IRQ0_INTS_RESET 0x00000000u
#define PWM_IRQ0_INTS_CH11_RESET 0x0u
#define PWM_IRQ0_INTS_CH11_BITS 0x00000800u
#define PWM_IRQ0_INTS_CH11_MSB 11u
#define PWM_IRQ0_INTS_CH11_LSB 11u
#define PWM_IRQ0_INTS_CH11_ACCESS "RO"
#define PWM_IRQ0_INTS_CH10_RESET 0x0u
#define PWM_IRQ0_INTS_CH10_BITS 0x00000400u
#define PWM_IRQ0_INTS_CH10_MSB 10u
#define PWM_IRQ0_INTS_CH10_LSB 10u
#define PWM_IRQ0_INTS_CH10_ACCESS "RO"
#define PWM_IRQ0_INTS_CH9_RESET 0x0u
#define PWM_IRQ0_INTS_CH9_BITS 0x00000200u
#define PWM_IRQ0_INTS_CH9_MSB 9u
#define PWM_IRQ0_INTS_CH9_LSB 9u
#define PWM_IRQ0_INTS_CH9_ACCESS "RO"
#define PWM_IRQ0_INTS_CH8_RESET 0x0u
#define PWM_IRQ0_INTS_CH8_BITS 0x00000100u
#define PWM_IRQ0_INTS_CH8_MSB 8u
#define PWM_IRQ0_INTS_CH8_LSB 8u
#define PWM_IRQ0_INTS_CH8_ACCESS "RO"
#define PWM_IRQ0_INTS_CH7_RESET 0x0u
#define PWM_IRQ0_INTS_CH7_BITS 0x00000080u
#define PWM_IRQ0_INTS_CH7_MSB 7u
#define PWM_IRQ0_INTS_CH7_LSB 7u
#define PWM_IRQ0_INTS_CH7_ACCESS "RO"
#define PWM_IRQ0_INTS_CH6_RESET 0x0u
#define PWM_IRQ0_INTS_CH6_BITS 0x00000040u
#define PWM_IRQ0_INTS_CH6_MSB 6u
#define PWM_IRQ0_INTS_CH6_LSB 6u
#define PWM_IRQ0_INTS_CH6_ACCESS "RO"
#define PWM_IRQ0_INTS_CH5_RESET 0x0u
#define PWM_IRQ0_INTS_CH5_BITS 0x00000020u
#define PWM_IRQ0_INTS_CH5_MSB 5u
#define PWM_IRQ0_INTS_CH5_LSB 5u
#define PWM_IRQ0_INTS_CH5_ACCESS "RO"
#define PWM_IRQ0_INTS_CH4_RESET 0x0u
#define PWM_IRQ0_INTS_CH4_BITS 0x00000010u
#define PWM_IRQ0_INTS_CH4_MSB 4u
#define PWM_IRQ0_INTS_CH4_LSB 4u
#define PWM_IRQ0_INTS_CH4_ACCESS "RO"
#define PWM_IRQ0_INTS_CH3_RESET 0x0u
#define PWM_IRQ0_INTS_CH3_BITS 0x00000008u
#define PWM_IRQ0_INTS_CH3_MSB 3u
#define PWM_IRQ0_INTS_CH3_LSB 3u
#define PWM_IRQ0_INTS_CH3_ACCESS "RO"
#define PWM_IRQ0_INTS_CH2_RESET 0x0u
#define PWM_IRQ0_INTS_CH2_BITS 0x00000004u
#define PWM_IRQ0_INTS_CH2_MSB 2u
#define PWM_IRQ0_INTS_CH2_LSB 2u
#define PWM_IRQ0_INTS_CH2_ACCESS "RO"
#define PWM_IRQ0_INTS_CH1_RESET 0x0u
#define PWM_IRQ0_INTS_CH1_BITS 0x00000002u
#define PWM_IRQ0_INTS_CH1_MSB 1u
#define PWM_IRQ0_INTS_CH1_LSB 1u
#define PWM_IRQ0_INTS_CH1_ACCESS "RO"
#define PWM_IRQ0_INTS_CH0_RESET 0x0u
#define PWM_IRQ0_INTS_CH0_BITS 0x00000001u
#define PWM_IRQ0_INTS_CH0_MSB 0u
#define PWM_IRQ0_INTS_CH0_LSB 0u
#define PWM_IRQ0_INTS_CH0_ACCESS "RO"
#define PWM_IRQ1_INTE_OFFSET 0x00000104u
#define PWM_IRQ1_INTE_BITS 0x00000fffu
#define PWM_IRQ1_INTE_RESET 0x00000000u
#define PWM_IRQ1_INTE_CH11_RESET 0x0u
#define PWM_IRQ1_INTE_CH11_BITS 0x00000800u
#define PWM_IRQ1_INTE_CH11_MSB 11u
#define PWM_IRQ1_INTE_CH11_LSB 11u
#define PWM_IRQ1_INTE_CH11_ACCESS "RW"
#define PWM_IRQ1_INTE_CH10_RESET 0x0u
#define PWM_IRQ1_INTE_CH10_BITS 0x00000400u
#define PWM_IRQ1_INTE_CH10_MSB 10u
#define PWM_IRQ1_INTE_CH10_LSB 10u
#define PWM_IRQ1_INTE_CH10_ACCESS "RW"
#define PWM_IRQ1_INTE_CH9_RESET 0x0u
#define PWM_IRQ1_INTE_CH9_BITS 0x00000200u
#define PWM_IRQ1_INTE_CH9_MSB 9u
#define PWM_IRQ1_INTE_CH9_LSB 9u
#define PWM_IRQ1_INTE_CH9_ACCESS "RW"
#define PWM_IRQ1_INTE_CH8_RESET 0x0u
#define PWM_IRQ1_INTE_CH8_BITS 0x00000100u
#define PWM_IRQ1_INTE_CH8_MSB 8u
#define PWM_IRQ1_INTE_CH8_LSB 8u
#define PWM_IRQ1_INTE_CH8_ACCESS "RW"
#define PWM_IRQ1_INTE_CH7_RESET 0x0u
#define PWM_IRQ1_INTE_CH7_BITS 0x00000080u
#define PWM_IRQ1_INTE_CH7_MSB 7u
#define PWM_IRQ1_INTE_CH7_LSB 7u
#define PWM_IRQ1_INTE_CH7_ACCESS "RW"
#define PWM_IRQ1_INTE_CH6_RESET 0x0u
#define PWM_IRQ1_INTE_CH6_BITS 0x00000040u
#define PWM_IRQ1_INTE_CH6_MSB 6u
#define PWM_IRQ1_INTE_CH6_LSB 6u
#define PWM_IRQ1_INTE_CH6_ACCESS "RW"
#define PWM_IRQ1_INTE_CH5_RESET 0x0u
#define PWM_IRQ1_INTE_CH5_BITS 0x00000020u
#define PWM_IRQ1_INTE_CH5_MSB 5u
#define PWM_IRQ1_INTE_CH5_LSB 5u
#define PWM_IRQ1_INTE_CH5_ACCESS "RW"
#define PWM_IRQ1_INTE_CH4_RESET 0x0u
#define PWM_IRQ1_INTE_CH4_BITS 0x00000010u
#define PWM_IRQ1_INTE_CH4_MSB 4u
#define PWM_IRQ1_INTE_CH4_LSB 4u
#define PWM_IRQ1_INTE_CH4_ACCESS "RW"
#define PWM_IRQ1_INTE_CH3_RESET 0x0u
#define PWM_IRQ1_INTE_CH3_BITS 0x00000008u
#define PWM_IRQ1_INTE_CH3_MSB 3u
#define PWM_IRQ1_INTE_CH3_LSB 3u
#define PWM_IRQ1_INTE_CH3_ACCESS "RW"
#define PWM_IRQ1_INTE_CH2_RESET 0x0u
#define PWM_IRQ1_INTE_CH2_BITS 0x00000004u
#define PWM_IRQ1_INTE_CH2_MSB 2u
#define PWM_IRQ1_INTE_CH2_LSB 2u
#define PWM_IRQ1_INTE_CH2_ACCESS "RW"
#define PWM_IRQ1_INTE_CH1_RESET 0x0u
#define PWM_IRQ1_INTE_CH1_BITS 0x00000002u
#define PWM_IRQ1_INTE_CH1_MSB 1u
#define PWM_IRQ1_INTE_CH1_LSB 1u
#define PWM_IRQ1_INTE_CH1_ACCESS "RW"
#define PWM_IRQ1_INTE_CH0_RESET 0x0u
#define PWM_IRQ1_INTE_CH0_BITS 0x00000001u
#define PWM_IRQ1_INTE_CH0_MSB 0u
#define PWM_IRQ1_INTE_CH0_LSB 0u
#define PWM_IRQ1_INTE_CH0_ACCESS "RW"
#define PWM_IRQ1_INTF_OFFSET 0x00000108u
#define PWM_IRQ1_INTF_BITS 0x00000fffu
#define PWM_IRQ1_INTF_RESET 0x00000000u
#define PWM_IRQ1_INTF_CH11_RESET 0x0u
#define PWM_IRQ1_INTF_CH11_BITS 0x00000800u
#define PWM_IRQ1_INTF_CH11_MSB 11u
#define PWM_IRQ1_INTF_CH11_LSB 11u
#define PWM_IRQ1_INTF_CH11_ACCESS "RW"
#define PWM_IRQ1_INTF_CH10_RESET 0x0u
#define PWM_IRQ1_INTF_CH10_BITS 0x00000400u
#define PWM_IRQ1_INTF_CH10_MSB 10u
#define PWM_IRQ1_INTF_CH10_LSB 10u
#define PWM_IRQ1_INTF_CH10_ACCESS "RW"
#define PWM_IRQ1_INTF_CH9_RESET 0x0u
#define PWM_IRQ1_INTF_CH9_BITS 0x00000200u
#define PWM_IRQ1_INTF_CH9_MSB 9u
#define PWM_IRQ1_INTF_CH9_LSB 9u
#define PWM_IRQ1_INTF_CH9_ACCESS "RW"
#define PWM_IRQ1_INTF_CH8_RESET 0x0u
#define PWM_IRQ1_INTF_CH8_BITS 0x00000100u
#define PWM_IRQ1_INTF_CH8_MSB 8u
#define PWM_IRQ1_INTF_CH8_LSB 8u
#define PWM_IRQ1_INTF_CH8_ACCESS "RW"
#define PWM_IRQ1_INTF_CH7_RESET 0x0u
#define PWM_IRQ1_INTF_CH7_BITS 0x00000080u
#define PWM_IRQ1_INTF_CH7_MSB 7u
#define PWM_IRQ1_INTF_CH7_LSB 7u
#define PWM_IRQ1_INTF_CH7_ACCESS "RW"
#define PWM_IRQ1_INTF_CH6_RESET 0x0u
#define PWM_IRQ1_INTF_CH6_BITS 0x00000040u
#define PWM_IRQ1_INTF_CH6_MSB 6u
#define PWM_IRQ1_INTF_CH6_LSB 6u
#define PWM_IRQ1_INTF_CH6_ACCESS "RW"
#define PWM_IRQ1_INTF_CH5_RESET 0x0u
#define PWM_IRQ1_INTF_CH5_BITS 0x00000020u
#define PWM_IRQ1_INTF_CH5_MSB 5u
#define PWM_IRQ1_INTF_CH5_LSB 5u
#define PWM_IRQ1_INTF_CH5_ACCESS "RW"
#define PWM_IRQ1_INTF_CH4_RESET 0x0u
#define PWM_IRQ1_INTF_CH4_BITS 0x00000010u
#define PWM_IRQ1_INTF_CH4_MSB 4u
#define PWM_IRQ1_INTF_CH4_LSB 4u
#define PWM_IRQ1_INTF_CH4_ACCESS "RW"
#define PWM_IRQ1_INTF_CH3_RESET 0x0u
#define PWM_IRQ1_INTF_CH3_BITS 0x00000008u
#define PWM_IRQ1_INTF_CH3_MSB 3u
#define PWM_IRQ1_INTF_CH3_LSB 3u
#define PWM_IRQ1_INTF_CH3_ACCESS "RW"
#define PWM_IRQ1_INTF_CH2_RESET 0x0u
#define PWM_IRQ1_INTF_CH2_BITS 0x00000004u
#define PWM_IRQ1_INTF_CH2_MSB 2u
#define PWM_IRQ1_INTF_CH2_LSB 2u
#define PWM_IRQ1_INTF_CH2_ACCESS "RW"
#define PWM_IRQ1_INTF_CH1_RESET 0x0u
#define PWM_IRQ1_INTF_CH1_BITS 0x00000002u
#define PWM_IRQ1_INTF_CH1_MSB 1u
#define PWM_IRQ1_INTF_CH1_LSB 1u
#define PWM_IRQ1_INTF_CH1_ACCESS "RW"
#define PWM_IRQ1_INTF_CH0_RESET 0x0u
#define PWM_IRQ1_INTF_CH0_BITS 0x00000001u
#define PWM_IRQ1_INTF_CH0_MSB 0u
#define PWM_IRQ1_INTF_CH0_LSB 0u
#define PWM_IRQ1_INTF_CH0_ACCESS "RW"
#define PWM_IRQ1_INTS_OFFSET 0x0000010cu
#define PWM_IRQ1_INTS_BITS 0x00000fffu
#define PWM_IRQ1_INTS_RESET 0x00000000u
#define PWM_IRQ1_INTS_CH11_RESET 0x0u
#define PWM_IRQ1_INTS_CH11_BITS 0x00000800u
#define PWM_IRQ1_INTS_CH11_MSB 11u
#define PWM_IRQ1_INTS_CH11_LSB 11u
#define PWM_IRQ1_INTS_CH11_ACCESS "RO"
#define PWM_IRQ1_INTS_CH10_RESET 0x0u
#define PWM_IRQ1_INTS_CH10_BITS 0x00000400u
#define PWM_IRQ1_INTS_CH10_MSB 10u
#define PWM_IRQ1_INTS_CH10_LSB 10u
#define PWM_IRQ1_INTS_CH10_ACCESS "RO"
#define PWM_IRQ1_INTS_CH9_RESET 0x0u
#define PWM_IRQ1_INTS_CH9_BITS 0x00000200u
#define PWM_IRQ1_INTS_CH9_MSB 9u
#define PWM_IRQ1_INTS_CH9_LSB 9u
#define PWM_IRQ1_INTS_CH9_ACCESS "RO"
#define PWM_IRQ1_INTS_CH8_RESET 0x0u
#define PWM_IRQ1_INTS_CH8_BITS 0x00000100u
#define PWM_IRQ1_INTS_CH8_MSB 8u
#define PWM_IRQ1_INTS_CH8_LSB 8u
#define PWM_IRQ1_INTS_CH8_ACCESS "RO"
#define PWM_IRQ1_INTS_CH7_RESET 0x0u
#define PWM_IRQ1_INTS_CH7_BITS 0x00000080u
#define PWM_IRQ1_INTS_CH7_MSB 7u
#define PWM_IRQ1_INTS_CH7_LSB 7u
#define PWM_IRQ1_INTS_CH7_ACCESS "RO"
#define PWM_IRQ1_INTS_CH6_RESET 0x0u
#define PWM_IRQ1_INTS_CH6_BITS 0x00000040u
#define PWM_IRQ1_INTS_CH6_MSB 6u
#define PWM_IRQ1_INTS_CH6_LSB 6u
#define PWM_IRQ1_INTS_CH6_ACCESS "RO"
#define PWM_IRQ1_INTS_CH5_RESET 0x0u
#define PWM_IRQ1_INTS_CH5_BITS 0x00000020u
#define PWM_IRQ1_INTS_CH5_MSB 5u
#define PWM_IRQ1_INTS_CH5_LSB 5u
#define PWM_IRQ1_INTS_CH5_ACCESS "RO"
#define PWM_IRQ1_INTS_CH4_RESET 0x0u
#define PWM_IRQ1_INTS_CH4_BITS 0x00000010u
#define PWM_IRQ1_INTS_CH4_MSB 4u
#define PWM_IRQ1_INTS_CH4_LSB 4u
#define PWM_IRQ1_INTS_CH4_ACCESS "RO"
#define PWM_IRQ1_INTS_CH3_RESET 0x0u
#define PWM_IRQ1_INTS_CH3_BITS 0x00000008u
#define PWM_IRQ1_INTS_CH3_MSB 3u
#define PWM_IRQ1_INTS_CH3_LSB 3u
#define PWM_IRQ1_INTS_CH3_ACCESS "RO"
#define PWM_IRQ1_INTS_CH2_RESET 0x0u
#define PWM_IRQ1_INTS_CH2_BITS 0x00000004u
#define PWM_IRQ1_INTS_CH2_MSB 2u
#define PWM_IRQ1_INTS_CH2_LSB 2u
#define PWM_IRQ1_INTS_CH2_ACCESS "RO"
#define PWM_IRQ1_INTS_CH1_RESET 0x0u
#define PWM_IRQ1_INTS_CH1_BITS 0x00000002u
#define PWM_IRQ1_INTS_CH1_MSB 1u
#define PWM_IRQ1_INTS_CH1_LSB 1u
#define PWM_IRQ1_INTS_CH1_ACCESS "RO"
#define PWM_IRQ1_INTS_CH0_RESET 0x0u
#define PWM_IRQ1_INTS_CH0_BITS 0x00000001u
#define PWM_IRQ1_INTS_CH0_MSB 0u
#define PWM_IRQ1_INTS_CH0_LSB 0u
#define PWM_IRQ1_INTS_CH0_ACCESS "RO"
typedef struct {
   
    io_rw_32 csr;
   
    io_rw_32 div;
   
