gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define RESETS_RESET_TIMER0_RESET 0x1u
#define RESETS_RESET_TIMER0_BITS 0x00800000u
#define RESETS_RESET_TIMER0_MSB 23u
#define RESETS_RESET_TIMER0_LSB 23u
#define RESETS_RESET_TIMER0_ACCESS "RW"
#define RESETS_RESET_TBMAN_RESET 0x1u
#define RESETS_RESET_TBMAN_BITS 0x00400000u
#define RESETS_RESET_TBMAN_MSB 22u
#define RESETS_RESET_TBMAN_LSB 22u
#define RESETS_RESET_TBMAN_ACCESS "RW"
#define RESETS_RESET_SYSINFO_RESET 0x1u
#define RESETS_RESET_SYSINFO_BITS 0x00200000u
#define RESETS_RESET_SYSINFO_MSB 21u
#define RESETS_RESET_SYSINFO_LSB 21u
#define RESETS_RESET_SYSINFO_ACCESS "RW"
#define RESETS_RESET_SYSCFG_RESET 0x1u
#define RESETS_RESET_SYSCFG_BITS 0x00100000u
#define RESETS_RESET_SYSCFG_MSB 20u
#define RESETS_RESET_SYSCFG_LSB 20u
#define RESETS_RESET_SYSCFG_ACCESS "RW"
#define RESETS_RESET_SPI1_RESET 0x1u
#define RESETS_RESET_SPI1_BITS 0x00080000u
#define RESETS_RESET_SPI1_MSB 19u
#define RESETS_RESET_SPI1_LSB 19u
#define RESETS_RESET_SPI1_ACCESS "RW"
#define RESETS_RESET_SPI0_RESET 0x1u
#define RESETS_RESET_SPI0_BITS 0x00040000u
#define RESETS_RESET_SPI0_MSB 18u
#define RESETS_RESET_SPI0_LSB 18u
#define RESETS_RESET_SPI0_ACCESS "RW"
#define RESETS_RESET_SHA256_RESET 0x1u
#define RESETS_RESET_SHA256_BITS 0x00020000u
#define RESETS_RESET_SHA256_MSB 17u
#define RESETS_RESET_SHA256_LSB 17u
#define RESETS_RESET_SHA256_ACCESS "RW"
#define RESETS_RESET_PWM_RESET 0x1u
#define RESETS_RESET_PWM_BITS 0x00010000u
#define RESETS_RESET_PWM_MSB 16u
#define RESETS_RESET_PWM_LSB 16u
#define RESETS_RESET_PWM_ACCESS "RW"
#define RESETS_RESET_PLL_USB_RESET 0x1u
#define RESETS_RESET_PLL_USB_BITS 0x00008000u
#define RESETS_RESET_PLL_USB_MSB 15u
#define RESETS_RESET_PLL_USB_LSB 15u
#define RESETS_RESET_PLL_USB_ACCESS "RW"
#define RESETS_RESET_PLL_SYS_RESET 0x1u
#define RESETS_RESET_PLL_SYS_BITS 0x00004000u
#define RESETS_RESET_PLL_SYS_MSB 14u
#define RESETS_RESET_PLL_SYS_LSB 14u
#define RESETS_RESET_PLL_SYS_ACCESS "RW"
#define RESETS_RESET_PIO2_RESET 0x1u
#define RESETS_RESET_PIO2_BITS 0x00002000u
#define RESETS_RESET_PIO2_MSB 13u
#define RESETS_RESET_PIO2_LSB 13u
#define RESETS_RESET_PIO2_ACCESS "RW"
#define RESETS_RESET_PIO1_RESET 0x1u
#define RESETS_RESET_PIO1_BITS 0x00001000u
#define RESETS_RESET_PIO1_MSB 12u
#define RESETS_RESET_PIO1_LSB 12u
#define RESETS_RESET_PIO1_ACCESS "RW"
#define RESETS_RESET_PIO0_RESET 0x1u
#define RESETS_RESET_PIO0_BITS 0x00000800u
#define RESETS_RESET_PIO0_MSB 11u
#define RESETS_RESET_PIO0_LSB 11u
#define RESETS_RESET_PIO0_ACCESS "RW"
#define RESETS_RESET_PADS_QSPI_RESET 0x1u
#define RESETS_RESET_PADS_QSPI_BITS 0x00000400u
#define RESETS_RESET_PADS_QSPI_MSB 10u
#define RESETS_RESET_PADS_QSPI_LSB 10u
#define RESETS_RESET_PADS_QSPI_ACCESS "RW"
#define RESETS_RESET_PADS_BANK0_RESET 0x1u
#define RESETS_RESET_PADS_BANK0_BITS 0x00000200u
#define RESETS_RESET_PADS_BANK0_MSB 9u
#define RESETS_RESET_PADS_BANK0_LSB 9u
#define RESETS_RESET_PADS_BANK0_ACCESS "RW"
#define RESETS_RESET_JTAG_RESET 0x1u
#define RESETS_RESET_JTAG_BITS 0x00000100u
#define RESETS_RESET_JTAG_MSB 8u
#define RESETS_RESET_JTAG_LSB 8u
#define RESETS_RESET_JTAG_ACCESS "RW"
#define RESETS_RESET_IO_QSPI_RESET 0x1u
#define RESETS_RESET_IO_QSPI_BITS 0x00000080u
#define RESETS_RESET_IO_QSPI_MSB 7u
#define RESETS_RESET_IO_QSPI_LSB 7u
#define RESETS_RESET_IO_QSPI_ACCESS "RW"
#define RESETS_RESET_IO_BANK0_RESET 0x1u
#define RESETS_RESET_IO_BANK0_BITS 0x00000040u
#define RESETS_RESET_IO_BANK0_MSB 6u
#define RESETS_RESET_IO_BANK0_LSB 6u
#define RESETS_RESET_IO_BANK0_ACCESS "RW"
#define RESETS_RESET_I2C1_RESET 0x1u
#define RESETS_RESET_I2C1_BITS 0x00000020u
#define RESETS_RESET_I2C1_MSB 5u
#define RESETS_RESET_I2C1_LSB 5u
#define RESETS_RESET_I2C1_ACCESS "RW"
#define RESETS_RESET_I2C0_RESET 0x1u
#define RESETS_RESET_I2C0_BITS 0x00000010u
#define RESETS_RESET_I2C0_MSB 4u
#define RESETS_RESET_I2C0_LSB 4u
#define RESETS_RESET_I2C0_ACCESS "RW"
#define RESETS_RESET_HSTX_RESET 0x1u
#define RESETS_RESET_HSTX_BITS 0x00000008u
#define RESETS_RESET_HSTX_MSB 3u
#define RESETS_RESET_HSTX_LSB 3u
#define RESETS_RESET_HSTX_ACCESS "RW"
#define RESETS_RESET_DMA_RESET 0x1u
#define RESETS_RESET_DMA_BITS 0x00000004u
#define RESETS_RESET_DMA_MSB 2u
#define RESETS_RESET_DMA_LSB 2u
#define RESETS_RESET_DMA_ACCESS "RW"
#define RESETS_RESET_BUSCTRL_RESET 0x1u
#define RESETS_RESET_BUSCTRL_BITS 0x00000002u
#define RESETS_RESET_BUSCTRL_MSB 1u
#define RESETS_RESET_BUSCTRL_LSB 1u
#define RESETS_RESET_BUSCTRL_ACCESS "RW"
#define RESETS_RESET_ADC_RESET 0x1u
#define RESETS_RESET_ADC_BITS 0x00000001u
#define RESETS_RESET_ADC_MSB 0u
#define RESETS_RESET_ADC_LSB 0u
#define RESETS_RESET_ADC_ACCESS "RW"
#define RESETS_WDSEL_OFFSET 0x00000004u
#define RESETS_WDSEL_BITS 0x1fffffffu
#define RESETS_WDSEL_RESET 0x00000000u
#define RESETS_WDSEL_USBCTRL_RESET 0x0u
#define RESETS_WDSEL_USBCTRL_BITS 0x10000000u
#define RESETS_WDSEL_USBCTRL_MSB 28u
#define RESETS_WDSEL_USBCTRL_LSB 28u
#define RESETS_WDSEL_USBCTRL_ACCESS "RW"
#define RESETS_WDSEL_UART1_RESET 0x0u
#define RESETS_WDSEL_UART1_BITS 0x08000000u
#define RESETS_WDSEL_UART1_MSB 27u
#define RESETS_WDSEL_UART1_LSB 27u
#define RESETS_WDSEL_UART1_ACCESS "RW"
#define RESETS_WDSEL_UART0_RESET 0x0u
#define RESETS_WDSEL_UART0_BITS 0x04000000u
#define RESETS_WDSEL_UART0_MSB 26u
#define RESETS_WDSEL_UART0_LSB 26u
#define RESETS_WDSEL_UART0_ACCESS "RW"
#define RESETS_WDSEL_TRNG_RESET 0x0u
#define RESETS_WDSEL_TRNG_BITS 0x02000000u
#define RESETS_WDSEL_TRNG_MSB 25u
#define RESETS_WDSEL_TRNG_LSB 25u
#define RESETS_WDSEL_TRNG_ACCESS "RW"
#define RESETS_WDSEL_TIMER1_RESET 0x0u
#define RESETS_WDSEL_TIMER1_BITS 0x01000000u
#define RESETS_WDSEL_TIMER1_MSB 24u
#define RESETS_WDSEL_TIMER1_LSB 24u
#define RESETS_WDSEL_TIMER1_ACCESS "RW"
#define RESETS_WDSEL_TIMER0_RESET 0x0u
#define RESETS_WDSEL_TIMER0_BITS 0x00800000u
#define RESETS_WDSEL_TIMER0_MSB 23u
#define RESETS_WDSEL_TIMER0_LSB 23u
#define RESETS_WDSEL_TIMER0_ACCESS "RW"
#define RESETS_WDSEL_TBMAN_RESET 0x0u
#define RESETS_WDSEL_TBMAN_BITS 0x00400000u
#define RESETS_WDSEL_TBMAN_MSB 22u
#define RESETS_WDSEL_TBMAN_LSB 22u
#define RESETS_WDSEL_TBMAN_ACCESS "RW"
#define RESETS_WDSEL_SYSINFO_RESET 0x0u
#define RESETS_WDSEL_SYSINFO_BITS 0x00200000u
#define RESETS_WDSEL_SYSINFO_MSB 21u
#define RESETS_WDSEL_SYSINFO_LSB 21u
#define RESETS_WDSEL_SYSINFO_ACCESS "RW"
#define RESETS_WDSEL_SYSCFG_RESET 0x0u
#define RESETS_WDSEL_SYSCFG_BITS 0x00100000u
#define RESETS_WDSEL_SYSCFG_MSB 20u
#define RESETS_WDSEL_SYSCFG_LSB 20u
#define RESETS_WDSEL_SYSCFG_ACCESS "RW"
#define RESETS_WDSEL_SPI1_RESET 0x0u
#define RESETS_WDSEL_SPI1_BITS 0x00080000u
#define RESETS_WDSEL_SPI1_MSB 19u
#define RESETS_WDSEL_SPI1_LSB 19u
#define RESETS_WDSEL_SPI1_ACCESS "RW"
#define RESETS_WDSEL_SPI0_RESET 0x0u
#define RESETS_WDSEL_SPI0_BITS 0x00040000u
#define RESETS_WDSEL_SPI0_MSB 18u
#define RESETS_WDSEL_SPI0_LSB 18u
#define RESETS_WDSEL_SPI0_ACCESS "RW"
#define RESETS_WDSEL_SHA256_RESET 0x0u
#define RESETS_WDSEL_SHA256_BITS 0x00020000u
#define RESETS_WDSEL_SHA256_MSB 17u
#define RESETS_WDSEL_SHA256_LSB 17u
#define RESETS_WDSEL_SHA256_ACCESS "RW"
#define RESETS_WDSEL_PWM_RESET 0x0u
#define RESETS_WDSEL_PWM_BITS 0x00010000u
#define RESETS_WDSEL_PWM_MSB 16u
#define RESETS_WDSEL_PWM_LSB 16u
#define RESETS_WDSEL_PWM_ACCESS "RW"
#define RESETS_WDSEL_PLL_USB_RESET 0x0u
#define RESETS_WDSEL_PLL_USB_BITS 0x00008000u
#define RESETS_WDSEL_PLL_USB_MSB 15u
#define RESETS_WDSEL_PLL_USB_LSB 15u
#define RESETS_WDSEL_PLL_USB_ACCESS "RW"
#define RESETS_WDSEL_PLL_SYS_RESET 0x0u
#define RESETS_WDSEL_PLL_SYS_BITS 0x00004000u
#define RESETS_WDSEL_PLL_SYS_MSB 14u
#define RESETS_WDSEL_PLL_SYS_LSB 14u
#define RESETS_WDSEL_PLL_SYS_ACCESS "RW"
#define RESETS_WDSEL_PIO2_RESET 0x0u
#define RESETS_WDSEL_PIO2_BITS 0x00002000u
#define RESETS_WDSEL_PIO2_MSB 13u
#define RESETS_WDSEL_PIO2_LSB 13u
#define RESETS_WDSEL_PIO2_ACCESS "RW"
#define RESETS_WDSEL_PIO1_RESET 0x0u
#define RESETS_WDSEL_PIO1_BITS 0x00001000u
#define RESETS_WDSEL_PIO1_MSB 12u
#define RESETS_WDSEL_PIO1_LSB 12u
#define RESETS_WDSEL_PIO1_ACCESS "RW"
#define RESETS_WDSEL_PIO0_RESET 0x0u
#define RESETS_WDSEL_PIO0_BITS 0x00000800u
#define RESETS_WDSEL_PIO0_MSB 11u
#define RESETS_WDSEL_PIO0_LSB 11u
#define RESETS_WDSEL_PIO0_ACCESS "RW"
#define RESETS_WDSEL_PADS_QSPI_RESET 0x0u
#define RESETS_WDSEL_PADS_QSPI_BITS 0x00000400u
#define RESETS_WDSEL_PADS_QSPI_MSB 10u
#define RESETS_WDSEL_PADS_QSPI_LSB 10u
#define RESETS_WDSEL_PADS_QSPI_ACCESS "RW"
#define RESETS_WDSEL_PADS_BANK0_RESET 0x0u
#define RESETS_WDSEL_PADS_BANK0_BITS 0x00000200u
#define RESETS_WDSEL_PADS_BANK0_MSB 9u
#define RESETS_WDSEL_PADS_BANK0_LSB 9u
#define RESETS_WDSEL_PADS_BANK0_ACCESS "RW"
#define RESETS_WDSEL_JTAG_RESET 0x0u
#define RESETS_WDSEL_JTAG_BITS 0x00000100u
#define RESETS_WDSEL_JTAG_MSB 8u
#define RESETS_WDSEL_JTAG_LSB 8u
#define RESETS_WDSEL_JTAG_ACCESS "RW"
#define RESETS_WDSEL_IO_QSPI_RESET 0x0u
#define RESETS_WDSEL_IO_QSPI_BITS 0x00000080u
#define RESETS_WDSEL_IO_QSPI_MSB 7u
#define RESETS_WDSEL_IO_QSPI_LSB 7u
#define RESETS_WDSEL_IO_QSPI_ACCESS "RW"
#define RESETS_WDSEL_IO_BANK0_RESET 0x0u
#define RESETS_WDSEL_IO_BANK0_BITS 0x00000040u
#define RESETS_WDSEL_IO_BANK0_MSB 6u
#define RESETS_WDSEL_IO_BANK0_LSB 6u
#define RESETS_WDSEL_IO_BANK0_ACCESS "RW"
#define RESETS_WDSEL_I2C1_RESET 0x0u
#define RESETS_WDSEL_I2C1_BITS 0x00000020u
#define RESETS_WDSEL_I2C1_MSB 5u
#define RESETS_WDSEL_I2C1_LSB 5u
#define RESETS_WDSEL_I2C1_ACCESS "RW"
#define RESETS_WDSEL_I2C0_RESET 0x0u
#define RESETS_WDSEL_I2C0_BITS 0x00000010u
#define RESETS_WDSEL_I2C0_MSB 4u
#define RESETS_WDSEL_I2C0_LSB 4u
#define RESETS_WDSEL_I2C0_ACCESS "RW"
#define RESETS_WDSEL_HSTX_RESET 0x0u
#define RESETS_WDSEL_HSTX_BITS 0x00000008u
#define RESETS_WDSEL_HSTX_MSB 3u
#define RESETS_WDSEL_HSTX_LSB 3u
#define RESETS_WDSEL_HSTX_ACCESS "RW"
#define RESETS_WDSEL_DMA_RESET 0x0u
#define RESETS_WDSEL_DMA_BITS 0x00000004u
#define RESETS_WDSEL_DMA_MSB 2u
#define RESETS_WDSEL_DMA_LSB 2u
#define RESETS_WDSEL_DMA_ACCESS "RW"
#define RESETS_WDSEL_BUSCTRL_RESET 0x0u
#define RESETS_WDSEL_BUSCTRL_BITS 0x00000002u
#define RESETS_WDSEL_BUSCTRL_MSB 1u
#define RESETS_WDSEL_BUSCTRL_LSB 1u
#define RESETS_WDSEL_BUSCTRL_ACCESS "RW"
#define RESETS_WDSEL_ADC_RESET 0x0u
#define RESETS_WDSEL_ADC_BITS 0x00000001u
#define RESETS_WDSEL_ADC_MSB 0u
#define RESETS_WDSEL_ADC_LSB 0u
#define RESETS_WDSEL_ADC_ACCESS "RW"
#define RESETS_RESET_DONE_OFFSET 0x00000008u
#define RESETS_RESET_DONE_BITS 0x1fffffffu
#define RESETS_RESET_DONE_RESET 0x00000000u
#define RESETS_RESET_DONE_USBCTRL_RESET 0x0u
#define RESETS_RESET_DONE_USBCTRL_BITS 0x10000000u
#define RESETS_RESET_DONE_USBCTRL_MSB 28u
#define RESETS_RESET_DONE_USBCTRL_LSB 28u
#define RESETS_RESET_DONE_USBCTRL_ACCESS "RO"
#define RESETS_RESET_DONE_UART1_RESET 0x0u
#define RESETS_RESET_DONE_UART1_BITS 0x08000000u
#define RESETS_RESET_DONE_UART1_MSB 27u
#define RESETS_RESET_DONE_UART1_LSB 27u
#define RESETS_RESET_DONE_UART1_ACCESS "RO"
#define RESETS_RESET_DONE_UART0_RESET 0x0u
#define RESETS_RESET_DONE_UART0_BITS 0x04000000u
#define RESETS_RESET_DONE_UART0_MSB 26u
#define RESETS_RESET_DONE_UART0_LSB 26u
#define RESETS_RESET_DONE_UART0_ACCESS "RO"
#define RESETS_RESET_DONE_TRNG_RESET 0x0u
#define RESETS_RESET_DONE_TRNG_BITS 0x02000000u
#define RESETS_RESET_DONE_TRNG_MSB 25u
#define RESETS_RESET_DONE_TRNG_LSB 25u
#define RESETS_RESET_DONE_TRNG_ACCESS "RO"
#define RESETS_RESET_DONE_TIMER1_RESET 0x0u
#define RESETS_RESET_DONE_TIMER1_BITS 0x01000000u
#define RESETS_RESET_DONE_TIMER1_MSB 24u
#define RESETS_RESET_DONE_TIMER1_LSB 24u
#define RESETS_RESET_DONE_TIMER1_ACCESS "RO"
#define RESETS_RESET_DONE_TIMER0_RESET 0x0u
#define RESETS_RESET_DONE_TIMER0_BITS 0x00800000u
#define RESETS_RESET_DONE_TIMER0_MSB 23u
#define RESETS_RESET_DONE_TIMER0_LSB 23u
#define RESETS_RESET_DONE_TIMER0_ACCESS "RO"
#define RESETS_RESET_DONE_TBMAN_RESET 0x0u
#define RESETS_RESET_DONE_TBMAN_BITS 0x00400000u
#define RESETS_RESET_DONE_TBMAN_MSB 22u
#define RESETS_RESET_DONE_TBMAN_LSB 22u
#define RESETS_RESET_DONE_TBMAN_ACCESS "RO"
#define RESETS_RESET_DONE_SYSINFO_RESET 0x0u
#define RESETS_RESET_DONE_SYSINFO_BITS 0x00200000u
#define RESETS_RESET_DONE_SYSINFO_MSB 21u
#define RESETS_RESET_DONE_SYSINFO_LSB 21u
#define RESETS_RESET_DONE_SYSINFO_ACCESS "RO"
#define RESETS_RESET_DONE_SYSCFG_RESET 0x0u
#define RESETS_RESET_DONE_SYSCFG_BITS 0x00100000u
#define RESETS_RESET_DONE_SYSCFG_MSB 20u
#define RESETS_RESET_DONE_SYSCFG_LSB 20u
#define RESETS_RESET_DONE_SYSCFG_ACCESS "RO"
#define RESETS_RESET_DONE_SPI1_RESET 0x0u
#define RESETS_RESET_DONE_SPI1_BITS 0x00080000u
#define RESETS_RESET_DONE_SPI1_MSB 19u
#define RESETS_RESET_DONE_SPI1_LSB 19u
#define RESETS_RESET_DONE_SPI1_ACCESS "RO"
#define RESETS_RESET_DONE_SPI0_RESET 0x0u
#define RESETS_RESET_DONE_SPI0_BITS 0x00040000u
#define RESETS_RESET_DONE_SPI0_MSB 18u
#define RESETS_RESET_DONE_SPI0_LSB 18u
#define RESETS_RESET_DONE_SPI0_ACCESS "RO"
#define RESETS_RESET_DONE_SHA256_RESET 0x0u
#define RESETS_RESET_DONE_SHA256_BITS 0x00020000u
#define RESETS_RESET_DONE_SHA256_MSB 17u
#define RESETS_RESET_DONE_SHA256_LSB 17u
#define RESETS_RESET_DONE_SHA256_ACCESS "RO"
#define RESETS_RESET_DONE_PWM_RESET 0x0u
#define RESETS_RESET_DONE_PWM_BITS 0x00010000u
#define RESETS_RESET_DONE_PWM_MSB 16u
#define RESETS_RESET_DONE_PWM_LSB 16u
#define RESETS_RESET_DONE_PWM_ACCESS "RO"
#define RESETS_RESET_DONE_PLL_USB_RESET 0x0u
#define RESETS_RESET_DONE_PLL_USB_BITS 0x00008000u
#define RESETS_RESET_DONE_PLL_USB_MSB 15u
#define RESETS_RESET_DONE_PLL_USB_LSB 15u
#define RESETS_RESET_DONE_PLL_USB_ACCESS "RO"
#define RESETS_RESET_DONE_PLL_SYS_RESET 0x0u
#define RESETS_RESET_DONE_PLL_SYS_BITS 0x00004000u
#define RESETS_RESET_DONE_PLL_SYS_MSB 14u
#define RESETS_RESET_DONE_PLL_SYS_LSB 14u
#define RESETS_RESET_DONE_PLL_SYS_ACCESS "RO"
#define RESETS_RESET_DONE_PIO2_RESET 0x0u
#define RESETS_RESET_DONE_PIO2_BITS 0x00002000u
#define RESETS_RESET_DONE_PIO2_MSB 13u
#define RESETS_RESET_DONE_PIO2_LSB 13u
#define RESETS_RESET_DONE_PIO2_ACCESS "RO"
#define RESETS_RESET_DONE_PIO1_RESET 0x0u
#define RESETS_RESET_DONE_PIO1_BITS 0x00001000u
#define RESETS_RESET_DONE_PIO1_MSB 12u
#define RESETS_RESET_DONE_PIO1_LSB 12u
#define RESETS_RESET_DONE_PIO1_ACCESS "RO"
#define RESETS_RESET_DONE_PIO0_RESET 0x0u
#define RESETS_RESET_DONE_PIO0_BITS 0x00000800u
#define RESETS_RESET_DONE_PIO0_MSB 11u
#define RESETS_RESET_DONE_PIO0_LSB 11u
#define RESETS_RESET_DONE_PIO0_ACCESS "RO"
#define RESETS_RESET_DONE_PADS_QSPI_RESET 0x0u
#define RESETS_RESET_DONE_PADS_QSPI_BITS 0x00000400u
#define RESETS_RESET_DONE_PADS_QSPI_MSB 10u
#define RESETS_RESET_DONE_PADS_QSPI_LSB 10u
#define RESETS_RESET_DONE_PADS_QSPI_ACCESS "RO"
#define RESETS_RESET_DONE_PADS_BANK0_RESET 0x0u
#define RESETS_RESET_DONE_PADS_BANK0_BITS 0x00000200u
#define RESETS_RESET_DONE_PADS_BANK0_MSB 9u
#define RESETS_RESET_DONE_PADS_BANK0_LSB 9u
#define RESETS_RESET_DONE_PADS_BANK0_ACCESS "RO"
#define RESETS_RESET_DONE_JTAG_RESET 0x0u
#define RESETS_RESET_DONE_JTAG_BITS 0x00000100u
#define RESETS_RESET_DONE_JTAG_MSB 8u
#define RESETS_RESET_DONE_JTAG_LSB 8u
#define RESETS_RESET_DONE_JTAG_ACCESS "RO"
#define RESETS_RESET_DONE_IO_QSPI_RESET 0x0u
#define RESETS_RESET_DONE_IO_QSPI_BITS 0x00000080u
#define RESETS_RESET_DONE_IO_QSPI_MSB 7u
#define RESETS_RESET_DONE_IO_QSPI_LSB 7u
#define RESETS_RESET_DONE_IO_QSPI_ACCESS "RO"
#define RESETS_RESET_DONE_IO_BANK0_RESET 0x0u
#define RESETS_RESET_DONE_IO_BANK0_BITS 0x00000040u
#define RESETS_RESET_DONE_IO_BANK0_MSB 6u
#define RESETS_RESET_DONE_IO_BANK0_LSB 6u
#define RESETS_RESET_DONE_IO_BANK0_ACCESS "RO"
#define RESETS_RESET_DONE_I2C1_RESET 0x0u
#define RESETS_RESET_DONE_I2C1_BITS 0x00000020u
#define RESETS_RESET_DONE_I2C1_MSB 5u
#define RESETS_RESET_DONE_I2C1_LSB 5u
#define RESETS_RESET_DONE_I2C1_ACCESS "RO"
#define RESETS_RESET_DONE_I2C0_RESET 0x0u
#define RESETS_RESET_DONE_I2C0_BITS 0x00000010u
#define RESETS_RESET_DONE_I2C0_MSB 4u
#define RESETS_RESET_DONE_I2C0_LSB 4u
#define RESETS_RESET_DONE_I2C0_ACCESS "RO"
#define RESETS_RESET_DONE_HSTX_RESET 0x0u
#define RESETS_RESET_DONE_HSTX_BITS 0x00000008u
#define RESETS_RESET_DONE_HSTX_MSB 3u
#define RESETS_RESET_DONE_HSTX_LSB 3u
#define RESETS_RESET_DONE_HSTX_ACCESS "RO"
#define RESETS_RESET_DONE_DMA_RESET 0x0u
#define RESETS_RESET_DONE_DMA_BITS 0x00000004u
#define RESETS_RESET_DONE_DMA_MSB 2u
#define RESETS_RESET_DONE_DMA_LSB 2u
#define RESETS_RESET_DONE_DMA_ACCESS "RO"
#define RESETS_RESET_DONE_BUSCTRL_RESET 0x0u
#define RESETS_RESET_DONE_BUSCTRL_BITS 0x00000002u
#define RESETS_RESET_DONE_BUSCTRL_MSB 1u
#define RESETS_RESET_DONE_BUSCTRL_LSB 1u
#define RESETS_RESET_DONE_BUSCTRL_ACCESS "RO"
#define RESETS_RESET_DONE_ADC_RESET 0x0u
#define RESETS_RESET_DONE_ADC_BITS 0x00000001u
#define RESETS_RESET_DONE_ADC_MSB 0u
#define RESETS_RESET_DONE_ADC_LSB 0u
#define RESETS_RESET_DONE_ADC_ACCESS "RO"
typedef enum reset_num_rp2350 {
    RESET_ADC = 0,
    RESET_BUSCTRL = 1,
    RESET_DMA = 2,
    RESET_HSTX = 3,
    RESET_I2C0 = 4,
    RESET_I2C1 = 5,
    RESET_IO_BANK0 = 6,
    RESET_IO_QSPI = 7,
    RESET_JTAG = 8,
    RESET_PADS_BANK0 = 9,
    RESET_PADS_QSPI = 10,
    RESET_PIO0 = 11,
    RESET_PIO1 = 12,
    RESET_PIO2 = 13,
    RESET_PLL_SYS = 14,
    RESET_PLL_USB = 15,
    RESET_PWM = 16,
    RESET_SHA256 = 17,
    RESET_SPI0 = 18,
    RESET_SPI1 = 19,
    RESET_SYSCFG = 20,
    RESET_SYSINFO = 21,
    RESET_TBMAN = 22,
    RESET_TIMER0 = 23,
    RESET_TIMER1 = 24,
    RESET_TRNG = 25,
    RESET_UART0 = 26,
    RESET_UART1 = 27,
    RESET_USBCTRL = 28,
    RESET_COUNT
} reset_num_t;
