gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef union {
    uint32_t words[32/4];
    uint8_t bytes[32];
} sha256_result_t;
static inline void sha256_set_dma_size(uint size_in_bytes) {
    uint32_t val;
    ({if (((0 || 0) && !0)) ((!(size_in_bytes != 1 && size_in_bytes != 2 && size_in_bytes != 4)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_sha256/include/hardware/sha256.h", 71, __func__, "!(size_in_bytes != 1 && size_in_bytes != 2 && size_in_bytes != 4)"));});
    if (size_in_bytes == 1) {
        val = 0x0u;
    } else if (size_in_bytes == 2) {
        val = 0x1u;
    } else {
        val = 0x2u;
    }
    hw_write_masked(&((sha256_hw_t *)0x400f8000u)->csr, val << 8u, 0x00000300u);
}
static inline void sha256_set_bswap(_Bool swap) {
    if (swap) {
        hw_set_bits(&((sha256_hw_t *)0x400f8000u)->csr, 0x00001000u);
    } else {
        hw_clear_bits(&((sha256_hw_t *)0x400f8000u)->csr, 0x00001000u);
    }
}
static inline void sha256_start(void) {
    hw_set_bits(&((sha256_hw_t *)0x400f8000u)->csr, 0x00000001u);
}
static inline _Bool sha256_is_sum_valid(void) {
    return ((sha256_hw_t *)0x400f8000u)->csr & 0x00000004u;
}
static inline _Bool sha256_is_ready(void) {
    return ((sha256_hw_t *)0x400f8000u)->csr & 0x00000002u;
}
static inline void sha256_wait_valid_blocking(void) {
    while (!sha256_is_sum_valid()) {
        tight_loop_contents();
    }
}
static inline void sha256_wait_ready_blocking(void) {
    while (!sha256_is_ready()) {
        tight_loop_contents();
    }
}
void sha256_get_result(sha256_result_t *out, enum sha256_endianness endianness);
static inline _Bool sha256_err_not_ready(void) {
    return ((sha256_hw_t *)0x400f8000u)->csr & 0x00000010u;
}
static inline void sha256_err_not_ready_clear(void) {
    hw_clear_bits(&((sha256_hw_t *)0x400f8000u)->csr, 0x00000010u);
}
static inline volatile void *sha256_get_write_addr(void) {
    return &((sha256_hw_t *)0x400f8000u)->wdata;
}
static inline void sha256_put_word(uint32_t word) {
    ((sha256_hw_t *)0x400f8000u)->wdata = word;
}
static inline void sha256_put_byte(uint8_t b) {
    *((io_rw_8*)&((sha256_hw_t *)0x400f8000u)->wdata) = b;
}
#define _HARDWARE_SPI_H 
#define _HARDWARE_STRUCTS_SPI_H 
#define _HARDWARE_REGS_SPI_H 
#define SPI_SSPCR0_OFFSET 0x00000000u
#define SPI_SSPCR0_BITS 0x0000ffffu
#define SPI_SSPCR0_RESET 0x00000000u
#define SPI_SSPCR0_SCR_RESET 0x00u
#define SPI_SSPCR0_SCR_BITS 0x0000ff00u
#define SPI_SSPCR0_SCR_MSB 15u
#define SPI_SSPCR0_SCR_LSB 8u
#define SPI_SSPCR0_SCR_ACCESS "RW"
#define SPI_SSPCR0_SPH_RESET 0x0u
#define SPI_SSPCR0_SPH_BITS 0x00000080u
#define SPI_SSPCR0_SPH_MSB 7u
#define SPI_SSPCR0_SPH_LSB 7u
#define SPI_SSPCR0_SPH_ACCESS "RW"
#define SPI_SSPCR0_SPO_RESET 0x0u
#define SPI_SSPCR0_SPO_BITS 0x00000040u
#define SPI_SSPCR0_SPO_MSB 6u
#define SPI_SSPCR0_SPO_LSB 6u
#define SPI_SSPCR0_SPO_ACCESS "RW"
#define SPI_SSPCR0_FRF_RESET 0x0u
#define SPI_SSPCR0_FRF_BITS 0x00000030u
#define SPI_SSPCR0_FRF_MSB 5u
#define SPI_SSPCR0_FRF_LSB 4u
#define SPI_SSPCR0_FRF_ACCESS "RW"
#define SPI_SSPCR0_DSS_RESET 0x0u
#define SPI_SSPCR0_DSS_BITS 0x0000000fu
#define SPI_SSPCR0_DSS_MSB 3u
#define SPI_SSPCR0_DSS_LSB 0u
#define SPI_SSPCR0_DSS_ACCESS "RW"
#define SPI_SSPCR1_OFFSET 0x00000004u
#define SPI_SSPCR1_BITS 0x0000000fu
#define SPI_SSPCR1_RESET 0x00000000u
#define SPI_SSPCR1_SOD_RESET 0x0u
#define SPI_SSPCR1_SOD_BITS 0x00000008u
#define SPI_SSPCR1_SOD_MSB 3u
#define SPI_SSPCR1_SOD_LSB 3u
#define SPI_SSPCR1_SOD_ACCESS "RW"
#define SPI_SSPCR1_MS_RESET 0x0u
#define SPI_SSPCR1_MS_BITS 0x00000004u
#define SPI_SSPCR1_MS_MSB 2u
#define SPI_SSPCR1_MS_LSB 2u
#define SPI_SSPCR1_MS_ACCESS "RW"
#define SPI_SSPCR1_SSE_RESET 0x0u
#define SPI_SSPCR1_SSE_BITS 0x00000002u
#define SPI_SSPCR1_SSE_MSB 1u
#define SPI_SSPCR1_SSE_LSB 1u
#define SPI_SSPCR1_SSE_ACCESS "RW"
#define SPI_SSPCR1_LBM_RESET 0x0u
#define SPI_SSPCR1_LBM_BITS 0x00000001u
#define SPI_SSPCR1_LBM_MSB 0u
#define SPI_SSPCR1_LBM_LSB 0u
#define SPI_SSPCR1_LBM_ACCESS "RW"
#define SPI_SSPDR_OFFSET 0x00000008u
#define SPI_SSPDR_BITS 0x0000ffffu
#define SPI_SSPDR_RESET "-"
#define SPI_SSPDR_DATA_RESET "-"
#define SPI_SSPDR_DATA_BITS 0x0000ffffu
#define SPI_SSPDR_DATA_MSB 15u
#define SPI_SSPDR_DATA_LSB 0u
#define SPI_SSPDR_DATA_ACCESS "RWF"
#define SPI_SSPSR_OFFSET 0x0000000cu
#define SPI_SSPSR_BITS 0x0000001fu
#define SPI_SSPSR_RESET 0x00000003u
#define SPI_SSPSR_BSY_RESET 0x0u
#define SPI_SSPSR_BSY_BITS 0x00000010u
#define SPI_SSPSR_BSY_MSB 4u
#define SPI_SSPSR_BSY_LSB 4u
#define SPI_SSPSR_BSY_ACCESS "RO"
#define SPI_SSPSR_RFF_RESET 0x0u
#define SPI_SSPSR_RFF_BITS 0x00000008u
#define SPI_SSPSR_RFF_MSB 3u
#define SPI_SSPSR_RFF_LSB 3u
#define SPI_SSPSR_RFF_ACCESS "RO"
#define SPI_SSPSR_RNE_RESET 0x0u
#define SPI_SSPSR_RNE_BITS 0x00000004u
#define SPI_SSPSR_RNE_MSB 2u
#define SPI_SSPSR_RNE_LSB 2u
#define SPI_SSPSR_RNE_ACCESS "RO"
#define SPI_SSPSR_TNF_RESET 0x1u
#define SPI_SSPSR_TNF_BITS 0x00000002u
#define SPI_SSPSR_TNF_MSB 1u
#define SPI_SSPSR_TNF_LSB 1u
#define SPI_SSPSR_TNF_ACCESS "RO"
#define SPI_SSPSR_TFE_RESET 0x1u
#define SPI_SSPSR_TFE_BITS 0x00000001u
#define SPI_SSPSR_TFE_MSB 0u
#define SPI_SSPSR_TFE_LSB 0u
#define SPI_SSPSR_TFE_ACCESS "RO"
#define SPI_SSPCPSR_OFFSET 0x00000010u
#define SPI_SSPCPSR_BITS 0x000000ffu
#define SPI_SSPCPSR_RESET 0x00000000u
#define SPI_SSPCPSR_CPSDVSR_RESET 0x00u
#define SPI_SSPCPSR_CPSDVSR_BITS 0x000000ffu
#define SPI_SSPCPSR_CPSDVSR_MSB 7u
#define SPI_SSPCPSR_CPSDVSR_LSB 0u
#define SPI_SSPCPSR_CPSDVSR_ACCESS "RW"
#define SPI_SSPIMSC_OFFSET 0x00000014u
#define SPI_SSPIMSC_BITS 0x0000000fu
#define SPI_SSPIMSC_RESET 0x00000000u
#define SPI_SSPIMSC_TXIM_RESET 0x0u
#define SPI_SSPIMSC_TXIM_BITS 0x00000008u
#define SPI_SSPIMSC_TXIM_MSB 3u
#define SPI_SSPIMSC_TXIM_LSB 3u
#define SPI_SSPIMSC_TXIM_ACCESS "RW"
#define SPI_SSPIMSC_RXIM_RESET 0x0u
#define SPI_SSPIMSC_RXIM_BITS 0x00000004u
#define SPI_SSPIMSC_RXIM_MSB 2u
#define SPI_SSPIMSC_RXIM_LSB 2u
#define SPI_SSPIMSC_RXIM_ACCESS "RW"
#define SPI_SSPIMSC_RTIM_RESET 0x0u
#define SPI_SSPIMSC_RTIM_BITS 0x00000002u
#define SPI_SSPIMSC_RTIM_MSB 1u
#define SPI_SSPIMSC_RTIM_LSB 1u
#define SPI_SSPIMSC_RTIM_ACCESS "RW"
#define SPI_SSPIMSC_RORIM_RESET 0x0u
#define SPI_SSPIMSC_RORIM_BITS 0x00000001u
#define SPI_SSPIMSC_RORIM_MSB 0u
#define SPI_SSPIMSC_RORIM_LSB 0u
#define SPI_SSPIMSC_RORIM_ACCESS "RW"
#define SPI_SSPRIS_OFFSET 0x00000018u
#define SPI_SSPRIS_BITS 0x0000000fu
#define SPI_SSPRIS_RESET 0x00000008u
#define SPI_SSPRIS_TXRIS_RESET 0x1u
#define SPI_SSPRIS_TXRIS_BITS 0x00000008u
#define SPI_SSPRIS_TXRIS_MSB 3u
#define SPI_SSPRIS_TXRIS_LSB 3u
#define SPI_SSPRIS_TXRIS_ACCESS "RO"
#define SPI_SSPRIS_RXRIS_RESET 0x0u
#define SPI_SSPRIS_RXRIS_BITS 0x00000004u
#define SPI_SSPRIS_RXRIS_MSB 2u
#define SPI_SSPRIS_RXRIS_LSB 2u
#define SPI_SSPRIS_RXRIS_ACCESS "RO"
#define SPI_SSPRIS_RTRIS_RESET 0x0u
#define SPI_SSPRIS_RTRIS_BITS 0x00000002u
#define SPI_SSPRIS_RTRIS_MSB 1u
#define SPI_SSPRIS_RTRIS_LSB 1u
#define SPI_SSPRIS_RTRIS_ACCESS "RO"
#define SPI_SSPRIS_RORRIS_RESET 0x0u
#define SPI_SSPRIS_RORRIS_BITS 0x00000001u
#define SPI_SSPRIS_RORRIS_MSB 0u
#define SPI_SSPRIS_RORRIS_LSB 0u
#define SPI_SSPRIS_RORRIS_ACCESS "RO"
#define SPI_SSPMIS_OFFSET 0x0000001cu
#define SPI_SSPMIS_BITS 0x0000000fu
#define SPI_SSPMIS_RESET 0x00000000u
#define SPI_SSPMIS_TXMIS_RESET 0x0u
#define SPI_SSPMIS_TXMIS_BITS 0x00000008u
#define SPI_SSPMIS_TXMIS_MSB 3u
#define SPI_SSPMIS_TXMIS_LSB 3u
#define SPI_SSPMIS_TXMIS_ACCESS "RO"
#define SPI_SSPMIS_RXMIS_RESET 0x0u
#define SPI_SSPMIS_RXMIS_BITS 0x00000004u
#define SPI_SSPMIS_RXMIS_MSB 2u
#define SPI_SSPMIS_RXMIS_LSB 2u
#define SPI_SSPMIS_RXMIS_ACCESS "RO"
#define SPI_SSPMIS_RTMIS_RESET 0x0u
#define SPI_SSPMIS_RTMIS_BITS 0x00000002u
#define SPI_SSPMIS_RTMIS_MSB 1u
#define SPI_SSPMIS_RTMIS_LSB 1u
#define SPI_SSPMIS_RTMIS_ACCESS "RO"
#define SPI_SSPMIS_RORMIS_RESET 0x0u
#define SPI_SSPMIS_RORMIS_BITS 0x00000001u
#define SPI_SSPMIS_RORMIS_MSB 0u
#define SPI_SSPMIS_RORMIS_LSB 0u
#define SPI_SSPMIS_RORMIS_ACCESS "RO"
#define SPI_SSPICR_OFFSET 0x00000020u
#define SPI_SSPICR_BITS 0x00000003u
#define SPI_SSPICR_RESET 0x00000000u
#define SPI_SSPICR_RTIC_RESET 0x0u
#define SPI_SSPICR_RTIC_BITS 0x00000002u
#define SPI_SSPICR_RTIC_MSB 1u
#define SPI_SSPICR_RTIC_LSB 1u
#define SPI_SSPICR_RTIC_ACCESS "WC"
#define SPI_SSPICR_RORIC_RESET 0x0u
#define SPI_SSPICR_RORIC_BITS 0x00000001u
#define SPI_SSPICR_RORIC_MSB 0u
#define SPI_SSPICR_RORIC_LSB 0u
#define SPI_SSPICR_RORIC_ACCESS "WC"
#define SPI_SSPDMACR_OFFSET 0x00000024u
#define SPI_SSPDMACR_BITS 0x00000003u
#define SPI_SSPDMACR_RESET 0x00000000u
#define SPI_SSPDMACR_TXDMAE_RESET 0x0u
#define SPI_SSPDMACR_TXDMAE_BITS 0x00000002u
#define SPI_SSPDMACR_TXDMAE_MSB 1u
#define SPI_SSPDMACR_TXDMAE_LSB 1u
#define SPI_SSPDMACR_TXDMAE_ACCESS "RW"
#define SPI_SSPDMACR_RXDMAE_RESET 0x0u
#define SPI_SSPDMACR_RXDMAE_BITS 0x00000001u
#define SPI_SSPDMACR_RXDMAE_MSB 0u
#define SPI_SSPDMACR_RXDMAE_LSB 0u
#define SPI_SSPDMACR_RXDMAE_ACCESS "RW"
#define SPI_SSPPERIPHID0_OFFSET 0x00000fe0u
#define SPI_SSPPERIPHID0_BITS 0x000000ffu
#define SPI_SSPPERIPHID0_RESET 0x00000022u
#define SPI_SSPPERIPHID0_PARTNUMBER0_RESET 0x22u
#define SPI_SSPPERIPHID0_PARTNUMBER0_BITS 0x000000ffu
#define SPI_SSPPERIPHID0_PARTNUMBER0_MSB 7u
#define SPI_SSPPERIPHID0_PARTNUMBER0_LSB 0u
#define SPI_SSPPERIPHID0_PARTNUMBER0_ACCESS "RO"
#define SPI_SSPPERIPHID1_OFFSET 0x00000fe4u
#define SPI_SSPPERIPHID1_BITS 0x000000ffu
#define SPI_SSPPERIPHID1_RESET 0x00000010u
#define SPI_SSPPERIPHID1_DESIGNER0_RESET 0x1u
#define SPI_SSPPERIPHID1_DESIGNER0_BITS 0x000000f0u
#define SPI_SSPPERIPHID1_DESIGNER0_MSB 7u
#define SPI_SSPPERIPHID1_DESIGNER0_LSB 4u
#define SPI_SSPPERIPHID1_DESIGNER0_ACCESS "RO"
#define SPI_SSPPERIPHID1_PARTNUMBER1_RESET 0x0u
#define SPI_SSPPERIPHID1_PARTNUMBER1_BITS 0x0000000fu
#define SPI_SSPPERIPHID1_PARTNUMBER1_MSB 3u
#define SPI_SSPPERIPHID1_PARTNUMBER1_LSB 0u
#define SPI_SSPPERIPHID1_PARTNUMBER1_ACCESS "RO"
#define SPI_SSPPERIPHID2_OFFSET 0x00000fe8u
#define SPI_SSPPERIPHID2_BITS 0x000000ffu
#define SPI_SSPPERIPHID2_RESET 0x00000034u
#define SPI_SSPPERIPHID2_REVISION_RESET 0x3u
#define SPI_SSPPERIPHID2_REVISION_BITS 0x000000f0u
#define SPI_SSPPERIPHID2_REVISION_MSB 7u
#define SPI_SSPPERIPHID2_REVISION_LSB 4u
#define SPI_SSPPERIPHID2_REVISION_ACCESS "RO"
#define SPI_SSPPERIPHID2_DESIGNER1_RESET 0x4u
#define SPI_SSPPERIPHID2_DESIGNER1_BITS 0x0000000fu
#define SPI_SSPPERIPHID2_DESIGNER1_MSB 3u
#define SPI_SSPPERIPHID2_DESIGNER1_LSB 0u
#define SPI_SSPPERIPHID2_DESIGNER1_ACCESS "RO"
#define SPI_SSPPERIPHID3_OFFSET 0x00000fecu
#define SPI_SSPPERIPHID3_BITS 0x000000ffu
#define SPI_SSPPERIPHID3_RESET 0x00000000u
#define SPI_SSPPERIPHID3_CONFIGURATION_RESET 0x00u
#define SPI_SSPPERIPHID3_CONFIGURATION_BITS 0x000000ffu
#define SPI_SSPPERIPHID3_CONFIGURATION_MSB 7u
#define SPI_SSPPERIPHID3_CONFIGURATION_LSB 0u
#define SPI_SSPPERIPHID3_CONFIGURATION_ACCESS "RO"
#define SPI_SSPPCELLID0_OFFSET 0x00000ff0u
#define SPI_SSPPCELLID0_BITS 0x000000ffu
#define SPI_SSPPCELLID0_RESET 0x0000000du
#define SPI_SSPPCELLID0_SSPPCELLID0_RESET 0x0du
#define SPI_SSPPCELLID0_SSPPCELLID0_BITS 0x000000ffu
#define SPI_SSPPCELLID0_SSPPCELLID0_MSB 7u
#define SPI_SSPPCELLID0_SSPPCELLID0_LSB 0u
#define SPI_SSPPCELLID0_SSPPCELLID0_ACCESS "RO"
#define SPI_SSPPCELLID1_OFFSET 0x00000ff4u
#define SPI_SSPPCELLID1_BITS 0x000000ffu
#define SPI_SSPPCELLID1_RESET 0x000000f0u
#define SPI_SSPPCELLID1_SSPPCELLID1_RESET 0xf0u
#define SPI_SSPPCELLID1_SSPPCELLID1_BITS 0x000000ffu
#define SPI_SSPPCELLID1_SSPPCELLID1_MSB 7u
#define SPI_SSPPCELLID1_SSPPCELLID1_LSB 0u
#define SPI_SSPPCELLID1_SSPPCELLID1_ACCESS "RO"
#define SPI_SSPPCELLID2_OFFSET 0x00000ff8u
#define SPI_SSPPCELLID2_BITS 0x000000ffu
#define SPI_SSPPCELLID2_RESET 0x00000005u
#define SPI_SSPPCELLID2_SSPPCELLID2_RESET 0x05u
#define SPI_SSPPCELLID2_SSPPCELLID2_BITS 0x000000ffu
#define SPI_SSPPCELLID2_SSPPCELLID2_MSB 7u
#define SPI_SSPPCELLID2_SSPPCELLID2_LSB 0u
#define SPI_SSPPCELLID2_SSPPCELLID2_ACCESS "RO"
#define SPI_SSPPCELLID3_OFFSET 0x00000ffcu
#define SPI_SSPPCELLID3_BITS 0x000000ffu
#define SPI_SSPPCELLID3_RESET 0x000000b1u
#define SPI_SSPPCELLID3_SSPPCELLID3_RESET 0xb1u
#define SPI_SSPPCELLID3_SSPPCELLID3_BITS 0x000000ffu
#define SPI_SSPPCELLID3_SSPPCELLID3_MSB 7u
#define SPI_SSPPCELLID3_SSPPCELLID3_LSB 0u
#define SPI_SSPPCELLID3_SSPPCELLID3_ACCESS "RO"
typedef struct {
   
    io_rw_32 cr0;
   
