gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 cr1;
   
    io_rw_32 dr;
   
    io_ro_32 sr;
   
    io_rw_32 cpsr;
   
    io_rw_32 imsc;
   
    io_ro_32 ris;
   
    io_ro_32 mis;
   
    io_rw_32 icr;
   
    io_rw_32 dmacr;
} spi_hw_t;
static spi_hw_t * const spi0_hw = (spi_hw_t *)SPI0_BASE; // ORIGINAL: #define spi0_hw ((spi_hw_t *)SPI0_BASE)
static spi_hw_t * const spi1_hw = (spi_hw_t *)SPI1_BASE; // ORIGINAL: #define spi1_hw ((spi_hw_t *)SPI1_BASE)
_Static_assert(sizeof (spi_hw_t) == 0x0028, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_SPI 0
typedef struct spi_inst spi_inst_t;
static spi_inst_t * const spi0 = (spi_inst_t *)spi0_hw; // ORIGINAL: #define spi0 ((spi_inst_t *)spi0_hw)
static spi_inst_t * const spi1 = (spi_inst_t *)spi1_hw; // ORIGINAL: #define spi1 ((spi_inst_t *)spi1_hw)
#define PICO_DEFAULT_SPI_INSTANCE() (__CONCAT(spi,PICO_DEFAULT_SPI))
#define spi_default PICO_DEFAULT_SPI_INSTANCE()
_Static_assert(2u == 2, "");
#define SPI_NUM(spi) ((spi) == spi1)
_Static_assert(2u == 2, "");
#define SPI_INSTANCE(num) ((num) ? spi1 : spi0)
_Static_assert(DREQ_SPI0_RX == DREQ_SPI0_TX + 1, "");
_Static_assert(DREQ_SPI1_RX == DREQ_SPI1_TX + 1, "");
_Static_assert(DREQ_SPI1_TX == DREQ_SPI0_TX + 2, "");
#define SPI_DREQ_NUM(spi,is_tx) (DREQ_SPI0_TX + SPI_NUM(spi) * 2 + !(is_tx))
typedef enum {
    SPI_CPHA_0 = 0,
    SPI_CPHA_1 = 1
} spi_cpha_t;
typedef enum {
    SPI_CPOL_0 = 0,
    SPI_CPOL_1 = 1
} spi_cpol_t;
typedef enum {
    SPI_LSB_FIRST = 0,
    SPI_MSB_FIRST = 1
} spi_order_t;
uint spi_init(spi_inst_t *spi, uint baudrate);
void spi_deinit(spi_inst_t *spi);
uint spi_set_baudrate(spi_inst_t *spi, uint baudrate);
uint spi_get_baudrate(const spi_inst_t *spi);
static inline uint spi_get_index(const spi_inst_t *spi) {
    ({if (((0 || 0) && !0)) ((!(spi != ((spi_inst_t *)((spi_hw_t *)0x40080000u)) && spi != ((spi_inst_t *)((spi_hw_t *)0x40088000u)))) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_spi/include/hardware/spi.h", 219, __func__, "!(spi != ((spi_inst_t *)((spi_hw_t *)0x40080000u)) && spi != ((spi_inst_t *)((spi_hw_t *)0x40088000u)))"));});
    return ((spi) == ((spi_inst_t *)((spi_hw_t *)0x40088000u)));
}
static inline spi_hw_t *spi_get_hw(spi_inst_t *spi) {
    spi_get_index(spi);
    return (spi_hw_t *)spi;
}
static inline const spi_hw_t *spi_get_const_hw(const spi_inst_t *spi) {
    spi_get_index(spi);
    return (const spi_hw_t *)spi;
}
static inline void spi_set_format(spi_inst_t *spi, uint data_bits, spi_cpol_t cpol, spi_cpha_t cpha, __attribute__((__unused__)) spi_order_t order) {
    ({if (((0 || 0) && !0)) ((!(data_bits < 4 || data_bits > 16)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_spi/include/hardware/spi.h", 245, __func__, "!(data_bits < 4 || data_bits > 16)"));});
    ({if (((0 || 0) && !0)) ((!(order != SPI_MSB_FIRST)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_spi/include/hardware/spi.h", 247, __func__, "!(order != SPI_MSB_FIRST)"));});
    ({if (((0 || 0) && !0)) ((!(cpol != SPI_CPOL_0 && cpol != SPI_CPOL_1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_spi/include/hardware/spi.h", 248, __func__, "!(cpol != SPI_CPOL_0 && cpol != SPI_CPOL_1)"));});
    ({if (((0 || 0) && !0)) ((!(cpha != SPI_CPHA_0 && cpha != SPI_CPHA_1)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/hardware_spi/include/hardware/spi.h", 249, __func__, "!(cpha != SPI_CPHA_0 && cpha != SPI_CPHA_1)"));});
    uint32_t enable_mask = spi_get_hw(spi)->cr1 & 0x00000002u;
    hw_clear_bits(&spi_get_hw(spi)->cr1, 0x00000002u);
    hw_write_masked(&spi_get_hw(spi)->cr0,
                    ((uint)(data_bits - 1)) << 0u |
                    ((uint)cpol) << 6u |
                    ((uint)cpha) << 7u,
        0x0000000fu |
        0x00000040u |
        0x00000080u);
    hw_set_bits(&spi_get_hw(spi)->cr1, enable_mask);
}
static inline void spi_set_slave(spi_inst_t *spi, _Bool slave) {
    uint32_t enable_mask = spi_get_hw(spi)->cr1 & 0x00000002u;
    hw_clear_bits(&spi_get_hw(spi)->cr1, 0x00000002u);
    if (slave)
        hw_set_bits(&spi_get_hw(spi)->cr1, 0x00000004u);
    else
        hw_clear_bits(&spi_get_hw(spi)->cr1, 0x00000004u);
    hw_set_bits(&spi_get_hw(spi)->cr1, enable_mask);
}
static inline _Bool spi_is_writable(const spi_inst_t *spi) {
    return (spi_get_const_hw(spi)->sr & 0x00000002u);
}
static inline _Bool spi_is_readable(const spi_inst_t *spi) {
    return (spi_get_const_hw(spi)->sr & 0x00000004u);
}
static inline _Bool spi_is_busy(const spi_inst_t *spi) {
    return (spi_get_const_hw(spi)->sr & 0x00000010u);
}
int spi_write_read_blocking(spi_inst_t *spi, const uint8_t *src, uint8_t *dst, size_t len);
int spi_write_blocking(spi_inst_t *spi, const uint8_t *src, size_t len);
int spi_read_blocking(spi_inst_t *spi, uint8_t repeated_tx_data, uint8_t *dst, size_t len);
int spi_write16_read16_blocking(spi_inst_t *spi, const uint16_t *src, uint16_t *dst, size_t len);
int spi_write16_blocking(spi_inst_t *spi, const uint16_t *src, size_t len);
int spi_read16_blocking(spi_inst_t *spi, uint16_t repeated_tx_data, uint16_t *dst, size_t len);
static inline uint spi_get_dreq(spi_inst_t *spi, _Bool is_tx) {
    return (DREQ_SPI0_TX + ((spi) == ((spi_inst_t *)((spi_hw_t *)0x40088000u))) * 2 + !(is_tx));
}
#define _HARDWARE_TICKS_H 
#define _HARDWARE_STRUCTS_TICKS_H 
#define _HARDWARE_REGS_TICKS_H 
#define TICKS_PROC0_CTRL_OFFSET 0x00000000u
#define TICKS_PROC0_CTRL_BITS 0x00000003u
#define TICKS_PROC0_CTRL_RESET 0x00000000u
#define TICKS_PROC0_CTRL_RUNNING_RESET "-"
#define TICKS_PROC0_CTRL_RUNNING_BITS 0x00000002u
#define TICKS_PROC0_CTRL_RUNNING_MSB 1u
#define TICKS_PROC0_CTRL_RUNNING_LSB 1u
#define TICKS_PROC0_CTRL_RUNNING_ACCESS "RO"
#define TICKS_PROC0_CTRL_ENABLE_RESET 0x0u
#define TICKS_PROC0_CTRL_ENABLE_BITS 0x00000001u
#define TICKS_PROC0_CTRL_ENABLE_MSB 0u
#define TICKS_PROC0_CTRL_ENABLE_LSB 0u
#define TICKS_PROC0_CTRL_ENABLE_ACCESS "RW"
#define TICKS_PROC0_CYCLES_OFFSET 0x00000004u
#define TICKS_PROC0_CYCLES_BITS 0x000001ffu
#define TICKS_PROC0_CYCLES_RESET 0x00000000u
#define TICKS_PROC0_CYCLES_MSB 8u
#define TICKS_PROC0_CYCLES_LSB 0u
#define TICKS_PROC0_CYCLES_ACCESS "RW"
#define TICKS_PROC0_COUNT_OFFSET 0x00000008u
#define TICKS_PROC0_COUNT_BITS 0x000001ffu
#define TICKS_PROC0_COUNT_RESET "-"
#define TICKS_PROC0_COUNT_MSB 8u
#define TICKS_PROC0_COUNT_LSB 0u
#define TICKS_PROC0_COUNT_ACCESS "RO"
#define TICKS_PROC1_CTRL_OFFSET 0x0000000cu
#define TICKS_PROC1_CTRL_BITS 0x00000003u
#define TICKS_PROC1_CTRL_RESET 0x00000000u
#define TICKS_PROC1_CTRL_RUNNING_RESET "-"
#define TICKS_PROC1_CTRL_RUNNING_BITS 0x00000002u
#define TICKS_PROC1_CTRL_RUNNING_MSB 1u
#define TICKS_PROC1_CTRL_RUNNING_LSB 1u
#define TICKS_PROC1_CTRL_RUNNING_ACCESS "RO"
#define TICKS_PROC1_CTRL_ENABLE_RESET 0x0u
#define TICKS_PROC1_CTRL_ENABLE_BITS 0x00000001u
#define TICKS_PROC1_CTRL_ENABLE_MSB 0u
#define TICKS_PROC1_CTRL_ENABLE_LSB 0u
#define TICKS_PROC1_CTRL_ENABLE_ACCESS "RW"
#define TICKS_PROC1_CYCLES_OFFSET 0x00000010u
#define TICKS_PROC1_CYCLES_BITS 0x000001ffu
#define TICKS_PROC1_CYCLES_RESET 0x00000000u
#define TICKS_PROC1_CYCLES_MSB 8u
#define TICKS_PROC1_CYCLES_LSB 0u
#define TICKS_PROC1_CYCLES_ACCESS "RW"
#define TICKS_PROC1_COUNT_OFFSET 0x00000014u
#define TICKS_PROC1_COUNT_BITS 0x000001ffu
#define TICKS_PROC1_COUNT_RESET "-"
#define TICKS_PROC1_COUNT_MSB 8u
#define TICKS_PROC1_COUNT_LSB 0u
#define TICKS_PROC1_COUNT_ACCESS "RO"
#define TICKS_TIMER0_CTRL_OFFSET 0x00000018u
#define TICKS_TIMER0_CTRL_BITS 0x00000003u
#define TICKS_TIMER0_CTRL_RESET 0x00000000u
#define TICKS_TIMER0_CTRL_RUNNING_RESET "-"
#define TICKS_TIMER0_CTRL_RUNNING_BITS 0x00000002u
#define TICKS_TIMER0_CTRL_RUNNING_MSB 1u
#define TICKS_TIMER0_CTRL_RUNNING_LSB 1u
#define TICKS_TIMER0_CTRL_RUNNING_ACCESS "RO"
#define TICKS_TIMER0_CTRL_ENABLE_RESET 0x0u
#define TICKS_TIMER0_CTRL_ENABLE_BITS 0x00000001u
#define TICKS_TIMER0_CTRL_ENABLE_MSB 0u
#define TICKS_TIMER0_CTRL_ENABLE_LSB 0u
#define TICKS_TIMER0_CTRL_ENABLE_ACCESS "RW"
#define TICKS_TIMER0_CYCLES_OFFSET 0x0000001cu
#define TICKS_TIMER0_CYCLES_BITS 0x000001ffu
#define TICKS_TIMER0_CYCLES_RESET 0x00000000u
#define TICKS_TIMER0_CYCLES_MSB 8u
#define TICKS_TIMER0_CYCLES_LSB 0u
#define TICKS_TIMER0_CYCLES_ACCESS "RW"
#define TICKS_TIMER0_COUNT_OFFSET 0x00000020u
#define TICKS_TIMER0_COUNT_BITS 0x000001ffu
#define TICKS_TIMER0_COUNT_RESET "-"
#define TICKS_TIMER0_COUNT_MSB 8u
#define TICKS_TIMER0_COUNT_LSB 0u
#define TICKS_TIMER0_COUNT_ACCESS "RO"
#define TICKS_TIMER1_CTRL_OFFSET 0x00000024u
#define TICKS_TIMER1_CTRL_BITS 0x00000003u
#define TICKS_TIMER1_CTRL_RESET 0x00000000u
#define TICKS_TIMER1_CTRL_RUNNING_RESET "-"
#define TICKS_TIMER1_CTRL_RUNNING_BITS 0x00000002u
#define TICKS_TIMER1_CTRL_RUNNING_MSB 1u
#define TICKS_TIMER1_CTRL_RUNNING_LSB 1u
#define TICKS_TIMER1_CTRL_RUNNING_ACCESS "RO"
#define TICKS_TIMER1_CTRL_ENABLE_RESET 0x0u
#define TICKS_TIMER1_CTRL_ENABLE_BITS 0x00000001u
#define TICKS_TIMER1_CTRL_ENABLE_MSB 0u
#define TICKS_TIMER1_CTRL_ENABLE_LSB 0u
#define TICKS_TIMER1_CTRL_ENABLE_ACCESS "RW"
#define TICKS_TIMER1_CYCLES_OFFSET 0x00000028u
#define TICKS_TIMER1_CYCLES_BITS 0x000001ffu
#define TICKS_TIMER1_CYCLES_RESET 0x00000000u
#define TICKS_TIMER1_CYCLES_MSB 8u
#define TICKS_TIMER1_CYCLES_LSB 0u
#define TICKS_TIMER1_CYCLES_ACCESS "RW"
#define TICKS_TIMER1_COUNT_OFFSET 0x0000002cu
#define TICKS_TIMER1_COUNT_BITS 0x000001ffu
#define TICKS_TIMER1_COUNT_RESET "-"
#define TICKS_TIMER1_COUNT_MSB 8u
#define TICKS_TIMER1_COUNT_LSB 0u
#define TICKS_TIMER1_COUNT_ACCESS "RO"
#define TICKS_WATCHDOG_CTRL_OFFSET 0x00000030u
#define TICKS_WATCHDOG_CTRL_BITS 0x00000003u
#define TICKS_WATCHDOG_CTRL_RESET 0x00000000u
#define TICKS_WATCHDOG_CTRL_RUNNING_RESET "-"
#define TICKS_WATCHDOG_CTRL_RUNNING_BITS 0x00000002u
#define TICKS_WATCHDOG_CTRL_RUNNING_MSB 1u
#define TICKS_WATCHDOG_CTRL_RUNNING_LSB 1u
#define TICKS_WATCHDOG_CTRL_RUNNING_ACCESS "RO"
#define TICKS_WATCHDOG_CTRL_ENABLE_RESET 0x0u
#define TICKS_WATCHDOG_CTRL_ENABLE_BITS 0x00000001u
#define TICKS_WATCHDOG_CTRL_ENABLE_MSB 0u
#define TICKS_WATCHDOG_CTRL_ENABLE_LSB 0u
#define TICKS_WATCHDOG_CTRL_ENABLE_ACCESS "RW"
#define TICKS_WATCHDOG_CYCLES_OFFSET 0x00000034u
#define TICKS_WATCHDOG_CYCLES_BITS 0x000001ffu
#define TICKS_WATCHDOG_CYCLES_RESET 0x00000000u
#define TICKS_WATCHDOG_CYCLES_MSB 8u
#define TICKS_WATCHDOG_CYCLES_LSB 0u
#define TICKS_WATCHDOG_CYCLES_ACCESS "RW"
#define TICKS_WATCHDOG_COUNT_OFFSET 0x00000038u
#define TICKS_WATCHDOG_COUNT_BITS 0x000001ffu
#define TICKS_WATCHDOG_COUNT_RESET "-"
#define TICKS_WATCHDOG_COUNT_MSB 8u
#define TICKS_WATCHDOG_COUNT_LSB 0u
#define TICKS_WATCHDOG_COUNT_ACCESS "RO"
#define TICKS_RISCV_CTRL_OFFSET 0x0000003cu
#define TICKS_RISCV_CTRL_BITS 0x00000003u
#define TICKS_RISCV_CTRL_RESET 0x00000000u
#define TICKS_RISCV_CTRL_RUNNING_RESET "-"
#define TICKS_RISCV_CTRL_RUNNING_BITS 0x00000002u
#define TICKS_RISCV_CTRL_RUNNING_MSB 1u
#define TICKS_RISCV_CTRL_RUNNING_LSB 1u
#define TICKS_RISCV_CTRL_RUNNING_ACCESS "RO"
#define TICKS_RISCV_CTRL_ENABLE_RESET 0x0u
#define TICKS_RISCV_CTRL_ENABLE_BITS 0x00000001u
#define TICKS_RISCV_CTRL_ENABLE_MSB 0u
#define TICKS_RISCV_CTRL_ENABLE_LSB 0u
#define TICKS_RISCV_CTRL_ENABLE_ACCESS "RW"
#define TICKS_RISCV_CYCLES_OFFSET 0x00000040u
#define TICKS_RISCV_CYCLES_BITS 0x000001ffu
#define TICKS_RISCV_CYCLES_RESET 0x00000000u
#define TICKS_RISCV_CYCLES_MSB 8u
#define TICKS_RISCV_CYCLES_LSB 0u
#define TICKS_RISCV_CYCLES_ACCESS "RW"
#define TICKS_RISCV_COUNT_OFFSET 0x00000044u
#define TICKS_RISCV_COUNT_BITS 0x000001ffu
#define TICKS_RISCV_COUNT_RESET "-"
#define TICKS_RISCV_COUNT_MSB 8u
#define TICKS_RISCV_COUNT_LSB 0u
#define TICKS_RISCV_COUNT_ACCESS "RO"
typedef enum tick_gen_num_rp2350 {
    TICK_PROC0 = 0,
    TICK_PROC1 = 1,
    TICK_TIMER0 = 2,
    TICK_TIMER1 = 3,
    TICK_WATCHDOG = 4,
    TICK_RISCV = 5,
    TICK_COUNT
} tick_gen_num_t;
