gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef struct {
   
    io_rw_32 ctrl;
   
    io_rw_32 cycles;
   
    io_ro_32 count;
} ticks_slice_hw_t;
typedef struct {
    ticks_slice_hw_t ticks[6];
} ticks_hw_t;
static ticks_hw_t * const ticks_hw = (ticks_hw_t *)TICKS_BASE; // ORIGINAL: #define ticks_hw ((ticks_hw_t *)TICKS_BASE)
_Static_assert(sizeof (ticks_hw_t) == 0x0048, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_TICKS 0
void tick_start(tick_gen_num_t tick, uint cycles);
void tick_stop(tick_gen_num_t tick);
_Bool tick_is_running(tick_gen_num_t tick);
#define _HARDWARE_UART_H 
#define _HARDWARE_STRUCTS_UART_H 
#define _HARDWARE_REGS_UART_H 
#define UART_UARTDR_OFFSET 0x00000000u
#define UART_UARTDR_BITS 0x00000fffu
#define UART_UARTDR_RESET 0x00000000u
#define UART_UARTDR_OE_RESET "-"
#define UART_UARTDR_OE_BITS 0x00000800u
#define UART_UARTDR_OE_MSB 11u
#define UART_UARTDR_OE_LSB 11u
#define UART_UARTDR_OE_ACCESS "RO"
#define UART_UARTDR_BE_RESET "-"
#define UART_UARTDR_BE_BITS 0x00000400u
#define UART_UARTDR_BE_MSB 10u
#define UART_UARTDR_BE_LSB 10u
#define UART_UARTDR_BE_ACCESS "RO"
#define UART_UARTDR_PE_RESET "-"
#define UART_UARTDR_PE_BITS 0x00000200u
#define UART_UARTDR_PE_MSB 9u
#define UART_UARTDR_PE_LSB 9u
#define UART_UARTDR_PE_ACCESS "RO"
#define UART_UARTDR_FE_RESET "-"
#define UART_UARTDR_FE_BITS 0x00000100u
#define UART_UARTDR_FE_MSB 8u
#define UART_UARTDR_FE_LSB 8u
#define UART_UARTDR_FE_ACCESS "RO"
#define UART_UARTDR_DATA_RESET "-"
#define UART_UARTDR_DATA_BITS 0x000000ffu
#define UART_UARTDR_DATA_MSB 7u
#define UART_UARTDR_DATA_LSB 0u
#define UART_UARTDR_DATA_ACCESS "RWF"
#define UART_UARTRSR_OFFSET 0x00000004u
#define UART_UARTRSR_BITS 0x0000000fu
#define UART_UARTRSR_RESET 0x00000000u
#define UART_UARTRSR_OE_RESET 0x0u
#define UART_UARTRSR_OE_BITS 0x00000008u
#define UART_UARTRSR_OE_MSB 3u
#define UART_UARTRSR_OE_LSB 3u
#define UART_UARTRSR_OE_ACCESS "WC"
#define UART_UARTRSR_BE_RESET 0x0u
#define UART_UARTRSR_BE_BITS 0x00000004u
#define UART_UARTRSR_BE_MSB 2u
#define UART_UARTRSR_BE_LSB 2u
#define UART_UARTRSR_BE_ACCESS "WC"
#define UART_UARTRSR_PE_RESET 0x0u
#define UART_UARTRSR_PE_BITS 0x00000002u
#define UART_UARTRSR_PE_MSB 1u
#define UART_UARTRSR_PE_LSB 1u
#define UART_UARTRSR_PE_ACCESS "WC"
#define UART_UARTRSR_FE_RESET 0x0u
#define UART_UARTRSR_FE_BITS 0x00000001u
#define UART_UARTRSR_FE_MSB 0u
#define UART_UARTRSR_FE_LSB 0u
#define UART_UARTRSR_FE_ACCESS "WC"
#define UART_UARTFR_OFFSET 0x00000018u
#define UART_UARTFR_BITS 0x000001ffu
#define UART_UARTFR_RESET 0x00000090u
#define UART_UARTFR_RI_RESET "-"
#define UART_UARTFR_RI_BITS 0x00000100u
#define UART_UARTFR_RI_MSB 8u
#define UART_UARTFR_RI_LSB 8u
#define UART_UARTFR_RI_ACCESS "RO"
#define UART_UARTFR_TXFE_RESET 0x1u
#define UART_UARTFR_TXFE_BITS 0x00000080u
#define UART_UARTFR_TXFE_MSB 7u
#define UART_UARTFR_TXFE_LSB 7u
#define UART_UARTFR_TXFE_ACCESS "RO"
#define UART_UARTFR_RXFF_RESET 0x0u
#define UART_UARTFR_RXFF_BITS 0x00000040u
#define UART_UARTFR_RXFF_MSB 6u
#define UART_UARTFR_RXFF_LSB 6u
#define UART_UARTFR_RXFF_ACCESS "RO"
#define UART_UARTFR_TXFF_RESET 0x0u
#define UART_UARTFR_TXFF_BITS 0x00000020u
#define UART_UARTFR_TXFF_MSB 5u
#define UART_UARTFR_TXFF_LSB 5u
#define UART_UARTFR_TXFF_ACCESS "RO"
#define UART_UARTFR_RXFE_RESET 0x1u
#define UART_UARTFR_RXFE_BITS 0x00000010u
#define UART_UARTFR_RXFE_MSB 4u
#define UART_UARTFR_RXFE_LSB 4u
#define UART_UARTFR_RXFE_ACCESS "RO"
#define UART_UARTFR_BUSY_RESET 0x0u
#define UART_UARTFR_BUSY_BITS 0x00000008u
#define UART_UARTFR_BUSY_MSB 3u
#define UART_UARTFR_BUSY_LSB 3u
#define UART_UARTFR_BUSY_ACCESS "RO"
#define UART_UARTFR_DCD_RESET "-"
#define UART_UARTFR_DCD_BITS 0x00000004u
#define UART_UARTFR_DCD_MSB 2u
#define UART_UARTFR_DCD_LSB 2u
#define UART_UARTFR_DCD_ACCESS "RO"
#define UART_UARTFR_DSR_RESET "-"
#define UART_UARTFR_DSR_BITS 0x00000002u
#define UART_UARTFR_DSR_MSB 1u
#define UART_UARTFR_DSR_LSB 1u
#define UART_UARTFR_DSR_ACCESS "RO"
#define UART_UARTFR_CTS_RESET "-"
#define UART_UARTFR_CTS_BITS 0x00000001u
#define UART_UARTFR_CTS_MSB 0u
#define UART_UARTFR_CTS_LSB 0u
#define UART_UARTFR_CTS_ACCESS "RO"
#define UART_UARTILPR_OFFSET 0x00000020u
#define UART_UARTILPR_BITS 0x000000ffu
#define UART_UARTILPR_RESET 0x00000000u
#define UART_UARTILPR_ILPDVSR_RESET 0x00u
#define UART_UARTILPR_ILPDVSR_BITS 0x000000ffu
#define UART_UARTILPR_ILPDVSR_MSB 7u
#define UART_UARTILPR_ILPDVSR_LSB 0u
#define UART_UARTILPR_ILPDVSR_ACCESS "RW"
#define UART_UARTIBRD_OFFSET 0x00000024u
#define UART_UARTIBRD_BITS 0x0000ffffu
#define UART_UARTIBRD_RESET 0x00000000u
#define UART_UARTIBRD_BAUD_DIVINT_RESET 0x0000u
#define UART_UARTIBRD_BAUD_DIVINT_BITS 0x0000ffffu
#define UART_UARTIBRD_BAUD_DIVINT_MSB 15u
#define UART_UARTIBRD_BAUD_DIVINT_LSB 0u
#define UART_UARTIBRD_BAUD_DIVINT_ACCESS "RW"
#define UART_UARTFBRD_OFFSET 0x00000028u
#define UART_UARTFBRD_BITS 0x0000003fu
#define UART_UARTFBRD_RESET 0x00000000u
#define UART_UARTFBRD_BAUD_DIVFRAC_RESET 0x00u
#define UART_UARTFBRD_BAUD_DIVFRAC_BITS 0x0000003fu
#define UART_UARTFBRD_BAUD_DIVFRAC_MSB 5u
#define UART_UARTFBRD_BAUD_DIVFRAC_LSB 0u
#define UART_UARTFBRD_BAUD_DIVFRAC_ACCESS "RW"
#define UART_UARTLCR_H_OFFSET 0x0000002cu
#define UART_UARTLCR_H_BITS 0x000000ffu
#define UART_UARTLCR_H_RESET 0x00000000u
#define UART_UARTLCR_H_SPS_RESET 0x0u
#define UART_UARTLCR_H_SPS_BITS 0x00000080u
#define UART_UARTLCR_H_SPS_MSB 7u
#define UART_UARTLCR_H_SPS_LSB 7u
#define UART_UARTLCR_H_SPS_ACCESS "RW"
#define UART_UARTLCR_H_WLEN_RESET 0x0u
#define UART_UARTLCR_H_WLEN_BITS 0x00000060u
#define UART_UARTLCR_H_WLEN_MSB 6u
#define UART_UARTLCR_H_WLEN_LSB 5u
#define UART_UARTLCR_H_WLEN_ACCESS "RW"
#define UART_UARTLCR_H_FEN_RESET 0x0u
#define UART_UARTLCR_H_FEN_BITS 0x00000010u
#define UART_UARTLCR_H_FEN_MSB 4u
#define UART_UARTLCR_H_FEN_LSB 4u
#define UART_UARTLCR_H_FEN_ACCESS "RW"
#define UART_UARTLCR_H_STP2_RESET 0x0u
#define UART_UARTLCR_H_STP2_BITS 0x00000008u
#define UART_UARTLCR_H_STP2_MSB 3u
#define UART_UARTLCR_H_STP2_LSB 3u
#define UART_UARTLCR_H_STP2_ACCESS "RW"
#define UART_UARTLCR_H_EPS_RESET 0x0u
#define UART_UARTLCR_H_EPS_BITS 0x00000004u
#define UART_UARTLCR_H_EPS_MSB 2u
#define UART_UARTLCR_H_EPS_LSB 2u
#define UART_UARTLCR_H_EPS_ACCESS "RW"
#define UART_UARTLCR_H_PEN_RESET 0x0u
#define UART_UARTLCR_H_PEN_BITS 0x00000002u
#define UART_UARTLCR_H_PEN_MSB 1u
#define UART_UARTLCR_H_PEN_LSB 1u
#define UART_UARTLCR_H_PEN_ACCESS "RW"
#define UART_UARTLCR_H_BRK_RESET 0x0u
#define UART_UARTLCR_H_BRK_BITS 0x00000001u
#define UART_UARTLCR_H_BRK_MSB 0u
#define UART_UARTLCR_H_BRK_LSB 0u
#define UART_UARTLCR_H_BRK_ACCESS "RW"
#define UART_UARTCR_OFFSET 0x00000030u
#define UART_UARTCR_BITS 0x0000ff87u
#define UART_UARTCR_RESET 0x00000300u
#define UART_UARTCR_CTSEN_RESET 0x0u
#define UART_UARTCR_CTSEN_BITS 0x00008000u
#define UART_UARTCR_CTSEN_MSB 15u
#define UART_UARTCR_CTSEN_LSB 15u
#define UART_UARTCR_CTSEN_ACCESS "RW"
#define UART_UARTCR_RTSEN_RESET 0x0u
#define UART_UARTCR_RTSEN_BITS 0x00004000u
#define UART_UARTCR_RTSEN_MSB 14u
#define UART_UARTCR_RTSEN_LSB 14u
#define UART_UARTCR_RTSEN_ACCESS "RW"
#define UART_UARTCR_OUT2_RESET 0x0u
#define UART_UARTCR_OUT2_BITS 0x00002000u
#define UART_UARTCR_OUT2_MSB 13u
#define UART_UARTCR_OUT2_LSB 13u
#define UART_UARTCR_OUT2_ACCESS "RW"
#define UART_UARTCR_OUT1_RESET 0x0u
#define UART_UARTCR_OUT1_BITS 0x00001000u
#define UART_UARTCR_OUT1_MSB 12u
#define UART_UARTCR_OUT1_LSB 12u
#define UART_UARTCR_OUT1_ACCESS "RW"
#define UART_UARTCR_RTS_RESET 0x0u
#define UART_UARTCR_RTS_BITS 0x00000800u
#define UART_UARTCR_RTS_MSB 11u
#define UART_UARTCR_RTS_LSB 11u
#define UART_UARTCR_RTS_ACCESS "RW"
#define UART_UARTCR_DTR_RESET 0x0u
#define UART_UARTCR_DTR_BITS 0x00000400u
#define UART_UARTCR_DTR_MSB 10u
#define UART_UARTCR_DTR_LSB 10u
#define UART_UARTCR_DTR_ACCESS "RW"
#define UART_UARTCR_RXE_RESET 0x1u
#define UART_UARTCR_RXE_BITS 0x00000200u
#define UART_UARTCR_RXE_MSB 9u
#define UART_UARTCR_RXE_LSB 9u
#define UART_UARTCR_RXE_ACCESS "RW"
#define UART_UARTCR_TXE_RESET 0x1u
#define UART_UARTCR_TXE_BITS 0x00000100u
#define UART_UARTCR_TXE_MSB 8u
#define UART_UARTCR_TXE_LSB 8u
#define UART_UARTCR_TXE_ACCESS "RW"
#define UART_UARTCR_LBE_RESET 0x0u
#define UART_UARTCR_LBE_BITS 0x00000080u
#define UART_UARTCR_LBE_MSB 7u
#define UART_UARTCR_LBE_LSB 7u
#define UART_UARTCR_LBE_ACCESS "RW"
#define UART_UARTCR_SIRLP_RESET 0x0u
#define UART_UARTCR_SIRLP_BITS 0x00000004u
#define UART_UARTCR_SIRLP_MSB 2u
#define UART_UARTCR_SIRLP_LSB 2u
#define UART_UARTCR_SIRLP_ACCESS "RW"
#define UART_UARTCR_SIREN_RESET 0x0u
#define UART_UARTCR_SIREN_BITS 0x00000002u
#define UART_UARTCR_SIREN_MSB 1u
#define UART_UARTCR_SIREN_LSB 1u
#define UART_UARTCR_SIREN_ACCESS "RW"
#define UART_UARTCR_UARTEN_RESET 0x0u
#define UART_UARTCR_UARTEN_BITS 0x00000001u
#define UART_UARTCR_UARTEN_MSB 0u
#define UART_UARTCR_UARTEN_LSB 0u
#define UART_UARTCR_UARTEN_ACCESS "RW"
#define UART_UARTIFLS_OFFSET 0x00000034u
#define UART_UARTIFLS_BITS 0x0000003fu
#define UART_UARTIFLS_RESET 0x00000012u
#define UART_UARTIFLS_RXIFLSEL_RESET 0x2u
#define UART_UARTIFLS_RXIFLSEL_BITS 0x00000038u
#define UART_UARTIFLS_RXIFLSEL_MSB 5u
#define UART_UARTIFLS_RXIFLSEL_LSB 3u
#define UART_UARTIFLS_RXIFLSEL_ACCESS "RW"
#define UART_UARTIFLS_TXIFLSEL_RESET 0x2u
#define UART_UARTIFLS_TXIFLSEL_BITS 0x00000007u
#define UART_UARTIFLS_TXIFLSEL_MSB 2u
#define UART_UARTIFLS_TXIFLSEL_LSB 0u
#define UART_UARTIFLS_TXIFLSEL_ACCESS "RW"
#define UART_UARTIMSC_OFFSET 0x00000038u
#define UART_UARTIMSC_BITS 0x000007ffu
#define UART_UARTIMSC_RESET 0x00000000u
#define UART_UARTIMSC_OEIM_RESET 0x0u
#define UART_UARTIMSC_OEIM_BITS 0x00000400u
#define UART_UARTIMSC_OEIM_MSB 10u
#define UART_UARTIMSC_OEIM_LSB 10u
#define UART_UARTIMSC_OEIM_ACCESS "RW"
#define UART_UARTIMSC_BEIM_RESET 0x0u
#define UART_UARTIMSC_BEIM_BITS 0x00000200u
#define UART_UARTIMSC_BEIM_MSB 9u
#define UART_UARTIMSC_BEIM_LSB 9u
#define UART_UARTIMSC_BEIM_ACCESS "RW"
#define UART_UARTIMSC_PEIM_RESET 0x0u
#define UART_UARTIMSC_PEIM_BITS 0x00000100u
#define UART_UARTIMSC_PEIM_MSB 8u
#define UART_UARTIMSC_PEIM_LSB 8u
#define UART_UARTIMSC_PEIM_ACCESS "RW"
#define UART_UARTIMSC_FEIM_RESET 0x0u
#define UART_UARTIMSC_FEIM_BITS 0x00000080u
#define UART_UARTIMSC_FEIM_MSB 7u
#define UART_UARTIMSC_FEIM_LSB 7u
#define UART_UARTIMSC_FEIM_ACCESS "RW"
#define UART_UARTIMSC_RTIM_RESET 0x0u
#define UART_UARTIMSC_RTIM_BITS 0x00000040u
#define UART_UARTIMSC_RTIM_MSB 6u
#define UART_UARTIMSC_RTIM_LSB 6u
#define UART_UARTIMSC_RTIM_ACCESS "RW"
#define UART_UARTIMSC_TXIM_RESET 0x0u
#define UART_UARTIMSC_TXIM_BITS 0x00000020u
#define UART_UARTIMSC_TXIM_MSB 5u
#define UART_UARTIMSC_TXIM_LSB 5u
#define UART_UARTIMSC_TXIM_ACCESS "RW"
#define UART_UARTIMSC_RXIM_RESET 0x0u
#define UART_UARTIMSC_RXIM_BITS 0x00000010u
#define UART_UARTIMSC_RXIM_MSB 4u
#define UART_UARTIMSC_RXIM_LSB 4u
#define UART_UARTIMSC_RXIM_ACCESS "RW"
#define UART_UARTIMSC_DSRMIM_RESET 0x0u
#define UART_UARTIMSC_DSRMIM_BITS 0x00000008u
#define UART_UARTIMSC_DSRMIM_MSB 3u
#define UART_UARTIMSC_DSRMIM_LSB 3u
#define UART_UARTIMSC_DSRMIM_ACCESS "RW"
#define UART_UARTIMSC_DCDMIM_RESET 0x0u
#define UART_UARTIMSC_DCDMIM_BITS 0x00000004u
#define UART_UARTIMSC_DCDMIM_MSB 2u
#define UART_UARTIMSC_DCDMIM_LSB 2u
#define UART_UARTIMSC_DCDMIM_ACCESS "RW"
#define UART_UARTIMSC_CTSMIM_RESET 0x0u
#define UART_UARTIMSC_CTSMIM_BITS 0x00000002u
#define UART_UARTIMSC_CTSMIM_MSB 1u
#define UART_UARTIMSC_CTSMIM_LSB 1u
#define UART_UARTIMSC_CTSMIM_ACCESS "RW"
#define UART_UARTIMSC_RIMIM_RESET 0x0u
#define UART_UARTIMSC_RIMIM_BITS 0x00000001u
#define UART_UARTIMSC_RIMIM_MSB 0u
#define UART_UARTIMSC_RIMIM_LSB 0u
#define UART_UARTIMSC_RIMIM_ACCESS "RW"
#define UART_UARTRIS_OFFSET 0x0000003cu
#define UART_UARTRIS_BITS 0x000007ffu
#define UART_UARTRIS_RESET 0x00000000u
#define UART_UARTRIS_OERIS_RESET 0x0u
#define UART_UARTRIS_OERIS_BITS 0x00000400u
#define UART_UARTRIS_OERIS_MSB 10u
#define UART_UARTRIS_OERIS_LSB 10u
#define UART_UARTRIS_OERIS_ACCESS "RO"
#define UART_UARTRIS_BERIS_RESET 0x0u
#define UART_UARTRIS_BERIS_BITS 0x00000200u
#define UART_UARTRIS_BERIS_MSB 9u
#define UART_UARTRIS_BERIS_LSB 9u
#define UART_UARTRIS_BERIS_ACCESS "RO"
#define UART_UARTRIS_PERIS_RESET 0x0u
#define UART_UARTRIS_PERIS_BITS 0x00000100u
#define UART_UARTRIS_PERIS_MSB 8u
#define UART_UARTRIS_PERIS_LSB 8u
#define UART_UARTRIS_PERIS_ACCESS "RO"
#define UART_UARTRIS_FERIS_RESET 0x0u
#define UART_UARTRIS_FERIS_BITS 0x00000080u
#define UART_UARTRIS_FERIS_MSB 7u
#define UART_UARTRIS_FERIS_LSB 7u
#define UART_UARTRIS_FERIS_ACCESS "RO"
#define UART_UARTRIS_RTRIS_RESET 0x0u
#define UART_UARTRIS_RTRIS_BITS 0x00000040u
#define UART_UARTRIS_RTRIS_MSB 6u
#define UART_UARTRIS_RTRIS_LSB 6u
#define UART_UARTRIS_RTRIS_ACCESS "RO"
#define UART_UARTRIS_TXRIS_RESET 0x0u
#define UART_UARTRIS_TXRIS_BITS 0x00000020u
#define UART_UARTRIS_TXRIS_MSB 5u
#define UART_UARTRIS_TXRIS_LSB 5u
#define UART_UARTRIS_TXRIS_ACCESS "RO"
#define UART_UARTRIS_RXRIS_RESET 0x0u
#define UART_UARTRIS_RXRIS_BITS 0x00000010u
#define UART_UARTRIS_RXRIS_MSB 4u
#define UART_UARTRIS_RXRIS_LSB 4u
#define UART_UARTRIS_RXRIS_ACCESS "RO"
#define UART_UARTRIS_DSRRMIS_RESET "-"
#define UART_UARTRIS_DSRRMIS_BITS 0x00000008u
#define UART_UARTRIS_DSRRMIS_MSB 3u
#define UART_UARTRIS_DSRRMIS_LSB 3u
#define UART_UARTRIS_DSRRMIS_ACCESS "RO"
#define UART_UARTRIS_DCDRMIS_RESET "-"
#define UART_UARTRIS_DCDRMIS_BITS 0x00000004u
#define UART_UARTRIS_DCDRMIS_MSB 2u
#define UART_UARTRIS_DCDRMIS_LSB 2u
#define UART_UARTRIS_DCDRMIS_ACCESS "RO"
#define UART_UARTRIS_CTSRMIS_RESET "-"
#define UART_UARTRIS_CTSRMIS_BITS 0x00000002u
#define UART_UARTRIS_CTSRMIS_MSB 1u
#define UART_UARTRIS_CTSRMIS_LSB 1u
#define UART_UARTRIS_CTSRMIS_ACCESS "RO"
#define UART_UARTRIS_RIRMIS_RESET "-"
#define UART_UARTRIS_RIRMIS_BITS 0x00000001u
#define UART_UARTRIS_RIRMIS_MSB 0u
#define UART_UARTRIS_RIRMIS_LSB 0u
#define UART_UARTRIS_RIRMIS_ACCESS "RO"
#define UART_UARTMIS_OFFSET 0x00000040u
#define UART_UARTMIS_BITS 0x000007ffu
#define UART_UARTMIS_RESET 0x00000000u
#define UART_UARTMIS_OEMIS_RESET 0x0u
#define UART_UARTMIS_OEMIS_BITS 0x00000400u
#define UART_UARTMIS_OEMIS_MSB 10u
#define UART_UARTMIS_OEMIS_LSB 10u
#define UART_UARTMIS_OEMIS_ACCESS "RO"
#define UART_UARTMIS_BEMIS_RESET 0x0u
#define UART_UARTMIS_BEMIS_BITS 0x00000200u
#define UART_UARTMIS_BEMIS_MSB 9u
#define UART_UARTMIS_BEMIS_LSB 9u
#define UART_UARTMIS_BEMIS_ACCESS "RO"
#define UART_UARTMIS_PEMIS_RESET 0x0u
#define UART_UARTMIS_PEMIS_BITS 0x00000100u
#define UART_UARTMIS_PEMIS_MSB 8u
#define UART_UARTMIS_PEMIS_LSB 8u
#define UART_UARTMIS_PEMIS_ACCESS "RO"
#define UART_UARTMIS_FEMIS_RESET 0x0u
#define UART_UARTMIS_FEMIS_BITS 0x00000080u
#define UART_UARTMIS_FEMIS_MSB 7u
#define UART_UARTMIS_FEMIS_LSB 7u
#define UART_UARTMIS_FEMIS_ACCESS "RO"
#define UART_UARTMIS_RTMIS_RESET 0x0u
#define UART_UARTMIS_RTMIS_BITS 0x00000040u
#define UART_UARTMIS_RTMIS_MSB 6u
#define UART_UARTMIS_RTMIS_LSB 6u
#define UART_UARTMIS_RTMIS_ACCESS "RO"
#define UART_UARTMIS_TXMIS_RESET 0x0u
#define UART_UARTMIS_TXMIS_BITS 0x00000020u
#define UART_UARTMIS_TXMIS_MSB 5u
#define UART_UARTMIS_TXMIS_LSB 5u
#define UART_UARTMIS_TXMIS_ACCESS "RO"
#define UART_UARTMIS_RXMIS_RESET 0x0u
#define UART_UARTMIS_RXMIS_BITS 0x00000010u
#define UART_UARTMIS_RXMIS_MSB 4u
#define UART_UARTMIS_RXMIS_LSB 4u
#define UART_UARTMIS_RXMIS_ACCESS "RO"
#define UART_UARTMIS_DSRMMIS_RESET "-"
#define UART_UARTMIS_DSRMMIS_BITS 0x00000008u
#define UART_UARTMIS_DSRMMIS_MSB 3u
#define UART_UARTMIS_DSRMMIS_LSB 3u
#define UART_UARTMIS_DSRMMIS_ACCESS "RO"
#define UART_UARTMIS_DCDMMIS_RESET "-"
#define UART_UARTMIS_DCDMMIS_BITS 0x00000004u
#define UART_UARTMIS_DCDMMIS_MSB 2u
#define UART_UARTMIS_DCDMMIS_LSB 2u
#define UART_UARTMIS_DCDMMIS_ACCESS "RO"
#define UART_UARTMIS_CTSMMIS_RESET "-"
#define UART_UARTMIS_CTSMMIS_BITS 0x00000002u
#define UART_UARTMIS_CTSMMIS_MSB 1u
#define UART_UARTMIS_CTSMMIS_LSB 1u
#define UART_UARTMIS_CTSMMIS_ACCESS "RO"
#define UART_UARTMIS_RIMMIS_RESET "-"
#define UART_UARTMIS_RIMMIS_BITS 0x00000001u
#define UART_UARTMIS_RIMMIS_MSB 0u
#define UART_UARTMIS_RIMMIS_LSB 0u
#define UART_UARTMIS_RIMMIS_ACCESS "RO"
#define UART_UARTICR_OFFSET 0x00000044u
#define UART_UARTICR_BITS 0x000007ffu
#define UART_UARTICR_RESET 0x00000000u
#define UART_UARTICR_OEIC_RESET "-"
#define UART_UARTICR_OEIC_BITS 0x00000400u
#define UART_UARTICR_OEIC_MSB 10u
#define UART_UARTICR_OEIC_LSB 10u
#define UART_UARTICR_OEIC_ACCESS "WC"
#define UART_UARTICR_BEIC_RESET "-"
#define UART_UARTICR_BEIC_BITS 0x00000200u
#define UART_UARTICR_BEIC_MSB 9u
#define UART_UARTICR_BEIC_LSB 9u
#define UART_UARTICR_BEIC_ACCESS "WC"
#define UART_UARTICR_PEIC_RESET "-"
#define UART_UARTICR_PEIC_BITS 0x00000100u
#define UART_UARTICR_PEIC_MSB 8u
#define UART_UARTICR_PEIC_LSB 8u
#define UART_UARTICR_PEIC_ACCESS "WC"
#define UART_UARTICR_FEIC_RESET "-"
#define UART_UARTICR_FEIC_BITS 0x00000080u
#define UART_UARTICR_FEIC_MSB 7u
#define UART_UARTICR_FEIC_LSB 7u
#define UART_UARTICR_FEIC_ACCESS "WC"
#define UART_UARTICR_RTIC_RESET "-"
#define UART_UARTICR_RTIC_BITS 0x00000040u
#define UART_UARTICR_RTIC_MSB 6u
#define UART_UARTICR_RTIC_LSB 6u
#define UART_UARTICR_RTIC_ACCESS "WC"
#define UART_UARTICR_TXIC_RESET "-"
#define UART_UARTICR_TXIC_BITS 0x00000020u
#define UART_UARTICR_TXIC_MSB 5u
#define UART_UARTICR_TXIC_LSB 5u
#define UART_UARTICR_TXIC_ACCESS "WC"
#define UART_UARTICR_RXIC_RESET "-"
#define UART_UARTICR_RXIC_BITS 0x00000010u
#define UART_UARTICR_RXIC_MSB 4u
#define UART_UARTICR_RXIC_LSB 4u
#define UART_UARTICR_RXIC_ACCESS "WC"
#define UART_UARTICR_DSRMIC_RESET "-"
#define UART_UARTICR_DSRMIC_BITS 0x00000008u
#define UART_UARTICR_DSRMIC_MSB 3u
#define UART_UARTICR_DSRMIC_LSB 3u
#define UART_UARTICR_DSRMIC_ACCESS "WC"
#define UART_UARTICR_DCDMIC_RESET "-"
#define UART_UARTICR_DCDMIC_BITS 0x00000004u
#define UART_UARTICR_DCDMIC_MSB 2u
#define UART_UARTICR_DCDMIC_LSB 2u
#define UART_UARTICR_DCDMIC_ACCESS "WC"
#define UART_UARTICR_CTSMIC_RESET "-"
#define UART_UARTICR_CTSMIC_BITS 0x00000002u
#define UART_UARTICR_CTSMIC_MSB 1u
#define UART_UARTICR_CTSMIC_LSB 1u
#define UART_UARTICR_CTSMIC_ACCESS "WC"
#define UART_UARTICR_RIMIC_RESET "-"
#define UART_UARTICR_RIMIC_BITS 0x00000001u
#define UART_UARTICR_RIMIC_MSB 0u
#define UART_UARTICR_RIMIC_LSB 0u
#define UART_UARTICR_RIMIC_ACCESS "WC"
#define UART_UARTDMACR_OFFSET 0x00000048u
#define UART_UARTDMACR_BITS 0x00000007u
#define UART_UARTDMACR_RESET 0x00000000u
#define UART_UARTDMACR_DMAONERR_RESET 0x0u
#define UART_UARTDMACR_DMAONERR_BITS 0x00000004u
#define UART_UARTDMACR_DMAONERR_MSB 2u
#define UART_UARTDMACR_DMAONERR_LSB 2u
#define UART_UARTDMACR_DMAONERR_ACCESS "RW"
#define UART_UARTDMACR_TXDMAE_RESET 0x0u
#define UART_UARTDMACR_TXDMAE_BITS 0x00000002u
#define UART_UARTDMACR_TXDMAE_MSB 1u
#define UART_UARTDMACR_TXDMAE_LSB 1u
#define UART_UARTDMACR_TXDMAE_ACCESS "RW"
#define UART_UARTDMACR_RXDMAE_RESET 0x0u
#define UART_UARTDMACR_RXDMAE_BITS 0x00000001u
#define UART_UARTDMACR_RXDMAE_MSB 0u
#define UART_UARTDMACR_RXDMAE_LSB 0u
#define UART_UARTDMACR_RXDMAE_ACCESS "RW"
#define UART_UARTPERIPHID0_OFFSET 0x00000fe0u
#define UART_UARTPERIPHID0_BITS 0x000000ffu
#define UART_UARTPERIPHID0_RESET 0x00000011u
#define UART_UARTPERIPHID0_PARTNUMBER0_RESET 0x11u
#define UART_UARTPERIPHID0_PARTNUMBER0_BITS 0x000000ffu
#define UART_UARTPERIPHID0_PARTNUMBER0_MSB 7u
#define UART_UARTPERIPHID0_PARTNUMBER0_LSB 0u
#define UART_UARTPERIPHID0_PARTNUMBER0_ACCESS "RO"
#define UART_UARTPERIPHID1_OFFSET 0x00000fe4u
#define UART_UARTPERIPHID1_BITS 0x000000ffu
#define UART_UARTPERIPHID1_RESET 0x00000010u
#define UART_UARTPERIPHID1_DESIGNER0_RESET 0x1u
#define UART_UARTPERIPHID1_DESIGNER0_BITS 0x000000f0u
#define UART_UARTPERIPHID1_DESIGNER0_MSB 7u
#define UART_UARTPERIPHID1_DESIGNER0_LSB 4u
#define UART_UARTPERIPHID1_DESIGNER0_ACCESS "RO"
#define UART_UARTPERIPHID1_PARTNUMBER1_RESET 0x0u
#define UART_UARTPERIPHID1_PARTNUMBER1_BITS 0x0000000fu
#define UART_UARTPERIPHID1_PARTNUMBER1_MSB 3u
#define UART_UARTPERIPHID1_PARTNUMBER1_LSB 0u
#define UART_UARTPERIPHID1_PARTNUMBER1_ACCESS "RO"
#define UART_UARTPERIPHID2_OFFSET 0x00000fe8u
#define UART_UARTPERIPHID2_BITS 0x000000ffu
#define UART_UARTPERIPHID2_RESET 0x00000034u
#define UART_UARTPERIPHID2_REVISION_RESET 0x3u
#define UART_UARTPERIPHID2_REVISION_BITS 0x000000f0u
#define UART_UARTPERIPHID2_REVISION_MSB 7u
#define UART_UARTPERIPHID2_REVISION_LSB 4u
#define UART_UARTPERIPHID2_REVISION_ACCESS "RO"
#define UART_UARTPERIPHID2_DESIGNER1_RESET 0x4u
#define UART_UARTPERIPHID2_DESIGNER1_BITS 0x0000000fu
#define UART_UARTPERIPHID2_DESIGNER1_MSB 3u
#define UART_UARTPERIPHID2_DESIGNER1_LSB 0u
#define UART_UARTPERIPHID2_DESIGNER1_ACCESS "RO"
#define UART_UARTPERIPHID3_OFFSET 0x00000fecu
#define UART_UARTPERIPHID3_BITS 0x000000ffu
#define UART_UARTPERIPHID3_RESET 0x00000000u
#define UART_UARTPERIPHID3_CONFIGURATION_RESET 0x00u
#define UART_UARTPERIPHID3_CONFIGURATION_BITS 0x000000ffu
#define UART_UARTPERIPHID3_CONFIGURATION_MSB 7u
#define UART_UARTPERIPHID3_CONFIGURATION_LSB 0u
#define UART_UARTPERIPHID3_CONFIGURATION_ACCESS "RO"
#define UART_UARTPCELLID0_OFFSET 0x00000ff0u
#define UART_UARTPCELLID0_BITS 0x000000ffu
#define UART_UARTPCELLID0_RESET 0x0000000du
#define UART_UARTPCELLID0_UARTPCELLID0_RESET 0x0du
#define UART_UARTPCELLID0_UARTPCELLID0_BITS 0x000000ffu
#define UART_UARTPCELLID0_UARTPCELLID0_MSB 7u
#define UART_UARTPCELLID0_UARTPCELLID0_LSB 0u
#define UART_UARTPCELLID0_UARTPCELLID0_ACCESS "RO"
#define UART_UARTPCELLID1_OFFSET 0x00000ff4u
#define UART_UARTPCELLID1_BITS 0x000000ffu
#define UART_UARTPCELLID1_RESET 0x000000f0u
#define UART_UARTPCELLID1_UARTPCELLID1_RESET 0xf0u
#define UART_UARTPCELLID1_UARTPCELLID1_BITS 0x000000ffu
#define UART_UARTPCELLID1_UARTPCELLID1_MSB 7u
#define UART_UARTPCELLID1_UARTPCELLID1_LSB 0u
#define UART_UARTPCELLID1_UARTPCELLID1_ACCESS "RO"
#define UART_UARTPCELLID2_OFFSET 0x00000ff8u
#define UART_UARTPCELLID2_BITS 0x000000ffu
#define UART_UARTPCELLID2_RESET 0x00000005u
#define UART_UARTPCELLID2_UARTPCELLID2_RESET 0x05u
#define UART_UARTPCELLID2_UARTPCELLID2_BITS 0x000000ffu
#define UART_UARTPCELLID2_UARTPCELLID2_MSB 7u
#define UART_UARTPCELLID2_UARTPCELLID2_LSB 0u
#define UART_UARTPCELLID2_UARTPCELLID2_ACCESS "RO"
#define UART_UARTPCELLID3_OFFSET 0x00000ffcu
#define UART_UARTPCELLID3_BITS 0x000000ffu
#define UART_UARTPCELLID3_RESET 0x000000b1u
#define UART_UARTPCELLID3_UARTPCELLID3_RESET 0xb1u
#define UART_UARTPCELLID3_UARTPCELLID3_BITS 0x000000ffu
#define UART_UARTPCELLID3_UARTPCELLID3_MSB 7u
#define UART_UARTPCELLID3_UARTPCELLID3_LSB 0u
#define UART_UARTPCELLID3_UARTPCELLID3_ACCESS "RO"
typedef struct {
   
    io_rw_32 dr;
   
    io_rw_32 rsr;
    uint32_t _pad0[4];
   
    io_ro_32 fr;
    uint32_t _pad1;
   
