gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 ctrl;
   
    io_wo_32 load;
   
    io_ro_32 reason;
   
    io_rw_32 scratch[8];
} watchdog_hw_t;
static watchdog_hw_t * const watchdog_hw = (watchdog_hw_t *)WATCHDOG_BASE; // ORIGINAL: #define watchdog_hw ((watchdog_hw_t *)WATCHDOG_BASE)
_Static_assert(sizeof (watchdog_hw_t) == 0x002c, "");
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_WATCHDOG 0
void watchdog_reboot(uint32_t pc, uint32_t sp, uint32_t delay_ms);
void watchdog_start_tick(uint cycles);
void watchdog_update(void);
void watchdog_enable(uint32_t delay_ms, _Bool pause_on_debug);
void watchdog_disable(void);
_Bool watchdog_caused_reboot(void);
_Bool watchdog_enable_caused_reboot(void);
uint32_t watchdog_get_time_remaining_us(void);
uint32_t watchdog_get_time_remaining_ms(void);
static inline uint32_t watchdog_get_count(void) {
    return watchdog_get_time_remaining_us();
}
#define _HARDWARE_XIP_CACHE_H 
#define PARAM_ASSERTIONS_ENABLED_HARDWARE_XIP_CACHE 0
#define XIP_CACHE_LINE_SIZE 8u
#define XIP_CACHE_SIZE (16u * 1024u)
#define XIP_CACHE_ADDRESS_SPACE_SIZE (XIP_END - XIP_BASE)
#define XIP_CACHE_IS_READ_ONLY 0
void xip_cache_invalidate_all(void);
void xip_cache_invalidate_range(uintptr_t start_offset, uintptr_t size_bytes);
void xip_cache_clean_all(void);
void xip_cache_clean_range(uintptr_t start_offset, uintptr_t size_bytes);
void xip_cache_pin_range(uintptr_t start_offset, uintptr_t size_bytes);
#define _HARDWARE_XOSC_H 
#define _HARDWARE_STRUCTS_XOSC_H 
#define _HARDWARE_REGS_XOSC_H 
#define XOSC_CTRL_OFFSET 0x00000000u
#define XOSC_CTRL_BITS 0x00ffffffu
#define XOSC_CTRL_RESET 0x00000000u
#define XOSC_CTRL_ENABLE_RESET "-"
#define XOSC_CTRL_ENABLE_BITS 0x00fff000u
#define XOSC_CTRL_ENABLE_MSB 23u
#define XOSC_CTRL_ENABLE_LSB 12u
#define XOSC_CTRL_ENABLE_ACCESS "RW"
#define XOSC_CTRL_ENABLE_VALUE_DISABLE 0xd1eu
#define XOSC_CTRL_ENABLE_VALUE_ENABLE 0xfabu
#define XOSC_CTRL_FREQ_RANGE_RESET "-"
#define XOSC_CTRL_FREQ_RANGE_BITS 0x00000fffu
#define XOSC_CTRL_FREQ_RANGE_MSB 11u
#define XOSC_CTRL_FREQ_RANGE_LSB 0u
#define XOSC_CTRL_FREQ_RANGE_ACCESS "RW"
#define XOSC_CTRL_FREQ_RANGE_VALUE_1_15MHZ 0xaa0u
#define XOSC_CTRL_FREQ_RANGE_VALUE_10_30MHZ 0xaa1u
#define XOSC_CTRL_FREQ_RANGE_VALUE_25_60MHZ 0xaa2u
#define XOSC_CTRL_FREQ_RANGE_VALUE_40_100MHZ 0xaa3u
#define XOSC_STATUS_OFFSET 0x00000004u
#define XOSC_STATUS_BITS 0x81001003u
#define XOSC_STATUS_RESET 0x00000000u
#define XOSC_STATUS_STABLE_RESET 0x0u
#define XOSC_STATUS_STABLE_BITS 0x80000000u
#define XOSC_STATUS_STABLE_MSB 31u
#define XOSC_STATUS_STABLE_LSB 31u
#define XOSC_STATUS_STABLE_ACCESS "RO"
#define XOSC_STATUS_BADWRITE_RESET 0x0u
#define XOSC_STATUS_BADWRITE_BITS 0x01000000u
#define XOSC_STATUS_BADWRITE_MSB 24u
#define XOSC_STATUS_BADWRITE_LSB 24u
#define XOSC_STATUS_BADWRITE_ACCESS "WC"
#define XOSC_STATUS_ENABLED_RESET "-"
#define XOSC_STATUS_ENABLED_BITS 0x00001000u
#define XOSC_STATUS_ENABLED_MSB 12u
#define XOSC_STATUS_ENABLED_LSB 12u
#define XOSC_STATUS_ENABLED_ACCESS "RO"
#define XOSC_STATUS_FREQ_RANGE_RESET "-"
#define XOSC_STATUS_FREQ_RANGE_BITS 0x00000003u
#define XOSC_STATUS_FREQ_RANGE_MSB 1u
#define XOSC_STATUS_FREQ_RANGE_LSB 0u
#define XOSC_STATUS_FREQ_RANGE_ACCESS "RO"
#define XOSC_STATUS_FREQ_RANGE_VALUE_1_15MHZ 0x0u
#define XOSC_STATUS_FREQ_RANGE_VALUE_10_30MHZ 0x1u
#define XOSC_STATUS_FREQ_RANGE_VALUE_25_60MHZ 0x2u
#define XOSC_STATUS_FREQ_RANGE_VALUE_40_100MHZ 0x3u
#define XOSC_DORMANT_OFFSET 0x00000008u
#define XOSC_DORMANT_BITS 0xffffffffu
#define XOSC_DORMANT_RESET "-"
#define XOSC_DORMANT_MSB 31u
#define XOSC_DORMANT_LSB 0u
#define XOSC_DORMANT_ACCESS "RW"
#define XOSC_DORMANT_VALUE_DORMANT 0x636f6d61u
#define XOSC_DORMANT_VALUE_WAKE 0x77616b65u
#define XOSC_STARTUP_OFFSET 0x0000000cu
#define XOSC_STARTUP_BITS 0x00103fffu
#define XOSC_STARTUP_RESET 0x00000000u
#define XOSC_STARTUP_X4_RESET "-"
#define XOSC_STARTUP_X4_BITS 0x00100000u
#define XOSC_STARTUP_X4_MSB 20u
#define XOSC_STARTUP_X4_LSB 20u
#define XOSC_STARTUP_X4_ACCESS "RW"
#define XOSC_STARTUP_DELAY_RESET "-"
#define XOSC_STARTUP_DELAY_BITS 0x00003fffu
#define XOSC_STARTUP_DELAY_MSB 13u
#define XOSC_STARTUP_DELAY_LSB 0u
#define XOSC_STARTUP_DELAY_ACCESS "RW"
#define XOSC_COUNT_OFFSET 0x00000010u
#define XOSC_COUNT_BITS 0x0000ffffu
#define XOSC_COUNT_RESET 0x00000000u
#define XOSC_COUNT_MSB 15u
#define XOSC_COUNT_LSB 0u
#define XOSC_COUNT_ACCESS "RW"
typedef struct {
   
    io_rw_32 ctrl;
   
    io_rw_32 status;
   
    io_rw_32 dormant;
   
    io_rw_32 startup;
   
    io_rw_32 count;
} xosc_hw_t;
static xosc_hw_t * const xosc_hw = (xosc_hw_t *)XOSC_BASE; // ORIGINAL: #define xosc_hw ((xosc_hw_t *)XOSC_BASE)
_Static_assert(sizeof (xosc_hw_t) == 0x0014, "");
#define PICO_XOSC_STARTUP_DELAY_MULTIPLIER 6
void xosc_init(void);
void xosc_disable(void);
void xosc_dormant(void);
#define _PICO_AON_TIMER_H 
#define _TIME_H_ 
#define _SYS_REENT_H_ 
#define _SYS__TYPES_H 
#define __need_size_t 
#define __need_wint_t 
#undef __need_ptrdiff_t
#undef __need_size_t
#undef __need_wchar_t
#define _WINT_T 
typedef unsigned int wint_t;
#undef __need_wint_t
#undef NULL
#define NULL ((void *)0)
#undef __need_NULL
#undef offsetof
#define offsetof(TYPE,MEMBER) __builtin_offsetof (TYPE, MEMBER)
#define _MACHINE__TYPES_H 
typedef long __blkcnt_t;
typedef long __blksize_t;
typedef __uint64_t __fsblkcnt_t;
typedef __uint32_t __fsfilcnt_t;
typedef long _off_t;
typedef int __pid_t;
typedef short __dev_t;
typedef unsigned short __uid_t;
typedef unsigned short __gid_t;
typedef __uint32_t __id_t;
typedef unsigned short __ino_t;
typedef __uint32_t __mode_t;
__extension__ typedef long long _off64_t;
typedef _off_t __off_t;
typedef _off64_t __loff_t;
typedef long __key_t;
typedef long _fpos_t;
#undef __size_t
typedef unsigned int __size_t;
#define unsigned signed
typedef signed int _ssize_t;
#undef unsigned
typedef _ssize_t __ssize_t;
typedef struct
{
  int __count;
  union
  {
    wint_t __wch;
    unsigned char __wchb[4];
  } __value;
} _mbstate_t;
typedef void *_iconv_t;
#define _CLOCK_T_ unsigned long
typedef unsigned long __clock_t;
#define _TIME_T_ __int_least64_t
typedef __int_least64_t __time_t;
#define _CLOCKID_T_ unsigned long
typedef unsigned long __clockid_t;
typedef long __daddr_t;
#define _TIMER_T_ unsigned long
typedef unsigned long __timer_t;
typedef __uint8_t __sa_family_t;
typedef __uint32_t __socklen_t;
typedef int __nl_item;
typedef unsigned short __nlink_t;
typedef long __suseconds_t;
typedef unsigned long __useconds_t;
typedef __builtin_va_list __va_list;
#define _NULL 0
#define __Long long
typedef unsigned long __ULong;
#define __SYS_LOCK_H__ 
struct __lock;
typedef struct __lock * _LOCK_T;
#define _LOCK_RECURSIVE_T _LOCK_T
#define __LOCK_INIT(class,lock) extern struct __lock __lock_ ## lock; class _LOCK_T lock = &__lock_ ## lock
#define __LOCK_INIT_RECURSIVE(class,lock) __LOCK_INIT(class,lock)
extern void __retarget_lock_init(_LOCK_T *lock);
#define __lock_init(lock) __retarget_lock_init(&lock)
extern void __retarget_lock_init_recursive(_LOCK_T *lock);
#define __lock_init_recursive(lock) __retarget_lock_init_recursive(&lock)
extern void __retarget_lock_close(_LOCK_T lock);
#define __lock_close(lock) __retarget_lock_close(lock)
extern void __retarget_lock_close_recursive(_LOCK_T lock);
#define __lock_close_recursive(lock) __retarget_lock_close_recursive(lock)
extern void __retarget_lock_acquire(_LOCK_T lock);
#define __lock_acquire(lock) __retarget_lock_acquire(lock)
extern void __retarget_lock_acquire_recursive(_LOCK_T lock);
#define __lock_acquire_recursive(lock) __retarget_lock_acquire_recursive(lock)
extern int __retarget_lock_try_acquire(_LOCK_T lock);
#define __lock_try_acquire(lock) __retarget_lock_try_acquire(lock)
extern int __retarget_lock_try_acquire_recursive(_LOCK_T lock);
#define __lock_try_acquire_recursive(lock) __retarget_lock_try_acquire_recursive(lock)
extern void __retarget_lock_release(_LOCK_T lock);
#define __lock_release(lock) __retarget_lock_release(lock)
extern void __retarget_lock_release_recursive(_LOCK_T lock);
#define __lock_release_recursive(lock) __retarget_lock_release_recursive(lock)
typedef _LOCK_T _flock_t;
struct _reent;
struct __locale_t;
struct _Bigint
{
  struct _Bigint *_next;
  int _k, _maxwds, _sign, _wds;
  __ULong _x[1];
};
struct __tm
{
  int __tm_sec;
  int __tm_min;
  int __tm_hour;
  int __tm_mday;
  int __tm_mon;
  int __tm_year;
  int __tm_wday;
  int __tm_yday;
  int __tm_isdst;
};
#define _ATEXIT_SIZE 32
struct _on_exit_args {
 void * _fnargs[32];
 void * _dso_handle[32];
 __ULong _fntypes;
 __ULong _is_cxa;
};
struct _atexit {
 struct _atexit *_next;
 int _ind;
 void (*_fns[32])(void);
        struct _on_exit_args _on_exit_args;
};
#define _ATEXIT_INIT {_NULL, 0, {_NULL}, {{_NULL}, {_NULL}, 0, 0}}
struct __sbuf {
 unsigned char *_base;
 int _size;
};
