gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define fds_bits __fds_bits
#define __fdset_mask(n) ((__fd_mask)1 << ((n) % _NFDBITS))
#define FD_CLR(n,p) ((p)->__fds_bits[(n)/_NFDBITS] &= ~__fdset_mask(n))
#define FD_COPY(f,t) (void)(*(t) = *(f))
#define FD_ISSET(n,p) (((p)->__fds_bits[(n)/_NFDBITS] & __fdset_mask(n)) != 0)
#define FD_SET(n,p) ((p)->__fds_bits[(n)/_NFDBITS] |= __fdset_mask(n))
#define FD_ZERO(p) do { fd_set *_p; __size_t _n; _p = (p); _n = _howmany(FD_SETSIZE, _NFDBITS); while (_n > 0) _p->__fds_bits[--_n] = 0; } while (0)

int select (int __n, fd_set *__readfds, fd_set *__writefds, fd_set *__exceptfds, struct timeval *__timeout);
int pselect (int __n, fd_set *__readfds, fd_set *__writefds, fd_set *__exceptfds, const struct timespec *__timeout, const sigset_t *__set);

#define physadr physadr_t
#define quad quad_t
typedef __uint32_t in_addr_t;
#define _IN_ADDR_T_DECLARED 
typedef __uint16_t in_port_t;
#define _IN_PORT_T_DECLARED 
typedef __uintptr_t u_register_t;
typedef unsigned char u_char;
#define __u_char_defined 
typedef unsigned short u_short;
#define __u_short_defined 
typedef unsigned int u_int;
#define __u_int_defined 
typedef unsigned long u_long;
#define __u_long_defined 
#define _BSDTYPES_DEFINED 
typedef unsigned short ushort;
typedef unsigned int uint;
typedef unsigned long ulong;
typedef __blkcnt_t blkcnt_t;
#define _BLKCNT_T_DECLARED 
typedef __blksize_t blksize_t;
#define _BLKSIZE_T_DECLARED 
typedef unsigned long clock_t;
#define __clock_t_defined 
#define _CLOCK_T_DECLARED 
typedef __daddr_t daddr_t;
typedef char * caddr_t;
#define __caddr_t_defined 
typedef __fsblkcnt_t fsblkcnt_t;
typedef __fsfilcnt_t fsfilcnt_t;
#define _FSBLKCNT_T_DECLARED 
typedef __id_t id_t;
#define _ID_T_DECLARED 
typedef __ino_t ino_t;
#define _INO_T_DECLARED 
typedef __off_t off_t;
#define _OFF_T_DECLARED 
typedef __dev_t dev_t;
#define _DEV_T_DECLARED 
typedef __uid_t uid_t;
#define _UID_T_DECLARED 
typedef __gid_t gid_t;
#define _GID_T_DECLARED 
typedef __pid_t pid_t;
#define _PID_T_DECLARED 
typedef __key_t key_t;
#define _KEY_T_DECLARED 
typedef _ssize_t ssize_t;
#define _SSIZE_T_DECLARED 
typedef __mode_t mode_t;
#define _MODE_T_DECLARED 
typedef __nlink_t nlink_t;
#define _NLINK_T_DECLARED 
typedef __clockid_t clockid_t;
#define __clockid_t_defined 
#define _CLOCKID_T_DECLARED 
typedef __timer_t timer_t;
#define __timer_t_defined 
#define _TIMER_T_DECLARED 
typedef __useconds_t useconds_t;
#define _USECONDS_T_DECLARED 
typedef __int64_t sbintime_t;
#define _SYS__PTHREADTYPES_H_ 
#define _SYS_SCHED_H_ 
#define SCHED_OTHER 0
#define SCHED_FIFO 1
#define SCHED_RR 2
struct sched_param {
  int sched_priority;
};
typedef __uint32_t pthread_t;
#define PTHREAD_SCOPE_PROCESS 0
#define PTHREAD_SCOPE_SYSTEM 1
#define PTHREAD_INHERIT_SCHED 1
#define PTHREAD_EXPLICIT_SCHED 2
#define PTHREAD_CREATE_DETACHED 0
#define PTHREAD_CREATE_JOINABLE 1
typedef struct {
  int is_initialized;
  void *stackaddr;
  int stacksize;
  int contentionscope;
  int inheritsched;
  int schedpolicy;
  struct sched_param schedparam;
  int detachstate;
} pthread_attr_t;
typedef __uint32_t pthread_mutex_t;
typedef struct {
  int is_initialized;
  int recursive;
} pthread_mutexattr_t;
#define _PTHREAD_MUTEX_INITIALIZER ((pthread_mutex_t) 0xFFFFFFFF)
typedef __uint32_t pthread_cond_t;
#define _PTHREAD_COND_INITIALIZER ((pthread_cond_t) 0xFFFFFFFF)
typedef struct {
  int is_initialized;
  clock_t clock;
} pthread_condattr_t;
typedef __uint32_t pthread_key_t;
typedef struct {
  int is_initialized;
  int init_executed;
} pthread_once_t;
#define _PTHREAD_ONCE_INIT { 1, 0 }
#undef __need_inttypes
#define _SYS__LOCALE_H 
struct __locale_t;
typedef struct __locale_t *locale_t;

struct tm
{
  int tm_sec;
  int tm_min;
  int tm_hour;
  int tm_mday;
  int tm_mon;
  int tm_year;
  int tm_wday;
  int tm_yday;
  int tm_isdst;
};
clock_t clock (void);
double difftime (time_t _time2, time_t _time1);
time_t mktime (struct tm *_timeptr);
time_t time (time_t *_timer);
char *asctime (const struct tm *_tblock);
char *ctime (const time_t *_time);
struct tm *gmtime (const time_t *_timer);
struct tm *localtime (const time_t *_timer);
size_t strftime (char *restrict _s,
        size_t _maxsize, const char *restrict _fmt,
        const struct tm *restrict _t);
extern size_t strftime_l (char *restrict _s, size_t _maxsize,
     const char *restrict _fmt,
     const struct tm *restrict _t, locale_t _l);
char *asctime_r (const struct tm *restrict,
     char *restrict);
char *ctime_r (const time_t *, char *);
struct tm *gmtime_r (const time_t *restrict,
     struct tm *restrict);
struct tm *localtime_r (const time_t *restrict,
     struct tm *restrict);

void tzset (void);
void _tzset_r (struct _reent *);
extern long _timezone;
extern int _daylight;
extern char *_tzname[2];
#define tzname _tzname
#define CLOCK_ENABLED 1
#define CLOCK_DISABLED 0
#define CLOCK_ALLOWED 1
#define CLOCK_DISALLOWED 0
#define TIMER_ABSTIME 4
#define CLOCK_REALTIME (1)
#define _PICO_UTIL_DATETIME_H 
#define _SYS_TIME_H_ 
struct timezone {
 int tz_minuteswest;
 int tz_dsttime;
};
#define DST_NONE 0
#define DST_USA 1
#define DST_AUST 2
#define DST_WET 3
#define DST_MET 4
#define DST_EET 5
#define DST_CAN 6
struct bintime {
 time_t sec;
 uint64_t frac;
};
static __inline void
bintime_addx(struct bintime *_bt, uint64_t _x)
{
 uint64_t _u;
 _u = _bt->frac;
 _bt->frac += _x;
 if (_u > _bt->frac)
  _bt->sec++;
}
static __inline void
bintime_add(struct bintime *_bt, const struct bintime *_bt2)
{
 uint64_t _u;
 _u = _bt->frac;
 _bt->frac += _bt2->frac;
 if (_u > _bt->frac)
  _bt->sec++;
 _bt->sec += _bt2->sec;
}
static __inline void
bintime_sub(struct bintime *_bt, const struct bintime *_bt2)
{
 uint64_t _u;
 _u = _bt->frac;
 _bt->frac -= _bt2->frac;
 if (_u < _bt->frac)
  _bt->sec--;
 _bt->sec -= _bt2->sec;
}
static __inline void
bintime_mul(struct bintime *_bt, u_int _x)
{
 uint64_t _p1, _p2;
 _p1 = (_bt->frac & 0xffffffffull) * _x;
 _p2 = (_bt->frac >> 32) * _x + (_p1 >> 32);
 _bt->sec *= _x;
 _bt->sec += (_p2 >> 32);
 _bt->frac = (_p2 << 32) | (_p1 & 0xffffffffull);
}
static __inline void
bintime_shift(struct bintime *_bt, int _exp)
{
 if (_exp > 0) {
  _bt->sec <<= _exp;
  _bt->sec |= _bt->frac >> (64 - _exp);
  _bt->frac <<= _exp;
 } else if (_exp < 0) {
  _bt->frac >>= -_exp;
  _bt->frac |= (uint64_t)_bt->sec << (64 + _exp);
  _bt->sec >>= -_exp;
 }
}
#define bintime_clear(a) ((a)->sec = (a)->frac = 0)
#define bintime_isset(a) ((a)->sec || (a)->frac)
#define bintime_cmp(a,b,cmp) (((a)->sec == (b)->sec) ? ((a)->frac cmp (b)->frac) : ((a)->sec cmp (b)->sec))
#define SBT_1S ((sbintime_t)1 << 32)
#define SBT_1M (SBT_1S * 60)
#define SBT_1MS (SBT_1S / 1000)
#define SBT_1US (SBT_1S / 1000000)
#define SBT_1NS (SBT_1S / 1000000000)
#define SBT_MAX 0x7fffffffffffffffLL
static __inline int
sbintime_getsec(sbintime_t _sbt)
{
 return (_sbt >> 32);
}
static __inline sbintime_t
bttosbt(const struct bintime _bt)
{
 return (((sbintime_t)_bt.sec << 32) + (_bt.frac >> 32));
}
static __inline struct bintime
sbttobt(sbintime_t _sbt)
{
 struct bintime _bt;
 _bt.sec = _sbt >> 32;
 _bt.frac = _sbt << 32;
 return (_bt);
}
static __inline int64_t
sbttons(sbintime_t _sbt)
{
 uint64_t ns;
 ns = _sbt;
 if (ns >= ((sbintime_t)1 << 32))
  ns = (ns >> 32) * 1000000000;
 else
  ns = 0;
 return (ns + (1000000000 * (_sbt & 0xffffffffu) >> 32));
}
static __inline sbintime_t
nstosbt(int64_t _ns)
{
 sbintime_t sb = 0;
 if (_ns >= ((sbintime_t)1 << 32)) {
  sb = (_ns / 1000000000) * ((sbintime_t)1 << 32);
  _ns = _ns % 1000000000;
 }
 sb += ((_ns * 9223372037ull) + 0x7fffffff) >> 31;
 return (sb);
}
static __inline int64_t
sbttous(sbintime_t _sbt)
{
 return ((1000000 * _sbt) >> 32);
}
static __inline sbintime_t
ustosbt(int64_t _us)
{
 sbintime_t sb = 0;
 if (_us >= ((sbintime_t)1 << 32)) {
  sb = (_us / 1000000) * ((sbintime_t)1 << 32);
  _us = _us % 1000000;
 }
 sb += ((_us * 9223372036855ull) + 0x7fffffff) >> 31;
 return (sb);
}
static __inline int64_t
sbttoms(sbintime_t _sbt)
{
 return ((1000 * _sbt) >> 32);
}
static __inline sbintime_t
mstosbt(int64_t _ms)
{
 sbintime_t sb = 0;
 if (_ms >= ((sbintime_t)1 << 32)) {
  sb = (_ms / 1000) * ((sbintime_t)1 << 32);
  _ms = _ms % 1000;
 }
 sb += ((_ms * 9223372036854776ull) + 0x7fffffff) >> 31;
 return (sb);
}
static __inline void
bintime2timespec(const struct bintime *_bt, struct timespec *_ts)
{
 _ts->tv_sec = _bt->sec;
 _ts->tv_nsec = ((uint64_t)1000000000 *
     (uint32_t)(_bt->frac >> 32)) >> 32;
}
static __inline void
timespec2bintime(const struct timespec *_ts, struct bintime *_bt)
{
 _bt->sec = _ts->tv_sec;
 _bt->frac = _ts->tv_nsec * (uint64_t)18446744073LL;
}
static __inline void
bintime2timeval(const struct bintime *_bt, struct timeval *_tv)
{
 _tv->tv_sec = _bt->sec;
 _tv->tv_usec = ((uint64_t)1000000 * (uint32_t)(_bt->frac >> 32)) >> 32;
}
static __inline void
timeval2bintime(const struct timeval *_tv, struct bintime *_bt)
{
 _bt->sec = _tv->tv_sec;
 _bt->frac = _tv->tv_usec * (uint64_t)18446744073709LL;
}
static __inline struct timespec
sbttots(sbintime_t _sbt)
{
 struct timespec _ts;
 _ts.tv_sec = _sbt >> 32;
 _ts.tv_nsec = sbttons((uint32_t)_sbt);
 return (_ts);
}
static __inline sbintime_t
tstosbt(struct timespec _ts)
{
 return (((sbintime_t)_ts.tv_sec << 32) + nstosbt(_ts.tv_nsec));
}
static __inline struct timeval
sbttotv(sbintime_t _sbt)
{
 struct timeval _tv;
 _tv.tv_sec = _sbt >> 32;
 _tv.tv_usec = sbttous((uint32_t)_sbt);
 return (_tv);
}
static __inline sbintime_t
tvtosbt(struct timeval _tv)
{
 return (((sbintime_t)_tv.tv_sec << 32) + ustosbt(_tv.tv_usec));
}
#define timespecclear(tvp) ((tvp)->tv_sec = (tvp)->tv_nsec = 0)
#define timespecisset(tvp) ((tvp)->tv_sec || (tvp)->tv_nsec)
#define timespeccmp(tvp,uvp,cmp) (((tvp)->tv_sec == (uvp)->tv_sec) ? ((tvp)->tv_nsec cmp (uvp)->tv_nsec) : ((tvp)->tv_sec cmp (uvp)->tv_sec))
#define timespecadd(tsp,usp,vsp) do { (vsp)->tv_sec = (tsp)->tv_sec + (usp)->tv_sec; (vsp)->tv_nsec = (tsp)->tv_nsec + (usp)->tv_nsec; if ((vsp)->tv_nsec >= 1000000000L) { (vsp)->tv_sec++; (vsp)->tv_nsec -= 1000000000L; } } while (0)
#define timespecsub(tsp,usp,vsp) do { (vsp)->tv_sec = (tsp)->tv_sec - (usp)->tv_sec; (vsp)->tv_nsec = (tsp)->tv_nsec - (usp)->tv_nsec; if ((vsp)->tv_nsec < 0) { (vsp)->tv_sec--; (vsp)->tv_nsec += 1000000000L; } } while (0)
#define timerclear(tvp) ((tvp)->tv_sec = (tvp)->tv_usec = 0)
#define timerisset(tvp) ((tvp)->tv_sec || (tvp)->tv_usec)
#define timercmp(tvp,uvp,cmp) (((tvp)->tv_sec == (uvp)->tv_sec) ? ((tvp)->tv_usec cmp (uvp)->tv_usec) : ((tvp)->tv_sec cmp (uvp)->tv_sec))
#define timeradd(tvp,uvp,vvp) do { (vvp)->tv_sec = (tvp)->tv_sec + (uvp)->tv_sec; (vvp)->tv_usec = (tvp)->tv_usec + (uvp)->tv_usec; if ((vvp)->tv_usec >= 1000000) { (vvp)->tv_sec++; (vvp)->tv_usec -= 1000000; } } while (0)
#define timersub(tvp,uvp,vvp) do { (vvp)->tv_sec = (tvp)->tv_sec - (uvp)->tv_sec; (vvp)->tv_usec = (tvp)->tv_usec - (uvp)->tv_usec; if ((vvp)->tv_usec < 0) { (vvp)->tv_sec--; (vvp)->tv_usec += 1000000; } } while (0)
#define ITIMER_REAL 0
#define ITIMER_VIRTUAL 1
#define ITIMER_PROF 2
struct itimerval {
 struct timeval it_interval;
 struct timeval it_value;
};

int utimes (const char *, const struct timeval [2]);
int adjtime (const struct timeval *, struct timeval *);
int futimes (int, const struct timeval [2]);
int lutimes (const char *, const struct timeval [2]);
int settimeofday (const struct timeval *, const struct timezone *);
int getitimer (int __which, struct itimerval *__value);
int setitimer (int __which, const struct itimerval *restrict __value,
     struct itimerval *restrict __ovalue);
int gettimeofday (struct timeval *restrict __p,
     void *restrict __tz);

uint64_t timespec_to_ms(const struct timespec *ts);
uint64_t timespec_to_us(const struct timespec *ts);
void ms_to_timespec(uint64_t ms, struct timespec *ts);
void us_to_timespec(uint64_t ms, struct timespec *ts);
struct tm *pico_localtime_r(const time_t *time, struct tm *tm);
time_t pico_mktime(struct tm *tm);
#define AON_TIMER_IRQ_NUM() POWMAN_IRQ_TIMER
typedef void (*aon_timer_alarm_handler_t)(void);
void aon_timer_start_with_timeofday(void);
_Bool aon_timer_start(const struct timespec *ts);
_Bool aon_timer_start_calendar(const struct tm *tm);
void aon_timer_stop(void);
_Bool aon_timer_set_time(const struct timespec *ts);
_Bool aon_timer_set_time_calendar(const struct tm *tm);
_Bool aon_timer_get_time(struct timespec *ts);
_Bool aon_timer_get_time_calendar(struct tm *tm);
void aon_timer_get_resolution(struct timespec *ts);
aon_timer_alarm_handler_t aon_timer_enable_alarm(const struct timespec *ts, aon_timer_alarm_handler_t handler, _Bool wakeup_from_low_power);
aon_timer_alarm_handler_t aon_timer_enable_alarm_calendar(const struct tm *tm, aon_timer_alarm_handler_t handler, _Bool wakeup_from_low_power);
void aon_timer_disable_alarm(void);
_Bool aon_timer_is_running(void);
static inline uint aon_timer_get_irq_num(void) {
    return POWMAN_IRQ_TIMER;
}
#define _PICO_FLASH_H 
_Bool flash_safe_execute_core_init(void);
_Bool flash_safe_execute_core_deinit(void);
int flash_safe_execute(void (*func)(void *), void *param, uint32_t enter_exit_timeout_ms);
#define PICO_FLASH_ASSERT_ON_UNSAFE 1
#define PICO_FLASH_ASSUME_CORE0_SAFE 0
#define PICO_FLASH_ASSUME_CORE1_SAFE 0
#define PICO_FLASH_SAFE_EXECUTE_PICO_SUPPORT_MULTICORE_LOCKOUT 1
typedef struct {
    _Bool (*core_init_deinit)(_Bool init);
    int (*enter_safe_zone_timeout_ms)(uint32_t timeout_ms);
    int (*exit_safe_zone_timeout_ms)(uint32_t timeout_ms);
} flash_safety_helper_t;
flash_safety_helper_t *get_flash_safety_helper(void);
#define _PICO_I2C_SLAVE_H 
typedef enum i2c_slave_event_t
{
    I2C_SLAVE_RECEIVE,
    I2C_SLAVE_REQUEST,
    I2C_SLAVE_FINISH,
} i2c_slave_event_t;
typedef void (*i2c_slave_handler_t)(i2c_inst_t *i2c, i2c_slave_event_t event);
void i2c_slave_init(i2c_inst_t *i2c, uint8_t address, i2c_slave_handler_t handler);
void i2c_slave_deinit(i2c_inst_t *i2c);
#define _PICO_MULTICORE_H 
#define _PICO_SYNC_H 
#define _PICO_MUTEX_H 
typedef struct {
    lock_core_t core;
    int8_t owner;
    uint8_t enter_count;
} recursive_mutex_t;
typedef struct mutex {
    lock_core_t core;
    int8_t owner;
} mutex_t;
void mutex_init(mutex_t *mtx);
void recursive_mutex_init(recursive_mutex_t *mtx);
void mutex_enter_blocking(mutex_t *mtx);
void recursive_mutex_enter_blocking(recursive_mutex_t *mtx);
_Bool mutex_try_enter(mutex_t *mtx, uint32_t *owner_out);
_Bool mutex_try_enter_block_until(mutex_t *mtx, absolute_time_t until);
_Bool recursive_mutex_try_enter(recursive_mutex_t *mtx, uint32_t *owner_out);
_Bool mutex_enter_timeout_ms(mutex_t *mtx, uint32_t timeout_ms);
_Bool recursive_mutex_enter_timeout_ms(recursive_mutex_t *mtx, uint32_t timeout_ms);
_Bool mutex_enter_timeout_us(mutex_t *mtx, uint32_t timeout_us);
_Bool recursive_mutex_enter_timeout_us(recursive_mutex_t *mtx, uint32_t timeout_us);
_Bool mutex_enter_block_until(mutex_t *mtx, absolute_time_t until);
_Bool recursive_mutex_enter_block_until(recursive_mutex_t *mtx, absolute_time_t until);
void mutex_exit(mutex_t *mtx);
void recursive_mutex_exit(recursive_mutex_t *mtx);
static inline _Bool mutex_is_initialized(mutex_t *mtx) {
    return mtx->core.spin_lock != 0;
}
static inline _Bool recursive_mutex_is_initialized(recursive_mutex_t *mtx) {
    return mtx->core.spin_lock != 0;
}
#define auto_init_mutex(name) static __attribute__((section(".mutex_array"))) mutex_t name
#define auto_init_recursive_mutex(name) static __attribute__((section(".mutex_array"))) recursive_mutex_t name = { .core = { .spin_lock = (spin_lock_t *)1 }, .owner = 0, .enter_count = 0 }
void runtime_init_mutex(void);
#define _PICO_CRITICAL_SECTION_H 
typedef struct __attribute__((__packed__)) __attribute__((__aligned__(4))) critical_section {
    spin_lock_t *spin_lock;
    uint32_t save;
} critical_section_t;
