gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
void critical_section_init(critical_section_t *crit_sec);
void critical_section_init_with_lock_num(critical_section_t *crit_sec, uint lock_num);
__inline__ __attribute__((__always_inline__)) static void critical_section_enter_blocking(critical_section_t *crit_sec) {
    crit_sec->save = spin_lock_blocking(crit_sec->spin_lock);
}
__inline__ __attribute__((__always_inline__)) static void critical_section_exit(critical_section_t *crit_sec) {
    spin_unlock(crit_sec->spin_lock, crit_sec->save);
}
void critical_section_deinit(critical_section_t *crit_sec);
static inline _Bool critical_section_is_initialized(critical_section_t *crit_sec) {
    return crit_sec->spin_lock != 0;
}
#define PARAM_ASSERTIONS_ENABLED_PICO_MULTICORE 0
#define PICO_CORE1_STACK_SIZE PICO_STACK_SIZE
#define SIO_FIFO_IRQ_NUM(core) SIO_IRQ_FIFO
void multicore_reset_core1(void);
void multicore_launch_core1(void (*entry)(void));
void multicore_launch_core1_with_stack(void (*entry)(void), uint32_t *stack_bottom, size_t stack_size_bytes);
void multicore_launch_core1_raw(void (*entry)(void), uint32_t *sp, uint32_t vector_table);
static inline _Bool multicore_fifo_rvalid(void) {
    return ((sio_hw_t *)0xd0000000u)->fifo_st & 0x00000001u;
}
static inline _Bool multicore_fifo_wready(void) {
    return ((sio_hw_t *)0xd0000000u)->fifo_st & 0x00000002u;
}
void multicore_fifo_push_blocking(uint32_t data);
static inline void multicore_fifo_push_blocking_inline(uint32_t data) {
    while (!multicore_fifo_wready())
        tight_loop_contents();
    ((sio_hw_t *)0xd0000000u)->fifo_wr = data;
    __sev();
}
_Bool multicore_fifo_push_timeout_us(uint32_t data, uint64_t timeout_us);
uint32_t multicore_fifo_pop_blocking(void);
static inline uint32_t multicore_fifo_pop_blocking_inline(void) {
    while (!multicore_fifo_rvalid())
        __wfe();
    return ((sio_hw_t *)0xd0000000u)->fifo_rd;
}
_Bool multicore_fifo_pop_timeout_us(uint64_t timeout_us, uint32_t *out);
static inline void multicore_fifo_drain(void) {
    while (multicore_fifo_rvalid())
        (void) ((sio_hw_t *)0xd0000000u)->fifo_rd;
}
static inline void multicore_fifo_clear_irq(void) {
    ((sio_hw_t *)0xd0000000u)->fifo_st = 0xff;
}
static inline uint32_t multicore_fifo_get_status(void) {
    return ((sio_hw_t *)0xd0000000u)->fifo_st;
}
static inline void check_doorbell_num_param(__attribute__((__unused__)) uint doorbell_num) {
    ({if (((0 || 0) && !0)) ((!(doorbell_num >= 8u)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/rp2_common/pico_multicore/include/pico/multicore.h", 309, __func__, "!(doorbell_num >= 8u)"));});
}
void multicore_doorbell_claim(uint doorbell_num, uint core_mask);
int multicore_doorbell_claim_unused(uint core_mask, _Bool required);
void multicore_doorbell_unclaim(uint doorbell_num, uint core_mask);
static inline void multicore_doorbell_set_other_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_out_set = 1u << doorbell_num;
}
static inline void multicore_doorbell_clear_other_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_out_clr = 1u << doorbell_num;
}
static inline void multicore_doorbell_set_current_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_in_set = 1u << doorbell_num;
}
static inline void multicore_doorbell_clear_current_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    ((sio_hw_t *)0xd0000000u)->doorbell_in_clr = 1u << doorbell_num;
}
static inline _Bool multicore_doorbell_is_set_current_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    return ((sio_hw_t *)0xd0000000u)->doorbell_in_set & (1u << doorbell_num);
}
static inline _Bool multicore_doorbell_is_set_other_core(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    return ((sio_hw_t *)0xd0000000u)->doorbell_out_set & (1u << doorbell_num);
}
#define DOORBELL_IRQ_NUM(doorbell_num) SIO_IRQ_BELL
static inline uint multicore_doorbell_irq_num(uint doorbell_num) {
    check_doorbell_num_param(doorbell_num);
    return SIO_IRQ_BELL;
}
void multicore_lockout_victim_init(void);
void multicore_lockout_victim_deinit(void);
_Bool multicore_lockout_victim_is_initialized(uint core_num);
void multicore_lockout_start_blocking(void);
_Bool multicore_lockout_start_timeout_us(uint64_t timeout_us);
void multicore_lockout_end_blocking(void);
_Bool multicore_lockout_end_timeout_us(uint64_t timeout_us);
#define _PICO_RAND_H 
#define PICO_RAND_ENTROPY_SRC_TRNG 1
#define PICO_RAND_ENTROPY_SRC_TIME 1
#define PICO_RAND_SEED_ENTROPY_SRC_ROSC PICO_RAND_ENTROPY_SRC_ROSC
#define PICO_RAND_SEED_ENTROPY_SRC_TRNG PICO_RAND_ENTROPY_SRC_TRNG
#define PICO_RAND_SEED_ENTROPY_SRC_TIME PICO_RAND_ENTROPY_SRC_TIME
#define PICO_RAND_SEED_ENTROPY_SRC_BUS_PERF_COUNTER PICO_RAND_ENTROPY_SRC_BUS_PERF_COUNTER
#define PICO_RAND_SEED_ENTROPY_SRC_BOOT_RANDOM 1
#define PICO_RAND_SEED_ENTROPY_SRC_BOARD_ID (!PICO_RAND_SEED_ENTROPY_SRC_BOOT_RANDOM)
#define PICO_RAND_ROSC_BIT_SAMPLE_COUNT 1
#define PICO_RAND_MIN_ROSC_BIT_SAMPLE_TIME_US 10u
#define PICO_RAND_BUS_PERF_COUNTER_EVENT arbiter_sram5_perf_event_access
#define PICO_RAND_RAM_HASH_END SRAM_END
#define PICO_RAND_RAM_HASH_START (PICO_RAND_RAM_HASH_END - 1024u)
typedef struct rng_128 {
    uint64_t r[2];
} rng_128_t;
void get_rand_128(rng_128_t *rand128);
uint64_t get_rand_64(void);
uint32_t get_rand_32(void);
#define _PICO_SHA256_H 
typedef struct pico_sha256_state {
    enum sha256_endianness endianness;
    int8_t channel;
    _Bool locked;
    uint8_t cache_used;
    union {
        uint32_t word;
        uint8_t bytes[4];
    } cache;
    dma_channel_config config;
    size_t total_data_size;
} pico_sha256_state_t;
void pico_sha256_cleanup(pico_sha256_state_t *state);
int pico_sha256_try_start(pico_sha256_state_t *state, enum sha256_endianness endianness, _Bool use_dma);
int pico_sha256_start_blocking_until(pico_sha256_state_t *state, enum sha256_endianness endianness, _Bool use_dma, absolute_time_t until);
static inline int pico_sha256_start_blocking(pico_sha256_state_t *state, enum sha256_endianness endianness, _Bool use_dma) {
    return pico_sha256_start_blocking_until(state, endianness, use_dma, at_the_end_of_time);
}
void pico_sha256_update(pico_sha256_state_t *state, const uint8_t *data, size_t data_size_bytes);
void pico_sha256_update_blocking(pico_sha256_state_t *state, const uint8_t *data, size_t data_size_bytes);
void pico_sha256_finish(pico_sha256_state_t *state, sha256_result_t *out);
#define _PICO_STATUS_LED_H 
struct async_context;
#define PICO_STATUS_LED_AVAILABLE 1
#define PICO_COLORED_STATUS_LED_AVAILABLE 0
#define PICO_STATUS_LED_VIA_COLORED_STATUS_LED (PICO_COLORED_STATUS_LED_AVAILABLE && !PICO_STATUS_LED_AVAILABLE)
#define PICO_COLORED_STATUS_LED_USES_WRGB 0
#define PICO_COLORED_STATUS_LED_COLOR_FROM_RGB(r,g,b) (((r) << 16) | ((g) << 8) | (b))
#define PICO_COLORED_STATUS_LED_COLOR_FROM_WRGB(w,r,g,b) (((w) << 24) | ((r) << 16) | ((g) << 8) | (b))
#define PICO_DEFAULT_COLORED_STATUS_LED_ON_COLOR PICO_COLORED_STATUS_LED_COLOR_FROM_RGB(0xaa, 0xaa, 0xaa)
_Bool status_led_init(void);
_Bool status_led_init_with_context(struct async_context *context);
static inline _Bool colored_status_led_supported(void) {
    return 0;
}
static inline _Bool status_led_via_colored_status_led(void) {
    return (0 && !1);
}
static inline _Bool status_led_supported(void) {
    if (status_led_via_colored_status_led()) {
        return colored_status_led_supported();
    }
    return 1;
}
_Bool colored_status_led_set_state(_Bool led_on);
_Bool colored_status_led_get_state(void);
_Bool colored_status_led_set_on_with_color(uint32_t color);
uint32_t colored_status_led_get_on_color(void);
static inline _Bool status_led_set_state(_Bool led_on) {
    if (status_led_via_colored_status_led()) {
        return colored_status_led_set_state(led_on);
    } else if (status_led_supported()) {
        gpio_put(25, led_on);
        return 1;
    }
    return 0;
}
static inline _Bool status_led_get_state() {
    if (status_led_via_colored_status_led()) {
        return colored_status_led_get_state();
    } else if (status_led_supported()) {
        return gpio_get(25);
    }
    return 0;
}
void status_led_deinit();
#define _PICO_STDIO_DRIVER_H 
#define _PICO_STDIO_H 
#define PICO_STDOUT_MUTEX 1
#define PICO_STDIO_ENABLE_CRLF_SUPPORT 1
#define PICO_STDIO_DEFAULT_CRLF 1
#define PICO_STDIO_STACK_BUFFER_SIZE 128
#define PICO_STDIO_DEADLOCK_TIMEOUT_MS 1000
#define PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS 1
#define _STDARG_H 
#define _ANSI_STDARG_H_ 
#undef __need___va_list
#define __GNUC_VA_LIST 
typedef __builtin_va_list __gnuc_va_list;
#define va_start(v,l) __builtin_va_start(v,l)
#define va_end(v) __builtin_va_end(v)
#define va_arg(v,l) __builtin_va_arg(v,l)
#define va_copy(d,s) __builtin_va_copy(d,s)
#define __va_copy(d,s) __builtin_va_copy(d,s)
typedef __gnuc_va_list va_list;
#define _VA_LIST_ 
#define _VA_LIST 
#define _VA_LIST_DEFINED 
#define _VA_LIST_T_H 
#define __va_list__ 
typedef struct stdio_driver stdio_driver_t;
_Bool stdio_init_all(void);
_Bool stdio_deinit_all(void);
void stdio_flush(void);
int stdio_getchar_timeout_us(uint32_t timeout_us);
static inline int getchar_timeout_us(uint32_t timeout_us) {
    return stdio_getchar_timeout_us(timeout_us);
}
void stdio_set_driver_enabled(stdio_driver_t *driver, _Bool enabled);
void stdio_filter_driver(stdio_driver_t *driver);
void stdio_set_translate_crlf(stdio_driver_t *driver, _Bool translate);
int stdio_putchar_raw(int c);
static inline int putchar_raw(int c) {
    return stdio_putchar_raw(c);
}
int stdio_puts_raw(const char *s);
static inline int puts_raw(const char *s) {
    return stdio_puts_raw(s);
}
void stdio_set_chars_available_callback(void (*fn)(void*), void *param);
int stdio_get_until(char *buf, int len, absolute_time_t until);
int stdio_put_string(const char *s, int len, _Bool newline, _Bool cr_translation);
int stdio_getchar(void);
int stdio_putchar(int);
int stdio_puts(const char *s);
int stdio_vprintf(const char *format, va_list va);
int __attribute__((__format__ (__printf__, 1, 0))) stdio_printf(const char* format, ...);
struct stdio_driver {
    void (*out_chars)(const char *buf, int len);
    void (*out_flush)(void);
    int (*in_chars)(char *buf, int len);
    void (*set_chars_available_callback)(void (*fn)(void*), void *param);
    stdio_driver_t *next;
    _Bool last_ended_with_cr;
    _Bool crlf_enabled;
};
#define _PICO_STDIO_RTT_H 
#define PICO_STDIO_RTT_DEFAULT_CRLF PICO_STDIO_DEFAULT_CRLF
extern stdio_driver_t stdio_rtt;
void stdio_rtt_init(void);
void stdio_rtt_deinit(void);
#define _PICO_STDIO_UART_H 
#define PICO_STDIO_UART_DEFAULT_CRLF PICO_STDIO_DEFAULT_CRLF
#define PICO_STDIO_UART_SUPPORT_CHARS_AVAILABLE_CALLBACK 1
extern stdio_driver_t stdio_uart;
void stdio_uart_init(void);
void stdout_uart_init(void);
void stdin_uart_init(void);
void stdio_uart_init_full(uart_inst_t *uart, uint baud_rate, int tx_pin, int rx_pin);
void stdio_uart_deinit(void);
void stdout_uart_deinit(void);
void stdin_uart_deinit(void);
void stdio_uart_deinit_full(uart_inst_t *uart, int tx_pin, int rx_pin);
#define _PICO_STDLIB_H 
#define _PICO_STDIO_USB_H 
#define PICO_STDIO_USB_DEFAULT_CRLF PICO_STDIO_DEFAULT_CRLF
#define PICO_STDIO_USB_STDOUT_TIMEOUT_US 500000
#define PICO_STDIO_USB_TASK_INTERVAL_US 1000
#define PICO_STDIO_USB_ENABLE_IRQ_BACKGROUND_TASK 1
#define PICO_STDIO_USB_ENABLE_TINYUSB_INIT 1
#define PICO_STDIO_USB_RESET_MAGIC_BAUD_RATE 1200
#define PICO_STDIO_USB_CONNECT_WAIT_TIMEOUT_MS 0
#define PICO_STDIO_USB_POST_CONNECT_WAIT_DELAY_MS 50
#define PICO_STDIO_USB_DEINIT_DELAY_MS 110
#define PICO_STDIO_USB_RESET_BOOTSEL_ACTIVITY_LED_ACTIVE_LOW 0
#define PICO_STDIO_USB_RESET_BOOTSEL_FIXED_ACTIVITY_LED 0
#define PICO_STDIO_USB_RESET_BOOTSEL_INTERFACE_DISABLE_MASK 0u
#define PICO_STDIO_USB_RESET_INTERFACE_SUPPORT_RESET_TO_BOOTSEL 1
#define PICO_STDIO_USB_RESET_INTERFACE_SUPPORT_RESET_TO_FLASH_BOOT 1
#define PICO_STDIO_USB_RESET_INTERFACE_SUPPORT_MS_OS_20_DESCRIPTOR 1
#define PICO_STDIO_USB_RESET_RESET_TO_FLASH_DELAY_MS 100
#define PICO_STDIO_USB_USE_DEFAULT_DESCRIPTORS 1
#define PICO_STDIO_USB_CONNECTION_WITHOUT_DTR 0
#define PICO_STDIO_USB_DEVICE_SELF_POWERED 0
#define PICO_STDIO_USB_SUPPORT_CHARS_AVAILABLE_CALLBACK 1
extern stdio_driver_t stdio_usb;
_Bool stdio_usb_init(void);
_Bool stdio_usb_deinit(void);
_Bool stdio_usb_connected(void);
void stdio_usb_call_chars_available_callback(void);
#define PICO_DEFAULT_LED_PIN_INVERTED 0
void setup_default_uart(void);
#define _PICO_TIMEOUT_HELPER_H 
typedef struct timeout_state {
    absolute_time_t next_timeout;
    uint64_t param;
} timeout_state_t;
typedef _Bool (*check_timeout_fn)(timeout_state_t *ts, _Bool reset);
check_timeout_fn init_single_timeout_until(timeout_state_t *ts, absolute_time_t target);
check_timeout_fn init_per_iteration_timeout_us(timeout_state_t *ts, uint64_t per_iteration_timeout_us);
#define _PICO_UNIQUE_ID_H 
#define PICO_UNIQUE_BOARD_ID_SIZE_BYTES 8
#define PICO_UNIQUE_BOARD_ID_INIT_PRIORITY 1000
typedef struct {
 uint8_t id[8];
} pico_unique_board_id_t;
void pico_get_unique_board_id(pico_unique_board_id_t *id_out);
void pico_get_unique_board_id_string(char *id_out, uint len);
#define _PICO_UTIL_PHEAP_H 
#define PARAM_ASSERTIONS_ENABLED_PHEAP 0
#define PICO_PHEAP_MAX_ENTRIES 255
typedef uint8_t pheap_node_id_t;
typedef struct pheap_node {
    pheap_node_id_t child, sibling, parent;
} pheap_node_t;
