gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef _Bool (*pheap_comparator)(void *user_data, pheap_node_id_t a, pheap_node_id_t b);
typedef struct pheap {
    pheap_node_t *nodes;
    pheap_comparator comparator;
    void *user_data;
    pheap_node_id_t max_nodes;
    pheap_node_id_t root_id;
    pheap_node_id_t free_head_id;
    pheap_node_id_t free_tail_id;
} pheap_t;
pheap_t *ph_create(uint max_nodes, pheap_comparator comparator, void *user_data);
void ph_clear(pheap_t *heap);
void ph_destroy(pheap_t *heap);
static inline pheap_node_t *ph_get_node(pheap_t *heap, pheap_node_id_t id) {
    ((id && id <= heap->max_nodes) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 108, __func__, "id && id <= heap->max_nodes"));
    return heap->nodes + id - 1;
}
static void ph_add_child_node(pheap_t *heap, pheap_node_id_t parent_id, pheap_node_id_t child_id) {
    pheap_node_t *n = ph_get_node(heap, parent_id);
    ((parent_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 115, __func__, "parent_id"));
    ((child_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 116, __func__, "child_id"));
    ((parent_id != child_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 117, __func__, "parent_id != child_id"));
    pheap_node_t *c = ph_get_node(heap, child_id);
    c->parent = parent_id;
    if (!n->child) {
        n->child = child_id;
    } else {
        c->sibling = n->child;
        n->child = child_id;
    }
}
static pheap_node_id_t ph_merge_nodes(pheap_t *heap, pheap_node_id_t a, pheap_node_id_t b) {
    if (!a) return b;
    if (!b) return a;
    if (heap->comparator(heap->user_data, a, b)) {
        ph_add_child_node(heap, a, b);
        return a;
    } else {
        ph_add_child_node(heap, b, a);
        return b;
    }
}
static inline pheap_node_id_t ph_new_node(pheap_t *heap) {
    if (!heap->free_head_id) return 0;
    pheap_node_id_t id = heap->free_head_id;
    pheap_node_t *hn = ph_get_node(heap, id);
    heap->free_head_id = hn->sibling;
    if (!heap->free_head_id) heap->free_tail_id = 0;
    hn->child = hn->sibling = hn->parent = 0;
    return id;
}
static inline pheap_node_id_t ph_insert_node(pheap_t *heap, pheap_node_id_t id) {
    ((id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 171, __func__, "id"));
    pheap_node_t *hn = ph_get_node(heap, id);
    hn->child = hn->sibling = hn->parent = 0;
    heap->root_id = ph_merge_nodes(heap, heap->root_id, id);
    return heap->root_id;
}
static inline pheap_node_id_t ph_peek_head(pheap_t *heap) {
    return heap->root_id;
}
pheap_node_id_t ph_remove_head(pheap_t *heap, _Bool free);
static inline pheap_node_id_t ph_remove_and_free_head(pheap_t *heap) {
    return ph_remove_head(heap, 1);
}
_Bool ph_remove_and_free_node(pheap_t *heap, pheap_node_id_t id);
static inline _Bool ph_contains_node(pheap_t *heap, pheap_node_id_t id) {
    return id == heap->root_id || ph_get_node(heap, id)->parent;
}
static inline void ph_free_node(pheap_t *heap, pheap_node_id_t id) {
    ((id && !ph_contains_node(heap, id)) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 258, __func__, "id && !ph_contains_node(heap, id)"));
    if (heap->free_tail_id) {
        ph_get_node(heap, heap->free_tail_id)->sibling = id;
    }
    if (!heap->free_head_id) {
        ((!heap->free_tail_id) ? (void)0 : __assert_func ("/Users/gonzalo/.pico-sdk/sdk/2.2.0/src/common/pico_util/include/pico/util/pheap.h", 263, __func__, "!heap->free_tail_id"));
        heap->free_head_id = id;
    }
    heap->free_tail_id = id;
}
void ph_dump(pheap_t *heap, void (*dump_key)(pheap_node_id_t id, void *user_data), void *user_data);
void ph_post_alloc_init(pheap_t *heap, uint max_nodes, pheap_comparator comparator, void *user_data);
#define PHEAP_DEFINE_STATIC(name,_max_nodes) static_assert(_max_nodes && _max_nodes < (1u << (8 * sizeof(pheap_node_id_t))), ""); static pheap_node_t name ## _nodes[_max_nodes]; static pheap_t name = { .nodes = name ## _nodes, .max_nodes = _max_nodes };
#define _PICO_UTIL_QUEUE_H 
#define PICO_QUEUE_MAX_LEVEL 0
typedef struct {
    lock_core_t core;
    uint8_t *data;
    uint16_t wptr;
    uint16_t rptr;
    uint16_t element_size;
    uint16_t element_count;
} queue_t;
void queue_init_with_spinlock(queue_t *q, uint element_size, uint element_count, uint spinlock_num);
static inline void queue_init(queue_t *q, uint element_size, uint element_count) {
    queue_init_with_spinlock(q, element_size, element_count, next_striped_spin_lock_num());
}
void queue_free(queue_t *q);
static inline uint queue_get_level_unsafe(queue_t *q) {
    int32_t rc = (int32_t)q->wptr - (int32_t)q->rptr;
    if (rc < 0) {
        rc += q->element_count + 1;
    }
    return (uint)rc;
}
static inline uint queue_get_level(queue_t *q) {
    uint32_t save = spin_lock_blocking(q->core.spin_lock);
    uint level = queue_get_level_unsafe(q);
    spin_unlock(q->core.spin_lock, save);
    return level;
}
static inline _Bool queue_is_empty(queue_t *q) {
    return queue_get_level(q) == 0;
}
static inline _Bool queue_is_full(queue_t *q) {
    return queue_get_level(q) == q->element_count;
}
_Bool queue_try_add(queue_t *q, const void *data);
_Bool queue_try_remove(queue_t *q, void *data);
_Bool queue_try_peek(queue_t *q, void *data);
void queue_add_blocking(queue_t *q, const void *data);
void queue_remove_blocking(queue_t *q, void *data);
void queue_peek_blocking(queue_t *q, void *data);
#define _PICO_STDIO_USB_RESET_INTERFACE_H 
#define _PICO_USB_RESET_INTERFACE_H 
#define RESET_INTERFACE_SUBCLASS 0x00
#define RESET_INTERFACE_PROTOCOL 0x01
#define RESET_REQUEST_BOOTSEL 0x01
#define RESET_REQUEST_FLASH 0x02
#define _PICO_STDIO_USB_TUSB_CONFIG_H 
#define CFG_TUSB_RHPORT0_MODE (OPT_MODE_DEVICE)
#define CFG_TUD_CDC (1)
#define CFG_TUD_CDC_RX_BUFSIZE (TUD_OPT_HIGH_SPEED ? 512 : 64)
#define CFG_TUD_CDC_TX_BUFSIZE (TUD_OPT_HIGH_SPEED ? 512 : 64)
#define CFG_TUD_CDC_EP_BUFSIZE (TUD_OPT_HIGH_SPEED ? 512 : 64)
#define CFG_TUD_VENDOR (1)
#define CFG_TUD_VENDOR_RX_BUFSIZE (256)
#define CFG_TUD_VENDOR_TX_BUFSIZE (256)
#define _HARDWARE_STRUCTS_IO_QSPI_H 
#define _HARDWARE_REGS_IO_QSPI_H 
#define IO_QSPI_USBPHY_DP_STATUS_OFFSET 0x00000000u
#define IO_QSPI_USBPHY_DP_STATUS_BITS 0x04022200u
#define IO_QSPI_USBPHY_DP_STATUS_RESET 0x00000000u
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_USBPHY_DP_CTRL_OFFSET 0x00000004u
#define IO_QSPI_USBPHY_DP_CTRL_BITS 0x3003f01fu
#define IO_QSPI_USBPHY_DP_CTRL_RESET 0x0000001fu
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_MSB 17u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_LSB 16u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_MSB 15u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_LSB 14u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_UART1_TX 0x02u
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_SIOB_PROC_56 0x05u
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_USBPHY_DM_STATUS_OFFSET 0x00000008u
#define IO_QSPI_USBPHY_DM_STATUS_BITS 0x04022200u
#define IO_QSPI_USBPHY_DM_STATUS_RESET 0x00000000u
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_USBPHY_DM_CTRL_OFFSET 0x0000000cu
#define IO_QSPI_USBPHY_DM_CTRL_BITS 0x3003f01fu
#define IO_QSPI_USBPHY_DM_CTRL_RESET 0x0000001fu
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_MSB 17u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_LSB 16u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_MSB 15u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_LSB 14u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_UART1_RX 0x02u
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_SIOB_PROC_57 0x05u
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OFFSET 0x00000010u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_BITS 0x04022200u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_RESET 0x00000000u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OFFSET 0x00000014u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_BITS 0x3003f01fu
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_RESET 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_MSB 17u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_LSB 16u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_MSB 15u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_LSB 14u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_XIP_SCLK 0x00u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_UART1_CTS 0x02u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_SIOB_PROC_58 0x05u
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_UART1_TX 0x0bu
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OFFSET 0x00000018u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_BITS 0x04022200u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_RESET 0x00000000u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OFFSET 0x0000001cu
#define IO_QSPI_GPIO_QSPI_SS_CTRL_BITS 0x3003f01fu
#define IO_QSPI_GPIO_QSPI_SS_CTRL_RESET 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_MSB 17u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_LSB 16u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_MSB 15u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_LSB 14u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_XIP_SS_N_0 0x00u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_UART1_RTS 0x02u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_SIOB_PROC_59 0x05u
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_UART1_RX 0x0bu
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OFFSET 0x00000020u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_BITS 0x04022200u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_RESET 0x00000000u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OFFSET 0x00000024u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_BITS 0x3003f01fu
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_RESET 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_ACCESS "RW"
