gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_LSB 16u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_MSB 15u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_LSB 14u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_XIP_SD0 0x00u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_UART0_TX 0x02u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_I2C0_SDA 0x03u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_SIOB_PROC_60 0x05u
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OFFSET 0x00000028u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_BITS 0x04022200u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_RESET 0x00000000u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OFFSET 0x0000002cu
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_BITS 0x3003f01fu
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_RESET 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_LSB 16u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_MSB 15u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_LSB 14u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_XIP_SD1 0x00u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_UART0_RX 0x02u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_I2C0_SCL 0x03u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_SIOB_PROC_61 0x05u
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OFFSET 0x00000030u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_BITS 0x04022200u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_RESET 0x00000000u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OFFSET 0x00000034u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_BITS 0x3003f01fu
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_RESET 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_LSB 16u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_MSB 15u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_LSB 14u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_XIP_SD2 0x00u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_UART0_CTS 0x02u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_I2C1_SDA 0x03u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_SIOB_PROC_62 0x05u
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_UART0_TX 0x0bu
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OFFSET 0x00000038u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_BITS 0x04022200u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_RESET 0x00000000u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_BITS 0x04000000u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_MSB 26u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_LSB 26u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_BITS 0x00020000u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_LSB 17u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_BITS 0x00002000u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_LSB 13u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_BITS 0x00000200u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_MSB 9u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_LSB 9u
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_ACCESS "RO"
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OFFSET 0x0000003cu
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_BITS 0x3003f01fu
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_RESET 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_BITS 0x30000000u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_MSB 29u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_LSB 28u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_BITS 0x00030000u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_MSB 17u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_LSB 16u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_BITS 0x0000c000u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_MSB 15u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_LSB 14u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_DISABLE 0x2u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_ENABLE 0x3u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_RESET 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_BITS 0x00003000u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_MSB 13u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_LSB 12u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_NORMAL 0x0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_INVERT 0x1u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_LOW 0x2u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_HIGH 0x3u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_RESET 0x1fu
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_BITS 0x0000001fu
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_MSB 4u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_LSB 0u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_XIP_SD3 0x00u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_UART0_RTS 0x02u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_I2C1_SCL 0x03u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_SIOB_PROC_63 0x05u
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_UART0_RX 0x0bu
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_NULL 0x1fu
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_OFFSET 0x00000200u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_BITS 0x000000ffu
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_RESET 0x00000000u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_BITS 0x00000080u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_MSB 7u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_LSB 7u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_BITS 0x00000040u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_MSB 6u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_LSB 6u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_BITS 0x00000020u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_MSB 5u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_LSB 5u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_BITS 0x00000010u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_MSB 4u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_LSB 4u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_BITS 0x00000008u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_MSB 3u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_LSB 3u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_BITS 0x00000004u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_MSB 2u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_LSB 2u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_BITS 0x00000002u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_MSB 1u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_LSB 1u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_BITS 0x00000001u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_MSB 0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_LSB 0u
#define IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_OFFSET 0x00000204u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_BITS 0x000000ffu
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_RESET 0x00000000u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_BITS 0x00000080u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_MSB 7u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_LSB 7u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_BITS 0x00000040u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_MSB 6u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_LSB 6u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_BITS 0x00000020u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_MSB 5u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_LSB 5u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_BITS 0x00000010u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_MSB 4u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_LSB 4u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_BITS 0x00000008u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_MSB 3u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_LSB 3u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_BITS 0x00000004u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_MSB 2u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_LSB 2u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_BITS 0x00000002u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_MSB 1u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_LSB 1u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_BITS 0x00000001u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_MSB 0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_LSB 0u
#define IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_OFFSET 0x00000208u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_BITS 0x000000ffu
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_RESET 0x00000000u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_BITS 0x00000080u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_MSB 7u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_LSB 7u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_BITS 0x00000040u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_MSB 6u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_LSB 6u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_BITS 0x00000020u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_MSB 5u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_LSB 5u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_BITS 0x00000010u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_MSB 4u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_LSB 4u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_BITS 0x00000008u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_MSB 3u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_LSB 3u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_BITS 0x00000004u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_MSB 2u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_LSB 2u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_BITS 0x00000002u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_MSB 1u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_LSB 1u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_BITS 0x00000001u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_MSB 0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_LSB 0u
#define IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_OFFSET 0x0000020cu
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_BITS 0x000000ffu
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_RESET 0x00000000u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_BITS 0x00000080u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_MSB 7u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_LSB 7u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_BITS 0x00000040u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_MSB 6u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_LSB 6u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_RESET 0x0u
