gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_BITS 0x00000020u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_MSB 5u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_LSB 5u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_BITS 0x00000010u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_MSB 4u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_LSB 4u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_BITS 0x00000008u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_MSB 3u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_LSB 3u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_BITS 0x00000004u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_MSB 2u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_LSB 2u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_BITS 0x00000002u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_MSB 1u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_LSB 1u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_BITS 0x00000001u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_MSB 0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_LSB 0u
#define IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_OFFSET 0x00000210u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_BITS 0x000000ffu
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_RESET 0x00000000u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_BITS 0x00000080u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_MSB 7u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_LSB 7u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_BITS 0x00000040u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_MSB 6u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_LSB 6u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_BITS 0x00000020u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_MSB 5u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_LSB 5u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_BITS 0x00000010u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_MSB 4u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_LSB 4u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_BITS 0x00000008u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_MSB 3u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_LSB 3u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_BITS 0x00000004u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_MSB 2u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_LSB 2u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_BITS 0x00000002u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_MSB 1u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_LSB 1u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_BITS 0x00000001u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_MSB 0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_LSB 0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_OFFSET 0x00000214u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_BITS 0x000000ffu
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_RESET 0x00000000u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_BITS 0x00000080u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_MSB 7u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_LSB 7u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_BITS 0x00000040u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_MSB 6u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_LSB 6u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_BITS 0x00000020u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_MSB 5u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_LSB 5u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_BITS 0x00000010u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_MSB 4u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_LSB 4u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_BITS 0x00000008u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_MSB 3u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_LSB 3u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_BITS 0x00000004u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_MSB 2u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_LSB 2u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_BITS 0x00000002u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_MSB 1u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_LSB 1u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_ACCESS "RO"
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_RESET 0x0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_BITS 0x00000001u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_MSB 0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_LSB 0u
#define IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_ACCESS "RO"
#define IO_QSPI_INTR_OFFSET 0x00000218u
#define IO_QSPI_INTR_BITS 0xffffffffu
#define IO_QSPI_INTR_RESET 0x00000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_BITS 0x80000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_MSB 31u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_LSB 31u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_BITS 0x40000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_MSB 30u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_LSB 30u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_BITS 0x20000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_MSB 29u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_LSB 29u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_BITS 0x10000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_MSB 28u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_LSB 28u
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_BITS 0x08000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_MSB 27u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_LSB 27u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_BITS 0x04000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_MSB 26u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_LSB 26u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_BITS 0x02000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_MSB 25u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_LSB 25u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_BITS 0x01000000u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_MSB 24u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_LSB 24u
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_BITS 0x00800000u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_MSB 23u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_LSB 23u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_BITS 0x00400000u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_MSB 22u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_LSB 22u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_BITS 0x00200000u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_MSB 21u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_LSB 21u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_BITS 0x00100000u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_MSB 20u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_LSB 20u
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_BITS 0x00080000u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_MSB 19u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_LSB 19u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_BITS 0x00040000u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_MSB 18u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_LSB 18u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_BITS 0x00020000u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_MSB 17u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_LSB 17u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_BITS 0x00010000u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_MSB 16u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_LSB 16u
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_BITS 0x00008000u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_MSB 15u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_LSB 15u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_BITS 0x00004000u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_MSB 14u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_LSB 14u
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_BITS 0x00002000u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_MSB 13u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_LSB 13u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_BITS 0x00001000u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_MSB 12u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_LSB 12u
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_BITS 0x00000800u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_MSB 11u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_LSB 11u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_BITS 0x00000400u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_MSB 10u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_LSB 10u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_BITS 0x00000200u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_MSB 9u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_LSB 9u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_BITS 0x00000100u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_MSB 8u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_LSB 8u
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_USBPHY_DM_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_HIGH_BITS 0x00000080u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_HIGH_MSB 7u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_HIGH_LSB 7u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_USBPHY_DM_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_LOW_BITS 0x00000040u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_LOW_MSB 6u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_LOW_LSB 6u
#define IO_QSPI_INTR_USBPHY_DM_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_HIGH_BITS 0x00000020u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_HIGH_MSB 5u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_HIGH_LSB 5u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_LOW_BITS 0x00000010u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_LOW_MSB 4u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_LOW_LSB 4u
#define IO_QSPI_INTR_USBPHY_DM_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_INTR_USBPHY_DP_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_HIGH_BITS 0x00000008u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_HIGH_MSB 3u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_HIGH_LSB 3u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_HIGH_ACCESS "WC"
#define IO_QSPI_INTR_USBPHY_DP_EDGE_LOW_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_LOW_BITS 0x00000004u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_LOW_MSB 2u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_LOW_LSB 2u
#define IO_QSPI_INTR_USBPHY_DP_EDGE_LOW_ACCESS "WC"
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_HIGH_BITS 0x00000002u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_HIGH_MSB 1u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_HIGH_LSB 1u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_HIGH_ACCESS "RO"
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_LOW_BITS 0x00000001u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_LOW_MSB 0u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_LOW_LSB 0u
#define IO_QSPI_INTR_USBPHY_DP_LEVEL_LOW_ACCESS "RO"
#define IO_QSPI_PROC0_INTE_OFFSET 0x0000021cu
#define IO_QSPI_PROC0_INTE_BITS 0xffffffffu
#define IO_QSPI_PROC0_INTE_RESET 0x00000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_BITS 0x80000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_MSB 31u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_LSB 31u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_BITS 0x40000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_MSB 30u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_LSB 30u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_BITS 0x20000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_MSB 29u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_LSB 29u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_BITS 0x10000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_MSB 28u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_LSB 28u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_BITS 0x08000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_MSB 27u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_LSB 27u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_BITS 0x04000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_MSB 26u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_LSB 26u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_BITS 0x02000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_MSB 25u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_LSB 25u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_BITS 0x01000000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_MSB 24u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_LSB 24u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_BITS 0x00800000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_MSB 23u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_LSB 23u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_BITS 0x00400000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_MSB 22u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_LSB 22u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_BITS 0x00200000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_MSB 21u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_LSB 21u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_BITS 0x00100000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_MSB 20u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_LSB 20u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_BITS 0x00080000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_MSB 19u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_LSB 19u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_BITS 0x00040000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_MSB 18u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_LSB 18u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_BITS 0x00020000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_MSB 17u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_LSB 17u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_BITS 0x00010000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_MSB 16u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_LSB 16u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_BITS 0x00008000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_MSB 15u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_LSB 15u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_BITS 0x00004000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_MSB 14u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_LSB 14u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_BITS 0x00002000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_MSB 13u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_LSB 13u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_BITS 0x00001000u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_MSB 12u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_LSB 12u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_BITS 0x00000800u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_MSB 11u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_LSB 11u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_ACCESS "RW"
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_RESET 0x0u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_BITS 0x00000400u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_MSB 10u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_LSB 10u
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_ACCESS "RW"
