gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef struct {
   
    io_ro_32 status;
   
    io_rw_32 ctrl;
} io_qspi_status_ctrl_hw_t;
typedef struct {
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} io_qspi_irq_ctrl_hw_t;
typedef struct {
   
    io_ro_32 usbphy_dp_status;
   
    io_rw_32 usbphy_dp_ctrl;
   
    io_ro_32 usbphy_dm_status;
   
    io_rw_32 usbphy_dm_ctrl;
    io_qspi_status_ctrl_hw_t io[6];
    uint32_t _pad0[112];
   
    io_ro_32 irqsummary_proc0_secure;
   
    io_ro_32 irqsummary_proc0_nonsecure;
   
    io_ro_32 irqsummary_proc1_secure;
   
    io_ro_32 irqsummary_proc1_nonsecure;
   
    io_ro_32 irqsummary_dormant_wake_secure;
   
    io_ro_32 irqsummary_dormant_wake_nonsecure;
   
    io_rw_32 intr;
    union {
        struct {
            io_qspi_irq_ctrl_hw_t proc0_irq_ctrl;
            io_qspi_irq_ctrl_hw_t proc1_irq_ctrl;
            io_qspi_irq_ctrl_hw_t dormant_wake_irq_ctrl;
        };
        io_qspi_irq_ctrl_hw_t irq_ctrl[3];
    };
} io_qspi_hw_t;
static io_qspi_hw_t * const io_qspi_hw = (io_qspi_hw_t *)IO_QSPI_BASE; // ORIGINAL: #define io_qspi_hw ((io_qspi_hw_t *)IO_QSPI_BASE)
_Static_assert(sizeof (io_qspi_hw_t) == 0x0240, "");
#define _HARDWARE_STRUCTS_BUSCTRL_H 
#define _HARDWARE_REGS_BUSCTRL_H 
#define BUSCTRL_BUS_PRIORITY_OFFSET 0x00000000u
#define BUSCTRL_BUS_PRIORITY_BITS 0x00001111u
#define BUSCTRL_BUS_PRIORITY_RESET 0x00000000u
#define BUSCTRL_BUS_PRIORITY_DMA_W_RESET 0x0u
#define BUSCTRL_BUS_PRIORITY_DMA_W_BITS 0x00001000u
#define BUSCTRL_BUS_PRIORITY_DMA_W_MSB 12u
#define BUSCTRL_BUS_PRIORITY_DMA_W_LSB 12u
#define BUSCTRL_BUS_PRIORITY_DMA_W_ACCESS "RW"
#define BUSCTRL_BUS_PRIORITY_DMA_R_RESET 0x0u
#define BUSCTRL_BUS_PRIORITY_DMA_R_BITS 0x00000100u
#define BUSCTRL_BUS_PRIORITY_DMA_R_MSB 8u
#define BUSCTRL_BUS_PRIORITY_DMA_R_LSB 8u
#define BUSCTRL_BUS_PRIORITY_DMA_R_ACCESS "RW"
#define BUSCTRL_BUS_PRIORITY_PROC1_RESET 0x0u
#define BUSCTRL_BUS_PRIORITY_PROC1_BITS 0x00000010u
#define BUSCTRL_BUS_PRIORITY_PROC1_MSB 4u
#define BUSCTRL_BUS_PRIORITY_PROC1_LSB 4u
#define BUSCTRL_BUS_PRIORITY_PROC1_ACCESS "RW"
#define BUSCTRL_BUS_PRIORITY_PROC0_RESET 0x0u
#define BUSCTRL_BUS_PRIORITY_PROC0_BITS 0x00000001u
#define BUSCTRL_BUS_PRIORITY_PROC0_MSB 0u
#define BUSCTRL_BUS_PRIORITY_PROC0_LSB 0u
#define BUSCTRL_BUS_PRIORITY_PROC0_ACCESS "RW"
#define BUSCTRL_BUS_PRIORITY_ACK_OFFSET 0x00000004u
#define BUSCTRL_BUS_PRIORITY_ACK_BITS 0x00000001u
#define BUSCTRL_BUS_PRIORITY_ACK_RESET 0x00000000u
#define BUSCTRL_BUS_PRIORITY_ACK_MSB 0u
#define BUSCTRL_BUS_PRIORITY_ACK_LSB 0u
#define BUSCTRL_BUS_PRIORITY_ACK_ACCESS "RO"
#define BUSCTRL_PERFCTR_EN_OFFSET 0x00000008u
#define BUSCTRL_PERFCTR_EN_BITS 0x00000001u
#define BUSCTRL_PERFCTR_EN_RESET 0x00000000u
#define BUSCTRL_PERFCTR_EN_MSB 0u
#define BUSCTRL_PERFCTR_EN_LSB 0u
#define BUSCTRL_PERFCTR_EN_ACCESS "RW"
#define BUSCTRL_PERFCTR0_OFFSET 0x0000000cu
#define BUSCTRL_PERFCTR0_BITS 0x00ffffffu
#define BUSCTRL_PERFCTR0_RESET 0x00000000u
#define BUSCTRL_PERFCTR0_MSB 23u
#define BUSCTRL_PERFCTR0_LSB 0u
#define BUSCTRL_PERFCTR0_ACCESS "WC"
#define BUSCTRL_PERFSEL0_OFFSET 0x00000010u
#define BUSCTRL_PERFSEL0_BITS 0x0000007fu
#define BUSCTRL_PERFSEL0_RESET 0x0000001fu
#define BUSCTRL_PERFSEL0_MSB 6u
#define BUSCTRL_PERFSEL0_LSB 0u
#define BUSCTRL_PERFSEL0_ACCESS "RW"
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC1_STALL_UPSTREAM 0x00u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC1_STALL_DOWNSTREAM 0x01u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC1_ACCESS_CONTESTED 0x02u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC1_ACCESS 0x03u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC0_STALL_UPSTREAM 0x04u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC0_STALL_DOWNSTREAM 0x05u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC0_ACCESS_CONTESTED 0x06u
#define BUSCTRL_PERFSEL0_VALUE_SIOB_PROC0_ACCESS 0x07u
#define BUSCTRL_PERFSEL0_VALUE_APB_STALL_UPSTREAM 0x08u
#define BUSCTRL_PERFSEL0_VALUE_APB_STALL_DOWNSTREAM 0x09u
#define BUSCTRL_PERFSEL0_VALUE_APB_ACCESS_CONTESTED 0x0au
#define BUSCTRL_PERFSEL0_VALUE_APB_ACCESS 0x0bu
#define BUSCTRL_PERFSEL0_VALUE_FASTPERI_STALL_UPSTREAM 0x0cu
#define BUSCTRL_PERFSEL0_VALUE_FASTPERI_STALL_DOWNSTREAM 0x0du
#define BUSCTRL_PERFSEL0_VALUE_FASTPERI_ACCESS_CONTESTED 0x0eu
#define BUSCTRL_PERFSEL0_VALUE_FASTPERI_ACCESS 0x0fu
#define BUSCTRL_PERFSEL0_VALUE_SRAM9_STALL_UPSTREAM 0x10u
#define BUSCTRL_PERFSEL0_VALUE_SRAM9_STALL_DOWNSTREAM 0x11u
#define BUSCTRL_PERFSEL0_VALUE_SRAM9_ACCESS_CONTESTED 0x12u
#define BUSCTRL_PERFSEL0_VALUE_SRAM9_ACCESS 0x13u
#define BUSCTRL_PERFSEL0_VALUE_SRAM8_STALL_UPSTREAM 0x14u
#define BUSCTRL_PERFSEL0_VALUE_SRAM8_STALL_DOWNSTREAM 0x15u
#define BUSCTRL_PERFSEL0_VALUE_SRAM8_ACCESS_CONTESTED 0x16u
#define BUSCTRL_PERFSEL0_VALUE_SRAM8_ACCESS 0x17u
#define BUSCTRL_PERFSEL0_VALUE_SRAM7_STALL_UPSTREAM 0x18u
#define BUSCTRL_PERFSEL0_VALUE_SRAM7_STALL_DOWNSTREAM 0x19u
#define BUSCTRL_PERFSEL0_VALUE_SRAM7_ACCESS_CONTESTED 0x1au
#define BUSCTRL_PERFSEL0_VALUE_SRAM7_ACCESS 0x1bu
#define BUSCTRL_PERFSEL0_VALUE_SRAM6_STALL_UPSTREAM 0x1cu
#define BUSCTRL_PERFSEL0_VALUE_SRAM6_STALL_DOWNSTREAM 0x1du
#define BUSCTRL_PERFSEL0_VALUE_SRAM6_ACCESS_CONTESTED 0x1eu
#define BUSCTRL_PERFSEL0_VALUE_SRAM6_ACCESS 0x1fu
#define BUSCTRL_PERFSEL0_VALUE_SRAM5_STALL_UPSTREAM 0x20u
#define BUSCTRL_PERFSEL0_VALUE_SRAM5_STALL_DOWNSTREAM 0x21u
#define BUSCTRL_PERFSEL0_VALUE_SRAM5_ACCESS_CONTESTED 0x22u
#define BUSCTRL_PERFSEL0_VALUE_SRAM5_ACCESS 0x23u
#define BUSCTRL_PERFSEL0_VALUE_SRAM4_STALL_UPSTREAM 0x24u
#define BUSCTRL_PERFSEL0_VALUE_SRAM4_STALL_DOWNSTREAM 0x25u
#define BUSCTRL_PERFSEL0_VALUE_SRAM4_ACCESS_CONTESTED 0x26u
#define BUSCTRL_PERFSEL0_VALUE_SRAM4_ACCESS 0x27u
#define BUSCTRL_PERFSEL0_VALUE_SRAM3_STALL_UPSTREAM 0x28u
#define BUSCTRL_PERFSEL0_VALUE_SRAM3_STALL_DOWNSTREAM 0x29u
#define BUSCTRL_PERFSEL0_VALUE_SRAM3_ACCESS_CONTESTED 0x2au
#define BUSCTRL_PERFSEL0_VALUE_SRAM3_ACCESS 0x2bu
#define BUSCTRL_PERFSEL0_VALUE_SRAM2_STALL_UPSTREAM 0x2cu
#define BUSCTRL_PERFSEL0_VALUE_SRAM2_STALL_DOWNSTREAM 0x2du
#define BUSCTRL_PERFSEL0_VALUE_SRAM2_ACCESS_CONTESTED 0x2eu
#define BUSCTRL_PERFSEL0_VALUE_SRAM2_ACCESS 0x2fu
#define BUSCTRL_PERFSEL0_VALUE_SRAM1_STALL_UPSTREAM 0x30u
#define BUSCTRL_PERFSEL0_VALUE_SRAM1_STALL_DOWNSTREAM 0x31u
#define BUSCTRL_PERFSEL0_VALUE_SRAM1_ACCESS_CONTESTED 0x32u
#define BUSCTRL_PERFSEL0_VALUE_SRAM1_ACCESS 0x33u
#define BUSCTRL_PERFSEL0_VALUE_SRAM0_STALL_UPSTREAM 0x34u
#define BUSCTRL_PERFSEL0_VALUE_SRAM0_STALL_DOWNSTREAM 0x35u
#define BUSCTRL_PERFSEL0_VALUE_SRAM0_ACCESS_CONTESTED 0x36u
#define BUSCTRL_PERFSEL0_VALUE_SRAM0_ACCESS 0x37u
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN1_STALL_UPSTREAM 0x38u
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN1_STALL_DOWNSTREAM 0x39u
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN1_ACCESS_CONTESTED 0x3au
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN1_ACCESS 0x3bu
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN0_STALL_UPSTREAM 0x3cu
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN0_STALL_DOWNSTREAM 0x3du
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN0_ACCESS_CONTESTED 0x3eu
#define BUSCTRL_PERFSEL0_VALUE_XIP_MAIN0_ACCESS 0x3fu
#define BUSCTRL_PERFSEL0_VALUE_ROM_STALL_UPSTREAM 0x40u
#define BUSCTRL_PERFSEL0_VALUE_ROM_STALL_DOWNSTREAM 0x41u
#define BUSCTRL_PERFSEL0_VALUE_ROM_ACCESS_CONTESTED 0x42u
#define BUSCTRL_PERFSEL0_VALUE_ROM_ACCESS 0x43u
#define BUSCTRL_PERFCTR1_OFFSET 0x00000014u
#define BUSCTRL_PERFCTR1_BITS 0x00ffffffu
#define BUSCTRL_PERFCTR1_RESET 0x00000000u
#define BUSCTRL_PERFCTR1_MSB 23u
#define BUSCTRL_PERFCTR1_LSB 0u
#define BUSCTRL_PERFCTR1_ACCESS "WC"
#define BUSCTRL_PERFSEL1_OFFSET 0x00000018u
#define BUSCTRL_PERFSEL1_BITS 0x0000007fu
#define BUSCTRL_PERFSEL1_RESET 0x0000001fu
#define BUSCTRL_PERFSEL1_MSB 6u
#define BUSCTRL_PERFSEL1_LSB 0u
#define BUSCTRL_PERFSEL1_ACCESS "RW"
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC1_STALL_UPSTREAM 0x00u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC1_STALL_DOWNSTREAM 0x01u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC1_ACCESS_CONTESTED 0x02u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC1_ACCESS 0x03u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC0_STALL_UPSTREAM 0x04u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC0_STALL_DOWNSTREAM 0x05u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC0_ACCESS_CONTESTED 0x06u
#define BUSCTRL_PERFSEL1_VALUE_SIOB_PROC0_ACCESS 0x07u
#define BUSCTRL_PERFSEL1_VALUE_APB_STALL_UPSTREAM 0x08u
#define BUSCTRL_PERFSEL1_VALUE_APB_STALL_DOWNSTREAM 0x09u
#define BUSCTRL_PERFSEL1_VALUE_APB_ACCESS_CONTESTED 0x0au
#define BUSCTRL_PERFSEL1_VALUE_APB_ACCESS 0x0bu
#define BUSCTRL_PERFSEL1_VALUE_FASTPERI_STALL_UPSTREAM 0x0cu
#define BUSCTRL_PERFSEL1_VALUE_FASTPERI_STALL_DOWNSTREAM 0x0du
#define BUSCTRL_PERFSEL1_VALUE_FASTPERI_ACCESS_CONTESTED 0x0eu
#define BUSCTRL_PERFSEL1_VALUE_FASTPERI_ACCESS 0x0fu
#define BUSCTRL_PERFSEL1_VALUE_SRAM9_STALL_UPSTREAM 0x10u
#define BUSCTRL_PERFSEL1_VALUE_SRAM9_STALL_DOWNSTREAM 0x11u
#define BUSCTRL_PERFSEL1_VALUE_SRAM9_ACCESS_CONTESTED 0x12u
#define BUSCTRL_PERFSEL1_VALUE_SRAM9_ACCESS 0x13u
#define BUSCTRL_PERFSEL1_VALUE_SRAM8_STALL_UPSTREAM 0x14u
#define BUSCTRL_PERFSEL1_VALUE_SRAM8_STALL_DOWNSTREAM 0x15u
#define BUSCTRL_PERFSEL1_VALUE_SRAM8_ACCESS_CONTESTED 0x16u
#define BUSCTRL_PERFSEL1_VALUE_SRAM8_ACCESS 0x17u
#define BUSCTRL_PERFSEL1_VALUE_SRAM7_STALL_UPSTREAM 0x18u
#define BUSCTRL_PERFSEL1_VALUE_SRAM7_STALL_DOWNSTREAM 0x19u
#define BUSCTRL_PERFSEL1_VALUE_SRAM7_ACCESS_CONTESTED 0x1au
#define BUSCTRL_PERFSEL1_VALUE_SRAM7_ACCESS 0x1bu
#define BUSCTRL_PERFSEL1_VALUE_SRAM6_STALL_UPSTREAM 0x1cu
#define BUSCTRL_PERFSEL1_VALUE_SRAM6_STALL_DOWNSTREAM 0x1du
#define BUSCTRL_PERFSEL1_VALUE_SRAM6_ACCESS_CONTESTED 0x1eu
#define BUSCTRL_PERFSEL1_VALUE_SRAM6_ACCESS 0x1fu
#define BUSCTRL_PERFSEL1_VALUE_SRAM5_STALL_UPSTREAM 0x20u
#define BUSCTRL_PERFSEL1_VALUE_SRAM5_STALL_DOWNSTREAM 0x21u
#define BUSCTRL_PERFSEL1_VALUE_SRAM5_ACCESS_CONTESTED 0x22u
#define BUSCTRL_PERFSEL1_VALUE_SRAM5_ACCESS 0x23u
#define BUSCTRL_PERFSEL1_VALUE_SRAM4_STALL_UPSTREAM 0x24u
#define BUSCTRL_PERFSEL1_VALUE_SRAM4_STALL_DOWNSTREAM 0x25u
#define BUSCTRL_PERFSEL1_VALUE_SRAM4_ACCESS_CONTESTED 0x26u
#define BUSCTRL_PERFSEL1_VALUE_SRAM4_ACCESS 0x27u
#define BUSCTRL_PERFSEL1_VALUE_SRAM3_STALL_UPSTREAM 0x28u
#define BUSCTRL_PERFSEL1_VALUE_SRAM3_STALL_DOWNSTREAM 0x29u
#define BUSCTRL_PERFSEL1_VALUE_SRAM3_ACCESS_CONTESTED 0x2au
#define BUSCTRL_PERFSEL1_VALUE_SRAM3_ACCESS 0x2bu
#define BUSCTRL_PERFSEL1_VALUE_SRAM2_STALL_UPSTREAM 0x2cu
#define BUSCTRL_PERFSEL1_VALUE_SRAM2_STALL_DOWNSTREAM 0x2du
#define BUSCTRL_PERFSEL1_VALUE_SRAM2_ACCESS_CONTESTED 0x2eu
#define BUSCTRL_PERFSEL1_VALUE_SRAM2_ACCESS 0x2fu
#define BUSCTRL_PERFSEL1_VALUE_SRAM1_STALL_UPSTREAM 0x30u
#define BUSCTRL_PERFSEL1_VALUE_SRAM1_STALL_DOWNSTREAM 0x31u
#define BUSCTRL_PERFSEL1_VALUE_SRAM1_ACCESS_CONTESTED 0x32u
#define BUSCTRL_PERFSEL1_VALUE_SRAM1_ACCESS 0x33u
#define BUSCTRL_PERFSEL1_VALUE_SRAM0_STALL_UPSTREAM 0x34u
#define BUSCTRL_PERFSEL1_VALUE_SRAM0_STALL_DOWNSTREAM 0x35u
#define BUSCTRL_PERFSEL1_VALUE_SRAM0_ACCESS_CONTESTED 0x36u
#define BUSCTRL_PERFSEL1_VALUE_SRAM0_ACCESS 0x37u
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN1_STALL_UPSTREAM 0x38u
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN1_STALL_DOWNSTREAM 0x39u
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN1_ACCESS_CONTESTED 0x3au
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN1_ACCESS 0x3bu
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN0_STALL_UPSTREAM 0x3cu
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN0_STALL_DOWNSTREAM 0x3du
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN0_ACCESS_CONTESTED 0x3eu
#define BUSCTRL_PERFSEL1_VALUE_XIP_MAIN0_ACCESS 0x3fu
#define BUSCTRL_PERFSEL1_VALUE_ROM_STALL_UPSTREAM 0x40u
#define BUSCTRL_PERFSEL1_VALUE_ROM_STALL_DOWNSTREAM 0x41u
#define BUSCTRL_PERFSEL1_VALUE_ROM_ACCESS_CONTESTED 0x42u
#define BUSCTRL_PERFSEL1_VALUE_ROM_ACCESS 0x43u
#define BUSCTRL_PERFCTR2_OFFSET 0x0000001cu
#define BUSCTRL_PERFCTR2_BITS 0x00ffffffu
#define BUSCTRL_PERFCTR2_RESET 0x00000000u
#define BUSCTRL_PERFCTR2_MSB 23u
#define BUSCTRL_PERFCTR2_LSB 0u
#define BUSCTRL_PERFCTR2_ACCESS "WC"
#define BUSCTRL_PERFSEL2_OFFSET 0x00000020u
#define BUSCTRL_PERFSEL2_BITS 0x0000007fu
#define BUSCTRL_PERFSEL2_RESET 0x0000001fu
#define BUSCTRL_PERFSEL2_MSB 6u
#define BUSCTRL_PERFSEL2_LSB 0u
#define BUSCTRL_PERFSEL2_ACCESS "RW"
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC1_STALL_UPSTREAM 0x00u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC1_STALL_DOWNSTREAM 0x01u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC1_ACCESS_CONTESTED 0x02u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC1_ACCESS 0x03u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC0_STALL_UPSTREAM 0x04u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC0_STALL_DOWNSTREAM 0x05u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC0_ACCESS_CONTESTED 0x06u
#define BUSCTRL_PERFSEL2_VALUE_SIOB_PROC0_ACCESS 0x07u
#define BUSCTRL_PERFSEL2_VALUE_APB_STALL_UPSTREAM 0x08u
#define BUSCTRL_PERFSEL2_VALUE_APB_STALL_DOWNSTREAM 0x09u
#define BUSCTRL_PERFSEL2_VALUE_APB_ACCESS_CONTESTED 0x0au
#define BUSCTRL_PERFSEL2_VALUE_APB_ACCESS 0x0bu
#define BUSCTRL_PERFSEL2_VALUE_FASTPERI_STALL_UPSTREAM 0x0cu
#define BUSCTRL_PERFSEL2_VALUE_FASTPERI_STALL_DOWNSTREAM 0x0du
#define BUSCTRL_PERFSEL2_VALUE_FASTPERI_ACCESS_CONTESTED 0x0eu
#define BUSCTRL_PERFSEL2_VALUE_FASTPERI_ACCESS 0x0fu
#define BUSCTRL_PERFSEL2_VALUE_SRAM9_STALL_UPSTREAM 0x10u
#define BUSCTRL_PERFSEL2_VALUE_SRAM9_STALL_DOWNSTREAM 0x11u
#define BUSCTRL_PERFSEL2_VALUE_SRAM9_ACCESS_CONTESTED 0x12u
#define BUSCTRL_PERFSEL2_VALUE_SRAM9_ACCESS 0x13u
#define BUSCTRL_PERFSEL2_VALUE_SRAM8_STALL_UPSTREAM 0x14u
#define BUSCTRL_PERFSEL2_VALUE_SRAM8_STALL_DOWNSTREAM 0x15u
#define BUSCTRL_PERFSEL2_VALUE_SRAM8_ACCESS_CONTESTED 0x16u
#define BUSCTRL_PERFSEL2_VALUE_SRAM8_ACCESS 0x17u
#define BUSCTRL_PERFSEL2_VALUE_SRAM7_STALL_UPSTREAM 0x18u
#define BUSCTRL_PERFSEL2_VALUE_SRAM7_STALL_DOWNSTREAM 0x19u
#define BUSCTRL_PERFSEL2_VALUE_SRAM7_ACCESS_CONTESTED 0x1au
#define BUSCTRL_PERFSEL2_VALUE_SRAM7_ACCESS 0x1bu
#define BUSCTRL_PERFSEL2_VALUE_SRAM6_STALL_UPSTREAM 0x1cu
#define BUSCTRL_PERFSEL2_VALUE_SRAM6_STALL_DOWNSTREAM 0x1du
#define BUSCTRL_PERFSEL2_VALUE_SRAM6_ACCESS_CONTESTED 0x1eu
#define BUSCTRL_PERFSEL2_VALUE_SRAM6_ACCESS 0x1fu
#define BUSCTRL_PERFSEL2_VALUE_SRAM5_STALL_UPSTREAM 0x20u
#define BUSCTRL_PERFSEL2_VALUE_SRAM5_STALL_DOWNSTREAM 0x21u
#define BUSCTRL_PERFSEL2_VALUE_SRAM5_ACCESS_CONTESTED 0x22u
#define BUSCTRL_PERFSEL2_VALUE_SRAM5_ACCESS 0x23u
#define BUSCTRL_PERFSEL2_VALUE_SRAM4_STALL_UPSTREAM 0x24u
#define BUSCTRL_PERFSEL2_VALUE_SRAM4_STALL_DOWNSTREAM 0x25u
#define BUSCTRL_PERFSEL2_VALUE_SRAM4_ACCESS_CONTESTED 0x26u
#define BUSCTRL_PERFSEL2_VALUE_SRAM4_ACCESS 0x27u
#define BUSCTRL_PERFSEL2_VALUE_SRAM3_STALL_UPSTREAM 0x28u
#define BUSCTRL_PERFSEL2_VALUE_SRAM3_STALL_DOWNSTREAM 0x29u
#define BUSCTRL_PERFSEL2_VALUE_SRAM3_ACCESS_CONTESTED 0x2au
#define BUSCTRL_PERFSEL2_VALUE_SRAM3_ACCESS 0x2bu
#define BUSCTRL_PERFSEL2_VALUE_SRAM2_STALL_UPSTREAM 0x2cu
#define BUSCTRL_PERFSEL2_VALUE_SRAM2_STALL_DOWNSTREAM 0x2du
#define BUSCTRL_PERFSEL2_VALUE_SRAM2_ACCESS_CONTESTED 0x2eu
#define BUSCTRL_PERFSEL2_VALUE_SRAM2_ACCESS 0x2fu
#define BUSCTRL_PERFSEL2_VALUE_SRAM1_STALL_UPSTREAM 0x30u
#define BUSCTRL_PERFSEL2_VALUE_SRAM1_STALL_DOWNSTREAM 0x31u
#define BUSCTRL_PERFSEL2_VALUE_SRAM1_ACCESS_CONTESTED 0x32u
#define BUSCTRL_PERFSEL2_VALUE_SRAM1_ACCESS 0x33u
#define BUSCTRL_PERFSEL2_VALUE_SRAM0_STALL_UPSTREAM 0x34u
#define BUSCTRL_PERFSEL2_VALUE_SRAM0_STALL_DOWNSTREAM 0x35u
#define BUSCTRL_PERFSEL2_VALUE_SRAM0_ACCESS_CONTESTED 0x36u
#define BUSCTRL_PERFSEL2_VALUE_SRAM0_ACCESS 0x37u
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN1_STALL_UPSTREAM 0x38u
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN1_STALL_DOWNSTREAM 0x39u
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN1_ACCESS_CONTESTED 0x3au
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN1_ACCESS 0x3bu
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN0_STALL_UPSTREAM 0x3cu
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN0_STALL_DOWNSTREAM 0x3du
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN0_ACCESS_CONTESTED 0x3eu
#define BUSCTRL_PERFSEL2_VALUE_XIP_MAIN0_ACCESS 0x3fu
#define BUSCTRL_PERFSEL2_VALUE_ROM_STALL_UPSTREAM 0x40u
#define BUSCTRL_PERFSEL2_VALUE_ROM_STALL_DOWNSTREAM 0x41u
#define BUSCTRL_PERFSEL2_VALUE_ROM_ACCESS_CONTESTED 0x42u
#define BUSCTRL_PERFSEL2_VALUE_ROM_ACCESS 0x43u
#define BUSCTRL_PERFCTR3_OFFSET 0x00000024u
#define BUSCTRL_PERFCTR3_BITS 0x00ffffffu
#define BUSCTRL_PERFCTR3_RESET 0x00000000u
#define BUSCTRL_PERFCTR3_MSB 23u
#define BUSCTRL_PERFCTR3_LSB 0u
#define BUSCTRL_PERFCTR3_ACCESS "WC"
#define BUSCTRL_PERFSEL3_OFFSET 0x00000028u
#define BUSCTRL_PERFSEL3_BITS 0x0000007fu
#define BUSCTRL_PERFSEL3_RESET 0x0000001fu
#define BUSCTRL_PERFSEL3_MSB 6u
#define BUSCTRL_PERFSEL3_LSB 0u
#define BUSCTRL_PERFSEL3_ACCESS "RW"
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC1_STALL_UPSTREAM 0x00u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC1_STALL_DOWNSTREAM 0x01u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC1_ACCESS_CONTESTED 0x02u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC1_ACCESS 0x03u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC0_STALL_UPSTREAM 0x04u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC0_STALL_DOWNSTREAM 0x05u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC0_ACCESS_CONTESTED 0x06u
#define BUSCTRL_PERFSEL3_VALUE_SIOB_PROC0_ACCESS 0x07u
#define BUSCTRL_PERFSEL3_VALUE_APB_STALL_UPSTREAM 0x08u
#define BUSCTRL_PERFSEL3_VALUE_APB_STALL_DOWNSTREAM 0x09u
#define BUSCTRL_PERFSEL3_VALUE_APB_ACCESS_CONTESTED 0x0au
#define BUSCTRL_PERFSEL3_VALUE_APB_ACCESS 0x0bu
#define BUSCTRL_PERFSEL3_VALUE_FASTPERI_STALL_UPSTREAM 0x0cu
#define BUSCTRL_PERFSEL3_VALUE_FASTPERI_STALL_DOWNSTREAM 0x0du
#define BUSCTRL_PERFSEL3_VALUE_FASTPERI_ACCESS_CONTESTED 0x0eu
#define BUSCTRL_PERFSEL3_VALUE_FASTPERI_ACCESS 0x0fu
#define BUSCTRL_PERFSEL3_VALUE_SRAM9_STALL_UPSTREAM 0x10u
#define BUSCTRL_PERFSEL3_VALUE_SRAM9_STALL_DOWNSTREAM 0x11u
#define BUSCTRL_PERFSEL3_VALUE_SRAM9_ACCESS_CONTESTED 0x12u
#define BUSCTRL_PERFSEL3_VALUE_SRAM9_ACCESS 0x13u
#define BUSCTRL_PERFSEL3_VALUE_SRAM8_STALL_UPSTREAM 0x14u
#define BUSCTRL_PERFSEL3_VALUE_SRAM8_STALL_DOWNSTREAM 0x15u
#define BUSCTRL_PERFSEL3_VALUE_SRAM8_ACCESS_CONTESTED 0x16u
#define BUSCTRL_PERFSEL3_VALUE_SRAM8_ACCESS 0x17u
#define BUSCTRL_PERFSEL3_VALUE_SRAM7_STALL_UPSTREAM 0x18u
#define BUSCTRL_PERFSEL3_VALUE_SRAM7_STALL_DOWNSTREAM 0x19u
#define BUSCTRL_PERFSEL3_VALUE_SRAM7_ACCESS_CONTESTED 0x1au
#define BUSCTRL_PERFSEL3_VALUE_SRAM7_ACCESS 0x1bu
#define BUSCTRL_PERFSEL3_VALUE_SRAM6_STALL_UPSTREAM 0x1cu
#define BUSCTRL_PERFSEL3_VALUE_SRAM6_STALL_DOWNSTREAM 0x1du
#define BUSCTRL_PERFSEL3_VALUE_SRAM6_ACCESS_CONTESTED 0x1eu
#define BUSCTRL_PERFSEL3_VALUE_SRAM6_ACCESS 0x1fu
#define BUSCTRL_PERFSEL3_VALUE_SRAM5_STALL_UPSTREAM 0x20u
#define BUSCTRL_PERFSEL3_VALUE_SRAM5_STALL_DOWNSTREAM 0x21u
#define BUSCTRL_PERFSEL3_VALUE_SRAM5_ACCESS_CONTESTED 0x22u
#define BUSCTRL_PERFSEL3_VALUE_SRAM5_ACCESS 0x23u
#define BUSCTRL_PERFSEL3_VALUE_SRAM4_STALL_UPSTREAM 0x24u
#define BUSCTRL_PERFSEL3_VALUE_SRAM4_STALL_DOWNSTREAM 0x25u
#define BUSCTRL_PERFSEL3_VALUE_SRAM4_ACCESS_CONTESTED 0x26u
#define BUSCTRL_PERFSEL3_VALUE_SRAM4_ACCESS 0x27u
#define BUSCTRL_PERFSEL3_VALUE_SRAM3_STALL_UPSTREAM 0x28u
#define BUSCTRL_PERFSEL3_VALUE_SRAM3_STALL_DOWNSTREAM 0x29u
#define BUSCTRL_PERFSEL3_VALUE_SRAM3_ACCESS_CONTESTED 0x2au
#define BUSCTRL_PERFSEL3_VALUE_SRAM3_ACCESS 0x2bu
#define BUSCTRL_PERFSEL3_VALUE_SRAM2_STALL_UPSTREAM 0x2cu
#define BUSCTRL_PERFSEL3_VALUE_SRAM2_STALL_DOWNSTREAM 0x2du
#define BUSCTRL_PERFSEL3_VALUE_SRAM2_ACCESS_CONTESTED 0x2eu
#define BUSCTRL_PERFSEL3_VALUE_SRAM2_ACCESS 0x2fu
#define BUSCTRL_PERFSEL3_VALUE_SRAM1_STALL_UPSTREAM 0x30u
#define BUSCTRL_PERFSEL3_VALUE_SRAM1_STALL_DOWNSTREAM 0x31u
#define BUSCTRL_PERFSEL3_VALUE_SRAM1_ACCESS_CONTESTED 0x32u
#define BUSCTRL_PERFSEL3_VALUE_SRAM1_ACCESS 0x33u
#define BUSCTRL_PERFSEL3_VALUE_SRAM0_STALL_UPSTREAM 0x34u
#define BUSCTRL_PERFSEL3_VALUE_SRAM0_STALL_DOWNSTREAM 0x35u
#define BUSCTRL_PERFSEL3_VALUE_SRAM0_ACCESS_CONTESTED 0x36u
#define BUSCTRL_PERFSEL3_VALUE_SRAM0_ACCESS 0x37u
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN1_STALL_UPSTREAM 0x38u
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN1_STALL_DOWNSTREAM 0x39u
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN1_ACCESS_CONTESTED 0x3au
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN1_ACCESS 0x3bu
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN0_STALL_UPSTREAM 0x3cu
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN0_STALL_DOWNSTREAM 0x3du
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN0_ACCESS_CONTESTED 0x3eu
#define BUSCTRL_PERFSEL3_VALUE_XIP_MAIN0_ACCESS 0x3fu
#define BUSCTRL_PERFSEL3_VALUE_ROM_STALL_UPSTREAM 0x40u
#define BUSCTRL_PERFSEL3_VALUE_ROM_STALL_DOWNSTREAM 0x41u
#define BUSCTRL_PERFSEL3_VALUE_ROM_ACCESS_CONTESTED 0x42u
#define BUSCTRL_PERFSEL3_VALUE_ROM_ACCESS 0x43u
typedef enum bus_ctrl_perf_counter_rp2350 {
    arbiter_rom_perf_event_access = 19,
    arbiter_rom_perf_event_access_contested = 18,
    arbiter_xip_main_perf_event_access = 17,
    arbiter_xip_main_perf_event_access_contested = 16,
    arbiter_sram0_perf_event_access = 15,
    arbiter_sram0_perf_event_access_contested = 14,
    arbiter_sram1_perf_event_access = 13,
    arbiter_sram1_perf_event_access_contested = 12,
    arbiter_sram2_perf_event_access = 11,
    arbiter_sram2_perf_event_access_contested = 10,
    arbiter_sram3_perf_event_access = 9,
    arbiter_sram3_perf_event_access_contested = 8,
    arbiter_sram4_perf_event_access = 7,
    arbiter_sram4_perf_event_access_contested = 6,
    arbiter_sram5_perf_event_access = 5,
    arbiter_sram5_perf_event_access_contested = 4,
    arbiter_fastperi_perf_event_access = 3,
    arbiter_fastperi_perf_event_access_contested = 2,
    arbiter_apb_perf_event_access = 1,
    arbiter_apb_perf_event_access_contested = 0
} bus_ctrl_perf_counter_t;
