gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
typedef struct {
   
    io_rw_32 value;
   
    io_rw_32 sel;
} bus_ctrl_perf_hw_t;
typedef struct {
   
    io_rw_32 priority;
   
    io_ro_32 priority_ack;
   
    io_rw_32 perfctr_en;
    bus_ctrl_perf_hw_t counter[4];
} busctrl_hw_t;
static busctrl_hw_t * const busctrl_hw = (busctrl_hw_t *)BUSCTRL_BASE; // ORIGINAL: #define busctrl_hw ((busctrl_hw_t *)BUSCTRL_BASE)
_Static_assert(sizeof (busctrl_hw_t) == 0x002c, "");
static __typeof__(busctrl_hw) const bus_ctrl_hw = busctrl_hw; // ORIGINAL: #define bus_ctrl_hw busctrl_hw
static __typeof__(io_qspi_hw) const ioqspi_hw = io_qspi_hw; // ORIGINAL: #define ioqspi_hw io_qspi_hw
#define _HARDWARE_STRUCTS_SAU_H 
typedef struct {
   
    io_rw_32 ctrl;
   
    io_ro_32 type;
   
    io_rw_32 rnr;
   
    io_rw_32 rbar;
   
    io_rw_32 rlar;
} armv8m_sau_hw_t;
static armv8m_sau_hw_t * const sau_hw = (armv8m_sau_hw_t *)(PPB_BASE + M33_SAU_CTRL_OFFSET); // ORIGINAL: #define sau_hw ((armv8m_sau_hw_t *)(PPB_BASE + M33_SAU_CTRL_OFFSET))
static armv8m_sau_hw_t * const sau_ns_hw = (armv8m_sau_hw_t *)(PPB_NONSEC_BASE + M33_SAU_CTRL_OFFSET); // ORIGINAL: #define sau_ns_hw ((armv8m_sau_hw_t *)(PPB_NONSEC_BASE + M33_SAU_CTRL_OFFSET))
_Static_assert(sizeof (armv8m_sau_hw_t) == 0x0014, "");
#define _HARDWARE_STRUCTS_SYSCFG_H 
#define _HARDWARE_REGS_SYSCFG_H 
#define SYSCFG_PROC_CONFIG_OFFSET 0x00000000u
#define SYSCFG_PROC_CONFIG_BITS 0x00000003u
#define SYSCFG_PROC_CONFIG_RESET 0x00000000u
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_RESET 0x0u
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_BITS 0x00000002u
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_MSB 1u
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_LSB 1u
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_ACCESS "RO"
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_RESET 0x0u
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_BITS 0x00000001u
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_MSB 0u
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_LSB 0u
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_ACCESS "RO"
#define SYSCFG_PROC_IN_SYNC_BYPASS_OFFSET 0x00000004u
#define SYSCFG_PROC_IN_SYNC_BYPASS_BITS 0xffffffffu
#define SYSCFG_PROC_IN_SYNC_BYPASS_RESET 0x00000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_GPIO_RESET 0x00000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_GPIO_BITS 0xffffffffu
#define SYSCFG_PROC_IN_SYNC_BYPASS_GPIO_MSB 31u
#define SYSCFG_PROC_IN_SYNC_BYPASS_GPIO_LSB 0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_GPIO_ACCESS "RW"
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_OFFSET 0x00000008u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_BITS 0xff00ffffu
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_RESET 0x00000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SD_RESET 0x0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SD_BITS 0xf0000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SD_MSB 31u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SD_LSB 28u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SD_ACCESS "RW"
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_CSN_RESET 0x0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_CSN_BITS 0x08000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_CSN_MSB 27u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_CSN_LSB 27u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_CSN_ACCESS "RW"
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SCK_RESET 0x0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SCK_BITS 0x04000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SCK_MSB 26u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SCK_LSB 26u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_QSPI_SCK_ACCESS "RW"
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DM_RESET 0x0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DM_BITS 0x02000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DM_MSB 25u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DM_LSB 25u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DM_ACCESS "RW"
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DP_RESET 0x0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DP_BITS 0x01000000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DP_MSB 24u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DP_LSB 24u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_USB_DP_ACCESS "RW"
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_GPIO_RESET 0x0000u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_GPIO_BITS 0x0000ffffu
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_GPIO_MSB 15u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_GPIO_LSB 0u
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_GPIO_ACCESS "RW"
#define SYSCFG_DBGFORCE_OFFSET 0x0000000cu
#define SYSCFG_DBGFORCE_BITS 0x0000000fu
#define SYSCFG_DBGFORCE_RESET 0x00000006u
#define SYSCFG_DBGFORCE_ATTACH_RESET 0x0u
#define SYSCFG_DBGFORCE_ATTACH_BITS 0x00000008u
#define SYSCFG_DBGFORCE_ATTACH_MSB 3u
#define SYSCFG_DBGFORCE_ATTACH_LSB 3u
#define SYSCFG_DBGFORCE_ATTACH_ACCESS "RW"
#define SYSCFG_DBGFORCE_SWCLK_RESET 0x1u
#define SYSCFG_DBGFORCE_SWCLK_BITS 0x00000004u
#define SYSCFG_DBGFORCE_SWCLK_MSB 2u
#define SYSCFG_DBGFORCE_SWCLK_LSB 2u
#define SYSCFG_DBGFORCE_SWCLK_ACCESS "RW"
#define SYSCFG_DBGFORCE_SWDI_RESET 0x1u
#define SYSCFG_DBGFORCE_SWDI_BITS 0x00000002u
#define SYSCFG_DBGFORCE_SWDI_MSB 1u
#define SYSCFG_DBGFORCE_SWDI_LSB 1u
#define SYSCFG_DBGFORCE_SWDI_ACCESS "RW"
#define SYSCFG_DBGFORCE_SWDO_RESET "-"
#define SYSCFG_DBGFORCE_SWDO_BITS 0x00000001u
#define SYSCFG_DBGFORCE_SWDO_MSB 0u
#define SYSCFG_DBGFORCE_SWDO_LSB 0u
#define SYSCFG_DBGFORCE_SWDO_ACCESS "RO"
#define SYSCFG_MEMPOWERDOWN_OFFSET 0x00000010u
#define SYSCFG_MEMPOWERDOWN_BITS 0x00001fffu
#define SYSCFG_MEMPOWERDOWN_RESET 0x00000000u
#define SYSCFG_MEMPOWERDOWN_BOOTRAM_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_BOOTRAM_BITS 0x00001000u
#define SYSCFG_MEMPOWERDOWN_BOOTRAM_MSB 12u
#define SYSCFG_MEMPOWERDOWN_BOOTRAM_LSB 12u
#define SYSCFG_MEMPOWERDOWN_BOOTRAM_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_ROM_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_ROM_BITS 0x00000800u
#define SYSCFG_MEMPOWERDOWN_ROM_MSB 11u
#define SYSCFG_MEMPOWERDOWN_ROM_LSB 11u
#define SYSCFG_MEMPOWERDOWN_ROM_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_USB_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_USB_BITS 0x00000400u
#define SYSCFG_MEMPOWERDOWN_USB_MSB 10u
#define SYSCFG_MEMPOWERDOWN_USB_LSB 10u
#define SYSCFG_MEMPOWERDOWN_USB_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM9_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM9_BITS 0x00000200u
#define SYSCFG_MEMPOWERDOWN_SRAM9_MSB 9u
#define SYSCFG_MEMPOWERDOWN_SRAM9_LSB 9u
#define SYSCFG_MEMPOWERDOWN_SRAM9_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM8_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM8_BITS 0x00000100u
#define SYSCFG_MEMPOWERDOWN_SRAM8_MSB 8u
#define SYSCFG_MEMPOWERDOWN_SRAM8_LSB 8u
#define SYSCFG_MEMPOWERDOWN_SRAM8_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM7_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM7_BITS 0x00000080u
#define SYSCFG_MEMPOWERDOWN_SRAM7_MSB 7u
#define SYSCFG_MEMPOWERDOWN_SRAM7_LSB 7u
#define SYSCFG_MEMPOWERDOWN_SRAM7_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM6_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM6_BITS 0x00000040u
#define SYSCFG_MEMPOWERDOWN_SRAM6_MSB 6u
#define SYSCFG_MEMPOWERDOWN_SRAM6_LSB 6u
#define SYSCFG_MEMPOWERDOWN_SRAM6_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM5_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM5_BITS 0x00000020u
#define SYSCFG_MEMPOWERDOWN_SRAM5_MSB 5u
#define SYSCFG_MEMPOWERDOWN_SRAM5_LSB 5u
#define SYSCFG_MEMPOWERDOWN_SRAM5_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM4_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM4_BITS 0x00000010u
#define SYSCFG_MEMPOWERDOWN_SRAM4_MSB 4u
#define SYSCFG_MEMPOWERDOWN_SRAM4_LSB 4u
#define SYSCFG_MEMPOWERDOWN_SRAM4_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM3_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM3_BITS 0x00000008u
#define SYSCFG_MEMPOWERDOWN_SRAM3_MSB 3u
#define SYSCFG_MEMPOWERDOWN_SRAM3_LSB 3u
#define SYSCFG_MEMPOWERDOWN_SRAM3_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM2_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM2_BITS 0x00000004u
#define SYSCFG_MEMPOWERDOWN_SRAM2_MSB 2u
#define SYSCFG_MEMPOWERDOWN_SRAM2_LSB 2u
#define SYSCFG_MEMPOWERDOWN_SRAM2_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM1_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM1_BITS 0x00000002u
#define SYSCFG_MEMPOWERDOWN_SRAM1_MSB 1u
#define SYSCFG_MEMPOWERDOWN_SRAM1_LSB 1u
#define SYSCFG_MEMPOWERDOWN_SRAM1_ACCESS "RW"
#define SYSCFG_MEMPOWERDOWN_SRAM0_RESET 0x0u
#define SYSCFG_MEMPOWERDOWN_SRAM0_BITS 0x00000001u
#define SYSCFG_MEMPOWERDOWN_SRAM0_MSB 0u
#define SYSCFG_MEMPOWERDOWN_SRAM0_LSB 0u
#define SYSCFG_MEMPOWERDOWN_SRAM0_ACCESS "RW"
#define SYSCFG_AUXCTRL_OFFSET 0x00000014u
#define SYSCFG_AUXCTRL_BITS 0x000000ffu
#define SYSCFG_AUXCTRL_RESET 0x00000000u
#define SYSCFG_AUXCTRL_MSB 7u
#define SYSCFG_AUXCTRL_LSB 0u
#define SYSCFG_AUXCTRL_ACCESS "RW"
typedef struct {
   
    io_ro_32 proc_config;
   
    io_rw_32 proc_in_sync_bypass;
   
    io_rw_32 proc_in_sync_bypass_hi;
   
    io_rw_32 dbgforce;
   
