gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 mempowerdown;
   
    io_rw_32 auxctrl;
} syscfg_hw_t;
static syscfg_hw_t * const syscfg_hw = (syscfg_hw_t *)SYSCFG_BASE; // ORIGINAL: #define syscfg_hw ((syscfg_hw_t *)SYSCFG_BASE)
_Static_assert(sizeof (syscfg_hw_t) == 0x0018, "");
#define _HARDWARE_STRUCTS_ROSC_H 
#define _HARDWARE_REGS_ROSC_H 
#define ROSC_CTRL_OFFSET 0x00000000u
#define ROSC_CTRL_BITS 0x00ffffffu
#define ROSC_CTRL_RESET 0x00000aa0u
#define ROSC_CTRL_ENABLE_RESET "-"
#define ROSC_CTRL_ENABLE_BITS 0x00fff000u
#define ROSC_CTRL_ENABLE_MSB 23u
#define ROSC_CTRL_ENABLE_LSB 12u
#define ROSC_CTRL_ENABLE_ACCESS "RW"
#define ROSC_CTRL_ENABLE_VALUE_DISABLE 0xd1eu
#define ROSC_CTRL_ENABLE_VALUE_ENABLE 0xfabu
#define ROSC_CTRL_FREQ_RANGE_RESET 0xaa0u
#define ROSC_CTRL_FREQ_RANGE_BITS 0x00000fffu
#define ROSC_CTRL_FREQ_RANGE_MSB 11u
#define ROSC_CTRL_FREQ_RANGE_LSB 0u
#define ROSC_CTRL_FREQ_RANGE_ACCESS "RW"
#define ROSC_CTRL_FREQ_RANGE_VALUE_LOW 0xfa4u
#define ROSC_CTRL_FREQ_RANGE_VALUE_MEDIUM 0xfa5u
#define ROSC_CTRL_FREQ_RANGE_VALUE_HIGH 0xfa7u
#define ROSC_CTRL_FREQ_RANGE_VALUE_TOOHIGH 0xfa6u
#define ROSC_FREQA_OFFSET 0x00000004u
#define ROSC_FREQA_BITS 0xffff77ffu
#define ROSC_FREQA_RESET 0x00000088u
#define ROSC_FREQA_PASSWD_RESET 0x0000u
#define ROSC_FREQA_PASSWD_BITS 0xffff0000u
#define ROSC_FREQA_PASSWD_MSB 31u
#define ROSC_FREQA_PASSWD_LSB 16u
#define ROSC_FREQA_PASSWD_ACCESS "RW"
#define ROSC_FREQA_PASSWD_VALUE_PASS 0x9696u
#define ROSC_FREQA_DS3_RESET 0x0u
#define ROSC_FREQA_DS3_BITS 0x00007000u
#define ROSC_FREQA_DS3_MSB 14u
#define ROSC_FREQA_DS3_LSB 12u
#define ROSC_FREQA_DS3_ACCESS "RW"
#define ROSC_FREQA_DS2_RESET 0x0u
#define ROSC_FREQA_DS2_BITS 0x00000700u
#define ROSC_FREQA_DS2_MSB 10u
#define ROSC_FREQA_DS2_LSB 8u
#define ROSC_FREQA_DS2_ACCESS "RW"
#define ROSC_FREQA_DS1_RANDOM_RESET 0x1u
#define ROSC_FREQA_DS1_RANDOM_BITS 0x00000080u
#define ROSC_FREQA_DS1_RANDOM_MSB 7u
#define ROSC_FREQA_DS1_RANDOM_LSB 7u
#define ROSC_FREQA_DS1_RANDOM_ACCESS "RW"
#define ROSC_FREQA_DS1_RESET 0x0u
#define ROSC_FREQA_DS1_BITS 0x00000070u
#define ROSC_FREQA_DS1_MSB 6u
#define ROSC_FREQA_DS1_LSB 4u
#define ROSC_FREQA_DS1_ACCESS "RW"
#define ROSC_FREQA_DS0_RANDOM_RESET 0x1u
#define ROSC_FREQA_DS0_RANDOM_BITS 0x00000008u
#define ROSC_FREQA_DS0_RANDOM_MSB 3u
#define ROSC_FREQA_DS0_RANDOM_LSB 3u
#define ROSC_FREQA_DS0_RANDOM_ACCESS "RW"
#define ROSC_FREQA_DS0_RESET 0x0u
#define ROSC_FREQA_DS0_BITS 0x00000007u
#define ROSC_FREQA_DS0_MSB 2u
#define ROSC_FREQA_DS0_LSB 0u
#define ROSC_FREQA_DS0_ACCESS "RW"
#define ROSC_FREQB_OFFSET 0x00000008u
#define ROSC_FREQB_BITS 0xffff7777u
#define ROSC_FREQB_RESET 0x00000000u
#define ROSC_FREQB_PASSWD_RESET 0x0000u
#define ROSC_FREQB_PASSWD_BITS 0xffff0000u
#define ROSC_FREQB_PASSWD_MSB 31u
#define ROSC_FREQB_PASSWD_LSB 16u
#define ROSC_FREQB_PASSWD_ACCESS "RW"
#define ROSC_FREQB_PASSWD_VALUE_PASS 0x9696u
#define ROSC_FREQB_DS7_RESET 0x0u
#define ROSC_FREQB_DS7_BITS 0x00007000u
#define ROSC_FREQB_DS7_MSB 14u
#define ROSC_FREQB_DS7_LSB 12u
#define ROSC_FREQB_DS7_ACCESS "RW"
#define ROSC_FREQB_DS6_RESET 0x0u
#define ROSC_FREQB_DS6_BITS 0x00000700u
#define ROSC_FREQB_DS6_MSB 10u
#define ROSC_FREQB_DS6_LSB 8u
#define ROSC_FREQB_DS6_ACCESS "RW"
#define ROSC_FREQB_DS5_RESET 0x0u
#define ROSC_FREQB_DS5_BITS 0x00000070u
#define ROSC_FREQB_DS5_MSB 6u
#define ROSC_FREQB_DS5_LSB 4u
#define ROSC_FREQB_DS5_ACCESS "RW"
#define ROSC_FREQB_DS4_RESET 0x0u
#define ROSC_FREQB_DS4_BITS 0x00000007u
#define ROSC_FREQB_DS4_MSB 2u
#define ROSC_FREQB_DS4_LSB 0u
#define ROSC_FREQB_DS4_ACCESS "RW"
#define ROSC_RANDOM_OFFSET 0x0000000cu
#define ROSC_RANDOM_BITS 0xffffffffu
#define ROSC_RANDOM_RESET 0x3f04b16du
#define ROSC_RANDOM_SEED_RESET 0x3f04b16du
#define ROSC_RANDOM_SEED_BITS 0xffffffffu
#define ROSC_RANDOM_SEED_MSB 31u
#define ROSC_RANDOM_SEED_LSB 0u
#define ROSC_RANDOM_SEED_ACCESS "RW"
#define ROSC_DORMANT_OFFSET 0x00000010u
#define ROSC_DORMANT_BITS 0xffffffffu
#define ROSC_DORMANT_RESET "-"
#define ROSC_DORMANT_MSB 31u
#define ROSC_DORMANT_LSB 0u
#define ROSC_DORMANT_ACCESS "RW"
#define ROSC_DORMANT_VALUE_DORMANT 0x636f6d61u
#define ROSC_DORMANT_VALUE_WAKE 0x77616b65u
#define ROSC_DIV_OFFSET 0x00000014u
#define ROSC_DIV_BITS 0x0000ffffu
#define ROSC_DIV_RESET "-"
#define ROSC_DIV_MSB 15u
#define ROSC_DIV_LSB 0u
#define ROSC_DIV_ACCESS "RW"
#define ROSC_DIV_VALUE_PASS 0xaa00u
#define ROSC_PHASE_OFFSET 0x00000018u
#define ROSC_PHASE_BITS 0x00000fffu
#define ROSC_PHASE_RESET 0x00000008u
#define ROSC_PHASE_PASSWD_RESET 0x00u
#define ROSC_PHASE_PASSWD_BITS 0x00000ff0u
#define ROSC_PHASE_PASSWD_MSB 11u
#define ROSC_PHASE_PASSWD_LSB 4u
#define ROSC_PHASE_PASSWD_ACCESS "RW"
#define ROSC_PHASE_ENABLE_RESET 0x1u
#define ROSC_PHASE_ENABLE_BITS 0x00000008u
#define ROSC_PHASE_ENABLE_MSB 3u
#define ROSC_PHASE_ENABLE_LSB 3u
#define ROSC_PHASE_ENABLE_ACCESS "RW"
#define ROSC_PHASE_FLIP_RESET 0x0u
#define ROSC_PHASE_FLIP_BITS 0x00000004u
#define ROSC_PHASE_FLIP_MSB 2u
#define ROSC_PHASE_FLIP_LSB 2u
#define ROSC_PHASE_FLIP_ACCESS "RW"
#define ROSC_PHASE_SHIFT_RESET 0x0u
#define ROSC_PHASE_SHIFT_BITS 0x00000003u
#define ROSC_PHASE_SHIFT_MSB 1u
#define ROSC_PHASE_SHIFT_LSB 0u
#define ROSC_PHASE_SHIFT_ACCESS "RW"
#define ROSC_STATUS_OFFSET 0x0000001cu
#define ROSC_STATUS_BITS 0x81011000u
#define ROSC_STATUS_RESET 0x00000000u
#define ROSC_STATUS_STABLE_RESET 0x0u
#define ROSC_STATUS_STABLE_BITS 0x80000000u
#define ROSC_STATUS_STABLE_MSB 31u
#define ROSC_STATUS_STABLE_LSB 31u
#define ROSC_STATUS_STABLE_ACCESS "RO"
#define ROSC_STATUS_BADWRITE_RESET 0x0u
#define ROSC_STATUS_BADWRITE_BITS 0x01000000u
#define ROSC_STATUS_BADWRITE_MSB 24u
#define ROSC_STATUS_BADWRITE_LSB 24u
#define ROSC_STATUS_BADWRITE_ACCESS "WC"
#define ROSC_STATUS_DIV_RUNNING_RESET "-"
#define ROSC_STATUS_DIV_RUNNING_BITS 0x00010000u
#define ROSC_STATUS_DIV_RUNNING_MSB 16u
#define ROSC_STATUS_DIV_RUNNING_LSB 16u
#define ROSC_STATUS_DIV_RUNNING_ACCESS "RO"
#define ROSC_STATUS_ENABLED_RESET "-"
#define ROSC_STATUS_ENABLED_BITS 0x00001000u
#define ROSC_STATUS_ENABLED_MSB 12u
#define ROSC_STATUS_ENABLED_LSB 12u
#define ROSC_STATUS_ENABLED_ACCESS "RO"
#define ROSC_RANDOMBIT_OFFSET 0x00000020u
#define ROSC_RANDOMBIT_BITS 0x00000001u
#define ROSC_RANDOMBIT_RESET 0x00000001u
#define ROSC_RANDOMBIT_MSB 0u
#define ROSC_RANDOMBIT_LSB 0u
#define ROSC_RANDOMBIT_ACCESS "RO"
#define ROSC_COUNT_OFFSET 0x00000024u
#define ROSC_COUNT_BITS 0x0000ffffu
#define ROSC_COUNT_RESET 0x00000000u
#define ROSC_COUNT_MSB 15u
#define ROSC_COUNT_LSB 0u
#define ROSC_COUNT_ACCESS "RW"
typedef struct {
   
