gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 ctrl;
   
    io_rw_32 freqa;
   
    io_rw_32 freqb;
   
    io_rw_32 random;
   
    io_rw_32 dormant;
   
    io_rw_32 div;
   
    io_rw_32 phase;
   
    io_rw_32 status;
   
    io_ro_32 randombit;
   
    io_rw_32 count;
} rosc_hw_t;
static rosc_hw_t * const rosc_hw = (rosc_hw_t *)ROSC_BASE; // ORIGINAL: #define rosc_hw ((rosc_hw_t *)ROSC_BASE)
_Static_assert(sizeof (rosc_hw_t) == 0x0028, "");
#define _HARDWARE_STRUCTS_MPU_H 
typedef struct {
   
    io_ro_32 type;
   
    io_rw_32 ctrl;
   
    io_rw_32 rnr;
   
    io_rw_32 rbar;
   
    io_rw_32 rlar;
   
    io_rw_32 rbar_a1;
   
    io_rw_32 rlar_a1;
   
    io_rw_32 rbar_a2;
   
    io_rw_32 rlar_a2;
   
    io_rw_32 rbar_a3;
   
    io_rw_32 rlar_a3;
    uint32_t _pad0;
   
    io_rw_32 mair[2];
} mpu_hw_t;
static mpu_hw_t * const mpu_hw = (mpu_hw_t *)(PPB_BASE + M33_MPU_TYPE_OFFSET); // ORIGINAL: #define mpu_hw ((mpu_hw_t *)(PPB_BASE + M33_MPU_TYPE_OFFSET))
static mpu_hw_t * const mpu_ns_hw = (mpu_hw_t *)(PPB_NONSEC_BASE + M33_MPU_TYPE_OFFSET); // ORIGINAL: #define mpu_ns_hw ((mpu_hw_t *)(PPB_NONSEC_BASE + M33_MPU_TYPE_OFFSET))
_Static_assert(sizeof (mpu_hw_t) == 0x0038, "");
#define _HARDWARE_STRUCTS_SYSINFO_H 
#define _HARDWARE_REGS_SYSINFO_H 
#define SYSINFO_CHIP_ID_OFFSET 0x00000000u
#define SYSINFO_CHIP_ID_BITS 0xffffffffu
#define SYSINFO_CHIP_ID_RESET 0x00000001u
#define SYSINFO_CHIP_ID_REVISION_RESET "-"
#define SYSINFO_CHIP_ID_REVISION_BITS 0xf0000000u
#define SYSINFO_CHIP_ID_REVISION_MSB 31u
#define SYSINFO_CHIP_ID_REVISION_LSB 28u
#define SYSINFO_CHIP_ID_REVISION_ACCESS "RO"
#define SYSINFO_CHIP_ID_PART_RESET "-"
#define SYSINFO_CHIP_ID_PART_BITS 0x0ffff000u
#define SYSINFO_CHIP_ID_PART_MSB 27u
#define SYSINFO_CHIP_ID_PART_LSB 12u
#define SYSINFO_CHIP_ID_PART_ACCESS "RO"
#define SYSINFO_CHIP_ID_MANUFACTURER_RESET "-"
#define SYSINFO_CHIP_ID_MANUFACTURER_BITS 0x00000ffeu
#define SYSINFO_CHIP_ID_MANUFACTURER_MSB 11u
#define SYSINFO_CHIP_ID_MANUFACTURER_LSB 1u
#define SYSINFO_CHIP_ID_MANUFACTURER_ACCESS "RO"
#define SYSINFO_CHIP_ID_STOP_BIT_RESET 0x1u
#define SYSINFO_CHIP_ID_STOP_BIT_BITS 0x00000001u
#define SYSINFO_CHIP_ID_STOP_BIT_MSB 0u
#define SYSINFO_CHIP_ID_STOP_BIT_LSB 0u
#define SYSINFO_CHIP_ID_STOP_BIT_ACCESS "RO"
#define SYSINFO_PACKAGE_SEL_OFFSET 0x00000004u
#define SYSINFO_PACKAGE_SEL_BITS 0x00000001u
#define SYSINFO_PACKAGE_SEL_RESET 0x00000000u
#define SYSINFO_PACKAGE_SEL_MSB 0u
#define SYSINFO_PACKAGE_SEL_LSB 0u
#define SYSINFO_PACKAGE_SEL_ACCESS "RO"
#define SYSINFO_PLATFORM_OFFSET 0x00000008u
#define SYSINFO_PLATFORM_BITS 0x0000001fu
#define SYSINFO_PLATFORM_RESET 0x00000000u
#define SYSINFO_PLATFORM_GATESIM_RESET "-"
#define SYSINFO_PLATFORM_GATESIM_BITS 0x00000010u
#define SYSINFO_PLATFORM_GATESIM_MSB 4u
#define SYSINFO_PLATFORM_GATESIM_LSB 4u
#define SYSINFO_PLATFORM_GATESIM_ACCESS "RO"
#define SYSINFO_PLATFORM_BATCHSIM_RESET "-"
#define SYSINFO_PLATFORM_BATCHSIM_BITS 0x00000008u
#define SYSINFO_PLATFORM_BATCHSIM_MSB 3u
#define SYSINFO_PLATFORM_BATCHSIM_LSB 3u
#define SYSINFO_PLATFORM_BATCHSIM_ACCESS "RO"
#define SYSINFO_PLATFORM_HDLSIM_RESET "-"
#define SYSINFO_PLATFORM_HDLSIM_BITS 0x00000004u
#define SYSINFO_PLATFORM_HDLSIM_MSB 2u
#define SYSINFO_PLATFORM_HDLSIM_LSB 2u
#define SYSINFO_PLATFORM_HDLSIM_ACCESS "RO"
#define SYSINFO_PLATFORM_ASIC_RESET "-"
#define SYSINFO_PLATFORM_ASIC_BITS 0x00000002u
#define SYSINFO_PLATFORM_ASIC_MSB 1u
#define SYSINFO_PLATFORM_ASIC_LSB 1u
#define SYSINFO_PLATFORM_ASIC_ACCESS "RO"
#define SYSINFO_PLATFORM_FPGA_RESET "-"
#define SYSINFO_PLATFORM_FPGA_BITS 0x00000001u
#define SYSINFO_PLATFORM_FPGA_MSB 0u
#define SYSINFO_PLATFORM_FPGA_LSB 0u
#define SYSINFO_PLATFORM_FPGA_ACCESS "RO"
#define SYSINFO_GITREF_RP2350_OFFSET 0x00000014u
#define SYSINFO_GITREF_RP2350_BITS 0xffffffffu
#define SYSINFO_GITREF_RP2350_RESET "-"
#define SYSINFO_GITREF_RP2350_MSB 31u
#define SYSINFO_GITREF_RP2350_LSB 0u
#define SYSINFO_GITREF_RP2350_ACCESS "RO"
typedef struct {
   
    io_ro_32 chip_id;
   
    io_ro_32 package_sel;
   
    io_ro_32 platform;
    uint32_t _pad0[2];
   
    io_ro_32 gitref_rp2350;
} sysinfo_hw_t;
static sysinfo_hw_t * const sysinfo_hw = (sysinfo_hw_t *)SYSINFO_BASE; // ORIGINAL: #define sysinfo_hw ((sysinfo_hw_t *)SYSINFO_BASE)
_Static_assert(sizeof (sysinfo_hw_t) == 0x0018, "");
#define _HARDWARE_STRUCTS_XIP_H 
#define _HARDWARE_REGS_XIP_H 
#define XIP_CTRL_OFFSET 0x00000000u
#define XIP_CTRL_BITS 0x00000ffbu
#define XIP_CTRL_RESET 0x00000083u
#define XIP_CTRL_WRITABLE_M1_RESET 0x0u
#define XIP_CTRL_WRITABLE_M1_BITS 0x00000800u
#define XIP_CTRL_WRITABLE_M1_MSB 11u
#define XIP_CTRL_WRITABLE_M1_LSB 11u
#define XIP_CTRL_WRITABLE_M1_ACCESS "RW"
#define XIP_CTRL_WRITABLE_M0_RESET 0x0u
#define XIP_CTRL_WRITABLE_M0_BITS 0x00000400u
#define XIP_CTRL_WRITABLE_M0_MSB 10u
#define XIP_CTRL_WRITABLE_M0_LSB 10u
#define XIP_CTRL_WRITABLE_M0_ACCESS "RW"
#define XIP_CTRL_SPLIT_WAYS_RESET 0x0u
#define XIP_CTRL_SPLIT_WAYS_BITS 0x00000200u
#define XIP_CTRL_SPLIT_WAYS_MSB 9u
#define XIP_CTRL_SPLIT_WAYS_LSB 9u
#define XIP_CTRL_SPLIT_WAYS_ACCESS "RW"
#define XIP_CTRL_MAINT_NONSEC_RESET 0x0u
#define XIP_CTRL_MAINT_NONSEC_BITS 0x00000100u
#define XIP_CTRL_MAINT_NONSEC_MSB 8u
#define XIP_CTRL_MAINT_NONSEC_LSB 8u
#define XIP_CTRL_MAINT_NONSEC_ACCESS "RW"
#define XIP_CTRL_NO_UNTRANSLATED_NONSEC_RESET 0x1u
#define XIP_CTRL_NO_UNTRANSLATED_NONSEC_BITS 0x00000080u
#define XIP_CTRL_NO_UNTRANSLATED_NONSEC_MSB 7u
#define XIP_CTRL_NO_UNTRANSLATED_NONSEC_LSB 7u
#define XIP_CTRL_NO_UNTRANSLATED_NONSEC_ACCESS "RW"
#define XIP_CTRL_NO_UNTRANSLATED_SEC_RESET 0x0u
#define XIP_CTRL_NO_UNTRANSLATED_SEC_BITS 0x00000040u
#define XIP_CTRL_NO_UNTRANSLATED_SEC_MSB 6u
#define XIP_CTRL_NO_UNTRANSLATED_SEC_LSB 6u
#define XIP_CTRL_NO_UNTRANSLATED_SEC_ACCESS "RW"
#define XIP_CTRL_NO_UNCACHED_NONSEC_RESET 0x0u
#define XIP_CTRL_NO_UNCACHED_NONSEC_BITS 0x00000020u
#define XIP_CTRL_NO_UNCACHED_NONSEC_MSB 5u
#define XIP_CTRL_NO_UNCACHED_NONSEC_LSB 5u
#define XIP_CTRL_NO_UNCACHED_NONSEC_ACCESS "RW"
#define XIP_CTRL_NO_UNCACHED_SEC_RESET 0x0u
#define XIP_CTRL_NO_UNCACHED_SEC_BITS 0x00000010u
#define XIP_CTRL_NO_UNCACHED_SEC_MSB 4u
#define XIP_CTRL_NO_UNCACHED_SEC_LSB 4u
#define XIP_CTRL_NO_UNCACHED_SEC_ACCESS "RW"
#define XIP_CTRL_POWER_DOWN_RESET 0x0u
#define XIP_CTRL_POWER_DOWN_BITS 0x00000008u
#define XIP_CTRL_POWER_DOWN_MSB 3u
#define XIP_CTRL_POWER_DOWN_LSB 3u
#define XIP_CTRL_POWER_DOWN_ACCESS "RW"
#define XIP_CTRL_EN_NONSECURE_RESET 0x1u
#define XIP_CTRL_EN_NONSECURE_BITS 0x00000002u
#define XIP_CTRL_EN_NONSECURE_MSB 1u
#define XIP_CTRL_EN_NONSECURE_LSB 1u
#define XIP_CTRL_EN_NONSECURE_ACCESS "RW"
#define XIP_CTRL_EN_SECURE_RESET 0x1u
#define XIP_CTRL_EN_SECURE_BITS 0x00000001u
#define XIP_CTRL_EN_SECURE_MSB 0u
#define XIP_CTRL_EN_SECURE_LSB 0u
#define XIP_CTRL_EN_SECURE_ACCESS "RW"
#define XIP_STAT_OFFSET 0x00000008u
#define XIP_STAT_BITS 0x00000006u
#define XIP_STAT_RESET 0x00000002u
#define XIP_STAT_FIFO_FULL_RESET 0x0u
#define XIP_STAT_FIFO_FULL_BITS 0x00000004u
#define XIP_STAT_FIFO_FULL_MSB 2u
#define XIP_STAT_FIFO_FULL_LSB 2u
#define XIP_STAT_FIFO_FULL_ACCESS "RO"
#define XIP_STAT_FIFO_EMPTY_RESET 0x1u
#define XIP_STAT_FIFO_EMPTY_BITS 0x00000002u
#define XIP_STAT_FIFO_EMPTY_MSB 1u
#define XIP_STAT_FIFO_EMPTY_LSB 1u
#define XIP_STAT_FIFO_EMPTY_ACCESS "RO"
#define XIP_CTR_HIT_OFFSET 0x0000000cu
#define XIP_CTR_HIT_BITS 0xffffffffu
#define XIP_CTR_HIT_RESET 0x00000000u
#define XIP_CTR_HIT_MSB 31u
#define XIP_CTR_HIT_LSB 0u
#define XIP_CTR_HIT_ACCESS "WC"
#define XIP_CTR_ACC_OFFSET 0x00000010u
#define XIP_CTR_ACC_BITS 0xffffffffu
#define XIP_CTR_ACC_RESET 0x00000000u
#define XIP_CTR_ACC_MSB 31u
#define XIP_CTR_ACC_LSB 0u
#define XIP_CTR_ACC_ACCESS "WC"
#define XIP_STREAM_ADDR_OFFSET 0x00000014u
#define XIP_STREAM_ADDR_BITS 0xfffffffcu
#define XIP_STREAM_ADDR_RESET 0x00000000u
#define XIP_STREAM_ADDR_MSB 31u
#define XIP_STREAM_ADDR_LSB 2u
#define XIP_STREAM_ADDR_ACCESS "RW"
#define XIP_STREAM_CTR_OFFSET 0x00000018u
#define XIP_STREAM_CTR_BITS 0x003fffffu
#define XIP_STREAM_CTR_RESET 0x00000000u
#define XIP_STREAM_CTR_MSB 21u
#define XIP_STREAM_CTR_LSB 0u
#define XIP_STREAM_CTR_ACCESS "RW"
#define XIP_STREAM_FIFO_OFFSET 0x0000001cu
#define XIP_STREAM_FIFO_BITS 0xffffffffu
#define XIP_STREAM_FIFO_RESET 0x00000000u
#define XIP_STREAM_FIFO_MSB 31u
#define XIP_STREAM_FIFO_LSB 0u
#define XIP_STREAM_FIFO_ACCESS "RF"
typedef struct  __attribute__((swift_attr("~Copyable"))) {
   
