gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 ctrl;
    uint32_t _pad0;
   
    io_ro_32 stat;
   
    io_rw_32 ctr_hit;
   
    io_rw_32 ctr_acc;
   
    io_rw_32 stream_addr;
   
    io_rw_32 stream_ctr;
   
    io_ro_32 stream_fifo;
} xip_ctrl_hw_t;
static xip_ctrl_hw_t * const xip_ctrl_hw = (xip_ctrl_hw_t *)XIP_CTRL_BASE; // ORIGINAL: #define xip_ctrl_hw ((xip_ctrl_hw_t *)XIP_CTRL_BASE)
_Static_assert(sizeof (xip_ctrl_hw_t) == 0x0020, "");
#define XIP_STAT_FIFO_FULL XIP_STAT_FIFO_FULL_BITS
#define XIP_STAT_FIFO_EMPTY XIP_STAT_FIFO_EMPTY_BITS
#define XIP_STAT_FLUSH_RDY XIP_STAT_FLUSH_READY_BITS
#define _HARDWARE_STRUCTS_HSTX_CTRL_H 
#define _HARDWARE_REGS_HSTX_CTRL_H 
#define HSTX_CTRL_CSR_OFFSET 0x00000000u
#define HSTX_CTRL_CSR_BITS 0xff1f1f73u
#define HSTX_CTRL_CSR_RESET 0x10050600u
#define HSTX_CTRL_CSR_CLKDIV_RESET 0x1u
#define HSTX_CTRL_CSR_CLKDIV_BITS 0xf0000000u
#define HSTX_CTRL_CSR_CLKDIV_MSB 31u
#define HSTX_CTRL_CSR_CLKDIV_LSB 28u
#define HSTX_CTRL_CSR_CLKDIV_ACCESS "RW"
#define HSTX_CTRL_CSR_CLKPHASE_RESET 0x0u
#define HSTX_CTRL_CSR_CLKPHASE_BITS 0x0f000000u
#define HSTX_CTRL_CSR_CLKPHASE_MSB 27u
#define HSTX_CTRL_CSR_CLKPHASE_LSB 24u
#define HSTX_CTRL_CSR_CLKPHASE_ACCESS "RW"
#define HSTX_CTRL_CSR_N_SHIFTS_RESET 0x05u
#define HSTX_CTRL_CSR_N_SHIFTS_BITS 0x001f0000u
#define HSTX_CTRL_CSR_N_SHIFTS_MSB 20u
#define HSTX_CTRL_CSR_N_SHIFTS_LSB 16u
#define HSTX_CTRL_CSR_N_SHIFTS_ACCESS "RW"
#define HSTX_CTRL_CSR_SHIFT_RESET 0x06u
#define HSTX_CTRL_CSR_SHIFT_BITS 0x00001f00u
#define HSTX_CTRL_CSR_SHIFT_MSB 12u
#define HSTX_CTRL_CSR_SHIFT_LSB 8u
#define HSTX_CTRL_CSR_SHIFT_ACCESS "RW"
#define HSTX_CTRL_CSR_COUPLED_SEL_RESET 0x0u
#define HSTX_CTRL_CSR_COUPLED_SEL_BITS 0x00000060u
#define HSTX_CTRL_CSR_COUPLED_SEL_MSB 6u
#define HSTX_CTRL_CSR_COUPLED_SEL_LSB 5u
#define HSTX_CTRL_CSR_COUPLED_SEL_ACCESS "RW"
#define HSTX_CTRL_CSR_COUPLED_MODE_RESET 0x0u
#define HSTX_CTRL_CSR_COUPLED_MODE_BITS 0x00000010u
#define HSTX_CTRL_CSR_COUPLED_MODE_MSB 4u
#define HSTX_CTRL_CSR_COUPLED_MODE_LSB 4u
#define HSTX_CTRL_CSR_COUPLED_MODE_ACCESS "RW"
#define HSTX_CTRL_CSR_EXPAND_EN_RESET 0x0u
#define HSTX_CTRL_CSR_EXPAND_EN_BITS 0x00000002u
#define HSTX_CTRL_CSR_EXPAND_EN_MSB 1u
#define HSTX_CTRL_CSR_EXPAND_EN_LSB 1u
#define HSTX_CTRL_CSR_EXPAND_EN_ACCESS "RW"
#define HSTX_CTRL_CSR_EN_RESET 0x0u
#define HSTX_CTRL_CSR_EN_BITS 0x00000001u
#define HSTX_CTRL_CSR_EN_MSB 0u
#define HSTX_CTRL_CSR_EN_LSB 0u
#define HSTX_CTRL_CSR_EN_ACCESS "RW"
#define HSTX_CTRL_BIT0_OFFSET 0x00000004u
#define HSTX_CTRL_BIT0_BITS 0x00031f1fu
#define HSTX_CTRL_BIT0_RESET 0x00000000u
#define HSTX_CTRL_BIT0_CLK_RESET 0x0u
#define HSTX_CTRL_BIT0_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT0_CLK_MSB 17u
#define HSTX_CTRL_BIT0_CLK_LSB 17u
#define HSTX_CTRL_BIT0_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT0_INV_RESET 0x0u
#define HSTX_CTRL_BIT0_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT0_INV_MSB 16u
#define HSTX_CTRL_BIT0_INV_LSB 16u
#define HSTX_CTRL_BIT0_INV_ACCESS "RW"
#define HSTX_CTRL_BIT0_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT0_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT0_SEL_N_MSB 12u
#define HSTX_CTRL_BIT0_SEL_N_LSB 8u
#define HSTX_CTRL_BIT0_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT0_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT0_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT0_SEL_P_MSB 4u
#define HSTX_CTRL_BIT0_SEL_P_LSB 0u
#define HSTX_CTRL_BIT0_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT1_OFFSET 0x00000008u
#define HSTX_CTRL_BIT1_BITS 0x00031f1fu
#define HSTX_CTRL_BIT1_RESET 0x00000000u
#define HSTX_CTRL_BIT1_CLK_RESET 0x0u
#define HSTX_CTRL_BIT1_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT1_CLK_MSB 17u
#define HSTX_CTRL_BIT1_CLK_LSB 17u
#define HSTX_CTRL_BIT1_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT1_INV_RESET 0x0u
#define HSTX_CTRL_BIT1_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT1_INV_MSB 16u
#define HSTX_CTRL_BIT1_INV_LSB 16u
#define HSTX_CTRL_BIT1_INV_ACCESS "RW"
#define HSTX_CTRL_BIT1_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT1_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT1_SEL_N_MSB 12u
#define HSTX_CTRL_BIT1_SEL_N_LSB 8u
#define HSTX_CTRL_BIT1_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT1_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT1_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT1_SEL_P_MSB 4u
#define HSTX_CTRL_BIT1_SEL_P_LSB 0u
#define HSTX_CTRL_BIT1_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT2_OFFSET 0x0000000cu
#define HSTX_CTRL_BIT2_BITS 0x00031f1fu
#define HSTX_CTRL_BIT2_RESET 0x00000000u
#define HSTX_CTRL_BIT2_CLK_RESET 0x0u
#define HSTX_CTRL_BIT2_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT2_CLK_MSB 17u
#define HSTX_CTRL_BIT2_CLK_LSB 17u
#define HSTX_CTRL_BIT2_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT2_INV_RESET 0x0u
#define HSTX_CTRL_BIT2_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT2_INV_MSB 16u
#define HSTX_CTRL_BIT2_INV_LSB 16u
#define HSTX_CTRL_BIT2_INV_ACCESS "RW"
#define HSTX_CTRL_BIT2_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT2_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT2_SEL_N_MSB 12u
#define HSTX_CTRL_BIT2_SEL_N_LSB 8u
#define HSTX_CTRL_BIT2_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT2_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT2_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT2_SEL_P_MSB 4u
#define HSTX_CTRL_BIT2_SEL_P_LSB 0u
#define HSTX_CTRL_BIT2_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT3_OFFSET 0x00000010u
#define HSTX_CTRL_BIT3_BITS 0x00031f1fu
#define HSTX_CTRL_BIT3_RESET 0x00000000u
#define HSTX_CTRL_BIT3_CLK_RESET 0x0u
#define HSTX_CTRL_BIT3_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT3_CLK_MSB 17u
#define HSTX_CTRL_BIT3_CLK_LSB 17u
#define HSTX_CTRL_BIT3_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT3_INV_RESET 0x0u
#define HSTX_CTRL_BIT3_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT3_INV_MSB 16u
#define HSTX_CTRL_BIT3_INV_LSB 16u
#define HSTX_CTRL_BIT3_INV_ACCESS "RW"
#define HSTX_CTRL_BIT3_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT3_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT3_SEL_N_MSB 12u
#define HSTX_CTRL_BIT3_SEL_N_LSB 8u
#define HSTX_CTRL_BIT3_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT3_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT3_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT3_SEL_P_MSB 4u
#define HSTX_CTRL_BIT3_SEL_P_LSB 0u
#define HSTX_CTRL_BIT3_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT4_OFFSET 0x00000014u
#define HSTX_CTRL_BIT4_BITS 0x00031f1fu
#define HSTX_CTRL_BIT4_RESET 0x00000000u
#define HSTX_CTRL_BIT4_CLK_RESET 0x0u
#define HSTX_CTRL_BIT4_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT4_CLK_MSB 17u
#define HSTX_CTRL_BIT4_CLK_LSB 17u
#define HSTX_CTRL_BIT4_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT4_INV_RESET 0x0u
#define HSTX_CTRL_BIT4_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT4_INV_MSB 16u
#define HSTX_CTRL_BIT4_INV_LSB 16u
#define HSTX_CTRL_BIT4_INV_ACCESS "RW"
#define HSTX_CTRL_BIT4_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT4_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT4_SEL_N_MSB 12u
#define HSTX_CTRL_BIT4_SEL_N_LSB 8u
#define HSTX_CTRL_BIT4_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT4_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT4_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT4_SEL_P_MSB 4u
#define HSTX_CTRL_BIT4_SEL_P_LSB 0u
#define HSTX_CTRL_BIT4_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT5_OFFSET 0x00000018u
#define HSTX_CTRL_BIT5_BITS 0x00031f1fu
#define HSTX_CTRL_BIT5_RESET 0x00000000u
#define HSTX_CTRL_BIT5_CLK_RESET 0x0u
#define HSTX_CTRL_BIT5_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT5_CLK_MSB 17u
#define HSTX_CTRL_BIT5_CLK_LSB 17u
#define HSTX_CTRL_BIT5_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT5_INV_RESET 0x0u
#define HSTX_CTRL_BIT5_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT5_INV_MSB 16u
#define HSTX_CTRL_BIT5_INV_LSB 16u
#define HSTX_CTRL_BIT5_INV_ACCESS "RW"
#define HSTX_CTRL_BIT5_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT5_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT5_SEL_N_MSB 12u
#define HSTX_CTRL_BIT5_SEL_N_LSB 8u
#define HSTX_CTRL_BIT5_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT5_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT5_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT5_SEL_P_MSB 4u
#define HSTX_CTRL_BIT5_SEL_P_LSB 0u
#define HSTX_CTRL_BIT5_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT6_OFFSET 0x0000001cu
#define HSTX_CTRL_BIT6_BITS 0x00031f1fu
#define HSTX_CTRL_BIT6_RESET 0x00000000u
#define HSTX_CTRL_BIT6_CLK_RESET 0x0u
#define HSTX_CTRL_BIT6_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT6_CLK_MSB 17u
#define HSTX_CTRL_BIT6_CLK_LSB 17u
#define HSTX_CTRL_BIT6_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT6_INV_RESET 0x0u
#define HSTX_CTRL_BIT6_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT6_INV_MSB 16u
#define HSTX_CTRL_BIT6_INV_LSB 16u
#define HSTX_CTRL_BIT6_INV_ACCESS "RW"
#define HSTX_CTRL_BIT6_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT6_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT6_SEL_N_MSB 12u
#define HSTX_CTRL_BIT6_SEL_N_LSB 8u
#define HSTX_CTRL_BIT6_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT6_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT6_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT6_SEL_P_MSB 4u
#define HSTX_CTRL_BIT6_SEL_P_LSB 0u
#define HSTX_CTRL_BIT6_SEL_P_ACCESS "RW"
#define HSTX_CTRL_BIT7_OFFSET 0x00000020u
#define HSTX_CTRL_BIT7_BITS 0x00031f1fu
#define HSTX_CTRL_BIT7_RESET 0x00000000u
#define HSTX_CTRL_BIT7_CLK_RESET 0x0u
#define HSTX_CTRL_BIT7_CLK_BITS 0x00020000u
#define HSTX_CTRL_BIT7_CLK_MSB 17u
#define HSTX_CTRL_BIT7_CLK_LSB 17u
#define HSTX_CTRL_BIT7_CLK_ACCESS "RW"
#define HSTX_CTRL_BIT7_INV_RESET 0x0u
#define HSTX_CTRL_BIT7_INV_BITS 0x00010000u
#define HSTX_CTRL_BIT7_INV_MSB 16u
#define HSTX_CTRL_BIT7_INV_LSB 16u
#define HSTX_CTRL_BIT7_INV_ACCESS "RW"
#define HSTX_CTRL_BIT7_SEL_N_RESET 0x00u
#define HSTX_CTRL_BIT7_SEL_N_BITS 0x00001f00u
#define HSTX_CTRL_BIT7_SEL_N_MSB 12u
#define HSTX_CTRL_BIT7_SEL_N_LSB 8u
#define HSTX_CTRL_BIT7_SEL_N_ACCESS "RW"
#define HSTX_CTRL_BIT7_SEL_P_RESET 0x00u
#define HSTX_CTRL_BIT7_SEL_P_BITS 0x0000001fu
#define HSTX_CTRL_BIT7_SEL_P_MSB 4u
#define HSTX_CTRL_BIT7_SEL_P_LSB 0u
#define HSTX_CTRL_BIT7_SEL_P_ACCESS "RW"
#define HSTX_CTRL_EXPAND_SHIFT_OFFSET 0x00000024u
#define HSTX_CTRL_EXPAND_SHIFT_BITS 0x1f1f1f1fu
#define HSTX_CTRL_EXPAND_SHIFT_RESET 0x01000100u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_RESET 0x01u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_BITS 0x1f000000u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_MSB 28u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_LSB 24u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_ACCESS "RW"
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_RESET 0x00u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_BITS 0x001f0000u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_MSB 20u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_LSB 16u
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_ACCESS "RW"
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_RESET 0x01u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_BITS 0x00001f00u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_MSB 12u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_LSB 8u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_ACCESS "RW"
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_RESET 0x00u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_BITS 0x0000001fu
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_MSB 4u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_LSB 0u
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_ACCESS "RW"
#define HSTX_CTRL_EXPAND_TMDS_OFFSET 0x00000028u
#define HSTX_CTRL_EXPAND_TMDS_BITS 0x00ffffffu
#define HSTX_CTRL_EXPAND_TMDS_RESET 0x00000000u
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_RESET 0x0u
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_BITS 0x00e00000u
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_MSB 23u
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_LSB 21u
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_ACCESS "RW"
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_RESET 0x00u
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_BITS 0x001f0000u
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_MSB 20u
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_LSB 16u
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_ACCESS "RW"
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_RESET 0x0u
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_BITS 0x0000e000u
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_MSB 15u
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_LSB 13u
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_ACCESS "RW"
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_RESET 0x00u
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_BITS 0x00001f00u
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_MSB 12u
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_LSB 8u
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_ACCESS "RW"
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_RESET 0x0u
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_BITS 0x000000e0u
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_MSB 7u
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_LSB 5u
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_ACCESS "RW"
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_RESET 0x00u
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_BITS 0x0000001fu
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_MSB 4u
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_LSB 0u
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_ACCESS "RW"
typedef struct {
   
    io_rw_32 csr;
   
    io_rw_32 bit[8];
   
    io_rw_32 expand_shift;
   
    io_rw_32 expand_tmds;
} hstx_ctrl_hw_t;
