gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
static hstx_ctrl_hw_t * const hstx_ctrl_hw = (hstx_ctrl_hw_t *)HSTX_CTRL_BASE; // ORIGINAL: #define hstx_ctrl_hw ((hstx_ctrl_hw_t *)HSTX_CTRL_BASE)
_Static_assert(sizeof (hstx_ctrl_hw_t) == 0x002c, "");
#define _HARDWARE_STRUCTS_PSM_H 
#define _HARDWARE_REGS_PSM_H 
#define PSM_FRCE_ON_OFFSET 0x00000000u
#define PSM_FRCE_ON_BITS 0x01ffffffu
#define PSM_FRCE_ON_RESET 0x00000000u
#define PSM_FRCE_ON_PROC1_RESET 0x0u
#define PSM_FRCE_ON_PROC1_BITS 0x01000000u
#define PSM_FRCE_ON_PROC1_MSB 24u
#define PSM_FRCE_ON_PROC1_LSB 24u
#define PSM_FRCE_ON_PROC1_ACCESS "RW"
#define PSM_FRCE_ON_PROC0_RESET 0x0u
#define PSM_FRCE_ON_PROC0_BITS 0x00800000u
#define PSM_FRCE_ON_PROC0_MSB 23u
#define PSM_FRCE_ON_PROC0_LSB 23u
#define PSM_FRCE_ON_PROC0_ACCESS "RW"
#define PSM_FRCE_ON_ACCESSCTRL_RESET 0x0u
#define PSM_FRCE_ON_ACCESSCTRL_BITS 0x00400000u
#define PSM_FRCE_ON_ACCESSCTRL_MSB 22u
#define PSM_FRCE_ON_ACCESSCTRL_LSB 22u
#define PSM_FRCE_ON_ACCESSCTRL_ACCESS "RW"
#define PSM_FRCE_ON_SIO_RESET 0x0u
#define PSM_FRCE_ON_SIO_BITS 0x00200000u
#define PSM_FRCE_ON_SIO_MSB 21u
#define PSM_FRCE_ON_SIO_LSB 21u
#define PSM_FRCE_ON_SIO_ACCESS "RW"
#define PSM_FRCE_ON_XIP_RESET 0x0u
#define PSM_FRCE_ON_XIP_BITS 0x00100000u
#define PSM_FRCE_ON_XIP_MSB 20u
#define PSM_FRCE_ON_XIP_LSB 20u
#define PSM_FRCE_ON_XIP_ACCESS "RW"
#define PSM_FRCE_ON_SRAM9_RESET 0x0u
#define PSM_FRCE_ON_SRAM9_BITS 0x00080000u
#define PSM_FRCE_ON_SRAM9_MSB 19u
#define PSM_FRCE_ON_SRAM9_LSB 19u
#define PSM_FRCE_ON_SRAM9_ACCESS "RW"
#define PSM_FRCE_ON_SRAM8_RESET 0x0u
#define PSM_FRCE_ON_SRAM8_BITS 0x00040000u
#define PSM_FRCE_ON_SRAM8_MSB 18u
#define PSM_FRCE_ON_SRAM8_LSB 18u
#define PSM_FRCE_ON_SRAM8_ACCESS "RW"
#define PSM_FRCE_ON_SRAM7_RESET 0x0u
#define PSM_FRCE_ON_SRAM7_BITS 0x00020000u
#define PSM_FRCE_ON_SRAM7_MSB 17u
#define PSM_FRCE_ON_SRAM7_LSB 17u
#define PSM_FRCE_ON_SRAM7_ACCESS "RW"
#define PSM_FRCE_ON_SRAM6_RESET 0x0u
#define PSM_FRCE_ON_SRAM6_BITS 0x00010000u
#define PSM_FRCE_ON_SRAM6_MSB 16u
#define PSM_FRCE_ON_SRAM6_LSB 16u
#define PSM_FRCE_ON_SRAM6_ACCESS "RW"
#define PSM_FRCE_ON_SRAM5_RESET 0x0u
#define PSM_FRCE_ON_SRAM5_BITS 0x00008000u
#define PSM_FRCE_ON_SRAM5_MSB 15u
#define PSM_FRCE_ON_SRAM5_LSB 15u
#define PSM_FRCE_ON_SRAM5_ACCESS "RW"
#define PSM_FRCE_ON_SRAM4_RESET 0x0u
#define PSM_FRCE_ON_SRAM4_BITS 0x00004000u
#define PSM_FRCE_ON_SRAM4_MSB 14u
#define PSM_FRCE_ON_SRAM4_LSB 14u
#define PSM_FRCE_ON_SRAM4_ACCESS "RW"
#define PSM_FRCE_ON_SRAM3_RESET 0x0u
#define PSM_FRCE_ON_SRAM3_BITS 0x00002000u
#define PSM_FRCE_ON_SRAM3_MSB 13u
#define PSM_FRCE_ON_SRAM3_LSB 13u
#define PSM_FRCE_ON_SRAM3_ACCESS "RW"
#define PSM_FRCE_ON_SRAM2_RESET 0x0u
#define PSM_FRCE_ON_SRAM2_BITS 0x00001000u
#define PSM_FRCE_ON_SRAM2_MSB 12u
#define PSM_FRCE_ON_SRAM2_LSB 12u
#define PSM_FRCE_ON_SRAM2_ACCESS "RW"
#define PSM_FRCE_ON_SRAM1_RESET 0x0u
#define PSM_FRCE_ON_SRAM1_BITS 0x00000800u
#define PSM_FRCE_ON_SRAM1_MSB 11u
#define PSM_FRCE_ON_SRAM1_LSB 11u
#define PSM_FRCE_ON_SRAM1_ACCESS "RW"
#define PSM_FRCE_ON_SRAM0_RESET 0x0u
#define PSM_FRCE_ON_SRAM0_BITS 0x00000400u
#define PSM_FRCE_ON_SRAM0_MSB 10u
#define PSM_FRCE_ON_SRAM0_LSB 10u
#define PSM_FRCE_ON_SRAM0_ACCESS "RW"
#define PSM_FRCE_ON_BOOTRAM_RESET 0x0u
#define PSM_FRCE_ON_BOOTRAM_BITS 0x00000200u
#define PSM_FRCE_ON_BOOTRAM_MSB 9u
#define PSM_FRCE_ON_BOOTRAM_LSB 9u
#define PSM_FRCE_ON_BOOTRAM_ACCESS "RW"
#define PSM_FRCE_ON_ROM_RESET 0x0u
#define PSM_FRCE_ON_ROM_BITS 0x00000100u
#define PSM_FRCE_ON_ROM_MSB 8u
#define PSM_FRCE_ON_ROM_LSB 8u
#define PSM_FRCE_ON_ROM_ACCESS "RW"
#define PSM_FRCE_ON_BUSFABRIC_RESET 0x0u
#define PSM_FRCE_ON_BUSFABRIC_BITS 0x00000080u
#define PSM_FRCE_ON_BUSFABRIC_MSB 7u
#define PSM_FRCE_ON_BUSFABRIC_LSB 7u
#define PSM_FRCE_ON_BUSFABRIC_ACCESS "RW"
#define PSM_FRCE_ON_PSM_READY_RESET 0x0u
#define PSM_FRCE_ON_PSM_READY_BITS 0x00000040u
#define PSM_FRCE_ON_PSM_READY_MSB 6u
#define PSM_FRCE_ON_PSM_READY_LSB 6u
#define PSM_FRCE_ON_PSM_READY_ACCESS "RW"
#define PSM_FRCE_ON_CLOCKS_RESET 0x0u
#define PSM_FRCE_ON_CLOCKS_BITS 0x00000020u
#define PSM_FRCE_ON_CLOCKS_MSB 5u
#define PSM_FRCE_ON_CLOCKS_LSB 5u
#define PSM_FRCE_ON_CLOCKS_ACCESS "RW"
#define PSM_FRCE_ON_RESETS_RESET 0x0u
#define PSM_FRCE_ON_RESETS_BITS 0x00000010u
#define PSM_FRCE_ON_RESETS_MSB 4u
#define PSM_FRCE_ON_RESETS_LSB 4u
#define PSM_FRCE_ON_RESETS_ACCESS "RW"
#define PSM_FRCE_ON_XOSC_RESET 0x0u
#define PSM_FRCE_ON_XOSC_BITS 0x00000008u
#define PSM_FRCE_ON_XOSC_MSB 3u
#define PSM_FRCE_ON_XOSC_LSB 3u
#define PSM_FRCE_ON_XOSC_ACCESS "RW"
#define PSM_FRCE_ON_ROSC_RESET 0x0u
#define PSM_FRCE_ON_ROSC_BITS 0x00000004u
#define PSM_FRCE_ON_ROSC_MSB 2u
#define PSM_FRCE_ON_ROSC_LSB 2u
#define PSM_FRCE_ON_ROSC_ACCESS "RW"
#define PSM_FRCE_ON_OTP_RESET 0x0u
#define PSM_FRCE_ON_OTP_BITS 0x00000002u
#define PSM_FRCE_ON_OTP_MSB 1u
#define PSM_FRCE_ON_OTP_LSB 1u
#define PSM_FRCE_ON_OTP_ACCESS "RW"
#define PSM_FRCE_ON_PROC_COLD_RESET 0x0u
#define PSM_FRCE_ON_PROC_COLD_BITS 0x00000001u
#define PSM_FRCE_ON_PROC_COLD_MSB 0u
#define PSM_FRCE_ON_PROC_COLD_LSB 0u
#define PSM_FRCE_ON_PROC_COLD_ACCESS "RW"
#define PSM_FRCE_OFF_OFFSET 0x00000004u
#define PSM_FRCE_OFF_BITS 0x01ffffffu
#define PSM_FRCE_OFF_RESET 0x00000000u
#define PSM_FRCE_OFF_PROC1_RESET 0x0u
#define PSM_FRCE_OFF_PROC1_BITS 0x01000000u
#define PSM_FRCE_OFF_PROC1_MSB 24u
#define PSM_FRCE_OFF_PROC1_LSB 24u
#define PSM_FRCE_OFF_PROC1_ACCESS "RW"
#define PSM_FRCE_OFF_PROC0_RESET 0x0u
#define PSM_FRCE_OFF_PROC0_BITS 0x00800000u
#define PSM_FRCE_OFF_PROC0_MSB 23u
#define PSM_FRCE_OFF_PROC0_LSB 23u
#define PSM_FRCE_OFF_PROC0_ACCESS "RW"
#define PSM_FRCE_OFF_ACCESSCTRL_RESET 0x0u
#define PSM_FRCE_OFF_ACCESSCTRL_BITS 0x00400000u
#define PSM_FRCE_OFF_ACCESSCTRL_MSB 22u
#define PSM_FRCE_OFF_ACCESSCTRL_LSB 22u
#define PSM_FRCE_OFF_ACCESSCTRL_ACCESS "RW"
#define PSM_FRCE_OFF_SIO_RESET 0x0u
#define PSM_FRCE_OFF_SIO_BITS 0x00200000u
#define PSM_FRCE_OFF_SIO_MSB 21u
#define PSM_FRCE_OFF_SIO_LSB 21u
#define PSM_FRCE_OFF_SIO_ACCESS "RW"
#define PSM_FRCE_OFF_XIP_RESET 0x0u
#define PSM_FRCE_OFF_XIP_BITS 0x00100000u
#define PSM_FRCE_OFF_XIP_MSB 20u
#define PSM_FRCE_OFF_XIP_LSB 20u
#define PSM_FRCE_OFF_XIP_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM9_RESET 0x0u
#define PSM_FRCE_OFF_SRAM9_BITS 0x00080000u
#define PSM_FRCE_OFF_SRAM9_MSB 19u
#define PSM_FRCE_OFF_SRAM9_LSB 19u
#define PSM_FRCE_OFF_SRAM9_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM8_RESET 0x0u
#define PSM_FRCE_OFF_SRAM8_BITS 0x00040000u
#define PSM_FRCE_OFF_SRAM8_MSB 18u
#define PSM_FRCE_OFF_SRAM8_LSB 18u
#define PSM_FRCE_OFF_SRAM8_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM7_RESET 0x0u
#define PSM_FRCE_OFF_SRAM7_BITS 0x00020000u
#define PSM_FRCE_OFF_SRAM7_MSB 17u
#define PSM_FRCE_OFF_SRAM7_LSB 17u
#define PSM_FRCE_OFF_SRAM7_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM6_RESET 0x0u
#define PSM_FRCE_OFF_SRAM6_BITS 0x00010000u
#define PSM_FRCE_OFF_SRAM6_MSB 16u
#define PSM_FRCE_OFF_SRAM6_LSB 16u
#define PSM_FRCE_OFF_SRAM6_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM5_RESET 0x0u
#define PSM_FRCE_OFF_SRAM5_BITS 0x00008000u
#define PSM_FRCE_OFF_SRAM5_MSB 15u
#define PSM_FRCE_OFF_SRAM5_LSB 15u
#define PSM_FRCE_OFF_SRAM5_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM4_RESET 0x0u
#define PSM_FRCE_OFF_SRAM4_BITS 0x00004000u
#define PSM_FRCE_OFF_SRAM4_MSB 14u
#define PSM_FRCE_OFF_SRAM4_LSB 14u
#define PSM_FRCE_OFF_SRAM4_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM3_RESET 0x0u
#define PSM_FRCE_OFF_SRAM3_BITS 0x00002000u
#define PSM_FRCE_OFF_SRAM3_MSB 13u
#define PSM_FRCE_OFF_SRAM3_LSB 13u
#define PSM_FRCE_OFF_SRAM3_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM2_RESET 0x0u
#define PSM_FRCE_OFF_SRAM2_BITS 0x00001000u
#define PSM_FRCE_OFF_SRAM2_MSB 12u
#define PSM_FRCE_OFF_SRAM2_LSB 12u
#define PSM_FRCE_OFF_SRAM2_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM1_RESET 0x0u
#define PSM_FRCE_OFF_SRAM1_BITS 0x00000800u
#define PSM_FRCE_OFF_SRAM1_MSB 11u
#define PSM_FRCE_OFF_SRAM1_LSB 11u
#define PSM_FRCE_OFF_SRAM1_ACCESS "RW"
#define PSM_FRCE_OFF_SRAM0_RESET 0x0u
#define PSM_FRCE_OFF_SRAM0_BITS 0x00000400u
#define PSM_FRCE_OFF_SRAM0_MSB 10u
#define PSM_FRCE_OFF_SRAM0_LSB 10u
#define PSM_FRCE_OFF_SRAM0_ACCESS "RW"
#define PSM_FRCE_OFF_BOOTRAM_RESET 0x0u
#define PSM_FRCE_OFF_BOOTRAM_BITS 0x00000200u
#define PSM_FRCE_OFF_BOOTRAM_MSB 9u
#define PSM_FRCE_OFF_BOOTRAM_LSB 9u
#define PSM_FRCE_OFF_BOOTRAM_ACCESS "RW"
#define PSM_FRCE_OFF_ROM_RESET 0x0u
#define PSM_FRCE_OFF_ROM_BITS 0x00000100u
#define PSM_FRCE_OFF_ROM_MSB 8u
#define PSM_FRCE_OFF_ROM_LSB 8u
#define PSM_FRCE_OFF_ROM_ACCESS "RW"
#define PSM_FRCE_OFF_BUSFABRIC_RESET 0x0u
#define PSM_FRCE_OFF_BUSFABRIC_BITS 0x00000080u
#define PSM_FRCE_OFF_BUSFABRIC_MSB 7u
#define PSM_FRCE_OFF_BUSFABRIC_LSB 7u
#define PSM_FRCE_OFF_BUSFABRIC_ACCESS "RW"
#define PSM_FRCE_OFF_PSM_READY_RESET 0x0u
#define PSM_FRCE_OFF_PSM_READY_BITS 0x00000040u
#define PSM_FRCE_OFF_PSM_READY_MSB 6u
#define PSM_FRCE_OFF_PSM_READY_LSB 6u
#define PSM_FRCE_OFF_PSM_READY_ACCESS "RW"
#define PSM_FRCE_OFF_CLOCKS_RESET 0x0u
#define PSM_FRCE_OFF_CLOCKS_BITS 0x00000020u
#define PSM_FRCE_OFF_CLOCKS_MSB 5u
#define PSM_FRCE_OFF_CLOCKS_LSB 5u
#define PSM_FRCE_OFF_CLOCKS_ACCESS "RW"
#define PSM_FRCE_OFF_RESETS_RESET 0x0u
#define PSM_FRCE_OFF_RESETS_BITS 0x00000010u
#define PSM_FRCE_OFF_RESETS_MSB 4u
#define PSM_FRCE_OFF_RESETS_LSB 4u
#define PSM_FRCE_OFF_RESETS_ACCESS "RW"
#define PSM_FRCE_OFF_XOSC_RESET 0x0u
#define PSM_FRCE_OFF_XOSC_BITS 0x00000008u
#define PSM_FRCE_OFF_XOSC_MSB 3u
#define PSM_FRCE_OFF_XOSC_LSB 3u
#define PSM_FRCE_OFF_XOSC_ACCESS "RW"
#define PSM_FRCE_OFF_ROSC_RESET 0x0u
#define PSM_FRCE_OFF_ROSC_BITS 0x00000004u
#define PSM_FRCE_OFF_ROSC_MSB 2u
#define PSM_FRCE_OFF_ROSC_LSB 2u
#define PSM_FRCE_OFF_ROSC_ACCESS "RW"
#define PSM_FRCE_OFF_OTP_RESET 0x0u
#define PSM_FRCE_OFF_OTP_BITS 0x00000002u
#define PSM_FRCE_OFF_OTP_MSB 1u
#define PSM_FRCE_OFF_OTP_LSB 1u
#define PSM_FRCE_OFF_OTP_ACCESS "RW"
#define PSM_FRCE_OFF_PROC_COLD_RESET 0x0u
#define PSM_FRCE_OFF_PROC_COLD_BITS 0x00000001u
#define PSM_FRCE_OFF_PROC_COLD_MSB 0u
#define PSM_FRCE_OFF_PROC_COLD_LSB 0u
#define PSM_FRCE_OFF_PROC_COLD_ACCESS "RW"
#define PSM_WDSEL_OFFSET 0x00000008u
#define PSM_WDSEL_BITS 0x01ffffffu
#define PSM_WDSEL_RESET 0x00000000u
#define PSM_WDSEL_PROC1_RESET 0x0u
#define PSM_WDSEL_PROC1_BITS 0x01000000u
#define PSM_WDSEL_PROC1_MSB 24u
#define PSM_WDSEL_PROC1_LSB 24u
#define PSM_WDSEL_PROC1_ACCESS "RW"
#define PSM_WDSEL_PROC0_RESET 0x0u
#define PSM_WDSEL_PROC0_BITS 0x00800000u
#define PSM_WDSEL_PROC0_MSB 23u
#define PSM_WDSEL_PROC0_LSB 23u
#define PSM_WDSEL_PROC0_ACCESS "RW"
#define PSM_WDSEL_ACCESSCTRL_RESET 0x0u
#define PSM_WDSEL_ACCESSCTRL_BITS 0x00400000u
#define PSM_WDSEL_ACCESSCTRL_MSB 22u
#define PSM_WDSEL_ACCESSCTRL_LSB 22u
#define PSM_WDSEL_ACCESSCTRL_ACCESS "RW"
#define PSM_WDSEL_SIO_RESET 0x0u
#define PSM_WDSEL_SIO_BITS 0x00200000u
#define PSM_WDSEL_SIO_MSB 21u
#define PSM_WDSEL_SIO_LSB 21u
#define PSM_WDSEL_SIO_ACCESS "RW"
#define PSM_WDSEL_XIP_RESET 0x0u
#define PSM_WDSEL_XIP_BITS 0x00100000u
#define PSM_WDSEL_XIP_MSB 20u
#define PSM_WDSEL_XIP_LSB 20u
#define PSM_WDSEL_XIP_ACCESS "RW"
#define PSM_WDSEL_SRAM9_RESET 0x0u
#define PSM_WDSEL_SRAM9_BITS 0x00080000u
#define PSM_WDSEL_SRAM9_MSB 19u
#define PSM_WDSEL_SRAM9_LSB 19u
#define PSM_WDSEL_SRAM9_ACCESS "RW"
#define PSM_WDSEL_SRAM8_RESET 0x0u
#define PSM_WDSEL_SRAM8_BITS 0x00040000u
#define PSM_WDSEL_SRAM8_MSB 18u
#define PSM_WDSEL_SRAM8_LSB 18u
#define PSM_WDSEL_SRAM8_ACCESS "RW"
#define PSM_WDSEL_SRAM7_RESET 0x0u
#define PSM_WDSEL_SRAM7_BITS 0x00020000u
#define PSM_WDSEL_SRAM7_MSB 17u
#define PSM_WDSEL_SRAM7_LSB 17u
#define PSM_WDSEL_SRAM7_ACCESS "RW"
#define PSM_WDSEL_SRAM6_RESET 0x0u
#define PSM_WDSEL_SRAM6_BITS 0x00010000u
#define PSM_WDSEL_SRAM6_MSB 16u
#define PSM_WDSEL_SRAM6_LSB 16u
#define PSM_WDSEL_SRAM6_ACCESS "RW"
#define PSM_WDSEL_SRAM5_RESET 0x0u
#define PSM_WDSEL_SRAM5_BITS 0x00008000u
#define PSM_WDSEL_SRAM5_MSB 15u
#define PSM_WDSEL_SRAM5_LSB 15u
#define PSM_WDSEL_SRAM5_ACCESS "RW"
#define PSM_WDSEL_SRAM4_RESET 0x0u
#define PSM_WDSEL_SRAM4_BITS 0x00004000u
#define PSM_WDSEL_SRAM4_MSB 14u
#define PSM_WDSEL_SRAM4_LSB 14u
#define PSM_WDSEL_SRAM4_ACCESS "RW"
#define PSM_WDSEL_SRAM3_RESET 0x0u
#define PSM_WDSEL_SRAM3_BITS 0x00002000u
#define PSM_WDSEL_SRAM3_MSB 13u
#define PSM_WDSEL_SRAM3_LSB 13u
#define PSM_WDSEL_SRAM3_ACCESS "RW"
#define PSM_WDSEL_SRAM2_RESET 0x0u
#define PSM_WDSEL_SRAM2_BITS 0x00001000u
#define PSM_WDSEL_SRAM2_MSB 12u
#define PSM_WDSEL_SRAM2_LSB 12u
#define PSM_WDSEL_SRAM2_ACCESS "RW"
#define PSM_WDSEL_SRAM1_RESET 0x0u
#define PSM_WDSEL_SRAM1_BITS 0x00000800u
#define PSM_WDSEL_SRAM1_MSB 11u
#define PSM_WDSEL_SRAM1_LSB 11u
#define PSM_WDSEL_SRAM1_ACCESS "RW"
#define PSM_WDSEL_SRAM0_RESET 0x0u
#define PSM_WDSEL_SRAM0_BITS 0x00000400u
#define PSM_WDSEL_SRAM0_MSB 10u
#define PSM_WDSEL_SRAM0_LSB 10u
#define PSM_WDSEL_SRAM0_ACCESS "RW"
#define PSM_WDSEL_BOOTRAM_RESET 0x0u
#define PSM_WDSEL_BOOTRAM_BITS 0x00000200u
#define PSM_WDSEL_BOOTRAM_MSB 9u
#define PSM_WDSEL_BOOTRAM_LSB 9u
#define PSM_WDSEL_BOOTRAM_ACCESS "RW"
#define PSM_WDSEL_ROM_RESET 0x0u
#define PSM_WDSEL_ROM_BITS 0x00000100u
#define PSM_WDSEL_ROM_MSB 8u
#define PSM_WDSEL_ROM_LSB 8u
#define PSM_WDSEL_ROM_ACCESS "RW"
#define PSM_WDSEL_BUSFABRIC_RESET 0x0u
#define PSM_WDSEL_BUSFABRIC_BITS 0x00000080u
#define PSM_WDSEL_BUSFABRIC_MSB 7u
#define PSM_WDSEL_BUSFABRIC_LSB 7u
#define PSM_WDSEL_BUSFABRIC_ACCESS "RW"
#define PSM_WDSEL_PSM_READY_RESET 0x0u
#define PSM_WDSEL_PSM_READY_BITS 0x00000040u
#define PSM_WDSEL_PSM_READY_MSB 6u
#define PSM_WDSEL_PSM_READY_LSB 6u
#define PSM_WDSEL_PSM_READY_ACCESS "RW"
#define PSM_WDSEL_CLOCKS_RESET 0x0u
#define PSM_WDSEL_CLOCKS_BITS 0x00000020u
#define PSM_WDSEL_CLOCKS_MSB 5u
#define PSM_WDSEL_CLOCKS_LSB 5u
#define PSM_WDSEL_CLOCKS_ACCESS "RW"
#define PSM_WDSEL_RESETS_RESET 0x0u
#define PSM_WDSEL_RESETS_BITS 0x00000010u
#define PSM_WDSEL_RESETS_MSB 4u
#define PSM_WDSEL_RESETS_LSB 4u
#define PSM_WDSEL_RESETS_ACCESS "RW"
#define PSM_WDSEL_XOSC_RESET 0x0u
#define PSM_WDSEL_XOSC_BITS 0x00000008u
#define PSM_WDSEL_XOSC_MSB 3u
#define PSM_WDSEL_XOSC_LSB 3u
#define PSM_WDSEL_XOSC_ACCESS "RW"
#define PSM_WDSEL_ROSC_RESET 0x0u
#define PSM_WDSEL_ROSC_BITS 0x00000004u
#define PSM_WDSEL_ROSC_MSB 2u
#define PSM_WDSEL_ROSC_LSB 2u
#define PSM_WDSEL_ROSC_ACCESS "RW"
#define PSM_WDSEL_OTP_RESET 0x0u
#define PSM_WDSEL_OTP_BITS 0x00000002u
#define PSM_WDSEL_OTP_MSB 1u
#define PSM_WDSEL_OTP_LSB 1u
#define PSM_WDSEL_OTP_ACCESS "RW"
#define PSM_WDSEL_PROC_COLD_RESET 0x0u
#define PSM_WDSEL_PROC_COLD_BITS 0x00000001u
#define PSM_WDSEL_PROC_COLD_MSB 0u
#define PSM_WDSEL_PROC_COLD_LSB 0u
#define PSM_WDSEL_PROC_COLD_ACCESS "RW"
#define PSM_DONE_OFFSET 0x0000000cu
#define PSM_DONE_BITS 0x01ffffffu
#define PSM_DONE_RESET 0x00000000u
#define PSM_DONE_PROC1_RESET 0x0u
#define PSM_DONE_PROC1_BITS 0x01000000u
#define PSM_DONE_PROC1_MSB 24u
#define PSM_DONE_PROC1_LSB 24u
#define PSM_DONE_PROC1_ACCESS "RO"
#define PSM_DONE_PROC0_RESET 0x0u
#define PSM_DONE_PROC0_BITS 0x00800000u
#define PSM_DONE_PROC0_MSB 23u
#define PSM_DONE_PROC0_LSB 23u
#define PSM_DONE_PROC0_ACCESS "RO"
#define PSM_DONE_ACCESSCTRL_RESET 0x0u
#define PSM_DONE_ACCESSCTRL_BITS 0x00400000u
#define PSM_DONE_ACCESSCTRL_MSB 22u
#define PSM_DONE_ACCESSCTRL_LSB 22u
#define PSM_DONE_ACCESSCTRL_ACCESS "RO"
#define PSM_DONE_SIO_RESET 0x0u
#define PSM_DONE_SIO_BITS 0x00200000u
#define PSM_DONE_SIO_MSB 21u
#define PSM_DONE_SIO_LSB 21u
#define PSM_DONE_SIO_ACCESS "RO"
#define PSM_DONE_XIP_RESET 0x0u
#define PSM_DONE_XIP_BITS 0x00100000u
#define PSM_DONE_XIP_MSB 20u
#define PSM_DONE_XIP_LSB 20u
#define PSM_DONE_XIP_ACCESS "RO"
#define PSM_DONE_SRAM9_RESET 0x0u
#define PSM_DONE_SRAM9_BITS 0x00080000u
#define PSM_DONE_SRAM9_MSB 19u
#define PSM_DONE_SRAM9_LSB 19u
#define PSM_DONE_SRAM9_ACCESS "RO"
#define PSM_DONE_SRAM8_RESET 0x0u
#define PSM_DONE_SRAM8_BITS 0x00040000u
#define PSM_DONE_SRAM8_MSB 18u
#define PSM_DONE_SRAM8_LSB 18u
#define PSM_DONE_SRAM8_ACCESS "RO"
#define PSM_DONE_SRAM7_RESET 0x0u
#define PSM_DONE_SRAM7_BITS 0x00020000u
#define PSM_DONE_SRAM7_MSB 17u
#define PSM_DONE_SRAM7_LSB 17u
#define PSM_DONE_SRAM7_ACCESS "RO"
#define PSM_DONE_SRAM6_RESET 0x0u
#define PSM_DONE_SRAM6_BITS 0x00010000u
#define PSM_DONE_SRAM6_MSB 16u
#define PSM_DONE_SRAM6_LSB 16u
#define PSM_DONE_SRAM6_ACCESS "RO"
#define PSM_DONE_SRAM5_RESET 0x0u
#define PSM_DONE_SRAM5_BITS 0x00008000u
#define PSM_DONE_SRAM5_MSB 15u
#define PSM_DONE_SRAM5_LSB 15u
#define PSM_DONE_SRAM5_ACCESS "RO"
#define PSM_DONE_SRAM4_RESET 0x0u
#define PSM_DONE_SRAM4_BITS 0x00004000u
#define PSM_DONE_SRAM4_MSB 14u
#define PSM_DONE_SRAM4_LSB 14u
#define PSM_DONE_SRAM4_ACCESS "RO"
#define PSM_DONE_SRAM3_RESET 0x0u
#define PSM_DONE_SRAM3_BITS 0x00002000u
#define PSM_DONE_SRAM3_MSB 13u
#define PSM_DONE_SRAM3_LSB 13u
#define PSM_DONE_SRAM3_ACCESS "RO"
#define PSM_DONE_SRAM2_RESET 0x0u
#define PSM_DONE_SRAM2_BITS 0x00001000u
#define PSM_DONE_SRAM2_MSB 12u
#define PSM_DONE_SRAM2_LSB 12u
#define PSM_DONE_SRAM2_ACCESS "RO"
#define PSM_DONE_SRAM1_RESET 0x0u
#define PSM_DONE_SRAM1_BITS 0x00000800u
#define PSM_DONE_SRAM1_MSB 11u
#define PSM_DONE_SRAM1_LSB 11u
#define PSM_DONE_SRAM1_ACCESS "RO"
#define PSM_DONE_SRAM0_RESET 0x0u
#define PSM_DONE_SRAM0_BITS 0x00000400u
#define PSM_DONE_SRAM0_MSB 10u
#define PSM_DONE_SRAM0_LSB 10u
#define PSM_DONE_SRAM0_ACCESS "RO"
#define PSM_DONE_BOOTRAM_RESET 0x0u
#define PSM_DONE_BOOTRAM_BITS 0x00000200u
#define PSM_DONE_BOOTRAM_MSB 9u
#define PSM_DONE_BOOTRAM_LSB 9u
#define PSM_DONE_BOOTRAM_ACCESS "RO"
#define PSM_DONE_ROM_RESET 0x0u
#define PSM_DONE_ROM_BITS 0x00000100u
#define PSM_DONE_ROM_MSB 8u
#define PSM_DONE_ROM_LSB 8u
#define PSM_DONE_ROM_ACCESS "RO"
#define PSM_DONE_BUSFABRIC_RESET 0x0u
#define PSM_DONE_BUSFABRIC_BITS 0x00000080u
#define PSM_DONE_BUSFABRIC_MSB 7u
#define PSM_DONE_BUSFABRIC_LSB 7u
#define PSM_DONE_BUSFABRIC_ACCESS "RO"
#define PSM_DONE_PSM_READY_RESET 0x0u
#define PSM_DONE_PSM_READY_BITS 0x00000040u
#define PSM_DONE_PSM_READY_MSB 6u
#define PSM_DONE_PSM_READY_LSB 6u
#define PSM_DONE_PSM_READY_ACCESS "RO"
#define PSM_DONE_CLOCKS_RESET 0x0u
#define PSM_DONE_CLOCKS_BITS 0x00000020u
#define PSM_DONE_CLOCKS_MSB 5u
#define PSM_DONE_CLOCKS_LSB 5u
#define PSM_DONE_CLOCKS_ACCESS "RO"
#define PSM_DONE_RESETS_RESET 0x0u
#define PSM_DONE_RESETS_BITS 0x00000010u
#define PSM_DONE_RESETS_MSB 4u
#define PSM_DONE_RESETS_LSB 4u
#define PSM_DONE_RESETS_ACCESS "RO"
#define PSM_DONE_XOSC_RESET 0x0u
#define PSM_DONE_XOSC_BITS 0x00000008u
#define PSM_DONE_XOSC_MSB 3u
#define PSM_DONE_XOSC_LSB 3u
#define PSM_DONE_XOSC_ACCESS "RO"
#define PSM_DONE_ROSC_RESET 0x0u
#define PSM_DONE_ROSC_BITS 0x00000004u
#define PSM_DONE_ROSC_MSB 2u
#define PSM_DONE_ROSC_LSB 2u
#define PSM_DONE_ROSC_ACCESS "RO"
#define PSM_DONE_OTP_RESET 0x0u
#define PSM_DONE_OTP_BITS 0x00000002u
#define PSM_DONE_OTP_MSB 1u
#define PSM_DONE_OTP_LSB 1u
#define PSM_DONE_OTP_ACCESS "RO"
#define PSM_DONE_PROC_COLD_RESET 0x0u
#define PSM_DONE_PROC_COLD_BITS 0x00000001u
#define PSM_DONE_PROC_COLD_MSB 0u
#define PSM_DONE_PROC_COLD_LSB 0u
#define PSM_DONE_PROC_COLD_ACCESS "RO"
typedef struct {
   
    io_rw_32 frce_on;
   
    io_rw_32 frce_off;
   
    io_rw_32 wdsel;
   
    io_ro_32 done;
} psm_hw_t;
