gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
static psm_hw_t * const psm_hw = (psm_hw_t *)PSM_BASE; // ORIGINAL: #define psm_hw ((psm_hw_t *)PSM_BASE)
_Static_assert(sizeof (psm_hw_t) == 0x0010, "");
#define _HARDWARE_STRUCTS_M33_EPPB_H 
#define _HARDWARE_REGS_M33_EPPB_H 
#define M33_EPPB_NMI_MASK0_OFFSET 0x00000000u
#define M33_EPPB_NMI_MASK0_BITS 0xffffffffu
#define M33_EPPB_NMI_MASK0_RESET 0x00000000u
#define M33_EPPB_NMI_MASK0_MSB 31u
#define M33_EPPB_NMI_MASK0_LSB 0u
#define M33_EPPB_NMI_MASK0_ACCESS "RW"
#define M33_EPPB_NMI_MASK1_OFFSET 0x00000004u
#define M33_EPPB_NMI_MASK1_BITS 0x000fffffu
#define M33_EPPB_NMI_MASK1_RESET 0x00000000u
#define M33_EPPB_NMI_MASK1_MSB 19u
#define M33_EPPB_NMI_MASK1_LSB 0u
#define M33_EPPB_NMI_MASK1_ACCESS "RW"
#define M33_EPPB_SLEEPCTRL_OFFSET 0x00000008u
#define M33_EPPB_SLEEPCTRL_BITS 0x00000007u
#define M33_EPPB_SLEEPCTRL_RESET 0x00000002u
#define M33_EPPB_SLEEPCTRL_WICENACK_RESET 0x0u
#define M33_EPPB_SLEEPCTRL_WICENACK_BITS 0x00000004u
#define M33_EPPB_SLEEPCTRL_WICENACK_MSB 2u
#define M33_EPPB_SLEEPCTRL_WICENACK_LSB 2u
#define M33_EPPB_SLEEPCTRL_WICENACK_ACCESS "RO"
#define M33_EPPB_SLEEPCTRL_WICENREQ_RESET 0x1u
#define M33_EPPB_SLEEPCTRL_WICENREQ_BITS 0x00000002u
#define M33_EPPB_SLEEPCTRL_WICENREQ_MSB 1u
#define M33_EPPB_SLEEPCTRL_WICENREQ_LSB 1u
#define M33_EPPB_SLEEPCTRL_WICENREQ_ACCESS "RW"
#define M33_EPPB_SLEEPCTRL_LIGHT_SLEEP_RESET 0x0u
#define M33_EPPB_SLEEPCTRL_LIGHT_SLEEP_BITS 0x00000001u
#define M33_EPPB_SLEEPCTRL_LIGHT_SLEEP_MSB 0u
#define M33_EPPB_SLEEPCTRL_LIGHT_SLEEP_LSB 0u
#define M33_EPPB_SLEEPCTRL_LIGHT_SLEEP_ACCESS "RW"
typedef struct {
   
    io_rw_32 nmi_mask[2];
   
    io_rw_32 sleepctrl;
} m33_eppb_hw_t;
static m33_eppb_hw_t * const eppb_hw = (m33_eppb_hw_t *)EPPB_BASE; // ORIGINAL: #define eppb_hw ((m33_eppb_hw_t *)EPPB_BASE)
_Static_assert(sizeof (m33_eppb_hw_t) == 0x000c, "");
#define _HARDWARE_STRUCTS_XIP_AUX_H 
#define _HARDWARE_REGS_XIP_AUX_H 
#define XIP_AUX_STREAM_OFFSET 0x00000000u
#define XIP_AUX_STREAM_BITS 0xffffffffu
#define XIP_AUX_STREAM_RESET 0x00000000u
#define XIP_AUX_STREAM_MSB 31u
#define XIP_AUX_STREAM_LSB 0u
#define XIP_AUX_STREAM_ACCESS "RF"
#define XIP_AUX_QMI_DIRECT_TX_OFFSET 0x00000004u
#define XIP_AUX_QMI_DIRECT_TX_BITS 0x001fffffu
#define XIP_AUX_QMI_DIRECT_TX_RESET 0x00000000u
#define XIP_AUX_QMI_DIRECT_TX_NOPUSH_RESET 0x0u
#define XIP_AUX_QMI_DIRECT_TX_NOPUSH_BITS 0x00100000u
#define XIP_AUX_QMI_DIRECT_TX_NOPUSH_MSB 20u
#define XIP_AUX_QMI_DIRECT_TX_NOPUSH_LSB 20u
#define XIP_AUX_QMI_DIRECT_TX_NOPUSH_ACCESS "WF"
#define XIP_AUX_QMI_DIRECT_TX_OE_RESET 0x0u
#define XIP_AUX_QMI_DIRECT_TX_OE_BITS 0x00080000u
#define XIP_AUX_QMI_DIRECT_TX_OE_MSB 19u
#define XIP_AUX_QMI_DIRECT_TX_OE_LSB 19u
#define XIP_AUX_QMI_DIRECT_TX_OE_ACCESS "WF"
#define XIP_AUX_QMI_DIRECT_TX_DWIDTH_RESET 0x0u
#define XIP_AUX_QMI_DIRECT_TX_DWIDTH_BITS 0x00040000u
#define XIP_AUX_QMI_DIRECT_TX_DWIDTH_MSB 18u
#define XIP_AUX_QMI_DIRECT_TX_DWIDTH_LSB 18u
#define XIP_AUX_QMI_DIRECT_TX_DWIDTH_ACCESS "WF"
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_RESET 0x0u
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_BITS 0x00030000u
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_MSB 17u
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_LSB 16u
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_ACCESS "WF"
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_VALUE_S 0x0u
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_VALUE_D 0x1u
#define XIP_AUX_QMI_DIRECT_TX_IWIDTH_VALUE_Q 0x2u
#define XIP_AUX_QMI_DIRECT_TX_DATA_RESET 0x0000u
#define XIP_AUX_QMI_DIRECT_TX_DATA_BITS 0x0000ffffu
#define XIP_AUX_QMI_DIRECT_TX_DATA_MSB 15u
#define XIP_AUX_QMI_DIRECT_TX_DATA_LSB 0u
#define XIP_AUX_QMI_DIRECT_TX_DATA_ACCESS "WF"
#define XIP_AUX_QMI_DIRECT_RX_OFFSET 0x00000008u
#define XIP_AUX_QMI_DIRECT_RX_BITS 0x0000ffffu
#define XIP_AUX_QMI_DIRECT_RX_RESET 0x00000000u
#define XIP_AUX_QMI_DIRECT_RX_MSB 15u
#define XIP_AUX_QMI_DIRECT_RX_LSB 0u
#define XIP_AUX_QMI_DIRECT_RX_ACCESS "RF"
typedef struct {
   
    io_ro_32 stream;
   
    io_wo_32 qmi_direct_tx;
   
    io_ro_32 qmi_direct_rx;
} xip_aux_hw_t;
static xip_aux_hw_t * const xip_aux_hw = (xip_aux_hw_t *)XIP_AUX_BASE; // ORIGINAL: #define xip_aux_hw ((xip_aux_hw_t *)XIP_AUX_BASE)
_Static_assert(sizeof (xip_aux_hw_t) == 0x000c, "");
#define _HARDWARE_STRUCTS_PADS_QSPI_H 
#define _HARDWARE_REGS_PADS_QSPI_H 
#define PADS_QSPI_VOLTAGE_SELECT_OFFSET 0x00000000u
#define PADS_QSPI_VOLTAGE_SELECT_BITS 0x00000001u
#define PADS_QSPI_VOLTAGE_SELECT_RESET 0x00000000u
#define PADS_QSPI_VOLTAGE_SELECT_MSB 0u
#define PADS_QSPI_VOLTAGE_SELECT_LSB 0u
#define PADS_QSPI_VOLTAGE_SELECT_ACCESS "RW"
#define PADS_QSPI_VOLTAGE_SELECT_VALUE_3V3 0x0u
#define PADS_QSPI_VOLTAGE_SELECT_VALUE_1V8 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_OFFSET 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SCLK_BITS 0x000001ffu
#define PADS_QSPI_GPIO_QSPI_SCLK_RESET 0x00000156u
#define PADS_QSPI_GPIO_QSPI_SCLK_ISO_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_ISO_BITS 0x00000100u
#define PADS_QSPI_GPIO_QSPI_SCLK_ISO_MSB 8u
#define PADS_QSPI_GPIO_QSPI_SCLK_ISO_LSB 8u
#define PADS_QSPI_GPIO_QSPI_SCLK_ISO_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_BITS 0x00000080u
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_MSB 7u
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_LSB 7u
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_BITS 0x00000040u
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_MSB 6u
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_LSB 6u
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_BITS 0x00000030u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_MSB 5u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_LSB 4u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_VALUE_2MA 0x0u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_VALUE_4MA 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_VALUE_8MA 0x2u
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_VALUE_12MA 0x3u
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_BITS 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_MSB 3u
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_LSB 3u
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_BITS 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_MSB 2u
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_LSB 2u
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_BITS 0x00000002u
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_MSB 1u
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_LSB 1u
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_BITS 0x00000001u
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_MSB 0u
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_LSB 0u
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_OFFSET 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SD0_BITS 0x000001ffu
#define PADS_QSPI_GPIO_QSPI_SD0_RESET 0x00000156u
#define PADS_QSPI_GPIO_QSPI_SD0_ISO_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD0_ISO_BITS 0x00000100u
#define PADS_QSPI_GPIO_QSPI_SD0_ISO_MSB 8u
#define PADS_QSPI_GPIO_QSPI_SD0_ISO_LSB 8u
#define PADS_QSPI_GPIO_QSPI_SD0_ISO_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_OD_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD0_OD_BITS 0x00000080u
#define PADS_QSPI_GPIO_QSPI_SD0_OD_MSB 7u
#define PADS_QSPI_GPIO_QSPI_SD0_OD_LSB 7u
#define PADS_QSPI_GPIO_QSPI_SD0_OD_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_IE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD0_IE_BITS 0x00000040u
#define PADS_QSPI_GPIO_QSPI_SD0_IE_MSB 6u
#define PADS_QSPI_GPIO_QSPI_SD0_IE_LSB 6u
#define PADS_QSPI_GPIO_QSPI_SD0_IE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_BITS 0x00000030u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_MSB 5u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_LSB 4u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_VALUE_2MA 0x0u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_VALUE_4MA 0x1u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_VALUE_8MA 0x2u
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_VALUE_12MA 0x3u
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_BITS 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_MSB 3u
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_LSB 3u
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_BITS 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_MSB 2u
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_LSB 2u
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_BITS 0x00000002u
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_MSB 1u
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_LSB 1u
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_BITS 0x00000001u
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_MSB 0u
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_LSB 0u
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_OFFSET 0x0000000cu
#define PADS_QSPI_GPIO_QSPI_SD1_BITS 0x000001ffu
#define PADS_QSPI_GPIO_QSPI_SD1_RESET 0x00000156u
#define PADS_QSPI_GPIO_QSPI_SD1_ISO_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD1_ISO_BITS 0x00000100u
#define PADS_QSPI_GPIO_QSPI_SD1_ISO_MSB 8u
#define PADS_QSPI_GPIO_QSPI_SD1_ISO_LSB 8u
#define PADS_QSPI_GPIO_QSPI_SD1_ISO_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_OD_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD1_OD_BITS 0x00000080u
#define PADS_QSPI_GPIO_QSPI_SD1_OD_MSB 7u
#define PADS_QSPI_GPIO_QSPI_SD1_OD_LSB 7u
#define PADS_QSPI_GPIO_QSPI_SD1_OD_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_IE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD1_IE_BITS 0x00000040u
#define PADS_QSPI_GPIO_QSPI_SD1_IE_MSB 6u
#define PADS_QSPI_GPIO_QSPI_SD1_IE_LSB 6u
#define PADS_QSPI_GPIO_QSPI_SD1_IE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_BITS 0x00000030u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_MSB 5u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_LSB 4u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_VALUE_2MA 0x0u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_VALUE_4MA 0x1u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_VALUE_8MA 0x2u
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_VALUE_12MA 0x3u
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_BITS 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_MSB 3u
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_LSB 3u
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_BITS 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_MSB 2u
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_LSB 2u
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_BITS 0x00000002u
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_MSB 1u
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_LSB 1u
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_BITS 0x00000001u
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_MSB 0u
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_LSB 0u
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_OFFSET 0x00000010u
#define PADS_QSPI_GPIO_QSPI_SD2_BITS 0x000001ffu
#define PADS_QSPI_GPIO_QSPI_SD2_RESET 0x0000015au
#define PADS_QSPI_GPIO_QSPI_SD2_ISO_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD2_ISO_BITS 0x00000100u
#define PADS_QSPI_GPIO_QSPI_SD2_ISO_MSB 8u
#define PADS_QSPI_GPIO_QSPI_SD2_ISO_LSB 8u
#define PADS_QSPI_GPIO_QSPI_SD2_ISO_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_OD_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD2_OD_BITS 0x00000080u
#define PADS_QSPI_GPIO_QSPI_SD2_OD_MSB 7u
#define PADS_QSPI_GPIO_QSPI_SD2_OD_LSB 7u
#define PADS_QSPI_GPIO_QSPI_SD2_OD_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_IE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD2_IE_BITS 0x00000040u
#define PADS_QSPI_GPIO_QSPI_SD2_IE_MSB 6u
#define PADS_QSPI_GPIO_QSPI_SD2_IE_LSB 6u
#define PADS_QSPI_GPIO_QSPI_SD2_IE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_BITS 0x00000030u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_MSB 5u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_LSB 4u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_VALUE_2MA 0x0u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_VALUE_4MA 0x1u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_VALUE_8MA 0x2u
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_VALUE_12MA 0x3u
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_BITS 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_MSB 3u
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_LSB 3u
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_BITS 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_MSB 2u
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_LSB 2u
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_BITS 0x00000002u
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_MSB 1u
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_LSB 1u
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_BITS 0x00000001u
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_MSB 0u
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_LSB 0u
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_OFFSET 0x00000014u
#define PADS_QSPI_GPIO_QSPI_SD3_BITS 0x000001ffu
#define PADS_QSPI_GPIO_QSPI_SD3_RESET 0x0000015au
#define PADS_QSPI_GPIO_QSPI_SD3_ISO_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD3_ISO_BITS 0x00000100u
#define PADS_QSPI_GPIO_QSPI_SD3_ISO_MSB 8u
#define PADS_QSPI_GPIO_QSPI_SD3_ISO_LSB 8u
#define PADS_QSPI_GPIO_QSPI_SD3_ISO_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_OD_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD3_OD_BITS 0x00000080u
#define PADS_QSPI_GPIO_QSPI_SD3_OD_MSB 7u
#define PADS_QSPI_GPIO_QSPI_SD3_OD_LSB 7u
#define PADS_QSPI_GPIO_QSPI_SD3_OD_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_IE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD3_IE_BITS 0x00000040u
#define PADS_QSPI_GPIO_QSPI_SD3_IE_MSB 6u
#define PADS_QSPI_GPIO_QSPI_SD3_IE_LSB 6u
#define PADS_QSPI_GPIO_QSPI_SD3_IE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_BITS 0x00000030u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_MSB 5u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_LSB 4u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_VALUE_2MA 0x0u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_VALUE_4MA 0x1u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_VALUE_8MA 0x2u
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_VALUE_12MA 0x3u
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_BITS 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_MSB 3u
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_LSB 3u
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_BITS 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_MSB 2u
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_LSB 2u
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_BITS 0x00000002u
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_MSB 1u
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_LSB 1u
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_BITS 0x00000001u
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_MSB 0u
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_LSB 0u
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_OFFSET 0x00000018u
#define PADS_QSPI_GPIO_QSPI_SS_BITS 0x000001ffu
#define PADS_QSPI_GPIO_QSPI_SS_RESET 0x0000015au
#define PADS_QSPI_GPIO_QSPI_SS_ISO_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SS_ISO_BITS 0x00000100u
#define PADS_QSPI_GPIO_QSPI_SS_ISO_MSB 8u
#define PADS_QSPI_GPIO_QSPI_SS_ISO_LSB 8u
#define PADS_QSPI_GPIO_QSPI_SS_ISO_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_OD_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SS_OD_BITS 0x00000080u
#define PADS_QSPI_GPIO_QSPI_SS_OD_MSB 7u
#define PADS_QSPI_GPIO_QSPI_SS_OD_LSB 7u
#define PADS_QSPI_GPIO_QSPI_SS_OD_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_IE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SS_IE_BITS 0x00000040u
#define PADS_QSPI_GPIO_QSPI_SS_IE_MSB 6u
#define PADS_QSPI_GPIO_QSPI_SS_IE_LSB 6u
#define PADS_QSPI_GPIO_QSPI_SS_IE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_BITS 0x00000030u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_MSB 5u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_LSB 4u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_2MA 0x0u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_4MA 0x1u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_8MA 0x2u
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_12MA 0x3u
#define PADS_QSPI_GPIO_QSPI_SS_PUE_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SS_PUE_BITS 0x00000008u
#define PADS_QSPI_GPIO_QSPI_SS_PUE_MSB 3u
#define PADS_QSPI_GPIO_QSPI_SS_PUE_LSB 3u
#define PADS_QSPI_GPIO_QSPI_SS_PUE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_PDE_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SS_PDE_BITS 0x00000004u
#define PADS_QSPI_GPIO_QSPI_SS_PDE_MSB 2u
#define PADS_QSPI_GPIO_QSPI_SS_PDE_LSB 2u
#define PADS_QSPI_GPIO_QSPI_SS_PDE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_RESET 0x1u
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_BITS 0x00000002u
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_MSB 1u
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_LSB 1u
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_RESET 0x0u
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_BITS 0x00000001u
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_MSB 0u
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_LSB 0u
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_ACCESS "RW"
typedef struct {
   
    io_rw_32 voltage_select;
   
    io_rw_32 io[6];
} pads_qspi_hw_t;
