gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
static pads_qspi_hw_t * const pads_qspi_hw = (pads_qspi_hw_t *)PADS_QSPI_BASE; // ORIGINAL: #define pads_qspi_hw ((pads_qspi_hw_t *)PADS_QSPI_BASE)
_Static_assert(sizeof (pads_qspi_hw_t) == 0x001c, "");
#define _HARDWARE_STRUCTS_QMI_H 
#define _HARDWARE_REGS_QMI_H 
#define QMI_DIRECT_CSR_OFFSET 0x00000000u
#define QMI_DIRECT_CSR_BITS 0xffdf7ccfu
#define QMI_DIRECT_CSR_RESET 0x01800000u
#define QMI_DIRECT_CSR_RXDELAY_RESET 0x0u
#define QMI_DIRECT_CSR_RXDELAY_BITS 0xc0000000u
#define QMI_DIRECT_CSR_RXDELAY_MSB 31u
#define QMI_DIRECT_CSR_RXDELAY_LSB 30u
#define QMI_DIRECT_CSR_RXDELAY_ACCESS "RW"
#define QMI_DIRECT_CSR_CLKDIV_RESET 0x06u
#define QMI_DIRECT_CSR_CLKDIV_BITS 0x3fc00000u
#define QMI_DIRECT_CSR_CLKDIV_MSB 29u
#define QMI_DIRECT_CSR_CLKDIV_LSB 22u
#define QMI_DIRECT_CSR_CLKDIV_ACCESS "RW"
#define QMI_DIRECT_CSR_RXLEVEL_RESET 0x0u
#define QMI_DIRECT_CSR_RXLEVEL_BITS 0x001c0000u
#define QMI_DIRECT_CSR_RXLEVEL_MSB 20u
#define QMI_DIRECT_CSR_RXLEVEL_LSB 18u
#define QMI_DIRECT_CSR_RXLEVEL_ACCESS "RO"
#define QMI_DIRECT_CSR_RXFULL_RESET 0x0u
#define QMI_DIRECT_CSR_RXFULL_BITS 0x00020000u
#define QMI_DIRECT_CSR_RXFULL_MSB 17u
#define QMI_DIRECT_CSR_RXFULL_LSB 17u
#define QMI_DIRECT_CSR_RXFULL_ACCESS "RO"
#define QMI_DIRECT_CSR_RXEMPTY_RESET 0x0u
#define QMI_DIRECT_CSR_RXEMPTY_BITS 0x00010000u
#define QMI_DIRECT_CSR_RXEMPTY_MSB 16u
#define QMI_DIRECT_CSR_RXEMPTY_LSB 16u
#define QMI_DIRECT_CSR_RXEMPTY_ACCESS "RO"
#define QMI_DIRECT_CSR_TXLEVEL_RESET 0x0u
#define QMI_DIRECT_CSR_TXLEVEL_BITS 0x00007000u
#define QMI_DIRECT_CSR_TXLEVEL_MSB 14u
#define QMI_DIRECT_CSR_TXLEVEL_LSB 12u
#define QMI_DIRECT_CSR_TXLEVEL_ACCESS "RO"
#define QMI_DIRECT_CSR_TXEMPTY_RESET 0x0u
#define QMI_DIRECT_CSR_TXEMPTY_BITS 0x00000800u
#define QMI_DIRECT_CSR_TXEMPTY_MSB 11u
#define QMI_DIRECT_CSR_TXEMPTY_LSB 11u
#define QMI_DIRECT_CSR_TXEMPTY_ACCESS "RO"
#define QMI_DIRECT_CSR_TXFULL_RESET 0x0u
#define QMI_DIRECT_CSR_TXFULL_BITS 0x00000400u
#define QMI_DIRECT_CSR_TXFULL_MSB 10u
#define QMI_DIRECT_CSR_TXFULL_LSB 10u
#define QMI_DIRECT_CSR_TXFULL_ACCESS "RO"
#define QMI_DIRECT_CSR_AUTO_CS1N_RESET 0x0u
#define QMI_DIRECT_CSR_AUTO_CS1N_BITS 0x00000080u
#define QMI_DIRECT_CSR_AUTO_CS1N_MSB 7u
#define QMI_DIRECT_CSR_AUTO_CS1N_LSB 7u
#define QMI_DIRECT_CSR_AUTO_CS1N_ACCESS "RW"
#define QMI_DIRECT_CSR_AUTO_CS0N_RESET 0x0u
#define QMI_DIRECT_CSR_AUTO_CS0N_BITS 0x00000040u
#define QMI_DIRECT_CSR_AUTO_CS0N_MSB 6u
#define QMI_DIRECT_CSR_AUTO_CS0N_LSB 6u
#define QMI_DIRECT_CSR_AUTO_CS0N_ACCESS "RW"
#define QMI_DIRECT_CSR_ASSERT_CS1N_RESET 0x0u
#define QMI_DIRECT_CSR_ASSERT_CS1N_BITS 0x00000008u
#define QMI_DIRECT_CSR_ASSERT_CS1N_MSB 3u
#define QMI_DIRECT_CSR_ASSERT_CS1N_LSB 3u
#define QMI_DIRECT_CSR_ASSERT_CS1N_ACCESS "RW"
#define QMI_DIRECT_CSR_ASSERT_CS0N_RESET 0x0u
#define QMI_DIRECT_CSR_ASSERT_CS0N_BITS 0x00000004u
#define QMI_DIRECT_CSR_ASSERT_CS0N_MSB 2u
#define QMI_DIRECT_CSR_ASSERT_CS0N_LSB 2u
#define QMI_DIRECT_CSR_ASSERT_CS0N_ACCESS "RW"
#define QMI_DIRECT_CSR_BUSY_RESET 0x0u
#define QMI_DIRECT_CSR_BUSY_BITS 0x00000002u
#define QMI_DIRECT_CSR_BUSY_MSB 1u
#define QMI_DIRECT_CSR_BUSY_LSB 1u
#define QMI_DIRECT_CSR_BUSY_ACCESS "RO"
#define QMI_DIRECT_CSR_EN_RESET 0x0u
#define QMI_DIRECT_CSR_EN_BITS 0x00000001u
#define QMI_DIRECT_CSR_EN_MSB 0u
#define QMI_DIRECT_CSR_EN_LSB 0u
#define QMI_DIRECT_CSR_EN_ACCESS "RW"
#define QMI_DIRECT_TX_OFFSET 0x00000004u
#define QMI_DIRECT_TX_BITS 0x001fffffu
#define QMI_DIRECT_TX_RESET 0x00000000u
#define QMI_DIRECT_TX_NOPUSH_RESET 0x0u
#define QMI_DIRECT_TX_NOPUSH_BITS 0x00100000u
#define QMI_DIRECT_TX_NOPUSH_MSB 20u
#define QMI_DIRECT_TX_NOPUSH_LSB 20u
#define QMI_DIRECT_TX_NOPUSH_ACCESS "WF"
#define QMI_DIRECT_TX_OE_RESET 0x0u
#define QMI_DIRECT_TX_OE_BITS 0x00080000u
#define QMI_DIRECT_TX_OE_MSB 19u
#define QMI_DIRECT_TX_OE_LSB 19u
#define QMI_DIRECT_TX_OE_ACCESS "WF"
#define QMI_DIRECT_TX_DWIDTH_RESET 0x0u
#define QMI_DIRECT_TX_DWIDTH_BITS 0x00040000u
#define QMI_DIRECT_TX_DWIDTH_MSB 18u
#define QMI_DIRECT_TX_DWIDTH_LSB 18u
#define QMI_DIRECT_TX_DWIDTH_ACCESS "WF"
#define QMI_DIRECT_TX_IWIDTH_RESET 0x0u
#define QMI_DIRECT_TX_IWIDTH_BITS 0x00030000u
#define QMI_DIRECT_TX_IWIDTH_MSB 17u
#define QMI_DIRECT_TX_IWIDTH_LSB 16u
#define QMI_DIRECT_TX_IWIDTH_ACCESS "WF"
#define QMI_DIRECT_TX_IWIDTH_VALUE_S 0x0u
#define QMI_DIRECT_TX_IWIDTH_VALUE_D 0x1u
#define QMI_DIRECT_TX_IWIDTH_VALUE_Q 0x2u
#define QMI_DIRECT_TX_DATA_RESET 0x0000u
#define QMI_DIRECT_TX_DATA_BITS 0x0000ffffu
#define QMI_DIRECT_TX_DATA_MSB 15u
#define QMI_DIRECT_TX_DATA_LSB 0u
#define QMI_DIRECT_TX_DATA_ACCESS "WF"
#define QMI_DIRECT_RX_OFFSET 0x00000008u
#define QMI_DIRECT_RX_BITS 0x0000ffffu
#define QMI_DIRECT_RX_RESET 0x00000000u
#define QMI_DIRECT_RX_MSB 15u
#define QMI_DIRECT_RX_LSB 0u
#define QMI_DIRECT_RX_ACCESS "RF"
#define QMI_M0_TIMING_OFFSET 0x0000000cu
#define QMI_M0_TIMING_BITS 0xf3fff7ffu
#define QMI_M0_TIMING_RESET 0x40000004u
#define QMI_M0_TIMING_COOLDOWN_RESET 0x1u
#define QMI_M0_TIMING_COOLDOWN_BITS 0xc0000000u
#define QMI_M0_TIMING_COOLDOWN_MSB 31u
#define QMI_M0_TIMING_COOLDOWN_LSB 30u
#define QMI_M0_TIMING_COOLDOWN_ACCESS "RW"
#define QMI_M0_TIMING_PAGEBREAK_RESET 0x0u
#define QMI_M0_TIMING_PAGEBREAK_BITS 0x30000000u
#define QMI_M0_TIMING_PAGEBREAK_MSB 29u
#define QMI_M0_TIMING_PAGEBREAK_LSB 28u
#define QMI_M0_TIMING_PAGEBREAK_ACCESS "RW"
#define QMI_M0_TIMING_PAGEBREAK_VALUE_NONE 0x0u
#define QMI_M0_TIMING_PAGEBREAK_VALUE_256 0x1u
#define QMI_M0_TIMING_PAGEBREAK_VALUE_1024 0x2u
#define QMI_M0_TIMING_PAGEBREAK_VALUE_4096 0x3u
#define QMI_M0_TIMING_SELECT_SETUP_RESET 0x0u
#define QMI_M0_TIMING_SELECT_SETUP_BITS 0x02000000u
#define QMI_M0_TIMING_SELECT_SETUP_MSB 25u
#define QMI_M0_TIMING_SELECT_SETUP_LSB 25u
#define QMI_M0_TIMING_SELECT_SETUP_ACCESS "RW"
#define QMI_M0_TIMING_SELECT_HOLD_RESET 0x0u
#define QMI_M0_TIMING_SELECT_HOLD_BITS 0x01800000u
#define QMI_M0_TIMING_SELECT_HOLD_MSB 24u
#define QMI_M0_TIMING_SELECT_HOLD_LSB 23u
#define QMI_M0_TIMING_SELECT_HOLD_ACCESS "RW"
#define QMI_M0_TIMING_MAX_SELECT_RESET 0x00u
#define QMI_M0_TIMING_MAX_SELECT_BITS 0x007e0000u
#define QMI_M0_TIMING_MAX_SELECT_MSB 22u
#define QMI_M0_TIMING_MAX_SELECT_LSB 17u
#define QMI_M0_TIMING_MAX_SELECT_ACCESS "RW"
#define QMI_M0_TIMING_MIN_DESELECT_RESET 0x00u
#define QMI_M0_TIMING_MIN_DESELECT_BITS 0x0001f000u
#define QMI_M0_TIMING_MIN_DESELECT_MSB 16u
#define QMI_M0_TIMING_MIN_DESELECT_LSB 12u
#define QMI_M0_TIMING_MIN_DESELECT_ACCESS "RW"
#define QMI_M0_TIMING_RXDELAY_RESET 0x0u
#define QMI_M0_TIMING_RXDELAY_BITS 0x00000700u
#define QMI_M0_TIMING_RXDELAY_MSB 10u
#define QMI_M0_TIMING_RXDELAY_LSB 8u
#define QMI_M0_TIMING_RXDELAY_ACCESS "RW"
#define QMI_M0_TIMING_CLKDIV_RESET 0x04u
#define QMI_M0_TIMING_CLKDIV_BITS 0x000000ffu
#define QMI_M0_TIMING_CLKDIV_MSB 7u
#define QMI_M0_TIMING_CLKDIV_LSB 0u
#define QMI_M0_TIMING_CLKDIV_ACCESS "RW"
#define QMI_M0_RFMT_OFFSET 0x00000010u
#define QMI_M0_RFMT_BITS 0x1007d3ffu
#define QMI_M0_RFMT_RESET 0x00001000u
#define QMI_M0_RFMT_DTR_RESET 0x0u
#define QMI_M0_RFMT_DTR_BITS 0x10000000u
#define QMI_M0_RFMT_DTR_MSB 28u
#define QMI_M0_RFMT_DTR_LSB 28u
#define QMI_M0_RFMT_DTR_ACCESS "RW"
#define QMI_M0_RFMT_DUMMY_LEN_RESET 0x0u
#define QMI_M0_RFMT_DUMMY_LEN_BITS 0x00070000u
#define QMI_M0_RFMT_DUMMY_LEN_MSB 18u
#define QMI_M0_RFMT_DUMMY_LEN_LSB 16u
#define QMI_M0_RFMT_DUMMY_LEN_ACCESS "RW"
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_NONE 0x0u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_4 0x1u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_8 0x2u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_12 0x3u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_16 0x4u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_20 0x5u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_24 0x6u
#define QMI_M0_RFMT_DUMMY_LEN_VALUE_28 0x7u
#define QMI_M0_RFMT_SUFFIX_LEN_RESET 0x0u
#define QMI_M0_RFMT_SUFFIX_LEN_BITS 0x0000c000u
#define QMI_M0_RFMT_SUFFIX_LEN_MSB 15u
#define QMI_M0_RFMT_SUFFIX_LEN_LSB 14u
#define QMI_M0_RFMT_SUFFIX_LEN_ACCESS "RW"
#define QMI_M0_RFMT_SUFFIX_LEN_VALUE_NONE 0x0u
#define QMI_M0_RFMT_SUFFIX_LEN_VALUE_8 0x2u
#define QMI_M0_RFMT_PREFIX_LEN_RESET 0x1u
#define QMI_M0_RFMT_PREFIX_LEN_BITS 0x00001000u
#define QMI_M0_RFMT_PREFIX_LEN_MSB 12u
#define QMI_M0_RFMT_PREFIX_LEN_LSB 12u
#define QMI_M0_RFMT_PREFIX_LEN_ACCESS "RW"
#define QMI_M0_RFMT_PREFIX_LEN_VALUE_NONE 0x0u
#define QMI_M0_RFMT_PREFIX_LEN_VALUE_8 0x1u
#define QMI_M0_RFMT_DATA_WIDTH_RESET 0x0u
#define QMI_M0_RFMT_DATA_WIDTH_BITS 0x00000300u
#define QMI_M0_RFMT_DATA_WIDTH_MSB 9u
#define QMI_M0_RFMT_DATA_WIDTH_LSB 8u
#define QMI_M0_RFMT_DATA_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_DATA_WIDTH_VALUE_S 0x0u
#define QMI_M0_RFMT_DATA_WIDTH_VALUE_D 0x1u
#define QMI_M0_RFMT_DATA_WIDTH_VALUE_Q 0x2u
#define QMI_M0_RFMT_DUMMY_WIDTH_RESET 0x0u
#define QMI_M0_RFMT_DUMMY_WIDTH_BITS 0x000000c0u
#define QMI_M0_RFMT_DUMMY_WIDTH_MSB 7u
#define QMI_M0_RFMT_DUMMY_WIDTH_LSB 6u
#define QMI_M0_RFMT_DUMMY_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_DUMMY_WIDTH_VALUE_S 0x0u
#define QMI_M0_RFMT_DUMMY_WIDTH_VALUE_D 0x1u
#define QMI_M0_RFMT_DUMMY_WIDTH_VALUE_Q 0x2u
#define QMI_M0_RFMT_SUFFIX_WIDTH_RESET 0x0u
#define QMI_M0_RFMT_SUFFIX_WIDTH_BITS 0x00000030u
#define QMI_M0_RFMT_SUFFIX_WIDTH_MSB 5u
#define QMI_M0_RFMT_SUFFIX_WIDTH_LSB 4u
#define QMI_M0_RFMT_SUFFIX_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_S 0x0u
#define QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_D 0x1u
#define QMI_M0_RFMT_SUFFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M0_RFMT_ADDR_WIDTH_RESET 0x0u
#define QMI_M0_RFMT_ADDR_WIDTH_BITS 0x0000000cu
#define QMI_M0_RFMT_ADDR_WIDTH_MSB 3u
#define QMI_M0_RFMT_ADDR_WIDTH_LSB 2u
#define QMI_M0_RFMT_ADDR_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_ADDR_WIDTH_VALUE_S 0x0u
#define QMI_M0_RFMT_ADDR_WIDTH_VALUE_D 0x1u
#define QMI_M0_RFMT_ADDR_WIDTH_VALUE_Q 0x2u
#define QMI_M0_RFMT_PREFIX_WIDTH_RESET 0x0u
#define QMI_M0_RFMT_PREFIX_WIDTH_BITS 0x00000003u
#define QMI_M0_RFMT_PREFIX_WIDTH_MSB 1u
#define QMI_M0_RFMT_PREFIX_WIDTH_LSB 0u
#define QMI_M0_RFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M0_RFMT_PREFIX_WIDTH_VALUE_S 0x0u
#define QMI_M0_RFMT_PREFIX_WIDTH_VALUE_D 0x1u
#define QMI_M0_RFMT_PREFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M0_RCMD_OFFSET 0x00000014u
#define QMI_M0_RCMD_BITS 0x0000ffffu
#define QMI_M0_RCMD_RESET 0x0000a003u
#define QMI_M0_RCMD_SUFFIX_RESET 0xa0u
#define QMI_M0_RCMD_SUFFIX_BITS 0x0000ff00u
#define QMI_M0_RCMD_SUFFIX_MSB 15u
#define QMI_M0_RCMD_SUFFIX_LSB 8u
#define QMI_M0_RCMD_SUFFIX_ACCESS "RW"
#define QMI_M0_RCMD_PREFIX_RESET 0x03u
#define QMI_M0_RCMD_PREFIX_BITS 0x000000ffu
#define QMI_M0_RCMD_PREFIX_MSB 7u
#define QMI_M0_RCMD_PREFIX_LSB 0u
#define QMI_M0_RCMD_PREFIX_ACCESS "RW"
#define QMI_M0_WFMT_OFFSET 0x00000018u
#define QMI_M0_WFMT_BITS 0x1007d3ffu
#define QMI_M0_WFMT_RESET 0x00001000u
#define QMI_M0_WFMT_DTR_RESET 0x0u
#define QMI_M0_WFMT_DTR_BITS 0x10000000u
#define QMI_M0_WFMT_DTR_MSB 28u
#define QMI_M0_WFMT_DTR_LSB 28u
#define QMI_M0_WFMT_DTR_ACCESS "RW"
#define QMI_M0_WFMT_DUMMY_LEN_RESET 0x0u
#define QMI_M0_WFMT_DUMMY_LEN_BITS 0x00070000u
#define QMI_M0_WFMT_DUMMY_LEN_MSB 18u
#define QMI_M0_WFMT_DUMMY_LEN_LSB 16u
#define QMI_M0_WFMT_DUMMY_LEN_ACCESS "RW"
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_NONE 0x0u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_4 0x1u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_8 0x2u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_12 0x3u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_16 0x4u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_20 0x5u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_24 0x6u
#define QMI_M0_WFMT_DUMMY_LEN_VALUE_28 0x7u
#define QMI_M0_WFMT_SUFFIX_LEN_RESET 0x0u
#define QMI_M0_WFMT_SUFFIX_LEN_BITS 0x0000c000u
#define QMI_M0_WFMT_SUFFIX_LEN_MSB 15u
#define QMI_M0_WFMT_SUFFIX_LEN_LSB 14u
#define QMI_M0_WFMT_SUFFIX_LEN_ACCESS "RW"
#define QMI_M0_WFMT_SUFFIX_LEN_VALUE_NONE 0x0u
#define QMI_M0_WFMT_SUFFIX_LEN_VALUE_8 0x2u
#define QMI_M0_WFMT_PREFIX_LEN_RESET 0x1u
#define QMI_M0_WFMT_PREFIX_LEN_BITS 0x00001000u
#define QMI_M0_WFMT_PREFIX_LEN_MSB 12u
#define QMI_M0_WFMT_PREFIX_LEN_LSB 12u
#define QMI_M0_WFMT_PREFIX_LEN_ACCESS "RW"
#define QMI_M0_WFMT_PREFIX_LEN_VALUE_NONE 0x0u
#define QMI_M0_WFMT_PREFIX_LEN_VALUE_8 0x1u
#define QMI_M0_WFMT_DATA_WIDTH_RESET 0x0u
#define QMI_M0_WFMT_DATA_WIDTH_BITS 0x00000300u
#define QMI_M0_WFMT_DATA_WIDTH_MSB 9u
#define QMI_M0_WFMT_DATA_WIDTH_LSB 8u
#define QMI_M0_WFMT_DATA_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_DATA_WIDTH_VALUE_S 0x0u
#define QMI_M0_WFMT_DATA_WIDTH_VALUE_D 0x1u
#define QMI_M0_WFMT_DATA_WIDTH_VALUE_Q 0x2u
#define QMI_M0_WFMT_DUMMY_WIDTH_RESET 0x0u
#define QMI_M0_WFMT_DUMMY_WIDTH_BITS 0x000000c0u
#define QMI_M0_WFMT_DUMMY_WIDTH_MSB 7u
#define QMI_M0_WFMT_DUMMY_WIDTH_LSB 6u
#define QMI_M0_WFMT_DUMMY_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_DUMMY_WIDTH_VALUE_S 0x0u
#define QMI_M0_WFMT_DUMMY_WIDTH_VALUE_D 0x1u
#define QMI_M0_WFMT_DUMMY_WIDTH_VALUE_Q 0x2u
#define QMI_M0_WFMT_SUFFIX_WIDTH_RESET 0x0u
#define QMI_M0_WFMT_SUFFIX_WIDTH_BITS 0x00000030u
#define QMI_M0_WFMT_SUFFIX_WIDTH_MSB 5u
#define QMI_M0_WFMT_SUFFIX_WIDTH_LSB 4u
#define QMI_M0_WFMT_SUFFIX_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_S 0x0u
#define QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_D 0x1u
#define QMI_M0_WFMT_SUFFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M0_WFMT_ADDR_WIDTH_RESET 0x0u
#define QMI_M0_WFMT_ADDR_WIDTH_BITS 0x0000000cu
#define QMI_M0_WFMT_ADDR_WIDTH_MSB 3u
#define QMI_M0_WFMT_ADDR_WIDTH_LSB 2u
#define QMI_M0_WFMT_ADDR_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_ADDR_WIDTH_VALUE_S 0x0u
#define QMI_M0_WFMT_ADDR_WIDTH_VALUE_D 0x1u
#define QMI_M0_WFMT_ADDR_WIDTH_VALUE_Q 0x2u
#define QMI_M0_WFMT_PREFIX_WIDTH_RESET 0x0u
#define QMI_M0_WFMT_PREFIX_WIDTH_BITS 0x00000003u
#define QMI_M0_WFMT_PREFIX_WIDTH_MSB 1u
#define QMI_M0_WFMT_PREFIX_WIDTH_LSB 0u
#define QMI_M0_WFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M0_WFMT_PREFIX_WIDTH_VALUE_S 0x0u
#define QMI_M0_WFMT_PREFIX_WIDTH_VALUE_D 0x1u
#define QMI_M0_WFMT_PREFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M0_WCMD_OFFSET 0x0000001cu
#define QMI_M0_WCMD_BITS 0x0000ffffu
#define QMI_M0_WCMD_RESET 0x0000a002u
#define QMI_M0_WCMD_SUFFIX_RESET 0xa0u
#define QMI_M0_WCMD_SUFFIX_BITS 0x0000ff00u
#define QMI_M0_WCMD_SUFFIX_MSB 15u
#define QMI_M0_WCMD_SUFFIX_LSB 8u
#define QMI_M0_WCMD_SUFFIX_ACCESS "RW"
#define QMI_M0_WCMD_PREFIX_RESET 0x02u
#define QMI_M0_WCMD_PREFIX_BITS 0x000000ffu
#define QMI_M0_WCMD_PREFIX_MSB 7u
#define QMI_M0_WCMD_PREFIX_LSB 0u
#define QMI_M0_WCMD_PREFIX_ACCESS "RW"
#define QMI_M1_TIMING_OFFSET 0x00000020u
#define QMI_M1_TIMING_BITS 0xf3fff7ffu
#define QMI_M1_TIMING_RESET 0x40000004u
#define QMI_M1_TIMING_COOLDOWN_RESET 0x1u
#define QMI_M1_TIMING_COOLDOWN_BITS 0xc0000000u
#define QMI_M1_TIMING_COOLDOWN_MSB 31u
#define QMI_M1_TIMING_COOLDOWN_LSB 30u
#define QMI_M1_TIMING_COOLDOWN_ACCESS "RW"
#define QMI_M1_TIMING_PAGEBREAK_RESET 0x0u
#define QMI_M1_TIMING_PAGEBREAK_BITS 0x30000000u
#define QMI_M1_TIMING_PAGEBREAK_MSB 29u
#define QMI_M1_TIMING_PAGEBREAK_LSB 28u
#define QMI_M1_TIMING_PAGEBREAK_ACCESS "RW"
#define QMI_M1_TIMING_PAGEBREAK_VALUE_NONE 0x0u
#define QMI_M1_TIMING_PAGEBREAK_VALUE_256 0x1u
#define QMI_M1_TIMING_PAGEBREAK_VALUE_1024 0x2u
#define QMI_M1_TIMING_PAGEBREAK_VALUE_4096 0x3u
#define QMI_M1_TIMING_SELECT_SETUP_RESET 0x0u
#define QMI_M1_TIMING_SELECT_SETUP_BITS 0x02000000u
#define QMI_M1_TIMING_SELECT_SETUP_MSB 25u
#define QMI_M1_TIMING_SELECT_SETUP_LSB 25u
#define QMI_M1_TIMING_SELECT_SETUP_ACCESS "RW"
#define QMI_M1_TIMING_SELECT_HOLD_RESET 0x0u
#define QMI_M1_TIMING_SELECT_HOLD_BITS 0x01800000u
#define QMI_M1_TIMING_SELECT_HOLD_MSB 24u
#define QMI_M1_TIMING_SELECT_HOLD_LSB 23u
#define QMI_M1_TIMING_SELECT_HOLD_ACCESS "RW"
#define QMI_M1_TIMING_MAX_SELECT_RESET 0x00u
#define QMI_M1_TIMING_MAX_SELECT_BITS 0x007e0000u
#define QMI_M1_TIMING_MAX_SELECT_MSB 22u
#define QMI_M1_TIMING_MAX_SELECT_LSB 17u
#define QMI_M1_TIMING_MAX_SELECT_ACCESS "RW"
#define QMI_M1_TIMING_MIN_DESELECT_RESET 0x00u
#define QMI_M1_TIMING_MIN_DESELECT_BITS 0x0001f000u
#define QMI_M1_TIMING_MIN_DESELECT_MSB 16u
#define QMI_M1_TIMING_MIN_DESELECT_LSB 12u
#define QMI_M1_TIMING_MIN_DESELECT_ACCESS "RW"
#define QMI_M1_TIMING_RXDELAY_RESET 0x0u
#define QMI_M1_TIMING_RXDELAY_BITS 0x00000700u
#define QMI_M1_TIMING_RXDELAY_MSB 10u
#define QMI_M1_TIMING_RXDELAY_LSB 8u
#define QMI_M1_TIMING_RXDELAY_ACCESS "RW"
#define QMI_M1_TIMING_CLKDIV_RESET 0x04u
#define QMI_M1_TIMING_CLKDIV_BITS 0x000000ffu
#define QMI_M1_TIMING_CLKDIV_MSB 7u
#define QMI_M1_TIMING_CLKDIV_LSB 0u
#define QMI_M1_TIMING_CLKDIV_ACCESS "RW"
#define QMI_M1_RFMT_OFFSET 0x00000024u
#define QMI_M1_RFMT_BITS 0x1007d3ffu
#define QMI_M1_RFMT_RESET 0x00001000u
#define QMI_M1_RFMT_DTR_RESET 0x0u
#define QMI_M1_RFMT_DTR_BITS 0x10000000u
#define QMI_M1_RFMT_DTR_MSB 28u
#define QMI_M1_RFMT_DTR_LSB 28u
#define QMI_M1_RFMT_DTR_ACCESS "RW"
#define QMI_M1_RFMT_DUMMY_LEN_RESET 0x0u
#define QMI_M1_RFMT_DUMMY_LEN_BITS 0x00070000u
#define QMI_M1_RFMT_DUMMY_LEN_MSB 18u
#define QMI_M1_RFMT_DUMMY_LEN_LSB 16u
#define QMI_M1_RFMT_DUMMY_LEN_ACCESS "RW"
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_NONE 0x0u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_4 0x1u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_8 0x2u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_12 0x3u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_16 0x4u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_20 0x5u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_24 0x6u
#define QMI_M1_RFMT_DUMMY_LEN_VALUE_28 0x7u
#define QMI_M1_RFMT_SUFFIX_LEN_RESET 0x0u
#define QMI_M1_RFMT_SUFFIX_LEN_BITS 0x0000c000u
#define QMI_M1_RFMT_SUFFIX_LEN_MSB 15u
#define QMI_M1_RFMT_SUFFIX_LEN_LSB 14u
#define QMI_M1_RFMT_SUFFIX_LEN_ACCESS "RW"
#define QMI_M1_RFMT_SUFFIX_LEN_VALUE_NONE 0x0u
#define QMI_M1_RFMT_SUFFIX_LEN_VALUE_8 0x2u
#define QMI_M1_RFMT_PREFIX_LEN_RESET 0x1u
#define QMI_M1_RFMT_PREFIX_LEN_BITS 0x00001000u
#define QMI_M1_RFMT_PREFIX_LEN_MSB 12u
#define QMI_M1_RFMT_PREFIX_LEN_LSB 12u
#define QMI_M1_RFMT_PREFIX_LEN_ACCESS "RW"
#define QMI_M1_RFMT_PREFIX_LEN_VALUE_NONE 0x0u
#define QMI_M1_RFMT_PREFIX_LEN_VALUE_8 0x1u
#define QMI_M1_RFMT_DATA_WIDTH_RESET 0x0u
#define QMI_M1_RFMT_DATA_WIDTH_BITS 0x00000300u
#define QMI_M1_RFMT_DATA_WIDTH_MSB 9u
#define QMI_M1_RFMT_DATA_WIDTH_LSB 8u
#define QMI_M1_RFMT_DATA_WIDTH_ACCESS "RW"
#define QMI_M1_RFMT_DATA_WIDTH_VALUE_S 0x0u
#define QMI_M1_RFMT_DATA_WIDTH_VALUE_D 0x1u
#define QMI_M1_RFMT_DATA_WIDTH_VALUE_Q 0x2u
#define QMI_M1_RFMT_DUMMY_WIDTH_RESET 0x0u
#define QMI_M1_RFMT_DUMMY_WIDTH_BITS 0x000000c0u
#define QMI_M1_RFMT_DUMMY_WIDTH_MSB 7u
#define QMI_M1_RFMT_DUMMY_WIDTH_LSB 6u
#define QMI_M1_RFMT_DUMMY_WIDTH_ACCESS "RW"
#define QMI_M1_RFMT_DUMMY_WIDTH_VALUE_S 0x0u
#define QMI_M1_RFMT_DUMMY_WIDTH_VALUE_D 0x1u
#define QMI_M1_RFMT_DUMMY_WIDTH_VALUE_Q 0x2u
#define QMI_M1_RFMT_SUFFIX_WIDTH_RESET 0x0u
#define QMI_M1_RFMT_SUFFIX_WIDTH_BITS 0x00000030u
#define QMI_M1_RFMT_SUFFIX_WIDTH_MSB 5u
#define QMI_M1_RFMT_SUFFIX_WIDTH_LSB 4u
#define QMI_M1_RFMT_SUFFIX_WIDTH_ACCESS "RW"
#define QMI_M1_RFMT_SUFFIX_WIDTH_VALUE_S 0x0u
#define QMI_M1_RFMT_SUFFIX_WIDTH_VALUE_D 0x1u
#define QMI_M1_RFMT_SUFFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M1_RFMT_ADDR_WIDTH_RESET 0x0u
#define QMI_M1_RFMT_ADDR_WIDTH_BITS 0x0000000cu
#define QMI_M1_RFMT_ADDR_WIDTH_MSB 3u
#define QMI_M1_RFMT_ADDR_WIDTH_LSB 2u
#define QMI_M1_RFMT_ADDR_WIDTH_ACCESS "RW"
#define QMI_M1_RFMT_ADDR_WIDTH_VALUE_S 0x0u
#define QMI_M1_RFMT_ADDR_WIDTH_VALUE_D 0x1u
#define QMI_M1_RFMT_ADDR_WIDTH_VALUE_Q 0x2u
#define QMI_M1_RFMT_PREFIX_WIDTH_RESET 0x0u
#define QMI_M1_RFMT_PREFIX_WIDTH_BITS 0x00000003u
#define QMI_M1_RFMT_PREFIX_WIDTH_MSB 1u
#define QMI_M1_RFMT_PREFIX_WIDTH_LSB 0u
#define QMI_M1_RFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M1_RFMT_PREFIX_WIDTH_VALUE_S 0x0u
#define QMI_M1_RFMT_PREFIX_WIDTH_VALUE_D 0x1u
#define QMI_M1_RFMT_PREFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M1_RCMD_OFFSET 0x00000028u
#define QMI_M1_RCMD_BITS 0x0000ffffu
#define QMI_M1_RCMD_RESET 0x0000a003u
#define QMI_M1_RCMD_SUFFIX_RESET 0xa0u
#define QMI_M1_RCMD_SUFFIX_BITS 0x0000ff00u
#define QMI_M1_RCMD_SUFFIX_MSB 15u
#define QMI_M1_RCMD_SUFFIX_LSB 8u
#define QMI_M1_RCMD_SUFFIX_ACCESS "RW"
#define QMI_M1_RCMD_PREFIX_RESET 0x03u
#define QMI_M1_RCMD_PREFIX_BITS 0x000000ffu
#define QMI_M1_RCMD_PREFIX_MSB 7u
#define QMI_M1_RCMD_PREFIX_LSB 0u
#define QMI_M1_RCMD_PREFIX_ACCESS "RW"
#define QMI_M1_WFMT_OFFSET 0x0000002cu
#define QMI_M1_WFMT_BITS 0x1007d3ffu
#define QMI_M1_WFMT_RESET 0x00001000u
#define QMI_M1_WFMT_DTR_RESET 0x0u
#define QMI_M1_WFMT_DTR_BITS 0x10000000u
#define QMI_M1_WFMT_DTR_MSB 28u
#define QMI_M1_WFMT_DTR_LSB 28u
#define QMI_M1_WFMT_DTR_ACCESS "RW"
#define QMI_M1_WFMT_DUMMY_LEN_RESET 0x0u
#define QMI_M1_WFMT_DUMMY_LEN_BITS 0x00070000u
#define QMI_M1_WFMT_DUMMY_LEN_MSB 18u
#define QMI_M1_WFMT_DUMMY_LEN_LSB 16u
#define QMI_M1_WFMT_DUMMY_LEN_ACCESS "RW"
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_NONE 0x0u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_4 0x1u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_8 0x2u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_12 0x3u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_16 0x4u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_20 0x5u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_24 0x6u
#define QMI_M1_WFMT_DUMMY_LEN_VALUE_28 0x7u
#define QMI_M1_WFMT_SUFFIX_LEN_RESET 0x0u
#define QMI_M1_WFMT_SUFFIX_LEN_BITS 0x0000c000u
#define QMI_M1_WFMT_SUFFIX_LEN_MSB 15u
#define QMI_M1_WFMT_SUFFIX_LEN_LSB 14u
#define QMI_M1_WFMT_SUFFIX_LEN_ACCESS "RW"
#define QMI_M1_WFMT_SUFFIX_LEN_VALUE_NONE 0x0u
#define QMI_M1_WFMT_SUFFIX_LEN_VALUE_8 0x2u
#define QMI_M1_WFMT_PREFIX_LEN_RESET 0x1u
#define QMI_M1_WFMT_PREFIX_LEN_BITS 0x00001000u
#define QMI_M1_WFMT_PREFIX_LEN_MSB 12u
#define QMI_M1_WFMT_PREFIX_LEN_LSB 12u
#define QMI_M1_WFMT_PREFIX_LEN_ACCESS "RW"
#define QMI_M1_WFMT_PREFIX_LEN_VALUE_NONE 0x0u
#define QMI_M1_WFMT_PREFIX_LEN_VALUE_8 0x1u
#define QMI_M1_WFMT_DATA_WIDTH_RESET 0x0u
#define QMI_M1_WFMT_DATA_WIDTH_BITS 0x00000300u
#define QMI_M1_WFMT_DATA_WIDTH_MSB 9u
#define QMI_M1_WFMT_DATA_WIDTH_LSB 8u
#define QMI_M1_WFMT_DATA_WIDTH_ACCESS "RW"
#define QMI_M1_WFMT_DATA_WIDTH_VALUE_S 0x0u
#define QMI_M1_WFMT_DATA_WIDTH_VALUE_D 0x1u
#define QMI_M1_WFMT_DATA_WIDTH_VALUE_Q 0x2u
#define QMI_M1_WFMT_DUMMY_WIDTH_RESET 0x0u
#define QMI_M1_WFMT_DUMMY_WIDTH_BITS 0x000000c0u
#define QMI_M1_WFMT_DUMMY_WIDTH_MSB 7u
#define QMI_M1_WFMT_DUMMY_WIDTH_LSB 6u
#define QMI_M1_WFMT_DUMMY_WIDTH_ACCESS "RW"
#define QMI_M1_WFMT_DUMMY_WIDTH_VALUE_S 0x0u
#define QMI_M1_WFMT_DUMMY_WIDTH_VALUE_D 0x1u
#define QMI_M1_WFMT_DUMMY_WIDTH_VALUE_Q 0x2u
#define QMI_M1_WFMT_SUFFIX_WIDTH_RESET 0x0u
#define QMI_M1_WFMT_SUFFIX_WIDTH_BITS 0x00000030u
#define QMI_M1_WFMT_SUFFIX_WIDTH_MSB 5u
#define QMI_M1_WFMT_SUFFIX_WIDTH_LSB 4u
#define QMI_M1_WFMT_SUFFIX_WIDTH_ACCESS "RW"
#define QMI_M1_WFMT_SUFFIX_WIDTH_VALUE_S 0x0u
#define QMI_M1_WFMT_SUFFIX_WIDTH_VALUE_D 0x1u
#define QMI_M1_WFMT_SUFFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M1_WFMT_ADDR_WIDTH_RESET 0x0u
#define QMI_M1_WFMT_ADDR_WIDTH_BITS 0x0000000cu
#define QMI_M1_WFMT_ADDR_WIDTH_MSB 3u
#define QMI_M1_WFMT_ADDR_WIDTH_LSB 2u
#define QMI_M1_WFMT_ADDR_WIDTH_ACCESS "RW"
#define QMI_M1_WFMT_ADDR_WIDTH_VALUE_S 0x0u
#define QMI_M1_WFMT_ADDR_WIDTH_VALUE_D 0x1u
#define QMI_M1_WFMT_ADDR_WIDTH_VALUE_Q 0x2u
#define QMI_M1_WFMT_PREFIX_WIDTH_RESET 0x0u
#define QMI_M1_WFMT_PREFIX_WIDTH_BITS 0x00000003u
#define QMI_M1_WFMT_PREFIX_WIDTH_MSB 1u
#define QMI_M1_WFMT_PREFIX_WIDTH_LSB 0u
#define QMI_M1_WFMT_PREFIX_WIDTH_ACCESS "RW"
#define QMI_M1_WFMT_PREFIX_WIDTH_VALUE_S 0x0u
#define QMI_M1_WFMT_PREFIX_WIDTH_VALUE_D 0x1u
#define QMI_M1_WFMT_PREFIX_WIDTH_VALUE_Q 0x2u
#define QMI_M1_WCMD_OFFSET 0x00000030u
#define QMI_M1_WCMD_BITS 0x0000ffffu
#define QMI_M1_WCMD_RESET 0x0000a002u
#define QMI_M1_WCMD_SUFFIX_RESET 0xa0u
#define QMI_M1_WCMD_SUFFIX_BITS 0x0000ff00u
#define QMI_M1_WCMD_SUFFIX_MSB 15u
#define QMI_M1_WCMD_SUFFIX_LSB 8u
#define QMI_M1_WCMD_SUFFIX_ACCESS "RW"
#define QMI_M1_WCMD_PREFIX_RESET 0x02u
#define QMI_M1_WCMD_PREFIX_BITS 0x000000ffu
#define QMI_M1_WCMD_PREFIX_MSB 7u
#define QMI_M1_WCMD_PREFIX_LSB 0u
#define QMI_M1_WCMD_PREFIX_ACCESS "RW"
#define QMI_ATRANS0_OFFSET 0x00000034u
#define QMI_ATRANS0_BITS 0x07ff0fffu
#define QMI_ATRANS0_RESET 0x04000000u
#define QMI_ATRANS0_SIZE_RESET 0x400u
#define QMI_ATRANS0_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS0_SIZE_MSB 26u
#define QMI_ATRANS0_SIZE_LSB 16u
#define QMI_ATRANS0_SIZE_ACCESS "RW"
#define QMI_ATRANS0_BASE_RESET 0x000u
