gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define QMI_ATRANS0_BASE_BITS 0x00000fffu
#define QMI_ATRANS0_BASE_MSB 11u
#define QMI_ATRANS0_BASE_LSB 0u
#define QMI_ATRANS0_BASE_ACCESS "RW"
#define QMI_ATRANS1_OFFSET 0x00000038u
#define QMI_ATRANS1_BITS 0x07ff0fffu
#define QMI_ATRANS1_RESET 0x04000400u
#define QMI_ATRANS1_SIZE_RESET 0x400u
#define QMI_ATRANS1_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS1_SIZE_MSB 26u
#define QMI_ATRANS1_SIZE_LSB 16u
#define QMI_ATRANS1_SIZE_ACCESS "RW"
#define QMI_ATRANS1_BASE_RESET 0x400u
#define QMI_ATRANS1_BASE_BITS 0x00000fffu
#define QMI_ATRANS1_BASE_MSB 11u
#define QMI_ATRANS1_BASE_LSB 0u
#define QMI_ATRANS1_BASE_ACCESS "RW"
#define QMI_ATRANS2_OFFSET 0x0000003cu
#define QMI_ATRANS2_BITS 0x07ff0fffu
#define QMI_ATRANS2_RESET 0x04000800u
#define QMI_ATRANS2_SIZE_RESET 0x400u
#define QMI_ATRANS2_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS2_SIZE_MSB 26u
#define QMI_ATRANS2_SIZE_LSB 16u
#define QMI_ATRANS2_SIZE_ACCESS "RW"
#define QMI_ATRANS2_BASE_RESET 0x800u
#define QMI_ATRANS2_BASE_BITS 0x00000fffu
#define QMI_ATRANS2_BASE_MSB 11u
#define QMI_ATRANS2_BASE_LSB 0u
#define QMI_ATRANS2_BASE_ACCESS "RW"
#define QMI_ATRANS3_OFFSET 0x00000040u
#define QMI_ATRANS3_BITS 0x07ff0fffu
#define QMI_ATRANS3_RESET 0x04000c00u
#define QMI_ATRANS3_SIZE_RESET 0x400u
#define QMI_ATRANS3_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS3_SIZE_MSB 26u
#define QMI_ATRANS3_SIZE_LSB 16u
#define QMI_ATRANS3_SIZE_ACCESS "RW"
#define QMI_ATRANS3_BASE_RESET 0xc00u
#define QMI_ATRANS3_BASE_BITS 0x00000fffu
#define QMI_ATRANS3_BASE_MSB 11u
#define QMI_ATRANS3_BASE_LSB 0u
#define QMI_ATRANS3_BASE_ACCESS "RW"
#define QMI_ATRANS4_OFFSET 0x00000044u
#define QMI_ATRANS4_BITS 0x07ff0fffu
#define QMI_ATRANS4_RESET 0x04000000u
#define QMI_ATRANS4_SIZE_RESET 0x400u
#define QMI_ATRANS4_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS4_SIZE_MSB 26u
#define QMI_ATRANS4_SIZE_LSB 16u
#define QMI_ATRANS4_SIZE_ACCESS "RW"
#define QMI_ATRANS4_BASE_RESET 0x000u
#define QMI_ATRANS4_BASE_BITS 0x00000fffu
#define QMI_ATRANS4_BASE_MSB 11u
#define QMI_ATRANS4_BASE_LSB 0u
#define QMI_ATRANS4_BASE_ACCESS "RW"
#define QMI_ATRANS5_OFFSET 0x00000048u
#define QMI_ATRANS5_BITS 0x07ff0fffu
#define QMI_ATRANS5_RESET 0x04000400u
#define QMI_ATRANS5_SIZE_RESET 0x400u
#define QMI_ATRANS5_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS5_SIZE_MSB 26u
#define QMI_ATRANS5_SIZE_LSB 16u
#define QMI_ATRANS5_SIZE_ACCESS "RW"
#define QMI_ATRANS5_BASE_RESET 0x400u
#define QMI_ATRANS5_BASE_BITS 0x00000fffu
#define QMI_ATRANS5_BASE_MSB 11u
#define QMI_ATRANS5_BASE_LSB 0u
#define QMI_ATRANS5_BASE_ACCESS "RW"
#define QMI_ATRANS6_OFFSET 0x0000004cu
#define QMI_ATRANS6_BITS 0x07ff0fffu
#define QMI_ATRANS6_RESET 0x04000800u
#define QMI_ATRANS6_SIZE_RESET 0x400u
#define QMI_ATRANS6_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS6_SIZE_MSB 26u
#define QMI_ATRANS6_SIZE_LSB 16u
#define QMI_ATRANS6_SIZE_ACCESS "RW"
#define QMI_ATRANS6_BASE_RESET 0x800u
#define QMI_ATRANS6_BASE_BITS 0x00000fffu
#define QMI_ATRANS6_BASE_MSB 11u
#define QMI_ATRANS6_BASE_LSB 0u
#define QMI_ATRANS6_BASE_ACCESS "RW"
#define QMI_ATRANS7_OFFSET 0x00000050u
#define QMI_ATRANS7_BITS 0x07ff0fffu
#define QMI_ATRANS7_RESET 0x04000c00u
#define QMI_ATRANS7_SIZE_RESET 0x400u
#define QMI_ATRANS7_SIZE_BITS 0x07ff0000u
#define QMI_ATRANS7_SIZE_MSB 26u
#define QMI_ATRANS7_SIZE_LSB 16u
#define QMI_ATRANS7_SIZE_ACCESS "RW"
#define QMI_ATRANS7_BASE_RESET 0xc00u
#define QMI_ATRANS7_BASE_BITS 0x00000fffu
#define QMI_ATRANS7_BASE_MSB 11u
#define QMI_ATRANS7_BASE_LSB 0u
#define QMI_ATRANS7_BASE_ACCESS "RW"
typedef struct {
   
    io_rw_32 timing;
   
    io_rw_32 rfmt;
   
    io_rw_32 rcmd;
   
    io_rw_32 wfmt;
   
    io_rw_32 wcmd;
} qmi_mem_hw_t;
typedef struct __attribute__((swift_attr("~Copyable"))) {
   
    io_rw_32 direct_csr;
   
    io_wo_32 direct_tx;
   
    io_ro_32 direct_rx;
    qmi_mem_hw_t m[2];
   
    io_rw_32 atrans[8];
} qmi_hw_t;
static qmi_hw_t * const qmi_hw = (qmi_hw_t *)XIP_QMI_BASE; // ORIGINAL: #define qmi_hw ((qmi_hw_t *)XIP_QMI_BASE)
_Static_assert(sizeof (qmi_hw_t) == 0x0054, "");
#define _HARDWARE_STRUCTS_OTP_H 
#define _HARDWARE_REGS_OTP_H 
#define OTP_SW_LOCK0_OFFSET 0x00000000u
#define OTP_SW_LOCK0_BITS 0x0000000fu
#define OTP_SW_LOCK0_RESET 0x00000000u
#define OTP_SW_LOCK0_NSEC_RESET "-"
#define OTP_SW_LOCK0_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK0_NSEC_MSB 3u
#define OTP_SW_LOCK0_NSEC_LSB 2u
#define OTP_SW_LOCK0_NSEC_ACCESS "RW"
#define OTP_SW_LOCK0_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK0_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK0_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK0_SEC_RESET "-"
#define OTP_SW_LOCK0_SEC_BITS 0x00000003u
#define OTP_SW_LOCK0_SEC_MSB 1u
#define OTP_SW_LOCK0_SEC_LSB 0u
#define OTP_SW_LOCK0_SEC_ACCESS "RW"
#define OTP_SW_LOCK0_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK0_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK0_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK1_OFFSET 0x00000004u
#define OTP_SW_LOCK1_BITS 0x0000000fu
#define OTP_SW_LOCK1_RESET 0x00000000u
#define OTP_SW_LOCK1_NSEC_RESET "-"
#define OTP_SW_LOCK1_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK1_NSEC_MSB 3u
#define OTP_SW_LOCK1_NSEC_LSB 2u
#define OTP_SW_LOCK1_NSEC_ACCESS "RW"
#define OTP_SW_LOCK1_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK1_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK1_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK1_SEC_RESET "-"
#define OTP_SW_LOCK1_SEC_BITS 0x00000003u
#define OTP_SW_LOCK1_SEC_MSB 1u
#define OTP_SW_LOCK1_SEC_LSB 0u
#define OTP_SW_LOCK1_SEC_ACCESS "RW"
#define OTP_SW_LOCK1_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK1_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK1_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK2_OFFSET 0x00000008u
#define OTP_SW_LOCK2_BITS 0x0000000fu
#define OTP_SW_LOCK2_RESET 0x00000000u
#define OTP_SW_LOCK2_NSEC_RESET "-"
#define OTP_SW_LOCK2_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK2_NSEC_MSB 3u
#define OTP_SW_LOCK2_NSEC_LSB 2u
#define OTP_SW_LOCK2_NSEC_ACCESS "RW"
#define OTP_SW_LOCK2_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK2_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK2_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK2_SEC_RESET "-"
#define OTP_SW_LOCK2_SEC_BITS 0x00000003u
#define OTP_SW_LOCK2_SEC_MSB 1u
#define OTP_SW_LOCK2_SEC_LSB 0u
#define OTP_SW_LOCK2_SEC_ACCESS "RW"
#define OTP_SW_LOCK2_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK2_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK2_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK3_OFFSET 0x0000000cu
#define OTP_SW_LOCK3_BITS 0x0000000fu
#define OTP_SW_LOCK3_RESET 0x00000000u
#define OTP_SW_LOCK3_NSEC_RESET "-"
#define OTP_SW_LOCK3_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK3_NSEC_MSB 3u
#define OTP_SW_LOCK3_NSEC_LSB 2u
#define OTP_SW_LOCK3_NSEC_ACCESS "RW"
#define OTP_SW_LOCK3_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK3_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK3_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK3_SEC_RESET "-"
#define OTP_SW_LOCK3_SEC_BITS 0x00000003u
#define OTP_SW_LOCK3_SEC_MSB 1u
#define OTP_SW_LOCK3_SEC_LSB 0u
#define OTP_SW_LOCK3_SEC_ACCESS "RW"
#define OTP_SW_LOCK3_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK3_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK3_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK4_OFFSET 0x00000010u
#define OTP_SW_LOCK4_BITS 0x0000000fu
#define OTP_SW_LOCK4_RESET 0x00000000u
#define OTP_SW_LOCK4_NSEC_RESET "-"
#define OTP_SW_LOCK4_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK4_NSEC_MSB 3u
#define OTP_SW_LOCK4_NSEC_LSB 2u
#define OTP_SW_LOCK4_NSEC_ACCESS "RW"
#define OTP_SW_LOCK4_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK4_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK4_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK4_SEC_RESET "-"
#define OTP_SW_LOCK4_SEC_BITS 0x00000003u
#define OTP_SW_LOCK4_SEC_MSB 1u
#define OTP_SW_LOCK4_SEC_LSB 0u
#define OTP_SW_LOCK4_SEC_ACCESS "RW"
#define OTP_SW_LOCK4_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK4_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK4_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK5_OFFSET 0x00000014u
#define OTP_SW_LOCK5_BITS 0x0000000fu
#define OTP_SW_LOCK5_RESET 0x00000000u
#define OTP_SW_LOCK5_NSEC_RESET "-"
#define OTP_SW_LOCK5_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK5_NSEC_MSB 3u
#define OTP_SW_LOCK5_NSEC_LSB 2u
#define OTP_SW_LOCK5_NSEC_ACCESS "RW"
#define OTP_SW_LOCK5_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK5_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK5_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK5_SEC_RESET "-"
#define OTP_SW_LOCK5_SEC_BITS 0x00000003u
#define OTP_SW_LOCK5_SEC_MSB 1u
#define OTP_SW_LOCK5_SEC_LSB 0u
#define OTP_SW_LOCK5_SEC_ACCESS "RW"
#define OTP_SW_LOCK5_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK5_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK5_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK6_OFFSET 0x00000018u
#define OTP_SW_LOCK6_BITS 0x0000000fu
#define OTP_SW_LOCK6_RESET 0x00000000u
#define OTP_SW_LOCK6_NSEC_RESET "-"
#define OTP_SW_LOCK6_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK6_NSEC_MSB 3u
#define OTP_SW_LOCK6_NSEC_LSB 2u
#define OTP_SW_LOCK6_NSEC_ACCESS "RW"
#define OTP_SW_LOCK6_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK6_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK6_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK6_SEC_RESET "-"
#define OTP_SW_LOCK6_SEC_BITS 0x00000003u
#define OTP_SW_LOCK6_SEC_MSB 1u
#define OTP_SW_LOCK6_SEC_LSB 0u
#define OTP_SW_LOCK6_SEC_ACCESS "RW"
#define OTP_SW_LOCK6_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK6_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK6_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK7_OFFSET 0x0000001cu
#define OTP_SW_LOCK7_BITS 0x0000000fu
#define OTP_SW_LOCK7_RESET 0x00000000u
#define OTP_SW_LOCK7_NSEC_RESET "-"
#define OTP_SW_LOCK7_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK7_NSEC_MSB 3u
#define OTP_SW_LOCK7_NSEC_LSB 2u
#define OTP_SW_LOCK7_NSEC_ACCESS "RW"
#define OTP_SW_LOCK7_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK7_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK7_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK7_SEC_RESET "-"
#define OTP_SW_LOCK7_SEC_BITS 0x00000003u
#define OTP_SW_LOCK7_SEC_MSB 1u
#define OTP_SW_LOCK7_SEC_LSB 0u
#define OTP_SW_LOCK7_SEC_ACCESS "RW"
#define OTP_SW_LOCK7_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK7_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK7_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK8_OFFSET 0x00000020u
#define OTP_SW_LOCK8_BITS 0x0000000fu
#define OTP_SW_LOCK8_RESET 0x00000000u
#define OTP_SW_LOCK8_NSEC_RESET "-"
#define OTP_SW_LOCK8_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK8_NSEC_MSB 3u
#define OTP_SW_LOCK8_NSEC_LSB 2u
#define OTP_SW_LOCK8_NSEC_ACCESS "RW"
#define OTP_SW_LOCK8_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK8_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK8_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK8_SEC_RESET "-"
#define OTP_SW_LOCK8_SEC_BITS 0x00000003u
#define OTP_SW_LOCK8_SEC_MSB 1u
#define OTP_SW_LOCK8_SEC_LSB 0u
#define OTP_SW_LOCK8_SEC_ACCESS "RW"
#define OTP_SW_LOCK8_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK8_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK8_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK9_OFFSET 0x00000024u
#define OTP_SW_LOCK9_BITS 0x0000000fu
#define OTP_SW_LOCK9_RESET 0x00000000u
#define OTP_SW_LOCK9_NSEC_RESET "-"
#define OTP_SW_LOCK9_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK9_NSEC_MSB 3u
#define OTP_SW_LOCK9_NSEC_LSB 2u
#define OTP_SW_LOCK9_NSEC_ACCESS "RW"
#define OTP_SW_LOCK9_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK9_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK9_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK9_SEC_RESET "-"
#define OTP_SW_LOCK9_SEC_BITS 0x00000003u
#define OTP_SW_LOCK9_SEC_MSB 1u
#define OTP_SW_LOCK9_SEC_LSB 0u
#define OTP_SW_LOCK9_SEC_ACCESS "RW"
#define OTP_SW_LOCK9_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK9_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK9_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK10_OFFSET 0x00000028u
#define OTP_SW_LOCK10_BITS 0x0000000fu
#define OTP_SW_LOCK10_RESET 0x00000000u
#define OTP_SW_LOCK10_NSEC_RESET "-"
#define OTP_SW_LOCK10_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK10_NSEC_MSB 3u
#define OTP_SW_LOCK10_NSEC_LSB 2u
#define OTP_SW_LOCK10_NSEC_ACCESS "RW"
#define OTP_SW_LOCK10_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK10_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK10_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK10_SEC_RESET "-"
#define OTP_SW_LOCK10_SEC_BITS 0x00000003u
#define OTP_SW_LOCK10_SEC_MSB 1u
#define OTP_SW_LOCK10_SEC_LSB 0u
#define OTP_SW_LOCK10_SEC_ACCESS "RW"
#define OTP_SW_LOCK10_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK10_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK10_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK11_OFFSET 0x0000002cu
#define OTP_SW_LOCK11_BITS 0x0000000fu
#define OTP_SW_LOCK11_RESET 0x00000000u
#define OTP_SW_LOCK11_NSEC_RESET "-"
#define OTP_SW_LOCK11_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK11_NSEC_MSB 3u
#define OTP_SW_LOCK11_NSEC_LSB 2u
#define OTP_SW_LOCK11_NSEC_ACCESS "RW"
#define OTP_SW_LOCK11_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK11_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK11_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK11_SEC_RESET "-"
#define OTP_SW_LOCK11_SEC_BITS 0x00000003u
#define OTP_SW_LOCK11_SEC_MSB 1u
#define OTP_SW_LOCK11_SEC_LSB 0u
#define OTP_SW_LOCK11_SEC_ACCESS "RW"
#define OTP_SW_LOCK11_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK11_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK11_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK12_OFFSET 0x00000030u
#define OTP_SW_LOCK12_BITS 0x0000000fu
#define OTP_SW_LOCK12_RESET 0x00000000u
#define OTP_SW_LOCK12_NSEC_RESET "-"
#define OTP_SW_LOCK12_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK12_NSEC_MSB 3u
#define OTP_SW_LOCK12_NSEC_LSB 2u
#define OTP_SW_LOCK12_NSEC_ACCESS "RW"
#define OTP_SW_LOCK12_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK12_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK12_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK12_SEC_RESET "-"
#define OTP_SW_LOCK12_SEC_BITS 0x00000003u
#define OTP_SW_LOCK12_SEC_MSB 1u
#define OTP_SW_LOCK12_SEC_LSB 0u
#define OTP_SW_LOCK12_SEC_ACCESS "RW"
#define OTP_SW_LOCK12_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK12_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK12_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK13_OFFSET 0x00000034u
#define OTP_SW_LOCK13_BITS 0x0000000fu
#define OTP_SW_LOCK13_RESET 0x00000000u
#define OTP_SW_LOCK13_NSEC_RESET "-"
#define OTP_SW_LOCK13_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK13_NSEC_MSB 3u
#define OTP_SW_LOCK13_NSEC_LSB 2u
#define OTP_SW_LOCK13_NSEC_ACCESS "RW"
#define OTP_SW_LOCK13_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK13_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK13_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK13_SEC_RESET "-"
#define OTP_SW_LOCK13_SEC_BITS 0x00000003u
#define OTP_SW_LOCK13_SEC_MSB 1u
#define OTP_SW_LOCK13_SEC_LSB 0u
#define OTP_SW_LOCK13_SEC_ACCESS "RW"
#define OTP_SW_LOCK13_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK13_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK13_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK14_OFFSET 0x00000038u
#define OTP_SW_LOCK14_BITS 0x0000000fu
#define OTP_SW_LOCK14_RESET 0x00000000u
#define OTP_SW_LOCK14_NSEC_RESET "-"
#define OTP_SW_LOCK14_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK14_NSEC_MSB 3u
#define OTP_SW_LOCK14_NSEC_LSB 2u
#define OTP_SW_LOCK14_NSEC_ACCESS "RW"
#define OTP_SW_LOCK14_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK14_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK14_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK14_SEC_RESET "-"
#define OTP_SW_LOCK14_SEC_BITS 0x00000003u
#define OTP_SW_LOCK14_SEC_MSB 1u
#define OTP_SW_LOCK14_SEC_LSB 0u
#define OTP_SW_LOCK14_SEC_ACCESS "RW"
#define OTP_SW_LOCK14_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK14_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK14_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK15_OFFSET 0x0000003cu
#define OTP_SW_LOCK15_BITS 0x0000000fu
#define OTP_SW_LOCK15_RESET 0x00000000u
#define OTP_SW_LOCK15_NSEC_RESET "-"
#define OTP_SW_LOCK15_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK15_NSEC_MSB 3u
#define OTP_SW_LOCK15_NSEC_LSB 2u
#define OTP_SW_LOCK15_NSEC_ACCESS "RW"
#define OTP_SW_LOCK15_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK15_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK15_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK15_SEC_RESET "-"
#define OTP_SW_LOCK15_SEC_BITS 0x00000003u
#define OTP_SW_LOCK15_SEC_MSB 1u
#define OTP_SW_LOCK15_SEC_LSB 0u
#define OTP_SW_LOCK15_SEC_ACCESS "RW"
#define OTP_SW_LOCK15_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK15_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK15_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK16_OFFSET 0x00000040u
#define OTP_SW_LOCK16_BITS 0x0000000fu
#define OTP_SW_LOCK16_RESET 0x00000000u
#define OTP_SW_LOCK16_NSEC_RESET "-"
#define OTP_SW_LOCK16_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK16_NSEC_MSB 3u
#define OTP_SW_LOCK16_NSEC_LSB 2u
#define OTP_SW_LOCK16_NSEC_ACCESS "RW"
#define OTP_SW_LOCK16_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK16_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK16_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK16_SEC_RESET "-"
#define OTP_SW_LOCK16_SEC_BITS 0x00000003u
#define OTP_SW_LOCK16_SEC_MSB 1u
#define OTP_SW_LOCK16_SEC_LSB 0u
#define OTP_SW_LOCK16_SEC_ACCESS "RW"
#define OTP_SW_LOCK16_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK16_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK16_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK17_OFFSET 0x00000044u
#define OTP_SW_LOCK17_BITS 0x0000000fu
#define OTP_SW_LOCK17_RESET 0x00000000u
#define OTP_SW_LOCK17_NSEC_RESET "-"
#define OTP_SW_LOCK17_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK17_NSEC_MSB 3u
#define OTP_SW_LOCK17_NSEC_LSB 2u
#define OTP_SW_LOCK17_NSEC_ACCESS "RW"
#define OTP_SW_LOCK17_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK17_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK17_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK17_SEC_RESET "-"
#define OTP_SW_LOCK17_SEC_BITS 0x00000003u
#define OTP_SW_LOCK17_SEC_MSB 1u
#define OTP_SW_LOCK17_SEC_LSB 0u
#define OTP_SW_LOCK17_SEC_ACCESS "RW"
#define OTP_SW_LOCK17_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK17_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK17_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK18_OFFSET 0x00000048u
#define OTP_SW_LOCK18_BITS 0x0000000fu
#define OTP_SW_LOCK18_RESET 0x00000000u
#define OTP_SW_LOCK18_NSEC_RESET "-"
#define OTP_SW_LOCK18_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK18_NSEC_MSB 3u
#define OTP_SW_LOCK18_NSEC_LSB 2u
#define OTP_SW_LOCK18_NSEC_ACCESS "RW"
#define OTP_SW_LOCK18_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK18_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK18_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK18_SEC_RESET "-"
#define OTP_SW_LOCK18_SEC_BITS 0x00000003u
#define OTP_SW_LOCK18_SEC_MSB 1u
#define OTP_SW_LOCK18_SEC_LSB 0u
#define OTP_SW_LOCK18_SEC_ACCESS "RW"
#define OTP_SW_LOCK18_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK18_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK18_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK19_OFFSET 0x0000004cu
#define OTP_SW_LOCK19_BITS 0x0000000fu
#define OTP_SW_LOCK19_RESET 0x00000000u
#define OTP_SW_LOCK19_NSEC_RESET "-"
#define OTP_SW_LOCK19_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK19_NSEC_MSB 3u
#define OTP_SW_LOCK19_NSEC_LSB 2u
#define OTP_SW_LOCK19_NSEC_ACCESS "RW"
#define OTP_SW_LOCK19_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK19_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK19_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK19_SEC_RESET "-"
#define OTP_SW_LOCK19_SEC_BITS 0x00000003u
#define OTP_SW_LOCK19_SEC_MSB 1u
#define OTP_SW_LOCK19_SEC_LSB 0u
#define OTP_SW_LOCK19_SEC_ACCESS "RW"
#define OTP_SW_LOCK19_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK19_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK19_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK20_OFFSET 0x00000050u
#define OTP_SW_LOCK20_BITS 0x0000000fu
#define OTP_SW_LOCK20_RESET 0x00000000u
#define OTP_SW_LOCK20_NSEC_RESET "-"
#define OTP_SW_LOCK20_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK20_NSEC_MSB 3u
#define OTP_SW_LOCK20_NSEC_LSB 2u
#define OTP_SW_LOCK20_NSEC_ACCESS "RW"
#define OTP_SW_LOCK20_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK20_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK20_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK20_SEC_RESET "-"
#define OTP_SW_LOCK20_SEC_BITS 0x00000003u
#define OTP_SW_LOCK20_SEC_MSB 1u
#define OTP_SW_LOCK20_SEC_LSB 0u
#define OTP_SW_LOCK20_SEC_ACCESS "RW"
#define OTP_SW_LOCK20_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK20_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK20_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK21_OFFSET 0x00000054u
#define OTP_SW_LOCK21_BITS 0x0000000fu
#define OTP_SW_LOCK21_RESET 0x00000000u
#define OTP_SW_LOCK21_NSEC_RESET "-"
#define OTP_SW_LOCK21_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK21_NSEC_MSB 3u
#define OTP_SW_LOCK21_NSEC_LSB 2u
#define OTP_SW_LOCK21_NSEC_ACCESS "RW"
#define OTP_SW_LOCK21_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK21_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK21_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK21_SEC_RESET "-"
#define OTP_SW_LOCK21_SEC_BITS 0x00000003u
#define OTP_SW_LOCK21_SEC_MSB 1u
#define OTP_SW_LOCK21_SEC_LSB 0u
#define OTP_SW_LOCK21_SEC_ACCESS "RW"
#define OTP_SW_LOCK21_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK21_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK21_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK22_OFFSET 0x00000058u
#define OTP_SW_LOCK22_BITS 0x0000000fu
#define OTP_SW_LOCK22_RESET 0x00000000u
#define OTP_SW_LOCK22_NSEC_RESET "-"
#define OTP_SW_LOCK22_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK22_NSEC_MSB 3u
#define OTP_SW_LOCK22_NSEC_LSB 2u
#define OTP_SW_LOCK22_NSEC_ACCESS "RW"
#define OTP_SW_LOCK22_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK22_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK22_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK22_SEC_RESET "-"
#define OTP_SW_LOCK22_SEC_BITS 0x00000003u
#define OTP_SW_LOCK22_SEC_MSB 1u
#define OTP_SW_LOCK22_SEC_LSB 0u
#define OTP_SW_LOCK22_SEC_ACCESS "RW"
#define OTP_SW_LOCK22_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK22_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK22_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK23_OFFSET 0x0000005cu
#define OTP_SW_LOCK23_BITS 0x0000000fu
#define OTP_SW_LOCK23_RESET 0x00000000u
#define OTP_SW_LOCK23_NSEC_RESET "-"
#define OTP_SW_LOCK23_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK23_NSEC_MSB 3u
#define OTP_SW_LOCK23_NSEC_LSB 2u
#define OTP_SW_LOCK23_NSEC_ACCESS "RW"
#define OTP_SW_LOCK23_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK23_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK23_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK23_SEC_RESET "-"
#define OTP_SW_LOCK23_SEC_BITS 0x00000003u
#define OTP_SW_LOCK23_SEC_MSB 1u
#define OTP_SW_LOCK23_SEC_LSB 0u
#define OTP_SW_LOCK23_SEC_ACCESS "RW"
#define OTP_SW_LOCK23_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK23_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK23_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK24_OFFSET 0x00000060u
#define OTP_SW_LOCK24_BITS 0x0000000fu
#define OTP_SW_LOCK24_RESET 0x00000000u
#define OTP_SW_LOCK24_NSEC_RESET "-"
#define OTP_SW_LOCK24_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK24_NSEC_MSB 3u
#define OTP_SW_LOCK24_NSEC_LSB 2u
#define OTP_SW_LOCK24_NSEC_ACCESS "RW"
#define OTP_SW_LOCK24_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK24_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK24_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK24_SEC_RESET "-"
#define OTP_SW_LOCK24_SEC_BITS 0x00000003u
#define OTP_SW_LOCK24_SEC_MSB 1u
#define OTP_SW_LOCK24_SEC_LSB 0u
#define OTP_SW_LOCK24_SEC_ACCESS "RW"
#define OTP_SW_LOCK24_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK24_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK24_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK25_OFFSET 0x00000064u
#define OTP_SW_LOCK25_BITS 0x0000000fu
#define OTP_SW_LOCK25_RESET 0x00000000u
#define OTP_SW_LOCK25_NSEC_RESET "-"
#define OTP_SW_LOCK25_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK25_NSEC_MSB 3u
#define OTP_SW_LOCK25_NSEC_LSB 2u
#define OTP_SW_LOCK25_NSEC_ACCESS "RW"
#define OTP_SW_LOCK25_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK25_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK25_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK25_SEC_RESET "-"
