gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define OTP_SW_LOCK25_SEC_BITS 0x00000003u
#define OTP_SW_LOCK25_SEC_MSB 1u
#define OTP_SW_LOCK25_SEC_LSB 0u
#define OTP_SW_LOCK25_SEC_ACCESS "RW"
#define OTP_SW_LOCK25_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK25_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK25_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK26_OFFSET 0x00000068u
#define OTP_SW_LOCK26_BITS 0x0000000fu
#define OTP_SW_LOCK26_RESET 0x00000000u
#define OTP_SW_LOCK26_NSEC_RESET "-"
#define OTP_SW_LOCK26_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK26_NSEC_MSB 3u
#define OTP_SW_LOCK26_NSEC_LSB 2u
#define OTP_SW_LOCK26_NSEC_ACCESS "RW"
#define OTP_SW_LOCK26_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK26_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK26_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK26_SEC_RESET "-"
#define OTP_SW_LOCK26_SEC_BITS 0x00000003u
#define OTP_SW_LOCK26_SEC_MSB 1u
#define OTP_SW_LOCK26_SEC_LSB 0u
#define OTP_SW_LOCK26_SEC_ACCESS "RW"
#define OTP_SW_LOCK26_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK26_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK26_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK27_OFFSET 0x0000006cu
#define OTP_SW_LOCK27_BITS 0x0000000fu
#define OTP_SW_LOCK27_RESET 0x00000000u
#define OTP_SW_LOCK27_NSEC_RESET "-"
#define OTP_SW_LOCK27_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK27_NSEC_MSB 3u
#define OTP_SW_LOCK27_NSEC_LSB 2u
#define OTP_SW_LOCK27_NSEC_ACCESS "RW"
#define OTP_SW_LOCK27_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK27_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK27_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK27_SEC_RESET "-"
#define OTP_SW_LOCK27_SEC_BITS 0x00000003u
#define OTP_SW_LOCK27_SEC_MSB 1u
#define OTP_SW_LOCK27_SEC_LSB 0u
#define OTP_SW_LOCK27_SEC_ACCESS "RW"
#define OTP_SW_LOCK27_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK27_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK27_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK28_OFFSET 0x00000070u
#define OTP_SW_LOCK28_BITS 0x0000000fu
#define OTP_SW_LOCK28_RESET 0x00000000u
#define OTP_SW_LOCK28_NSEC_RESET "-"
#define OTP_SW_LOCK28_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK28_NSEC_MSB 3u
#define OTP_SW_LOCK28_NSEC_LSB 2u
#define OTP_SW_LOCK28_NSEC_ACCESS "RW"
#define OTP_SW_LOCK28_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK28_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK28_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK28_SEC_RESET "-"
#define OTP_SW_LOCK28_SEC_BITS 0x00000003u
#define OTP_SW_LOCK28_SEC_MSB 1u
#define OTP_SW_LOCK28_SEC_LSB 0u
#define OTP_SW_LOCK28_SEC_ACCESS "RW"
#define OTP_SW_LOCK28_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK28_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK28_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK29_OFFSET 0x00000074u
#define OTP_SW_LOCK29_BITS 0x0000000fu
#define OTP_SW_LOCK29_RESET 0x00000000u
#define OTP_SW_LOCK29_NSEC_RESET "-"
#define OTP_SW_LOCK29_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK29_NSEC_MSB 3u
#define OTP_SW_LOCK29_NSEC_LSB 2u
#define OTP_SW_LOCK29_NSEC_ACCESS "RW"
#define OTP_SW_LOCK29_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK29_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK29_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK29_SEC_RESET "-"
#define OTP_SW_LOCK29_SEC_BITS 0x00000003u
#define OTP_SW_LOCK29_SEC_MSB 1u
#define OTP_SW_LOCK29_SEC_LSB 0u
#define OTP_SW_LOCK29_SEC_ACCESS "RW"
#define OTP_SW_LOCK29_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK29_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK29_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK30_OFFSET 0x00000078u
#define OTP_SW_LOCK30_BITS 0x0000000fu
#define OTP_SW_LOCK30_RESET 0x00000000u
#define OTP_SW_LOCK30_NSEC_RESET "-"
#define OTP_SW_LOCK30_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK30_NSEC_MSB 3u
#define OTP_SW_LOCK30_NSEC_LSB 2u
#define OTP_SW_LOCK30_NSEC_ACCESS "RW"
#define OTP_SW_LOCK30_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK30_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK30_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK30_SEC_RESET "-"
#define OTP_SW_LOCK30_SEC_BITS 0x00000003u
#define OTP_SW_LOCK30_SEC_MSB 1u
#define OTP_SW_LOCK30_SEC_LSB 0u
#define OTP_SW_LOCK30_SEC_ACCESS "RW"
#define OTP_SW_LOCK30_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK30_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK30_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK31_OFFSET 0x0000007cu
#define OTP_SW_LOCK31_BITS 0x0000000fu
#define OTP_SW_LOCK31_RESET 0x00000000u
#define OTP_SW_LOCK31_NSEC_RESET "-"
#define OTP_SW_LOCK31_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK31_NSEC_MSB 3u
#define OTP_SW_LOCK31_NSEC_LSB 2u
#define OTP_SW_LOCK31_NSEC_ACCESS "RW"
#define OTP_SW_LOCK31_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK31_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK31_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK31_SEC_RESET "-"
#define OTP_SW_LOCK31_SEC_BITS 0x00000003u
#define OTP_SW_LOCK31_SEC_MSB 1u
#define OTP_SW_LOCK31_SEC_LSB 0u
#define OTP_SW_LOCK31_SEC_ACCESS "RW"
#define OTP_SW_LOCK31_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK31_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK31_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK32_OFFSET 0x00000080u
#define OTP_SW_LOCK32_BITS 0x0000000fu
#define OTP_SW_LOCK32_RESET 0x00000000u
#define OTP_SW_LOCK32_NSEC_RESET "-"
#define OTP_SW_LOCK32_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK32_NSEC_MSB 3u
#define OTP_SW_LOCK32_NSEC_LSB 2u
#define OTP_SW_LOCK32_NSEC_ACCESS "RW"
#define OTP_SW_LOCK32_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK32_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK32_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK32_SEC_RESET "-"
#define OTP_SW_LOCK32_SEC_BITS 0x00000003u
#define OTP_SW_LOCK32_SEC_MSB 1u
#define OTP_SW_LOCK32_SEC_LSB 0u
#define OTP_SW_LOCK32_SEC_ACCESS "RW"
#define OTP_SW_LOCK32_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK32_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK32_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK33_OFFSET 0x00000084u
#define OTP_SW_LOCK33_BITS 0x0000000fu
#define OTP_SW_LOCK33_RESET 0x00000000u
#define OTP_SW_LOCK33_NSEC_RESET "-"
#define OTP_SW_LOCK33_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK33_NSEC_MSB 3u
#define OTP_SW_LOCK33_NSEC_LSB 2u
#define OTP_SW_LOCK33_NSEC_ACCESS "RW"
#define OTP_SW_LOCK33_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK33_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK33_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK33_SEC_RESET "-"
#define OTP_SW_LOCK33_SEC_BITS 0x00000003u
#define OTP_SW_LOCK33_SEC_MSB 1u
#define OTP_SW_LOCK33_SEC_LSB 0u
#define OTP_SW_LOCK33_SEC_ACCESS "RW"
#define OTP_SW_LOCK33_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK33_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK33_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK34_OFFSET 0x00000088u
#define OTP_SW_LOCK34_BITS 0x0000000fu
#define OTP_SW_LOCK34_RESET 0x00000000u
#define OTP_SW_LOCK34_NSEC_RESET "-"
#define OTP_SW_LOCK34_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK34_NSEC_MSB 3u
#define OTP_SW_LOCK34_NSEC_LSB 2u
#define OTP_SW_LOCK34_NSEC_ACCESS "RW"
#define OTP_SW_LOCK34_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK34_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK34_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK34_SEC_RESET "-"
#define OTP_SW_LOCK34_SEC_BITS 0x00000003u
#define OTP_SW_LOCK34_SEC_MSB 1u
#define OTP_SW_LOCK34_SEC_LSB 0u
#define OTP_SW_LOCK34_SEC_ACCESS "RW"
#define OTP_SW_LOCK34_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK34_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK34_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK35_OFFSET 0x0000008cu
#define OTP_SW_LOCK35_BITS 0x0000000fu
#define OTP_SW_LOCK35_RESET 0x00000000u
#define OTP_SW_LOCK35_NSEC_RESET "-"
#define OTP_SW_LOCK35_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK35_NSEC_MSB 3u
#define OTP_SW_LOCK35_NSEC_LSB 2u
#define OTP_SW_LOCK35_NSEC_ACCESS "RW"
#define OTP_SW_LOCK35_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK35_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK35_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK35_SEC_RESET "-"
#define OTP_SW_LOCK35_SEC_BITS 0x00000003u
#define OTP_SW_LOCK35_SEC_MSB 1u
#define OTP_SW_LOCK35_SEC_LSB 0u
#define OTP_SW_LOCK35_SEC_ACCESS "RW"
#define OTP_SW_LOCK35_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK35_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK35_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK36_OFFSET 0x00000090u
#define OTP_SW_LOCK36_BITS 0x0000000fu
#define OTP_SW_LOCK36_RESET 0x00000000u
#define OTP_SW_LOCK36_NSEC_RESET "-"
#define OTP_SW_LOCK36_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK36_NSEC_MSB 3u
#define OTP_SW_LOCK36_NSEC_LSB 2u
#define OTP_SW_LOCK36_NSEC_ACCESS "RW"
#define OTP_SW_LOCK36_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK36_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK36_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK36_SEC_RESET "-"
#define OTP_SW_LOCK36_SEC_BITS 0x00000003u
#define OTP_SW_LOCK36_SEC_MSB 1u
#define OTP_SW_LOCK36_SEC_LSB 0u
#define OTP_SW_LOCK36_SEC_ACCESS "RW"
#define OTP_SW_LOCK36_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK36_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK36_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK37_OFFSET 0x00000094u
#define OTP_SW_LOCK37_BITS 0x0000000fu
#define OTP_SW_LOCK37_RESET 0x00000000u
#define OTP_SW_LOCK37_NSEC_RESET "-"
#define OTP_SW_LOCK37_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK37_NSEC_MSB 3u
#define OTP_SW_LOCK37_NSEC_LSB 2u
#define OTP_SW_LOCK37_NSEC_ACCESS "RW"
#define OTP_SW_LOCK37_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK37_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK37_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK37_SEC_RESET "-"
#define OTP_SW_LOCK37_SEC_BITS 0x00000003u
#define OTP_SW_LOCK37_SEC_MSB 1u
#define OTP_SW_LOCK37_SEC_LSB 0u
#define OTP_SW_LOCK37_SEC_ACCESS "RW"
#define OTP_SW_LOCK37_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK37_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK37_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK38_OFFSET 0x00000098u
#define OTP_SW_LOCK38_BITS 0x0000000fu
#define OTP_SW_LOCK38_RESET 0x00000000u
#define OTP_SW_LOCK38_NSEC_RESET "-"
#define OTP_SW_LOCK38_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK38_NSEC_MSB 3u
#define OTP_SW_LOCK38_NSEC_LSB 2u
#define OTP_SW_LOCK38_NSEC_ACCESS "RW"
#define OTP_SW_LOCK38_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK38_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK38_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK38_SEC_RESET "-"
#define OTP_SW_LOCK38_SEC_BITS 0x00000003u
#define OTP_SW_LOCK38_SEC_MSB 1u
#define OTP_SW_LOCK38_SEC_LSB 0u
#define OTP_SW_LOCK38_SEC_ACCESS "RW"
#define OTP_SW_LOCK38_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK38_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK38_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK39_OFFSET 0x0000009cu
#define OTP_SW_LOCK39_BITS 0x0000000fu
#define OTP_SW_LOCK39_RESET 0x00000000u
#define OTP_SW_LOCK39_NSEC_RESET "-"
#define OTP_SW_LOCK39_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK39_NSEC_MSB 3u
#define OTP_SW_LOCK39_NSEC_LSB 2u
#define OTP_SW_LOCK39_NSEC_ACCESS "RW"
#define OTP_SW_LOCK39_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK39_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK39_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK39_SEC_RESET "-"
#define OTP_SW_LOCK39_SEC_BITS 0x00000003u
#define OTP_SW_LOCK39_SEC_MSB 1u
#define OTP_SW_LOCK39_SEC_LSB 0u
#define OTP_SW_LOCK39_SEC_ACCESS "RW"
#define OTP_SW_LOCK39_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK39_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK39_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK40_OFFSET 0x000000a0u
#define OTP_SW_LOCK40_BITS 0x0000000fu
#define OTP_SW_LOCK40_RESET 0x00000000u
#define OTP_SW_LOCK40_NSEC_RESET "-"
#define OTP_SW_LOCK40_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK40_NSEC_MSB 3u
#define OTP_SW_LOCK40_NSEC_LSB 2u
#define OTP_SW_LOCK40_NSEC_ACCESS "RW"
#define OTP_SW_LOCK40_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK40_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK40_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK40_SEC_RESET "-"
#define OTP_SW_LOCK40_SEC_BITS 0x00000003u
#define OTP_SW_LOCK40_SEC_MSB 1u
#define OTP_SW_LOCK40_SEC_LSB 0u
#define OTP_SW_LOCK40_SEC_ACCESS "RW"
#define OTP_SW_LOCK40_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK40_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK40_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK41_OFFSET 0x000000a4u
#define OTP_SW_LOCK41_BITS 0x0000000fu
#define OTP_SW_LOCK41_RESET 0x00000000u
#define OTP_SW_LOCK41_NSEC_RESET "-"
#define OTP_SW_LOCK41_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK41_NSEC_MSB 3u
#define OTP_SW_LOCK41_NSEC_LSB 2u
#define OTP_SW_LOCK41_NSEC_ACCESS "RW"
#define OTP_SW_LOCK41_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK41_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK41_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK41_SEC_RESET "-"
#define OTP_SW_LOCK41_SEC_BITS 0x00000003u
#define OTP_SW_LOCK41_SEC_MSB 1u
#define OTP_SW_LOCK41_SEC_LSB 0u
#define OTP_SW_LOCK41_SEC_ACCESS "RW"
#define OTP_SW_LOCK41_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK41_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK41_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK42_OFFSET 0x000000a8u
#define OTP_SW_LOCK42_BITS 0x0000000fu
#define OTP_SW_LOCK42_RESET 0x00000000u
#define OTP_SW_LOCK42_NSEC_RESET "-"
#define OTP_SW_LOCK42_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK42_NSEC_MSB 3u
#define OTP_SW_LOCK42_NSEC_LSB 2u
#define OTP_SW_LOCK42_NSEC_ACCESS "RW"
#define OTP_SW_LOCK42_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK42_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK42_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK42_SEC_RESET "-"
#define OTP_SW_LOCK42_SEC_BITS 0x00000003u
#define OTP_SW_LOCK42_SEC_MSB 1u
#define OTP_SW_LOCK42_SEC_LSB 0u
#define OTP_SW_LOCK42_SEC_ACCESS "RW"
#define OTP_SW_LOCK42_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK42_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK42_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK43_OFFSET 0x000000acu
#define OTP_SW_LOCK43_BITS 0x0000000fu
#define OTP_SW_LOCK43_RESET 0x00000000u
#define OTP_SW_LOCK43_NSEC_RESET "-"
#define OTP_SW_LOCK43_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK43_NSEC_MSB 3u
#define OTP_SW_LOCK43_NSEC_LSB 2u
#define OTP_SW_LOCK43_NSEC_ACCESS "RW"
#define OTP_SW_LOCK43_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK43_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK43_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK43_SEC_RESET "-"
#define OTP_SW_LOCK43_SEC_BITS 0x00000003u
#define OTP_SW_LOCK43_SEC_MSB 1u
#define OTP_SW_LOCK43_SEC_LSB 0u
#define OTP_SW_LOCK43_SEC_ACCESS "RW"
#define OTP_SW_LOCK43_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK43_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK43_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK44_OFFSET 0x000000b0u
#define OTP_SW_LOCK44_BITS 0x0000000fu
#define OTP_SW_LOCK44_RESET 0x00000000u
#define OTP_SW_LOCK44_NSEC_RESET "-"
#define OTP_SW_LOCK44_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK44_NSEC_MSB 3u
#define OTP_SW_LOCK44_NSEC_LSB 2u
#define OTP_SW_LOCK44_NSEC_ACCESS "RW"
#define OTP_SW_LOCK44_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK44_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK44_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK44_SEC_RESET "-"
#define OTP_SW_LOCK44_SEC_BITS 0x00000003u
#define OTP_SW_LOCK44_SEC_MSB 1u
#define OTP_SW_LOCK44_SEC_LSB 0u
#define OTP_SW_LOCK44_SEC_ACCESS "RW"
#define OTP_SW_LOCK44_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK44_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK44_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK45_OFFSET 0x000000b4u
#define OTP_SW_LOCK45_BITS 0x0000000fu
#define OTP_SW_LOCK45_RESET 0x00000000u
#define OTP_SW_LOCK45_NSEC_RESET "-"
#define OTP_SW_LOCK45_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK45_NSEC_MSB 3u
#define OTP_SW_LOCK45_NSEC_LSB 2u
#define OTP_SW_LOCK45_NSEC_ACCESS "RW"
#define OTP_SW_LOCK45_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK45_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK45_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK45_SEC_RESET "-"
#define OTP_SW_LOCK45_SEC_BITS 0x00000003u
#define OTP_SW_LOCK45_SEC_MSB 1u
#define OTP_SW_LOCK45_SEC_LSB 0u
#define OTP_SW_LOCK45_SEC_ACCESS "RW"
#define OTP_SW_LOCK45_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK45_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK45_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK46_OFFSET 0x000000b8u
#define OTP_SW_LOCK46_BITS 0x0000000fu
#define OTP_SW_LOCK46_RESET 0x00000000u
#define OTP_SW_LOCK46_NSEC_RESET "-"
#define OTP_SW_LOCK46_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK46_NSEC_MSB 3u
#define OTP_SW_LOCK46_NSEC_LSB 2u
#define OTP_SW_LOCK46_NSEC_ACCESS "RW"
#define OTP_SW_LOCK46_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK46_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK46_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK46_SEC_RESET "-"
#define OTP_SW_LOCK46_SEC_BITS 0x00000003u
#define OTP_SW_LOCK46_SEC_MSB 1u
#define OTP_SW_LOCK46_SEC_LSB 0u
#define OTP_SW_LOCK46_SEC_ACCESS "RW"
#define OTP_SW_LOCK46_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK46_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK46_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK47_OFFSET 0x000000bcu
#define OTP_SW_LOCK47_BITS 0x0000000fu
#define OTP_SW_LOCK47_RESET 0x00000000u
#define OTP_SW_LOCK47_NSEC_RESET "-"
#define OTP_SW_LOCK47_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK47_NSEC_MSB 3u
#define OTP_SW_LOCK47_NSEC_LSB 2u
#define OTP_SW_LOCK47_NSEC_ACCESS "RW"
#define OTP_SW_LOCK47_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK47_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK47_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK47_SEC_RESET "-"
#define OTP_SW_LOCK47_SEC_BITS 0x00000003u
#define OTP_SW_LOCK47_SEC_MSB 1u
#define OTP_SW_LOCK47_SEC_LSB 0u
#define OTP_SW_LOCK47_SEC_ACCESS "RW"
#define OTP_SW_LOCK47_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK47_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK47_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK48_OFFSET 0x000000c0u
#define OTP_SW_LOCK48_BITS 0x0000000fu
#define OTP_SW_LOCK48_RESET 0x00000000u
#define OTP_SW_LOCK48_NSEC_RESET "-"
#define OTP_SW_LOCK48_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK48_NSEC_MSB 3u
#define OTP_SW_LOCK48_NSEC_LSB 2u
#define OTP_SW_LOCK48_NSEC_ACCESS "RW"
#define OTP_SW_LOCK48_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK48_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK48_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK48_SEC_RESET "-"
#define OTP_SW_LOCK48_SEC_BITS 0x00000003u
#define OTP_SW_LOCK48_SEC_MSB 1u
#define OTP_SW_LOCK48_SEC_LSB 0u
#define OTP_SW_LOCK48_SEC_ACCESS "RW"
#define OTP_SW_LOCK48_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK48_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK48_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK49_OFFSET 0x000000c4u
#define OTP_SW_LOCK49_BITS 0x0000000fu
#define OTP_SW_LOCK49_RESET 0x00000000u
#define OTP_SW_LOCK49_NSEC_RESET "-"
#define OTP_SW_LOCK49_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK49_NSEC_MSB 3u
#define OTP_SW_LOCK49_NSEC_LSB 2u
#define OTP_SW_LOCK49_NSEC_ACCESS "RW"
#define OTP_SW_LOCK49_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK49_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK49_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK49_SEC_RESET "-"
#define OTP_SW_LOCK49_SEC_BITS 0x00000003u
#define OTP_SW_LOCK49_SEC_MSB 1u
#define OTP_SW_LOCK49_SEC_LSB 0u
#define OTP_SW_LOCK49_SEC_ACCESS "RW"
#define OTP_SW_LOCK49_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK49_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK49_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK50_OFFSET 0x000000c8u
#define OTP_SW_LOCK50_BITS 0x0000000fu
#define OTP_SW_LOCK50_RESET 0x00000000u
#define OTP_SW_LOCK50_NSEC_RESET "-"
#define OTP_SW_LOCK50_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK50_NSEC_MSB 3u
#define OTP_SW_LOCK50_NSEC_LSB 2u
#define OTP_SW_LOCK50_NSEC_ACCESS "RW"
#define OTP_SW_LOCK50_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK50_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK50_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK50_SEC_RESET "-"
#define OTP_SW_LOCK50_SEC_BITS 0x00000003u
#define OTP_SW_LOCK50_SEC_MSB 1u
#define OTP_SW_LOCK50_SEC_LSB 0u
#define OTP_SW_LOCK50_SEC_ACCESS "RW"
#define OTP_SW_LOCK50_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK50_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK50_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK51_OFFSET 0x000000ccu
#define OTP_SW_LOCK51_BITS 0x0000000fu
#define OTP_SW_LOCK51_RESET 0x00000000u
#define OTP_SW_LOCK51_NSEC_RESET "-"
#define OTP_SW_LOCK51_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK51_NSEC_MSB 3u
#define OTP_SW_LOCK51_NSEC_LSB 2u
#define OTP_SW_LOCK51_NSEC_ACCESS "RW"
#define OTP_SW_LOCK51_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK51_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK51_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK51_SEC_RESET "-"
#define OTP_SW_LOCK51_SEC_BITS 0x00000003u
#define OTP_SW_LOCK51_SEC_MSB 1u
#define OTP_SW_LOCK51_SEC_LSB 0u
#define OTP_SW_LOCK51_SEC_ACCESS "RW"
#define OTP_SW_LOCK51_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK51_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK51_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK52_OFFSET 0x000000d0u
#define OTP_SW_LOCK52_BITS 0x0000000fu
#define OTP_SW_LOCK52_RESET 0x00000000u
#define OTP_SW_LOCK52_NSEC_RESET "-"
#define OTP_SW_LOCK52_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK52_NSEC_MSB 3u
#define OTP_SW_LOCK52_NSEC_LSB 2u
#define OTP_SW_LOCK52_NSEC_ACCESS "RW"
#define OTP_SW_LOCK52_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK52_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK52_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK52_SEC_RESET "-"
#define OTP_SW_LOCK52_SEC_BITS 0x00000003u
#define OTP_SW_LOCK52_SEC_MSB 1u
#define OTP_SW_LOCK52_SEC_LSB 0u
#define OTP_SW_LOCK52_SEC_ACCESS "RW"
#define OTP_SW_LOCK52_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK52_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK52_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK53_OFFSET 0x000000d4u
#define OTP_SW_LOCK53_BITS 0x0000000fu
#define OTP_SW_LOCK53_RESET 0x00000000u
#define OTP_SW_LOCK53_NSEC_RESET "-"
#define OTP_SW_LOCK53_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK53_NSEC_MSB 3u
#define OTP_SW_LOCK53_NSEC_LSB 2u
#define OTP_SW_LOCK53_NSEC_ACCESS "RW"
#define OTP_SW_LOCK53_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK53_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK53_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK53_SEC_RESET "-"
#define OTP_SW_LOCK53_SEC_BITS 0x00000003u
#define OTP_SW_LOCK53_SEC_MSB 1u
#define OTP_SW_LOCK53_SEC_LSB 0u
#define OTP_SW_LOCK53_SEC_ACCESS "RW"
#define OTP_SW_LOCK53_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK53_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK53_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK54_OFFSET 0x000000d8u
#define OTP_SW_LOCK54_BITS 0x0000000fu
#define OTP_SW_LOCK54_RESET 0x00000000u
#define OTP_SW_LOCK54_NSEC_RESET "-"
#define OTP_SW_LOCK54_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK54_NSEC_MSB 3u
#define OTP_SW_LOCK54_NSEC_LSB 2u
#define OTP_SW_LOCK54_NSEC_ACCESS "RW"
#define OTP_SW_LOCK54_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK54_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK54_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK54_SEC_RESET "-"
#define OTP_SW_LOCK54_SEC_BITS 0x00000003u
#define OTP_SW_LOCK54_SEC_MSB 1u
#define OTP_SW_LOCK54_SEC_LSB 0u
#define OTP_SW_LOCK54_SEC_ACCESS "RW"
#define OTP_SW_LOCK54_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK54_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK54_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK55_OFFSET 0x000000dcu
#define OTP_SW_LOCK55_BITS 0x0000000fu
#define OTP_SW_LOCK55_RESET 0x00000000u
#define OTP_SW_LOCK55_NSEC_RESET "-"
#define OTP_SW_LOCK55_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK55_NSEC_MSB 3u
#define OTP_SW_LOCK55_NSEC_LSB 2u
#define OTP_SW_LOCK55_NSEC_ACCESS "RW"
#define OTP_SW_LOCK55_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK55_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK55_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK55_SEC_RESET "-"
#define OTP_SW_LOCK55_SEC_BITS 0x00000003u
#define OTP_SW_LOCK55_SEC_MSB 1u
#define OTP_SW_LOCK55_SEC_LSB 0u
#define OTP_SW_LOCK55_SEC_ACCESS "RW"
#define OTP_SW_LOCK55_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK55_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK55_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK56_OFFSET 0x000000e0u
#define OTP_SW_LOCK56_BITS 0x0000000fu
#define OTP_SW_LOCK56_RESET 0x00000000u
#define OTP_SW_LOCK56_NSEC_RESET "-"
