gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define OTP_SW_LOCK56_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK56_NSEC_MSB 3u
#define OTP_SW_LOCK56_NSEC_LSB 2u
#define OTP_SW_LOCK56_NSEC_ACCESS "RW"
#define OTP_SW_LOCK56_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK56_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK56_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK56_SEC_RESET "-"
#define OTP_SW_LOCK56_SEC_BITS 0x00000003u
#define OTP_SW_LOCK56_SEC_MSB 1u
#define OTP_SW_LOCK56_SEC_LSB 0u
#define OTP_SW_LOCK56_SEC_ACCESS "RW"
#define OTP_SW_LOCK56_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK56_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK56_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK57_OFFSET 0x000000e4u
#define OTP_SW_LOCK57_BITS 0x0000000fu
#define OTP_SW_LOCK57_RESET 0x00000000u
#define OTP_SW_LOCK57_NSEC_RESET "-"
#define OTP_SW_LOCK57_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK57_NSEC_MSB 3u
#define OTP_SW_LOCK57_NSEC_LSB 2u
#define OTP_SW_LOCK57_NSEC_ACCESS "RW"
#define OTP_SW_LOCK57_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK57_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK57_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK57_SEC_RESET "-"
#define OTP_SW_LOCK57_SEC_BITS 0x00000003u
#define OTP_SW_LOCK57_SEC_MSB 1u
#define OTP_SW_LOCK57_SEC_LSB 0u
#define OTP_SW_LOCK57_SEC_ACCESS "RW"
#define OTP_SW_LOCK57_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK57_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK57_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK58_OFFSET 0x000000e8u
#define OTP_SW_LOCK58_BITS 0x0000000fu
#define OTP_SW_LOCK58_RESET 0x00000000u
#define OTP_SW_LOCK58_NSEC_RESET "-"
#define OTP_SW_LOCK58_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK58_NSEC_MSB 3u
#define OTP_SW_LOCK58_NSEC_LSB 2u
#define OTP_SW_LOCK58_NSEC_ACCESS "RW"
#define OTP_SW_LOCK58_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK58_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK58_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK58_SEC_RESET "-"
#define OTP_SW_LOCK58_SEC_BITS 0x00000003u
#define OTP_SW_LOCK58_SEC_MSB 1u
#define OTP_SW_LOCK58_SEC_LSB 0u
#define OTP_SW_LOCK58_SEC_ACCESS "RW"
#define OTP_SW_LOCK58_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK58_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK58_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK59_OFFSET 0x000000ecu
#define OTP_SW_LOCK59_BITS 0x0000000fu
#define OTP_SW_LOCK59_RESET 0x00000000u
#define OTP_SW_LOCK59_NSEC_RESET "-"
#define OTP_SW_LOCK59_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK59_NSEC_MSB 3u
#define OTP_SW_LOCK59_NSEC_LSB 2u
#define OTP_SW_LOCK59_NSEC_ACCESS "RW"
#define OTP_SW_LOCK59_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK59_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK59_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK59_SEC_RESET "-"
#define OTP_SW_LOCK59_SEC_BITS 0x00000003u
#define OTP_SW_LOCK59_SEC_MSB 1u
#define OTP_SW_LOCK59_SEC_LSB 0u
#define OTP_SW_LOCK59_SEC_ACCESS "RW"
#define OTP_SW_LOCK59_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK59_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK59_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK60_OFFSET 0x000000f0u
#define OTP_SW_LOCK60_BITS 0x0000000fu
#define OTP_SW_LOCK60_RESET 0x00000000u
#define OTP_SW_LOCK60_NSEC_RESET "-"
#define OTP_SW_LOCK60_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK60_NSEC_MSB 3u
#define OTP_SW_LOCK60_NSEC_LSB 2u
#define OTP_SW_LOCK60_NSEC_ACCESS "RW"
#define OTP_SW_LOCK60_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK60_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK60_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK60_SEC_RESET "-"
#define OTP_SW_LOCK60_SEC_BITS 0x00000003u
#define OTP_SW_LOCK60_SEC_MSB 1u
#define OTP_SW_LOCK60_SEC_LSB 0u
#define OTP_SW_LOCK60_SEC_ACCESS "RW"
#define OTP_SW_LOCK60_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK60_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK60_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK61_OFFSET 0x000000f4u
#define OTP_SW_LOCK61_BITS 0x0000000fu
#define OTP_SW_LOCK61_RESET 0x00000000u
#define OTP_SW_LOCK61_NSEC_RESET "-"
#define OTP_SW_LOCK61_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK61_NSEC_MSB 3u
#define OTP_SW_LOCK61_NSEC_LSB 2u
#define OTP_SW_LOCK61_NSEC_ACCESS "RW"
#define OTP_SW_LOCK61_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK61_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK61_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK61_SEC_RESET "-"
#define OTP_SW_LOCK61_SEC_BITS 0x00000003u
#define OTP_SW_LOCK61_SEC_MSB 1u
#define OTP_SW_LOCK61_SEC_LSB 0u
#define OTP_SW_LOCK61_SEC_ACCESS "RW"
#define OTP_SW_LOCK61_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK61_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK61_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK62_OFFSET 0x000000f8u
#define OTP_SW_LOCK62_BITS 0x0000000fu
#define OTP_SW_LOCK62_RESET 0x00000000u
#define OTP_SW_LOCK62_NSEC_RESET "-"
#define OTP_SW_LOCK62_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK62_NSEC_MSB 3u
#define OTP_SW_LOCK62_NSEC_LSB 2u
#define OTP_SW_LOCK62_NSEC_ACCESS "RW"
#define OTP_SW_LOCK62_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK62_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK62_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK62_SEC_RESET "-"
#define OTP_SW_LOCK62_SEC_BITS 0x00000003u
#define OTP_SW_LOCK62_SEC_MSB 1u
#define OTP_SW_LOCK62_SEC_LSB 0u
#define OTP_SW_LOCK62_SEC_ACCESS "RW"
#define OTP_SW_LOCK62_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK62_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK62_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK63_OFFSET 0x000000fcu
#define OTP_SW_LOCK63_BITS 0x0000000fu
#define OTP_SW_LOCK63_RESET 0x00000000u
#define OTP_SW_LOCK63_NSEC_RESET "-"
#define OTP_SW_LOCK63_NSEC_BITS 0x0000000cu
#define OTP_SW_LOCK63_NSEC_MSB 3u
#define OTP_SW_LOCK63_NSEC_LSB 2u
#define OTP_SW_LOCK63_NSEC_ACCESS "RW"
#define OTP_SW_LOCK63_NSEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK63_NSEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK63_NSEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SW_LOCK63_SEC_RESET "-"
#define OTP_SW_LOCK63_SEC_BITS 0x00000003u
#define OTP_SW_LOCK63_SEC_MSB 1u
#define OTP_SW_LOCK63_SEC_LSB 0u
#define OTP_SW_LOCK63_SEC_ACCESS "RW"
#define OTP_SW_LOCK63_SEC_VALUE_READ_WRITE 0x0u
#define OTP_SW_LOCK63_SEC_VALUE_READ_ONLY 0x1u
#define OTP_SW_LOCK63_SEC_VALUE_INACCESSIBLE 0x3u
#define OTP_SBPI_INSTR_OFFSET 0x00000100u
#define OTP_SBPI_INSTR_BITS 0x7fffffffu
#define OTP_SBPI_INSTR_RESET 0x00000000u
#define OTP_SBPI_INSTR_EXEC_RESET 0x0u
#define OTP_SBPI_INSTR_EXEC_BITS 0x40000000u
#define OTP_SBPI_INSTR_EXEC_MSB 30u
#define OTP_SBPI_INSTR_EXEC_LSB 30u
#define OTP_SBPI_INSTR_EXEC_ACCESS "SC"
#define OTP_SBPI_INSTR_IS_WR_RESET 0x0u
#define OTP_SBPI_INSTR_IS_WR_BITS 0x20000000u
#define OTP_SBPI_INSTR_IS_WR_MSB 29u
#define OTP_SBPI_INSTR_IS_WR_LSB 29u
#define OTP_SBPI_INSTR_IS_WR_ACCESS "RW"
#define OTP_SBPI_INSTR_HAS_PAYLOAD_RESET 0x0u
#define OTP_SBPI_INSTR_HAS_PAYLOAD_BITS 0x10000000u
#define OTP_SBPI_INSTR_HAS_PAYLOAD_MSB 28u
#define OTP_SBPI_INSTR_HAS_PAYLOAD_LSB 28u
#define OTP_SBPI_INSTR_HAS_PAYLOAD_ACCESS "RW"
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_RESET 0x0u
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_BITS 0x0f000000u
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_MSB 27u
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_LSB 24u
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_ACCESS "RW"
#define OTP_SBPI_INSTR_TARGET_RESET 0x00u
#define OTP_SBPI_INSTR_TARGET_BITS 0x00ff0000u
#define OTP_SBPI_INSTR_TARGET_MSB 23u
#define OTP_SBPI_INSTR_TARGET_LSB 16u
#define OTP_SBPI_INSTR_TARGET_ACCESS "RW"
#define OTP_SBPI_INSTR_CMD_RESET 0x00u
#define OTP_SBPI_INSTR_CMD_BITS 0x0000ff00u
#define OTP_SBPI_INSTR_CMD_MSB 15u
#define OTP_SBPI_INSTR_CMD_LSB 8u
#define OTP_SBPI_INSTR_CMD_ACCESS "RW"
#define OTP_SBPI_INSTR_SHORT_WDATA_RESET 0x00u
#define OTP_SBPI_INSTR_SHORT_WDATA_BITS 0x000000ffu
#define OTP_SBPI_INSTR_SHORT_WDATA_MSB 7u
#define OTP_SBPI_INSTR_SHORT_WDATA_LSB 0u
#define OTP_SBPI_INSTR_SHORT_WDATA_ACCESS "RW"
#define OTP_SBPI_WDATA_0_OFFSET 0x00000104u
#define OTP_SBPI_WDATA_0_BITS 0xffffffffu
#define OTP_SBPI_WDATA_0_RESET 0x00000000u
#define OTP_SBPI_WDATA_0_MSB 31u
#define OTP_SBPI_WDATA_0_LSB 0u
#define OTP_SBPI_WDATA_0_ACCESS "RW"
#define OTP_SBPI_WDATA_1_OFFSET 0x00000108u
#define OTP_SBPI_WDATA_1_BITS 0xffffffffu
#define OTP_SBPI_WDATA_1_RESET 0x00000000u
#define OTP_SBPI_WDATA_1_MSB 31u
#define OTP_SBPI_WDATA_1_LSB 0u
#define OTP_SBPI_WDATA_1_ACCESS "RW"
#define OTP_SBPI_WDATA_2_OFFSET 0x0000010cu
#define OTP_SBPI_WDATA_2_BITS 0xffffffffu
#define OTP_SBPI_WDATA_2_RESET 0x00000000u
#define OTP_SBPI_WDATA_2_MSB 31u
#define OTP_SBPI_WDATA_2_LSB 0u
#define OTP_SBPI_WDATA_2_ACCESS "RW"
#define OTP_SBPI_WDATA_3_OFFSET 0x00000110u
#define OTP_SBPI_WDATA_3_BITS 0xffffffffu
#define OTP_SBPI_WDATA_3_RESET 0x00000000u
#define OTP_SBPI_WDATA_3_MSB 31u
#define OTP_SBPI_WDATA_3_LSB 0u
#define OTP_SBPI_WDATA_3_ACCESS "RW"
#define OTP_SBPI_RDATA_0_OFFSET 0x00000114u
#define OTP_SBPI_RDATA_0_BITS 0xffffffffu
#define OTP_SBPI_RDATA_0_RESET 0x00000000u
#define OTP_SBPI_RDATA_0_MSB 31u
#define OTP_SBPI_RDATA_0_LSB 0u
#define OTP_SBPI_RDATA_0_ACCESS "RO"
#define OTP_SBPI_RDATA_1_OFFSET 0x00000118u
#define OTP_SBPI_RDATA_1_BITS 0xffffffffu
#define OTP_SBPI_RDATA_1_RESET 0x00000000u
#define OTP_SBPI_RDATA_1_MSB 31u
#define OTP_SBPI_RDATA_1_LSB 0u
#define OTP_SBPI_RDATA_1_ACCESS "RO"
#define OTP_SBPI_RDATA_2_OFFSET 0x0000011cu
#define OTP_SBPI_RDATA_2_BITS 0xffffffffu
#define OTP_SBPI_RDATA_2_RESET 0x00000000u
#define OTP_SBPI_RDATA_2_MSB 31u
#define OTP_SBPI_RDATA_2_LSB 0u
#define OTP_SBPI_RDATA_2_ACCESS "RO"
#define OTP_SBPI_RDATA_3_OFFSET 0x00000120u
#define OTP_SBPI_RDATA_3_BITS 0xffffffffu
#define OTP_SBPI_RDATA_3_RESET 0x00000000u
#define OTP_SBPI_RDATA_3_MSB 31u
#define OTP_SBPI_RDATA_3_LSB 0u
#define OTP_SBPI_RDATA_3_ACCESS "RO"
#define OTP_SBPI_STATUS_OFFSET 0x00000124u
#define OTP_SBPI_STATUS_BITS 0x00ff1111u
#define OTP_SBPI_STATUS_RESET 0x00000000u
#define OTP_SBPI_STATUS_MISO_RESET "-"
#define OTP_SBPI_STATUS_MISO_BITS 0x00ff0000u
#define OTP_SBPI_STATUS_MISO_MSB 23u
#define OTP_SBPI_STATUS_MISO_LSB 16u
#define OTP_SBPI_STATUS_MISO_ACCESS "RO"
#define OTP_SBPI_STATUS_FLAG_RESET "-"
#define OTP_SBPI_STATUS_FLAG_BITS 0x00001000u
#define OTP_SBPI_STATUS_FLAG_MSB 12u
#define OTP_SBPI_STATUS_FLAG_LSB 12u
#define OTP_SBPI_STATUS_FLAG_ACCESS "RO"
#define OTP_SBPI_STATUS_INSTR_MISS_RESET 0x0u
#define OTP_SBPI_STATUS_INSTR_MISS_BITS 0x00000100u
#define OTP_SBPI_STATUS_INSTR_MISS_MSB 8u
#define OTP_SBPI_STATUS_INSTR_MISS_LSB 8u
#define OTP_SBPI_STATUS_INSTR_MISS_ACCESS "WC"
#define OTP_SBPI_STATUS_INSTR_DONE_RESET 0x0u
#define OTP_SBPI_STATUS_INSTR_DONE_BITS 0x00000010u
#define OTP_SBPI_STATUS_INSTR_DONE_MSB 4u
#define OTP_SBPI_STATUS_INSTR_DONE_LSB 4u
#define OTP_SBPI_STATUS_INSTR_DONE_ACCESS "WC"
#define OTP_SBPI_STATUS_RDATA_VLD_RESET 0x0u
#define OTP_SBPI_STATUS_RDATA_VLD_BITS 0x00000001u
#define OTP_SBPI_STATUS_RDATA_VLD_MSB 0u
#define OTP_SBPI_STATUS_RDATA_VLD_LSB 0u
#define OTP_SBPI_STATUS_RDATA_VLD_ACCESS "WC"
#define OTP_USR_OFFSET 0x00000128u
#define OTP_USR_BITS 0x00000011u
#define OTP_USR_RESET 0x00000001u
#define OTP_USR_PD_RESET 0x0u
#define OTP_USR_PD_BITS 0x00000010u
#define OTP_USR_PD_MSB 4u
#define OTP_USR_PD_LSB 4u
#define OTP_USR_PD_ACCESS "RW"
#define OTP_USR_DCTRL_RESET 0x1u
#define OTP_USR_DCTRL_BITS 0x00000001u
#define OTP_USR_DCTRL_MSB 0u
#define OTP_USR_DCTRL_LSB 0u
#define OTP_USR_DCTRL_ACCESS "RW"
#define OTP_DBG_OFFSET 0x0000012cu
#define OTP_DBG_BITS 0x000010ffu
#define OTP_DBG_RESET 0x00000000u
#define OTP_DBG_CUSTOMER_RMA_FLAG_RESET "-"
#define OTP_DBG_CUSTOMER_RMA_FLAG_BITS 0x00001000u
#define OTP_DBG_CUSTOMER_RMA_FLAG_MSB 12u
#define OTP_DBG_CUSTOMER_RMA_FLAG_LSB 12u
#define OTP_DBG_CUSTOMER_RMA_FLAG_ACCESS "RO"
#define OTP_DBG_PSM_STATE_RESET "-"
#define OTP_DBG_PSM_STATE_BITS 0x000000f0u
#define OTP_DBG_PSM_STATE_MSB 7u
#define OTP_DBG_PSM_STATE_LSB 4u
#define OTP_DBG_PSM_STATE_ACCESS "RO"
#define OTP_DBG_ROSC_UP_RESET "-"
#define OTP_DBG_ROSC_UP_BITS 0x00000008u
#define OTP_DBG_ROSC_UP_MSB 3u
#define OTP_DBG_ROSC_UP_LSB 3u
#define OTP_DBG_ROSC_UP_ACCESS "RO"
#define OTP_DBG_ROSC_UP_SEEN_RESET 0x0u
#define OTP_DBG_ROSC_UP_SEEN_BITS 0x00000004u
#define OTP_DBG_ROSC_UP_SEEN_MSB 2u
#define OTP_DBG_ROSC_UP_SEEN_LSB 2u
#define OTP_DBG_ROSC_UP_SEEN_ACCESS "WC"
#define OTP_DBG_BOOT_DONE_RESET "-"
#define OTP_DBG_BOOT_DONE_BITS 0x00000002u
#define OTP_DBG_BOOT_DONE_MSB 1u
#define OTP_DBG_BOOT_DONE_LSB 1u
#define OTP_DBG_BOOT_DONE_ACCESS "RO"
#define OTP_DBG_PSM_DONE_RESET "-"
#define OTP_DBG_PSM_DONE_BITS 0x00000001u
#define OTP_DBG_PSM_DONE_MSB 0u
#define OTP_DBG_PSM_DONE_LSB 0u
#define OTP_DBG_PSM_DONE_ACCESS "RO"
#define OTP_BIST_OFFSET 0x00000134u
#define OTP_BIST_BITS 0x7fff1fffu
#define OTP_BIST_RESET 0x0fff0000u
#define OTP_BIST_CNT_FAIL_RESET "-"
#define OTP_BIST_CNT_FAIL_BITS 0x40000000u
#define OTP_BIST_CNT_FAIL_MSB 30u
#define OTP_BIST_CNT_FAIL_LSB 30u
#define OTP_BIST_CNT_FAIL_ACCESS "RO"
#define OTP_BIST_CNT_CLR_RESET 0x0u
#define OTP_BIST_CNT_CLR_BITS 0x20000000u
#define OTP_BIST_CNT_CLR_MSB 29u
#define OTP_BIST_CNT_CLR_LSB 29u
#define OTP_BIST_CNT_CLR_ACCESS "SC"
#define OTP_BIST_CNT_ENA_RESET 0x0u
#define OTP_BIST_CNT_ENA_BITS 0x10000000u
#define OTP_BIST_CNT_ENA_MSB 28u
#define OTP_BIST_CNT_ENA_LSB 28u
#define OTP_BIST_CNT_ENA_ACCESS "RW"
#define OTP_BIST_CNT_MAX_RESET 0xfffu
#define OTP_BIST_CNT_MAX_BITS 0x0fff0000u
#define OTP_BIST_CNT_MAX_MSB 27u
#define OTP_BIST_CNT_MAX_LSB 16u
#define OTP_BIST_CNT_MAX_ACCESS "RW"
#define OTP_BIST_CNT_RESET "-"
#define OTP_BIST_CNT_BITS 0x00001fffu
#define OTP_BIST_CNT_MSB 12u
#define OTP_BIST_CNT_LSB 0u
#define OTP_BIST_CNT_ACCESS "RO"
#define OTP_CRT_KEY_W0_OFFSET 0x00000138u
#define OTP_CRT_KEY_W0_BITS 0xffffffffu
#define OTP_CRT_KEY_W0_RESET 0x00000000u
#define OTP_CRT_KEY_W0_MSB 31u
#define OTP_CRT_KEY_W0_LSB 0u
#define OTP_CRT_KEY_W0_ACCESS "WO"
#define OTP_CRT_KEY_W1_OFFSET 0x0000013cu
#define OTP_CRT_KEY_W1_BITS 0xffffffffu
#define OTP_CRT_KEY_W1_RESET 0x00000000u
#define OTP_CRT_KEY_W1_MSB 31u
#define OTP_CRT_KEY_W1_LSB 0u
#define OTP_CRT_KEY_W1_ACCESS "WO"
#define OTP_CRT_KEY_W2_OFFSET 0x00000140u
#define OTP_CRT_KEY_W2_BITS 0xffffffffu
#define OTP_CRT_KEY_W2_RESET 0x00000000u
#define OTP_CRT_KEY_W2_MSB 31u
#define OTP_CRT_KEY_W2_LSB 0u
#define OTP_CRT_KEY_W2_ACCESS "WO"
#define OTP_CRT_KEY_W3_OFFSET 0x00000144u
#define OTP_CRT_KEY_W3_BITS 0xffffffffu
#define OTP_CRT_KEY_W3_RESET 0x00000000u
#define OTP_CRT_KEY_W3_MSB 31u
#define OTP_CRT_KEY_W3_LSB 0u
#define OTP_CRT_KEY_W3_ACCESS "WO"
#define OTP_CRITICAL_OFFSET 0x00000148u
#define OTP_CRITICAL_BITS 0x0003007fu
#define OTP_CRITICAL_RESET 0x00000000u
#define OTP_CRITICAL_RISCV_DISABLE_RESET 0x0u
#define OTP_CRITICAL_RISCV_DISABLE_BITS 0x00020000u
#define OTP_CRITICAL_RISCV_DISABLE_MSB 17u
#define OTP_CRITICAL_RISCV_DISABLE_LSB 17u
#define OTP_CRITICAL_RISCV_DISABLE_ACCESS "RO"
#define OTP_CRITICAL_ARM_DISABLE_RESET 0x0u
#define OTP_CRITICAL_ARM_DISABLE_BITS 0x00010000u
#define OTP_CRITICAL_ARM_DISABLE_MSB 16u
#define OTP_CRITICAL_ARM_DISABLE_LSB 16u
#define OTP_CRITICAL_ARM_DISABLE_ACCESS "RO"
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_RESET 0x0u
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_BITS 0x00000060u
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_MSB 6u
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_LSB 5u
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_ACCESS "RO"
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_RESET 0x0u
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_BITS 0x00000010u
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_MSB 4u
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_LSB 4u
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_ACCESS "RO"
#define OTP_CRITICAL_DEFAULT_ARCHSEL_RESET 0x0u
#define OTP_CRITICAL_DEFAULT_ARCHSEL_BITS 0x00000008u
#define OTP_CRITICAL_DEFAULT_ARCHSEL_MSB 3u
#define OTP_CRITICAL_DEFAULT_ARCHSEL_LSB 3u
#define OTP_CRITICAL_DEFAULT_ARCHSEL_ACCESS "RO"
#define OTP_CRITICAL_DEBUG_DISABLE_RESET 0x0u
#define OTP_CRITICAL_DEBUG_DISABLE_BITS 0x00000004u
#define OTP_CRITICAL_DEBUG_DISABLE_MSB 2u
#define OTP_CRITICAL_DEBUG_DISABLE_LSB 2u
#define OTP_CRITICAL_DEBUG_DISABLE_ACCESS "RO"
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_RESET 0x0u
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_BITS 0x00000002u
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_MSB 1u
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_LSB 1u
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_ACCESS "RO"
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_RESET 0x0u
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_BITS 0x00000001u
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_MSB 0u
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_LSB 0u
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_ACCESS "RO"
#define OTP_KEY_VALID_OFFSET 0x0000014cu
#define OTP_KEY_VALID_BITS 0x000000ffu
#define OTP_KEY_VALID_RESET 0x00000000u
#define OTP_KEY_VALID_MSB 7u
#define OTP_KEY_VALID_LSB 0u
#define OTP_KEY_VALID_ACCESS "RO"
#define OTP_DEBUGEN_OFFSET 0x00000150u
#define OTP_DEBUGEN_BITS 0x0000010fu
#define OTP_DEBUGEN_RESET 0x00000000u
#define OTP_DEBUGEN_MISC_RESET 0x0u
#define OTP_DEBUGEN_MISC_BITS 0x00000100u
#define OTP_DEBUGEN_MISC_MSB 8u
#define OTP_DEBUGEN_MISC_LSB 8u
#define OTP_DEBUGEN_MISC_ACCESS "RW"
#define OTP_DEBUGEN_PROC1_SECURE_RESET 0x0u
#define OTP_DEBUGEN_PROC1_SECURE_BITS 0x00000008u
#define OTP_DEBUGEN_PROC1_SECURE_MSB 3u
#define OTP_DEBUGEN_PROC1_SECURE_LSB 3u
#define OTP_DEBUGEN_PROC1_SECURE_ACCESS "RW"
#define OTP_DEBUGEN_PROC1_RESET 0x0u
#define OTP_DEBUGEN_PROC1_BITS 0x00000004u
#define OTP_DEBUGEN_PROC1_MSB 2u
#define OTP_DEBUGEN_PROC1_LSB 2u
#define OTP_DEBUGEN_PROC1_ACCESS "RW"
#define OTP_DEBUGEN_PROC0_SECURE_RESET 0x0u
#define OTP_DEBUGEN_PROC0_SECURE_BITS 0x00000002u
#define OTP_DEBUGEN_PROC0_SECURE_MSB 1u
#define OTP_DEBUGEN_PROC0_SECURE_LSB 1u
#define OTP_DEBUGEN_PROC0_SECURE_ACCESS "RW"
#define OTP_DEBUGEN_PROC0_RESET 0x0u
#define OTP_DEBUGEN_PROC0_BITS 0x00000001u
#define OTP_DEBUGEN_PROC0_MSB 0u
#define OTP_DEBUGEN_PROC0_LSB 0u
#define OTP_DEBUGEN_PROC0_ACCESS "RW"
#define OTP_DEBUGEN_LOCK_OFFSET 0x00000154u
#define OTP_DEBUGEN_LOCK_BITS 0x0000010fu
#define OTP_DEBUGEN_LOCK_RESET 0x00000000u
#define OTP_DEBUGEN_LOCK_MISC_RESET 0x0u
#define OTP_DEBUGEN_LOCK_MISC_BITS 0x00000100u
#define OTP_DEBUGEN_LOCK_MISC_MSB 8u
#define OTP_DEBUGEN_LOCK_MISC_LSB 8u
#define OTP_DEBUGEN_LOCK_MISC_ACCESS "RW"
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_RESET 0x0u
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_BITS 0x00000008u
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_MSB 3u
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_LSB 3u
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_ACCESS "RW"
#define OTP_DEBUGEN_LOCK_PROC1_RESET 0x0u
#define OTP_DEBUGEN_LOCK_PROC1_BITS 0x00000004u
#define OTP_DEBUGEN_LOCK_PROC1_MSB 2u
#define OTP_DEBUGEN_LOCK_PROC1_LSB 2u
#define OTP_DEBUGEN_LOCK_PROC1_ACCESS "RW"
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_RESET 0x0u
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_BITS 0x00000002u
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_MSB 1u
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_LSB 1u
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_ACCESS "RW"
#define OTP_DEBUGEN_LOCK_PROC0_RESET 0x0u
#define OTP_DEBUGEN_LOCK_PROC0_BITS 0x00000001u
#define OTP_DEBUGEN_LOCK_PROC0_MSB 0u
#define OTP_DEBUGEN_LOCK_PROC0_LSB 0u
#define OTP_DEBUGEN_LOCK_PROC0_ACCESS "RW"
#define OTP_ARCHSEL_OFFSET 0x00000158u
#define OTP_ARCHSEL_BITS 0x00000003u
#define OTP_ARCHSEL_RESET 0x00000000u
#define OTP_ARCHSEL_CORE1_RESET 0x0u
#define OTP_ARCHSEL_CORE1_BITS 0x00000002u
#define OTP_ARCHSEL_CORE1_MSB 1u
#define OTP_ARCHSEL_CORE1_LSB 1u
#define OTP_ARCHSEL_CORE1_ACCESS "RW"
#define OTP_ARCHSEL_CORE1_VALUE_ARM 0x0u
#define OTP_ARCHSEL_CORE1_VALUE_RISCV 0x1u
#define OTP_ARCHSEL_CORE0_RESET 0x0u
#define OTP_ARCHSEL_CORE0_BITS 0x00000001u
#define OTP_ARCHSEL_CORE0_MSB 0u
#define OTP_ARCHSEL_CORE0_LSB 0u
#define OTP_ARCHSEL_CORE0_ACCESS "RW"
#define OTP_ARCHSEL_CORE0_VALUE_ARM 0x0u
#define OTP_ARCHSEL_CORE0_VALUE_RISCV 0x1u
#define OTP_ARCHSEL_STATUS_OFFSET 0x0000015cu
#define OTP_ARCHSEL_STATUS_BITS 0x00000003u
#define OTP_ARCHSEL_STATUS_RESET 0x00000000u
#define OTP_ARCHSEL_STATUS_CORE1_RESET 0x0u
#define OTP_ARCHSEL_STATUS_CORE1_BITS 0x00000002u
#define OTP_ARCHSEL_STATUS_CORE1_MSB 1u
#define OTP_ARCHSEL_STATUS_CORE1_LSB 1u
#define OTP_ARCHSEL_STATUS_CORE1_ACCESS "RO"
#define OTP_ARCHSEL_STATUS_CORE1_VALUE_ARM 0x0u
#define OTP_ARCHSEL_STATUS_CORE1_VALUE_RISCV 0x1u
#define OTP_ARCHSEL_STATUS_CORE0_RESET 0x0u
#define OTP_ARCHSEL_STATUS_CORE0_BITS 0x00000001u
#define OTP_ARCHSEL_STATUS_CORE0_MSB 0u
#define OTP_ARCHSEL_STATUS_CORE0_LSB 0u
#define OTP_ARCHSEL_STATUS_CORE0_ACCESS "RO"
#define OTP_ARCHSEL_STATUS_CORE0_VALUE_ARM 0x0u
#define OTP_ARCHSEL_STATUS_CORE0_VALUE_RISCV 0x1u
#define OTP_BOOTDIS_OFFSET 0x00000160u
#define OTP_BOOTDIS_BITS 0x00000003u
#define OTP_BOOTDIS_RESET 0x00000000u
#define OTP_BOOTDIS_NEXT_RESET 0x0u
#define OTP_BOOTDIS_NEXT_BITS 0x00000002u
#define OTP_BOOTDIS_NEXT_MSB 1u
#define OTP_BOOTDIS_NEXT_LSB 1u
#define OTP_BOOTDIS_NEXT_ACCESS "RW"
#define OTP_BOOTDIS_NOW_RESET 0x0u
#define OTP_BOOTDIS_NOW_BITS 0x00000001u
#define OTP_BOOTDIS_NOW_MSB 0u
#define OTP_BOOTDIS_NOW_LSB 0u
#define OTP_BOOTDIS_NOW_ACCESS "WC"
#define OTP_INTR_OFFSET 0x00000164u
#define OTP_INTR_BITS 0x0000001fu
#define OTP_INTR_RESET 0x00000000u
#define OTP_INTR_APB_RD_NSEC_FAIL_RESET 0x0u
#define OTP_INTR_APB_RD_NSEC_FAIL_BITS 0x00000010u
#define OTP_INTR_APB_RD_NSEC_FAIL_MSB 4u
#define OTP_INTR_APB_RD_NSEC_FAIL_LSB 4u
#define OTP_INTR_APB_RD_NSEC_FAIL_ACCESS "WC"
#define OTP_INTR_APB_RD_SEC_FAIL_RESET 0x0u
#define OTP_INTR_APB_RD_SEC_FAIL_BITS 0x00000008u
#define OTP_INTR_APB_RD_SEC_FAIL_MSB 3u
#define OTP_INTR_APB_RD_SEC_FAIL_LSB 3u
#define OTP_INTR_APB_RD_SEC_FAIL_ACCESS "WC"
#define OTP_INTR_APB_DCTRL_FAIL_RESET 0x0u
#define OTP_INTR_APB_DCTRL_FAIL_BITS 0x00000004u
#define OTP_INTR_APB_DCTRL_FAIL_MSB 2u
#define OTP_INTR_APB_DCTRL_FAIL_LSB 2u
#define OTP_INTR_APB_DCTRL_FAIL_ACCESS "WC"
#define OTP_INTR_SBPI_WR_FAIL_RESET 0x0u
#define OTP_INTR_SBPI_WR_FAIL_BITS 0x00000002u
#define OTP_INTR_SBPI_WR_FAIL_MSB 1u
#define OTP_INTR_SBPI_WR_FAIL_LSB 1u
#define OTP_INTR_SBPI_WR_FAIL_ACCESS "WC"
#define OTP_INTR_SBPI_FLAG_N_RESET 0x0u
#define OTP_INTR_SBPI_FLAG_N_BITS 0x00000001u
#define OTP_INTR_SBPI_FLAG_N_MSB 0u
#define OTP_INTR_SBPI_FLAG_N_LSB 0u
#define OTP_INTR_SBPI_FLAG_N_ACCESS "RO"
#define OTP_INTE_OFFSET 0x00000168u
#define OTP_INTE_BITS 0x0000001fu
#define OTP_INTE_RESET 0x00000000u
#define OTP_INTE_APB_RD_NSEC_FAIL_RESET 0x0u
#define OTP_INTE_APB_RD_NSEC_FAIL_BITS 0x00000010u
#define OTP_INTE_APB_RD_NSEC_FAIL_MSB 4u
#define OTP_INTE_APB_RD_NSEC_FAIL_LSB 4u
#define OTP_INTE_APB_RD_NSEC_FAIL_ACCESS "RW"
#define OTP_INTE_APB_RD_SEC_FAIL_RESET 0x0u
#define OTP_INTE_APB_RD_SEC_FAIL_BITS 0x00000008u
#define OTP_INTE_APB_RD_SEC_FAIL_MSB 3u
#define OTP_INTE_APB_RD_SEC_FAIL_LSB 3u
#define OTP_INTE_APB_RD_SEC_FAIL_ACCESS "RW"
#define OTP_INTE_APB_DCTRL_FAIL_RESET 0x0u
#define OTP_INTE_APB_DCTRL_FAIL_BITS 0x00000004u
#define OTP_INTE_APB_DCTRL_FAIL_MSB 2u
#define OTP_INTE_APB_DCTRL_FAIL_LSB 2u
#define OTP_INTE_APB_DCTRL_FAIL_ACCESS "RW"
#define OTP_INTE_SBPI_WR_FAIL_RESET 0x0u
#define OTP_INTE_SBPI_WR_FAIL_BITS 0x00000002u
#define OTP_INTE_SBPI_WR_FAIL_MSB 1u
#define OTP_INTE_SBPI_WR_FAIL_LSB 1u
#define OTP_INTE_SBPI_WR_FAIL_ACCESS "RW"
#define OTP_INTE_SBPI_FLAG_N_RESET 0x0u
#define OTP_INTE_SBPI_FLAG_N_BITS 0x00000001u
#define OTP_INTE_SBPI_FLAG_N_MSB 0u
#define OTP_INTE_SBPI_FLAG_N_LSB 0u
#define OTP_INTE_SBPI_FLAG_N_ACCESS "RW"
#define OTP_INTF_OFFSET 0x0000016cu
#define OTP_INTF_BITS 0x0000001fu
#define OTP_INTF_RESET 0x00000000u
#define OTP_INTF_APB_RD_NSEC_FAIL_RESET 0x0u
#define OTP_INTF_APB_RD_NSEC_FAIL_BITS 0x00000010u
#define OTP_INTF_APB_RD_NSEC_FAIL_MSB 4u
#define OTP_INTF_APB_RD_NSEC_FAIL_LSB 4u
#define OTP_INTF_APB_RD_NSEC_FAIL_ACCESS "RW"
#define OTP_INTF_APB_RD_SEC_FAIL_RESET 0x0u
#define OTP_INTF_APB_RD_SEC_FAIL_BITS 0x00000008u
#define OTP_INTF_APB_RD_SEC_FAIL_MSB 3u
#define OTP_INTF_APB_RD_SEC_FAIL_LSB 3u
#define OTP_INTF_APB_RD_SEC_FAIL_ACCESS "RW"
#define OTP_INTF_APB_DCTRL_FAIL_RESET 0x0u
#define OTP_INTF_APB_DCTRL_FAIL_BITS 0x00000004u
#define OTP_INTF_APB_DCTRL_FAIL_MSB 2u
#define OTP_INTF_APB_DCTRL_FAIL_LSB 2u
#define OTP_INTF_APB_DCTRL_FAIL_ACCESS "RW"
#define OTP_INTF_SBPI_WR_FAIL_RESET 0x0u
