gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define OTP_INTF_SBPI_WR_FAIL_BITS 0x00000002u
#define OTP_INTF_SBPI_WR_FAIL_MSB 1u
#define OTP_INTF_SBPI_WR_FAIL_LSB 1u
#define OTP_INTF_SBPI_WR_FAIL_ACCESS "RW"
#define OTP_INTF_SBPI_FLAG_N_RESET 0x0u
#define OTP_INTF_SBPI_FLAG_N_BITS 0x00000001u
#define OTP_INTF_SBPI_FLAG_N_MSB 0u
#define OTP_INTF_SBPI_FLAG_N_LSB 0u
#define OTP_INTF_SBPI_FLAG_N_ACCESS "RW"
#define OTP_INTS_OFFSET 0x00000170u
#define OTP_INTS_BITS 0x0000001fu
#define OTP_INTS_RESET 0x00000000u
#define OTP_INTS_APB_RD_NSEC_FAIL_RESET 0x0u
#define OTP_INTS_APB_RD_NSEC_FAIL_BITS 0x00000010u
#define OTP_INTS_APB_RD_NSEC_FAIL_MSB 4u
#define OTP_INTS_APB_RD_NSEC_FAIL_LSB 4u
#define OTP_INTS_APB_RD_NSEC_FAIL_ACCESS "RO"
#define OTP_INTS_APB_RD_SEC_FAIL_RESET 0x0u
#define OTP_INTS_APB_RD_SEC_FAIL_BITS 0x00000008u
#define OTP_INTS_APB_RD_SEC_FAIL_MSB 3u
#define OTP_INTS_APB_RD_SEC_FAIL_LSB 3u
#define OTP_INTS_APB_RD_SEC_FAIL_ACCESS "RO"
#define OTP_INTS_APB_DCTRL_FAIL_RESET 0x0u
#define OTP_INTS_APB_DCTRL_FAIL_BITS 0x00000004u
#define OTP_INTS_APB_DCTRL_FAIL_MSB 2u
#define OTP_INTS_APB_DCTRL_FAIL_LSB 2u
#define OTP_INTS_APB_DCTRL_FAIL_ACCESS "RO"
#define OTP_INTS_SBPI_WR_FAIL_RESET 0x0u
#define OTP_INTS_SBPI_WR_FAIL_BITS 0x00000002u
#define OTP_INTS_SBPI_WR_FAIL_MSB 1u
#define OTP_INTS_SBPI_WR_FAIL_LSB 1u
#define OTP_INTS_SBPI_WR_FAIL_ACCESS "RO"
#define OTP_INTS_SBPI_FLAG_N_RESET 0x0u
#define OTP_INTS_SBPI_FLAG_N_BITS 0x00000001u
#define OTP_INTS_SBPI_FLAG_N_MSB 0u
#define OTP_INTS_SBPI_FLAG_N_LSB 0u
#define OTP_INTS_SBPI_FLAG_N_ACCESS "RO"
typedef struct {
   
    io_rw_32 sw_lock[64];
   
    io_rw_32 sbpi_instr;
   
    io_rw_32 sbpi_wdata[4];
   
    io_ro_32 sbpi_rdata[4];
   
    io_rw_32 sbpi_status;
   
    io_rw_32 usr;
   
    io_rw_32 dbg;
    uint32_t _pad0;
   
    io_rw_32 bist;
   
    io_wo_32 crt_key_w[4];
   
    io_ro_32 critical;
   
    io_ro_32 key_valid;
   
    io_rw_32 debugen;
   
    io_rw_32 debugen_lock;
   
    io_rw_32 archsel;
   
    io_ro_32 archsel_status;
   
    io_rw_32 bootdis;
   
    io_rw_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
} otp_hw_t;
static otp_hw_t * const otp_hw = (otp_hw_t *)OTP_BASE; // ORIGINAL: #define otp_hw ((otp_hw_t *)OTP_BASE)
_Static_assert(sizeof (otp_hw_t) == 0x0174, "");
#define _HARDWARE_STRUCTS_USB_DPRAM_H 
#define _HARDWARE_REGS_USB_H 
#define USB_ADDR_ENDP_OFFSET 0x00000000u
#define USB_ADDR_ENDP_BITS 0x000f007fu
#define USB_ADDR_ENDP_RESET 0x00000000u
#define USB_ADDR_ENDP_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP_ADDRESS_MSB 6u
#define USB_ADDR_ENDP_ADDRESS_LSB 0u
#define USB_ADDR_ENDP_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP1_OFFSET 0x00000004u
#define USB_ADDR_ENDP1_BITS 0x060f007fu
#define USB_ADDR_ENDP1_RESET 0x00000000u
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP1_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP1_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP1_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP1_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP1_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP1_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP1_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP1_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP1_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP1_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP1_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP1_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP1_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP1_ADDRESS_MSB 6u
#define USB_ADDR_ENDP1_ADDRESS_LSB 0u
#define USB_ADDR_ENDP1_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP2_OFFSET 0x00000008u
#define USB_ADDR_ENDP2_BITS 0x060f007fu
#define USB_ADDR_ENDP2_RESET 0x00000000u
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP2_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP2_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP2_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP2_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP2_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP2_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP2_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP2_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP2_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP2_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP2_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP2_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP2_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP2_ADDRESS_MSB 6u
#define USB_ADDR_ENDP2_ADDRESS_LSB 0u
#define USB_ADDR_ENDP2_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP3_OFFSET 0x0000000cu
#define USB_ADDR_ENDP3_BITS 0x060f007fu
#define USB_ADDR_ENDP3_RESET 0x00000000u
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP3_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP3_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP3_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP3_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP3_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP3_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP3_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP3_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP3_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP3_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP3_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP3_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP3_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP3_ADDRESS_MSB 6u
#define USB_ADDR_ENDP3_ADDRESS_LSB 0u
#define USB_ADDR_ENDP3_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP4_OFFSET 0x00000010u
#define USB_ADDR_ENDP4_BITS 0x060f007fu
#define USB_ADDR_ENDP4_RESET 0x00000000u
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP4_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP4_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP4_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP4_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP4_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP4_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP4_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP4_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP4_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP4_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP4_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP4_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP4_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP4_ADDRESS_MSB 6u
#define USB_ADDR_ENDP4_ADDRESS_LSB 0u
#define USB_ADDR_ENDP4_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP5_OFFSET 0x00000014u
#define USB_ADDR_ENDP5_BITS 0x060f007fu
#define USB_ADDR_ENDP5_RESET 0x00000000u
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP5_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP5_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP5_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP5_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP5_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP5_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP5_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP5_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP5_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP5_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP5_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP5_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP5_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP5_ADDRESS_MSB 6u
#define USB_ADDR_ENDP5_ADDRESS_LSB 0u
#define USB_ADDR_ENDP5_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP6_OFFSET 0x00000018u
#define USB_ADDR_ENDP6_BITS 0x060f007fu
#define USB_ADDR_ENDP6_RESET 0x00000000u
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP6_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP6_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP6_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP6_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP6_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP6_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP6_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP6_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP6_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP6_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP6_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP6_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP6_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP6_ADDRESS_MSB 6u
#define USB_ADDR_ENDP6_ADDRESS_LSB 0u
#define USB_ADDR_ENDP6_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP7_OFFSET 0x0000001cu
#define USB_ADDR_ENDP7_BITS 0x060f007fu
#define USB_ADDR_ENDP7_RESET 0x00000000u
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP7_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP7_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP7_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP7_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP7_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP7_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP7_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP7_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP7_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP7_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP7_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP7_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP7_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP7_ADDRESS_MSB 6u
#define USB_ADDR_ENDP7_ADDRESS_LSB 0u
#define USB_ADDR_ENDP7_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP8_OFFSET 0x00000020u
#define USB_ADDR_ENDP8_BITS 0x060f007fu
#define USB_ADDR_ENDP8_RESET 0x00000000u
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP8_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP8_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP8_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP8_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP8_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP8_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP8_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP8_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP8_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP8_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP8_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP8_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP8_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP8_ADDRESS_MSB 6u
#define USB_ADDR_ENDP8_ADDRESS_LSB 0u
#define USB_ADDR_ENDP8_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP9_OFFSET 0x00000024u
#define USB_ADDR_ENDP9_BITS 0x060f007fu
#define USB_ADDR_ENDP9_RESET 0x00000000u
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP9_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP9_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP9_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP9_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP9_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP9_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP9_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP9_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP9_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP9_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP9_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP9_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP9_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP9_ADDRESS_MSB 6u
#define USB_ADDR_ENDP9_ADDRESS_LSB 0u
#define USB_ADDR_ENDP9_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP10_OFFSET 0x00000028u
#define USB_ADDR_ENDP10_BITS 0x060f007fu
#define USB_ADDR_ENDP10_RESET 0x00000000u
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP10_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP10_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP10_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP10_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP10_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP10_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP10_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP10_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP10_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP10_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP10_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP10_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP10_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP10_ADDRESS_MSB 6u
#define USB_ADDR_ENDP10_ADDRESS_LSB 0u
#define USB_ADDR_ENDP10_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP11_OFFSET 0x0000002cu
#define USB_ADDR_ENDP11_BITS 0x060f007fu
#define USB_ADDR_ENDP11_RESET 0x00000000u
#define USB_ADDR_ENDP11_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP11_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP11_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP11_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP11_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP11_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP11_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP11_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP11_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP11_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP11_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP11_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP11_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP11_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP11_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP11_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP11_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP11_ADDRESS_MSB 6u
#define USB_ADDR_ENDP11_ADDRESS_LSB 0u
#define USB_ADDR_ENDP11_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP12_OFFSET 0x00000030u
#define USB_ADDR_ENDP12_BITS 0x060f007fu
#define USB_ADDR_ENDP12_RESET 0x00000000u
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP12_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP12_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP12_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP12_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP12_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP12_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP12_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP12_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP12_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP12_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP12_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP12_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP12_ADDRESS_MSB 6u
#define USB_ADDR_ENDP12_ADDRESS_LSB 0u
#define USB_ADDR_ENDP12_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP13_OFFSET 0x00000034u
#define USB_ADDR_ENDP13_BITS 0x060f007fu
#define USB_ADDR_ENDP13_RESET 0x00000000u
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP13_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP13_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP13_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP13_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP13_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP13_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP13_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP13_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP13_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP13_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP13_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP13_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP13_ADDRESS_MSB 6u
#define USB_ADDR_ENDP13_ADDRESS_LSB 0u
#define USB_ADDR_ENDP13_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP14_OFFSET 0x00000038u
#define USB_ADDR_ENDP14_BITS 0x060f007fu
#define USB_ADDR_ENDP14_RESET 0x00000000u
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP14_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP14_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP14_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP14_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP14_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP14_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP14_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP14_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP14_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP14_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP14_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP14_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP14_ADDRESS_MSB 6u
#define USB_ADDR_ENDP14_ADDRESS_LSB 0u
#define USB_ADDR_ENDP14_ADDRESS_ACCESS "RW"
#define USB_ADDR_ENDP15_OFFSET 0x0000003cu
#define USB_ADDR_ENDP15_BITS 0x060f007fu
#define USB_ADDR_ENDP15_RESET 0x00000000u
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_RESET 0x0u
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_BITS 0x04000000u
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_MSB 26u
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_LSB 26u
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_ACCESS "RW"
#define USB_ADDR_ENDP15_INTEP_DIR_RESET 0x0u
#define USB_ADDR_ENDP15_INTEP_DIR_BITS 0x02000000u
#define USB_ADDR_ENDP15_INTEP_DIR_MSB 25u
#define USB_ADDR_ENDP15_INTEP_DIR_LSB 25u
#define USB_ADDR_ENDP15_INTEP_DIR_ACCESS "RW"
#define USB_ADDR_ENDP15_ENDPOINT_RESET 0x0u
#define USB_ADDR_ENDP15_ENDPOINT_BITS 0x000f0000u
#define USB_ADDR_ENDP15_ENDPOINT_MSB 19u
#define USB_ADDR_ENDP15_ENDPOINT_LSB 16u
#define USB_ADDR_ENDP15_ENDPOINT_ACCESS "RW"
#define USB_ADDR_ENDP15_ADDRESS_RESET 0x00u
#define USB_ADDR_ENDP15_ADDRESS_BITS 0x0000007fu
#define USB_ADDR_ENDP15_ADDRESS_MSB 6u
#define USB_ADDR_ENDP15_ADDRESS_LSB 0u
#define USB_ADDR_ENDP15_ADDRESS_ACCESS "RW"
#define USB_MAIN_CTRL_OFFSET 0x00000040u
#define USB_MAIN_CTRL_BITS 0x80000007u
#define USB_MAIN_CTRL_RESET 0x00000004u
#define USB_MAIN_CTRL_SIM_TIMING_RESET 0x0u
#define USB_MAIN_CTRL_SIM_TIMING_BITS 0x80000000u
#define USB_MAIN_CTRL_SIM_TIMING_MSB 31u
#define USB_MAIN_CTRL_SIM_TIMING_LSB 31u
#define USB_MAIN_CTRL_SIM_TIMING_ACCESS "RW"
#define USB_MAIN_CTRL_PHY_ISO_RESET 0x1u
#define USB_MAIN_CTRL_PHY_ISO_BITS 0x00000004u
#define USB_MAIN_CTRL_PHY_ISO_MSB 2u
#define USB_MAIN_CTRL_PHY_ISO_LSB 2u
#define USB_MAIN_CTRL_PHY_ISO_ACCESS "RW"
#define USB_MAIN_CTRL_HOST_NDEVICE_RESET 0x0u
#define USB_MAIN_CTRL_HOST_NDEVICE_BITS 0x00000002u
#define USB_MAIN_CTRL_HOST_NDEVICE_MSB 1u
#define USB_MAIN_CTRL_HOST_NDEVICE_LSB 1u
#define USB_MAIN_CTRL_HOST_NDEVICE_ACCESS "RW"
#define USB_MAIN_CTRL_CONTROLLER_EN_RESET 0x0u
#define USB_MAIN_CTRL_CONTROLLER_EN_BITS 0x00000001u
#define USB_MAIN_CTRL_CONTROLLER_EN_MSB 0u
#define USB_MAIN_CTRL_CONTROLLER_EN_LSB 0u
#define USB_MAIN_CTRL_CONTROLLER_EN_ACCESS "RW"
#define USB_SOF_WR_OFFSET 0x00000044u
#define USB_SOF_WR_BITS 0x000007ffu
#define USB_SOF_WR_RESET 0x00000000u
#define USB_SOF_WR_COUNT_RESET 0x000u
#define USB_SOF_WR_COUNT_BITS 0x000007ffu
#define USB_SOF_WR_COUNT_MSB 10u
#define USB_SOF_WR_COUNT_LSB 0u
#define USB_SOF_WR_COUNT_ACCESS "WF"
#define USB_SOF_RD_OFFSET 0x00000048u
#define USB_SOF_RD_BITS 0x000007ffu
#define USB_SOF_RD_RESET 0x00000000u
#define USB_SOF_RD_COUNT_RESET 0x000u
#define USB_SOF_RD_COUNT_BITS 0x000007ffu
#define USB_SOF_RD_COUNT_MSB 10u
#define USB_SOF_RD_COUNT_LSB 0u
#define USB_SOF_RD_COUNT_ACCESS "RO"
#define USB_SIE_CTRL_OFFSET 0x0000004cu
#define USB_SIE_CTRL_BITS 0xff0fbf5fu
#define USB_SIE_CTRL_RESET 0x00008000u
#define USB_SIE_CTRL_EP0_INT_STALL_RESET 0x0u
#define USB_SIE_CTRL_EP0_INT_STALL_BITS 0x80000000u
#define USB_SIE_CTRL_EP0_INT_STALL_MSB 31u
#define USB_SIE_CTRL_EP0_INT_STALL_LSB 31u
#define USB_SIE_CTRL_EP0_INT_STALL_ACCESS "RW"
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_RESET 0x0u
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_BITS 0x40000000u
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_MSB 30u
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_LSB 30u
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_ACCESS "RW"
#define USB_SIE_CTRL_EP0_INT_1BUF_RESET 0x0u
#define USB_SIE_CTRL_EP0_INT_1BUF_BITS 0x20000000u
#define USB_SIE_CTRL_EP0_INT_1BUF_MSB 29u
#define USB_SIE_CTRL_EP0_INT_1BUF_LSB 29u
#define USB_SIE_CTRL_EP0_INT_1BUF_ACCESS "RW"
#define USB_SIE_CTRL_EP0_INT_2BUF_RESET 0x0u
#define USB_SIE_CTRL_EP0_INT_2BUF_BITS 0x10000000u
#define USB_SIE_CTRL_EP0_INT_2BUF_MSB 28u
#define USB_SIE_CTRL_EP0_INT_2BUF_LSB 28u
#define USB_SIE_CTRL_EP0_INT_2BUF_ACCESS "RW"
#define USB_SIE_CTRL_EP0_INT_NAK_RESET 0x0u
#define USB_SIE_CTRL_EP0_INT_NAK_BITS 0x08000000u
#define USB_SIE_CTRL_EP0_INT_NAK_MSB 27u
#define USB_SIE_CTRL_EP0_INT_NAK_LSB 27u
#define USB_SIE_CTRL_EP0_INT_NAK_ACCESS "RW"
#define USB_SIE_CTRL_DIRECT_EN_RESET 0x0u
#define USB_SIE_CTRL_DIRECT_EN_BITS 0x04000000u
#define USB_SIE_CTRL_DIRECT_EN_MSB 26u
#define USB_SIE_CTRL_DIRECT_EN_LSB 26u
#define USB_SIE_CTRL_DIRECT_EN_ACCESS "RW"
#define USB_SIE_CTRL_DIRECT_DP_RESET 0x0u
#define USB_SIE_CTRL_DIRECT_DP_BITS 0x02000000u
#define USB_SIE_CTRL_DIRECT_DP_MSB 25u
#define USB_SIE_CTRL_DIRECT_DP_LSB 25u
#define USB_SIE_CTRL_DIRECT_DP_ACCESS "RW"
#define USB_SIE_CTRL_DIRECT_DM_RESET 0x0u
#define USB_SIE_CTRL_DIRECT_DM_BITS 0x01000000u
#define USB_SIE_CTRL_DIRECT_DM_MSB 24u
#define USB_SIE_CTRL_DIRECT_DM_LSB 24u
#define USB_SIE_CTRL_DIRECT_DM_ACCESS "RW"
#define USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_RESET 0x0u
#define USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_BITS 0x00080000u
#define USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_MSB 19u
#define USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_LSB 19u
#define USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_ACCESS "RW"
#define USB_SIE_CTRL_TRANSCEIVER_PD_RESET 0x0u
#define USB_SIE_CTRL_TRANSCEIVER_PD_BITS 0x00040000u
#define USB_SIE_CTRL_TRANSCEIVER_PD_MSB 18u
#define USB_SIE_CTRL_TRANSCEIVER_PD_LSB 18u
#define USB_SIE_CTRL_TRANSCEIVER_PD_ACCESS "RW"
#define USB_SIE_CTRL_RPU_OPT_RESET 0x0u
#define USB_SIE_CTRL_RPU_OPT_BITS 0x00020000u
#define USB_SIE_CTRL_RPU_OPT_MSB 17u
#define USB_SIE_CTRL_RPU_OPT_LSB 17u
#define USB_SIE_CTRL_RPU_OPT_ACCESS "RW"
#define USB_SIE_CTRL_PULLUP_EN_RESET 0x0u
#define USB_SIE_CTRL_PULLUP_EN_BITS 0x00010000u
#define USB_SIE_CTRL_PULLUP_EN_MSB 16u
#define USB_SIE_CTRL_PULLUP_EN_LSB 16u
#define USB_SIE_CTRL_PULLUP_EN_ACCESS "RW"
#define USB_SIE_CTRL_PULLDOWN_EN_RESET 0x1u
#define USB_SIE_CTRL_PULLDOWN_EN_BITS 0x00008000u
#define USB_SIE_CTRL_PULLDOWN_EN_MSB 15u
#define USB_SIE_CTRL_PULLDOWN_EN_LSB 15u
#define USB_SIE_CTRL_PULLDOWN_EN_ACCESS "RW"
#define USB_SIE_CTRL_RESET_BUS_RESET 0x0u
#define USB_SIE_CTRL_RESET_BUS_BITS 0x00002000u
#define USB_SIE_CTRL_RESET_BUS_MSB 13u
#define USB_SIE_CTRL_RESET_BUS_LSB 13u
#define USB_SIE_CTRL_RESET_BUS_ACCESS "SC"
#define USB_SIE_CTRL_RESUME_RESET 0x0u
#define USB_SIE_CTRL_RESUME_BITS 0x00001000u
#define USB_SIE_CTRL_RESUME_MSB 12u
#define USB_SIE_CTRL_RESUME_LSB 12u
#define USB_SIE_CTRL_RESUME_ACCESS "SC"
#define USB_SIE_CTRL_VBUS_EN_RESET 0x0u
#define USB_SIE_CTRL_VBUS_EN_BITS 0x00000800u
#define USB_SIE_CTRL_VBUS_EN_MSB 11u
#define USB_SIE_CTRL_VBUS_EN_LSB 11u
#define USB_SIE_CTRL_VBUS_EN_ACCESS "RW"
#define USB_SIE_CTRL_KEEP_ALIVE_EN_RESET 0x0u
#define USB_SIE_CTRL_KEEP_ALIVE_EN_BITS 0x00000400u
#define USB_SIE_CTRL_KEEP_ALIVE_EN_MSB 10u
#define USB_SIE_CTRL_KEEP_ALIVE_EN_LSB 10u
#define USB_SIE_CTRL_KEEP_ALIVE_EN_ACCESS "RW"
#define USB_SIE_CTRL_SOF_EN_RESET 0x0u
#define USB_SIE_CTRL_SOF_EN_BITS 0x00000200u
#define USB_SIE_CTRL_SOF_EN_MSB 9u
#define USB_SIE_CTRL_SOF_EN_LSB 9u
#define USB_SIE_CTRL_SOF_EN_ACCESS "RW"
#define USB_SIE_CTRL_SOF_SYNC_RESET 0x0u
