gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define USB_SIE_CTRL_SOF_SYNC_BITS 0x00000100u
#define USB_SIE_CTRL_SOF_SYNC_MSB 8u
#define USB_SIE_CTRL_SOF_SYNC_LSB 8u
#define USB_SIE_CTRL_SOF_SYNC_ACCESS "RW"
#define USB_SIE_CTRL_PREAMBLE_EN_RESET 0x0u
#define USB_SIE_CTRL_PREAMBLE_EN_BITS 0x00000040u
#define USB_SIE_CTRL_PREAMBLE_EN_MSB 6u
#define USB_SIE_CTRL_PREAMBLE_EN_LSB 6u
#define USB_SIE_CTRL_PREAMBLE_EN_ACCESS "RW"
#define USB_SIE_CTRL_STOP_TRANS_RESET 0x0u
#define USB_SIE_CTRL_STOP_TRANS_BITS 0x00000010u
#define USB_SIE_CTRL_STOP_TRANS_MSB 4u
#define USB_SIE_CTRL_STOP_TRANS_LSB 4u
#define USB_SIE_CTRL_STOP_TRANS_ACCESS "SC"
#define USB_SIE_CTRL_RECEIVE_DATA_RESET 0x0u
#define USB_SIE_CTRL_RECEIVE_DATA_BITS 0x00000008u
#define USB_SIE_CTRL_RECEIVE_DATA_MSB 3u
#define USB_SIE_CTRL_RECEIVE_DATA_LSB 3u
#define USB_SIE_CTRL_RECEIVE_DATA_ACCESS "RW"
#define USB_SIE_CTRL_SEND_DATA_RESET 0x0u
#define USB_SIE_CTRL_SEND_DATA_BITS 0x00000004u
#define USB_SIE_CTRL_SEND_DATA_MSB 2u
#define USB_SIE_CTRL_SEND_DATA_LSB 2u
#define USB_SIE_CTRL_SEND_DATA_ACCESS "RW"
#define USB_SIE_CTRL_SEND_SETUP_RESET 0x0u
#define USB_SIE_CTRL_SEND_SETUP_BITS 0x00000002u
#define USB_SIE_CTRL_SEND_SETUP_MSB 1u
#define USB_SIE_CTRL_SEND_SETUP_LSB 1u
#define USB_SIE_CTRL_SEND_SETUP_ACCESS "RW"
#define USB_SIE_CTRL_START_TRANS_RESET 0x0u
#define USB_SIE_CTRL_START_TRANS_BITS 0x00000001u
#define USB_SIE_CTRL_START_TRANS_MSB 0u
#define USB_SIE_CTRL_START_TRANS_LSB 0u
#define USB_SIE_CTRL_START_TRANS_ACCESS "SC"
#define USB_SIE_STATUS_OFFSET 0x00000050u
#define USB_SIE_STATUS_BITS 0xff8f1f1du
#define USB_SIE_STATUS_RESET 0x00000000u
#define USB_SIE_STATUS_DATA_SEQ_ERROR_RESET 0x0u
#define USB_SIE_STATUS_DATA_SEQ_ERROR_BITS 0x80000000u
#define USB_SIE_STATUS_DATA_SEQ_ERROR_MSB 31u
#define USB_SIE_STATUS_DATA_SEQ_ERROR_LSB 31u
#define USB_SIE_STATUS_DATA_SEQ_ERROR_ACCESS "WC"
#define USB_SIE_STATUS_ACK_REC_RESET 0x0u
#define USB_SIE_STATUS_ACK_REC_BITS 0x40000000u
#define USB_SIE_STATUS_ACK_REC_MSB 30u
#define USB_SIE_STATUS_ACK_REC_LSB 30u
#define USB_SIE_STATUS_ACK_REC_ACCESS "WC"
#define USB_SIE_STATUS_STALL_REC_RESET 0x0u
#define USB_SIE_STATUS_STALL_REC_BITS 0x20000000u
#define USB_SIE_STATUS_STALL_REC_MSB 29u
#define USB_SIE_STATUS_STALL_REC_LSB 29u
#define USB_SIE_STATUS_STALL_REC_ACCESS "WC"
#define USB_SIE_STATUS_NAK_REC_RESET 0x0u
#define USB_SIE_STATUS_NAK_REC_BITS 0x10000000u
#define USB_SIE_STATUS_NAK_REC_MSB 28u
#define USB_SIE_STATUS_NAK_REC_LSB 28u
#define USB_SIE_STATUS_NAK_REC_ACCESS "WC"
#define USB_SIE_STATUS_RX_TIMEOUT_RESET 0x0u
#define USB_SIE_STATUS_RX_TIMEOUT_BITS 0x08000000u
#define USB_SIE_STATUS_RX_TIMEOUT_MSB 27u
#define USB_SIE_STATUS_RX_TIMEOUT_LSB 27u
#define USB_SIE_STATUS_RX_TIMEOUT_ACCESS "WC"
#define USB_SIE_STATUS_RX_OVERFLOW_RESET 0x0u
#define USB_SIE_STATUS_RX_OVERFLOW_BITS 0x04000000u
#define USB_SIE_STATUS_RX_OVERFLOW_MSB 26u
#define USB_SIE_STATUS_RX_OVERFLOW_LSB 26u
#define USB_SIE_STATUS_RX_OVERFLOW_ACCESS "WC"
#define USB_SIE_STATUS_BIT_STUFF_ERROR_RESET 0x0u
#define USB_SIE_STATUS_BIT_STUFF_ERROR_BITS 0x02000000u
#define USB_SIE_STATUS_BIT_STUFF_ERROR_MSB 25u
#define USB_SIE_STATUS_BIT_STUFF_ERROR_LSB 25u
#define USB_SIE_STATUS_BIT_STUFF_ERROR_ACCESS "WC"
#define USB_SIE_STATUS_CRC_ERROR_RESET 0x0u
#define USB_SIE_STATUS_CRC_ERROR_BITS 0x01000000u
#define USB_SIE_STATUS_CRC_ERROR_MSB 24u
#define USB_SIE_STATUS_CRC_ERROR_LSB 24u
#define USB_SIE_STATUS_CRC_ERROR_ACCESS "WC"
#define USB_SIE_STATUS_ENDPOINT_ERROR_RESET 0x0u
#define USB_SIE_STATUS_ENDPOINT_ERROR_BITS 0x00800000u
#define USB_SIE_STATUS_ENDPOINT_ERROR_MSB 23u
#define USB_SIE_STATUS_ENDPOINT_ERROR_LSB 23u
#define USB_SIE_STATUS_ENDPOINT_ERROR_ACCESS "WC"
#define USB_SIE_STATUS_BUS_RESET_RESET 0x0u
#define USB_SIE_STATUS_BUS_RESET_BITS 0x00080000u
#define USB_SIE_STATUS_BUS_RESET_MSB 19u
#define USB_SIE_STATUS_BUS_RESET_LSB 19u
#define USB_SIE_STATUS_BUS_RESET_ACCESS "WC"
#define USB_SIE_STATUS_TRANS_COMPLETE_RESET 0x0u
#define USB_SIE_STATUS_TRANS_COMPLETE_BITS 0x00040000u
#define USB_SIE_STATUS_TRANS_COMPLETE_MSB 18u
#define USB_SIE_STATUS_TRANS_COMPLETE_LSB 18u
#define USB_SIE_STATUS_TRANS_COMPLETE_ACCESS "WC"
#define USB_SIE_STATUS_SETUP_REC_RESET 0x0u
#define USB_SIE_STATUS_SETUP_REC_BITS 0x00020000u
#define USB_SIE_STATUS_SETUP_REC_MSB 17u
#define USB_SIE_STATUS_SETUP_REC_LSB 17u
#define USB_SIE_STATUS_SETUP_REC_ACCESS "WC"
#define USB_SIE_STATUS_CONNECTED_RESET 0x0u
#define USB_SIE_STATUS_CONNECTED_BITS 0x00010000u
#define USB_SIE_STATUS_CONNECTED_MSB 16u
#define USB_SIE_STATUS_CONNECTED_LSB 16u
#define USB_SIE_STATUS_CONNECTED_ACCESS "RO"
#define USB_SIE_STATUS_RX_SHORT_PACKET_RESET 0x0u
#define USB_SIE_STATUS_RX_SHORT_PACKET_BITS 0x00001000u
#define USB_SIE_STATUS_RX_SHORT_PACKET_MSB 12u
#define USB_SIE_STATUS_RX_SHORT_PACKET_LSB 12u
#define USB_SIE_STATUS_RX_SHORT_PACKET_ACCESS "WC"
#define USB_SIE_STATUS_RESUME_RESET 0x0u
#define USB_SIE_STATUS_RESUME_BITS 0x00000800u
#define USB_SIE_STATUS_RESUME_MSB 11u
#define USB_SIE_STATUS_RESUME_LSB 11u
#define USB_SIE_STATUS_RESUME_ACCESS "WC"
#define USB_SIE_STATUS_VBUS_OVER_CURR_RESET 0x0u
#define USB_SIE_STATUS_VBUS_OVER_CURR_BITS 0x00000400u
#define USB_SIE_STATUS_VBUS_OVER_CURR_MSB 10u
#define USB_SIE_STATUS_VBUS_OVER_CURR_LSB 10u
#define USB_SIE_STATUS_VBUS_OVER_CURR_ACCESS "RO"
#define USB_SIE_STATUS_SPEED_RESET 0x0u
#define USB_SIE_STATUS_SPEED_BITS 0x00000300u
#define USB_SIE_STATUS_SPEED_MSB 9u
#define USB_SIE_STATUS_SPEED_LSB 8u
#define USB_SIE_STATUS_SPEED_ACCESS "RO"
#define USB_SIE_STATUS_SUSPENDED_RESET 0x0u
#define USB_SIE_STATUS_SUSPENDED_BITS 0x00000010u
#define USB_SIE_STATUS_SUSPENDED_MSB 4u
#define USB_SIE_STATUS_SUSPENDED_LSB 4u
#define USB_SIE_STATUS_SUSPENDED_ACCESS "RO"
#define USB_SIE_STATUS_LINE_STATE_RESET 0x0u
#define USB_SIE_STATUS_LINE_STATE_BITS 0x0000000cu
#define USB_SIE_STATUS_LINE_STATE_MSB 3u
#define USB_SIE_STATUS_LINE_STATE_LSB 2u
#define USB_SIE_STATUS_LINE_STATE_ACCESS "RO"
#define USB_SIE_STATUS_VBUS_DETECTED_RESET 0x0u
#define USB_SIE_STATUS_VBUS_DETECTED_BITS 0x00000001u
#define USB_SIE_STATUS_VBUS_DETECTED_MSB 0u
#define USB_SIE_STATUS_VBUS_DETECTED_LSB 0u
#define USB_SIE_STATUS_VBUS_DETECTED_ACCESS "RO"
#define USB_INT_EP_CTRL_OFFSET 0x00000054u
#define USB_INT_EP_CTRL_BITS 0x0000fffeu
#define USB_INT_EP_CTRL_RESET 0x00000000u
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_RESET 0x0000u
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_BITS 0x0000fffeu
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_MSB 15u
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_LSB 1u
#define USB_INT_EP_CTRL_INT_EP_ACTIVE_ACCESS "RW"
#define USB_BUFF_STATUS_OFFSET 0x00000058u
#define USB_BUFF_STATUS_BITS 0xffffffffu
#define USB_BUFF_STATUS_RESET 0x00000000u
#define USB_BUFF_STATUS_EP15_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP15_OUT_BITS 0x80000000u
#define USB_BUFF_STATUS_EP15_OUT_MSB 31u
#define USB_BUFF_STATUS_EP15_OUT_LSB 31u
#define USB_BUFF_STATUS_EP15_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP15_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP15_IN_BITS 0x40000000u
#define USB_BUFF_STATUS_EP15_IN_MSB 30u
#define USB_BUFF_STATUS_EP15_IN_LSB 30u
#define USB_BUFF_STATUS_EP15_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP14_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP14_OUT_BITS 0x20000000u
#define USB_BUFF_STATUS_EP14_OUT_MSB 29u
#define USB_BUFF_STATUS_EP14_OUT_LSB 29u
#define USB_BUFF_STATUS_EP14_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP14_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP14_IN_BITS 0x10000000u
#define USB_BUFF_STATUS_EP14_IN_MSB 28u
#define USB_BUFF_STATUS_EP14_IN_LSB 28u
#define USB_BUFF_STATUS_EP14_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP13_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP13_OUT_BITS 0x08000000u
#define USB_BUFF_STATUS_EP13_OUT_MSB 27u
#define USB_BUFF_STATUS_EP13_OUT_LSB 27u
#define USB_BUFF_STATUS_EP13_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP13_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP13_IN_BITS 0x04000000u
#define USB_BUFF_STATUS_EP13_IN_MSB 26u
#define USB_BUFF_STATUS_EP13_IN_LSB 26u
#define USB_BUFF_STATUS_EP13_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP12_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP12_OUT_BITS 0x02000000u
#define USB_BUFF_STATUS_EP12_OUT_MSB 25u
#define USB_BUFF_STATUS_EP12_OUT_LSB 25u
#define USB_BUFF_STATUS_EP12_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP12_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP12_IN_BITS 0x01000000u
#define USB_BUFF_STATUS_EP12_IN_MSB 24u
#define USB_BUFF_STATUS_EP12_IN_LSB 24u
#define USB_BUFF_STATUS_EP12_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP11_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP11_OUT_BITS 0x00800000u
#define USB_BUFF_STATUS_EP11_OUT_MSB 23u
#define USB_BUFF_STATUS_EP11_OUT_LSB 23u
#define USB_BUFF_STATUS_EP11_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP11_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP11_IN_BITS 0x00400000u
#define USB_BUFF_STATUS_EP11_IN_MSB 22u
#define USB_BUFF_STATUS_EP11_IN_LSB 22u
#define USB_BUFF_STATUS_EP11_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP10_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP10_OUT_BITS 0x00200000u
#define USB_BUFF_STATUS_EP10_OUT_MSB 21u
#define USB_BUFF_STATUS_EP10_OUT_LSB 21u
#define USB_BUFF_STATUS_EP10_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP10_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP10_IN_BITS 0x00100000u
#define USB_BUFF_STATUS_EP10_IN_MSB 20u
#define USB_BUFF_STATUS_EP10_IN_LSB 20u
#define USB_BUFF_STATUS_EP10_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP9_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP9_OUT_BITS 0x00080000u
#define USB_BUFF_STATUS_EP9_OUT_MSB 19u
#define USB_BUFF_STATUS_EP9_OUT_LSB 19u
#define USB_BUFF_STATUS_EP9_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP9_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP9_IN_BITS 0x00040000u
#define USB_BUFF_STATUS_EP9_IN_MSB 18u
#define USB_BUFF_STATUS_EP9_IN_LSB 18u
#define USB_BUFF_STATUS_EP9_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP8_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP8_OUT_BITS 0x00020000u
#define USB_BUFF_STATUS_EP8_OUT_MSB 17u
#define USB_BUFF_STATUS_EP8_OUT_LSB 17u
#define USB_BUFF_STATUS_EP8_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP8_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP8_IN_BITS 0x00010000u
#define USB_BUFF_STATUS_EP8_IN_MSB 16u
#define USB_BUFF_STATUS_EP8_IN_LSB 16u
#define USB_BUFF_STATUS_EP8_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP7_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP7_OUT_BITS 0x00008000u
#define USB_BUFF_STATUS_EP7_OUT_MSB 15u
#define USB_BUFF_STATUS_EP7_OUT_LSB 15u
#define USB_BUFF_STATUS_EP7_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP7_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP7_IN_BITS 0x00004000u
#define USB_BUFF_STATUS_EP7_IN_MSB 14u
#define USB_BUFF_STATUS_EP7_IN_LSB 14u
#define USB_BUFF_STATUS_EP7_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP6_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP6_OUT_BITS 0x00002000u
#define USB_BUFF_STATUS_EP6_OUT_MSB 13u
#define USB_BUFF_STATUS_EP6_OUT_LSB 13u
#define USB_BUFF_STATUS_EP6_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP6_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP6_IN_BITS 0x00001000u
#define USB_BUFF_STATUS_EP6_IN_MSB 12u
#define USB_BUFF_STATUS_EP6_IN_LSB 12u
#define USB_BUFF_STATUS_EP6_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP5_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP5_OUT_BITS 0x00000800u
#define USB_BUFF_STATUS_EP5_OUT_MSB 11u
#define USB_BUFF_STATUS_EP5_OUT_LSB 11u
#define USB_BUFF_STATUS_EP5_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP5_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP5_IN_BITS 0x00000400u
#define USB_BUFF_STATUS_EP5_IN_MSB 10u
#define USB_BUFF_STATUS_EP5_IN_LSB 10u
#define USB_BUFF_STATUS_EP5_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP4_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP4_OUT_BITS 0x00000200u
#define USB_BUFF_STATUS_EP4_OUT_MSB 9u
#define USB_BUFF_STATUS_EP4_OUT_LSB 9u
#define USB_BUFF_STATUS_EP4_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP4_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP4_IN_BITS 0x00000100u
#define USB_BUFF_STATUS_EP4_IN_MSB 8u
#define USB_BUFF_STATUS_EP4_IN_LSB 8u
#define USB_BUFF_STATUS_EP4_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP3_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP3_OUT_BITS 0x00000080u
#define USB_BUFF_STATUS_EP3_OUT_MSB 7u
#define USB_BUFF_STATUS_EP3_OUT_LSB 7u
#define USB_BUFF_STATUS_EP3_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP3_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP3_IN_BITS 0x00000040u
#define USB_BUFF_STATUS_EP3_IN_MSB 6u
#define USB_BUFF_STATUS_EP3_IN_LSB 6u
#define USB_BUFF_STATUS_EP3_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP2_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP2_OUT_BITS 0x00000020u
#define USB_BUFF_STATUS_EP2_OUT_MSB 5u
#define USB_BUFF_STATUS_EP2_OUT_LSB 5u
#define USB_BUFF_STATUS_EP2_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP2_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP2_IN_BITS 0x00000010u
#define USB_BUFF_STATUS_EP2_IN_MSB 4u
#define USB_BUFF_STATUS_EP2_IN_LSB 4u
#define USB_BUFF_STATUS_EP2_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP1_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP1_OUT_BITS 0x00000008u
#define USB_BUFF_STATUS_EP1_OUT_MSB 3u
#define USB_BUFF_STATUS_EP1_OUT_LSB 3u
#define USB_BUFF_STATUS_EP1_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP1_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP1_IN_BITS 0x00000004u
#define USB_BUFF_STATUS_EP1_IN_MSB 2u
#define USB_BUFF_STATUS_EP1_IN_LSB 2u
#define USB_BUFF_STATUS_EP1_IN_ACCESS "WC"
#define USB_BUFF_STATUS_EP0_OUT_RESET 0x0u
#define USB_BUFF_STATUS_EP0_OUT_BITS 0x00000002u
#define USB_BUFF_STATUS_EP0_OUT_MSB 1u
#define USB_BUFF_STATUS_EP0_OUT_LSB 1u
#define USB_BUFF_STATUS_EP0_OUT_ACCESS "WC"
#define USB_BUFF_STATUS_EP0_IN_RESET 0x0u
#define USB_BUFF_STATUS_EP0_IN_BITS 0x00000001u
#define USB_BUFF_STATUS_EP0_IN_MSB 0u
#define USB_BUFF_STATUS_EP0_IN_LSB 0u
#define USB_BUFF_STATUS_EP0_IN_ACCESS "WC"
#define USB_BUFF_CPU_SHOULD_HANDLE_OFFSET 0x0000005cu
#define USB_BUFF_CPU_SHOULD_HANDLE_BITS 0xffffffffu
#define USB_BUFF_CPU_SHOULD_HANDLE_RESET 0x00000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_BITS 0x80000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_MSB 31u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_LSB 31u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_BITS 0x40000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_MSB 30u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_LSB 30u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_BITS 0x20000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_MSB 29u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_LSB 29u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_BITS 0x10000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_MSB 28u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_LSB 28u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_BITS 0x08000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_MSB 27u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_LSB 27u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_BITS 0x04000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_MSB 26u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_LSB 26u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_BITS 0x02000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_MSB 25u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_LSB 25u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_BITS 0x01000000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_MSB 24u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_LSB 24u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_BITS 0x00800000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_MSB 23u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_LSB 23u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_BITS 0x00400000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_MSB 22u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_LSB 22u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_BITS 0x00200000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_MSB 21u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_LSB 21u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_BITS 0x00100000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_MSB 20u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_LSB 20u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_BITS 0x00080000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_MSB 19u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_LSB 19u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_BITS 0x00040000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_MSB 18u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_LSB 18u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_BITS 0x00020000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_MSB 17u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_LSB 17u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_BITS 0x00010000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_MSB 16u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_LSB 16u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_BITS 0x00008000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_MSB 15u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_LSB 15u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_BITS 0x00004000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_MSB 14u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_LSB 14u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_BITS 0x00002000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_MSB 13u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_LSB 13u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_BITS 0x00001000u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_MSB 12u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_LSB 12u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_BITS 0x00000800u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_MSB 11u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_LSB 11u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_BITS 0x00000400u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_MSB 10u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_LSB 10u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_BITS 0x00000200u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_MSB 9u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_LSB 9u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_BITS 0x00000100u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_MSB 8u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_LSB 8u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_BITS 0x00000080u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_MSB 7u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_LSB 7u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_BITS 0x00000040u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_MSB 6u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_LSB 6u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_BITS 0x00000020u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_MSB 5u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_LSB 5u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_BITS 0x00000010u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_MSB 4u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_LSB 4u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_BITS 0x00000008u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_MSB 3u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_LSB 3u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_BITS 0x00000004u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_MSB 2u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_LSB 2u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_BITS 0x00000002u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_MSB 1u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_LSB 1u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_ACCESS "RO"
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_RESET 0x0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_BITS 0x00000001u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_MSB 0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_LSB 0u
#define USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_ACCESS "RO"
#define USB_EP_ABORT_OFFSET 0x00000060u
#define USB_EP_ABORT_BITS 0xffffffffu
#define USB_EP_ABORT_RESET 0x00000000u
#define USB_EP_ABORT_EP15_OUT_RESET 0x0u
#define USB_EP_ABORT_EP15_OUT_BITS 0x80000000u
#define USB_EP_ABORT_EP15_OUT_MSB 31u
#define USB_EP_ABORT_EP15_OUT_LSB 31u
#define USB_EP_ABORT_EP15_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP15_IN_RESET 0x0u
#define USB_EP_ABORT_EP15_IN_BITS 0x40000000u
#define USB_EP_ABORT_EP15_IN_MSB 30u
#define USB_EP_ABORT_EP15_IN_LSB 30u
#define USB_EP_ABORT_EP15_IN_ACCESS "RW"
#define USB_EP_ABORT_EP14_OUT_RESET 0x0u
#define USB_EP_ABORT_EP14_OUT_BITS 0x20000000u
#define USB_EP_ABORT_EP14_OUT_MSB 29u
#define USB_EP_ABORT_EP14_OUT_LSB 29u
#define USB_EP_ABORT_EP14_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP14_IN_RESET 0x0u
#define USB_EP_ABORT_EP14_IN_BITS 0x10000000u
#define USB_EP_ABORT_EP14_IN_MSB 28u
#define USB_EP_ABORT_EP14_IN_LSB 28u
#define USB_EP_ABORT_EP14_IN_ACCESS "RW"
#define USB_EP_ABORT_EP13_OUT_RESET 0x0u
#define USB_EP_ABORT_EP13_OUT_BITS 0x08000000u
#define USB_EP_ABORT_EP13_OUT_MSB 27u
#define USB_EP_ABORT_EP13_OUT_LSB 27u
#define USB_EP_ABORT_EP13_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP13_IN_RESET 0x0u
#define USB_EP_ABORT_EP13_IN_BITS 0x04000000u
#define USB_EP_ABORT_EP13_IN_MSB 26u
#define USB_EP_ABORT_EP13_IN_LSB 26u
#define USB_EP_ABORT_EP13_IN_ACCESS "RW"
#define USB_EP_ABORT_EP12_OUT_RESET 0x0u
#define USB_EP_ABORT_EP12_OUT_BITS 0x02000000u
#define USB_EP_ABORT_EP12_OUT_MSB 25u
#define USB_EP_ABORT_EP12_OUT_LSB 25u
#define USB_EP_ABORT_EP12_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP12_IN_RESET 0x0u
#define USB_EP_ABORT_EP12_IN_BITS 0x01000000u
#define USB_EP_ABORT_EP12_IN_MSB 24u
