gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define USB_EP_ABORT_EP12_IN_LSB 24u
#define USB_EP_ABORT_EP12_IN_ACCESS "RW"
#define USB_EP_ABORT_EP11_OUT_RESET 0x0u
#define USB_EP_ABORT_EP11_OUT_BITS 0x00800000u
#define USB_EP_ABORT_EP11_OUT_MSB 23u
#define USB_EP_ABORT_EP11_OUT_LSB 23u
#define USB_EP_ABORT_EP11_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP11_IN_RESET 0x0u
#define USB_EP_ABORT_EP11_IN_BITS 0x00400000u
#define USB_EP_ABORT_EP11_IN_MSB 22u
#define USB_EP_ABORT_EP11_IN_LSB 22u
#define USB_EP_ABORT_EP11_IN_ACCESS "RW"
#define USB_EP_ABORT_EP10_OUT_RESET 0x0u
#define USB_EP_ABORT_EP10_OUT_BITS 0x00200000u
#define USB_EP_ABORT_EP10_OUT_MSB 21u
#define USB_EP_ABORT_EP10_OUT_LSB 21u
#define USB_EP_ABORT_EP10_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP10_IN_RESET 0x0u
#define USB_EP_ABORT_EP10_IN_BITS 0x00100000u
#define USB_EP_ABORT_EP10_IN_MSB 20u
#define USB_EP_ABORT_EP10_IN_LSB 20u
#define USB_EP_ABORT_EP10_IN_ACCESS "RW"
#define USB_EP_ABORT_EP9_OUT_RESET 0x0u
#define USB_EP_ABORT_EP9_OUT_BITS 0x00080000u
#define USB_EP_ABORT_EP9_OUT_MSB 19u
#define USB_EP_ABORT_EP9_OUT_LSB 19u
#define USB_EP_ABORT_EP9_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP9_IN_RESET 0x0u
#define USB_EP_ABORT_EP9_IN_BITS 0x00040000u
#define USB_EP_ABORT_EP9_IN_MSB 18u
#define USB_EP_ABORT_EP9_IN_LSB 18u
#define USB_EP_ABORT_EP9_IN_ACCESS "RW"
#define USB_EP_ABORT_EP8_OUT_RESET 0x0u
#define USB_EP_ABORT_EP8_OUT_BITS 0x00020000u
#define USB_EP_ABORT_EP8_OUT_MSB 17u
#define USB_EP_ABORT_EP8_OUT_LSB 17u
#define USB_EP_ABORT_EP8_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP8_IN_RESET 0x0u
#define USB_EP_ABORT_EP8_IN_BITS 0x00010000u
#define USB_EP_ABORT_EP8_IN_MSB 16u
#define USB_EP_ABORT_EP8_IN_LSB 16u
#define USB_EP_ABORT_EP8_IN_ACCESS "RW"
#define USB_EP_ABORT_EP7_OUT_RESET 0x0u
#define USB_EP_ABORT_EP7_OUT_BITS 0x00008000u
#define USB_EP_ABORT_EP7_OUT_MSB 15u
#define USB_EP_ABORT_EP7_OUT_LSB 15u
#define USB_EP_ABORT_EP7_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP7_IN_RESET 0x0u
#define USB_EP_ABORT_EP7_IN_BITS 0x00004000u
#define USB_EP_ABORT_EP7_IN_MSB 14u
#define USB_EP_ABORT_EP7_IN_LSB 14u
#define USB_EP_ABORT_EP7_IN_ACCESS "RW"
#define USB_EP_ABORT_EP6_OUT_RESET 0x0u
#define USB_EP_ABORT_EP6_OUT_BITS 0x00002000u
#define USB_EP_ABORT_EP6_OUT_MSB 13u
#define USB_EP_ABORT_EP6_OUT_LSB 13u
#define USB_EP_ABORT_EP6_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP6_IN_RESET 0x0u
#define USB_EP_ABORT_EP6_IN_BITS 0x00001000u
#define USB_EP_ABORT_EP6_IN_MSB 12u
#define USB_EP_ABORT_EP6_IN_LSB 12u
#define USB_EP_ABORT_EP6_IN_ACCESS "RW"
#define USB_EP_ABORT_EP5_OUT_RESET 0x0u
#define USB_EP_ABORT_EP5_OUT_BITS 0x00000800u
#define USB_EP_ABORT_EP5_OUT_MSB 11u
#define USB_EP_ABORT_EP5_OUT_LSB 11u
#define USB_EP_ABORT_EP5_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP5_IN_RESET 0x0u
#define USB_EP_ABORT_EP5_IN_BITS 0x00000400u
#define USB_EP_ABORT_EP5_IN_MSB 10u
#define USB_EP_ABORT_EP5_IN_LSB 10u
#define USB_EP_ABORT_EP5_IN_ACCESS "RW"
#define USB_EP_ABORT_EP4_OUT_RESET 0x0u
#define USB_EP_ABORT_EP4_OUT_BITS 0x00000200u
#define USB_EP_ABORT_EP4_OUT_MSB 9u
#define USB_EP_ABORT_EP4_OUT_LSB 9u
#define USB_EP_ABORT_EP4_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP4_IN_RESET 0x0u
#define USB_EP_ABORT_EP4_IN_BITS 0x00000100u
#define USB_EP_ABORT_EP4_IN_MSB 8u
#define USB_EP_ABORT_EP4_IN_LSB 8u
#define USB_EP_ABORT_EP4_IN_ACCESS "RW"
#define USB_EP_ABORT_EP3_OUT_RESET 0x0u
#define USB_EP_ABORT_EP3_OUT_BITS 0x00000080u
#define USB_EP_ABORT_EP3_OUT_MSB 7u
#define USB_EP_ABORT_EP3_OUT_LSB 7u
#define USB_EP_ABORT_EP3_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP3_IN_RESET 0x0u
#define USB_EP_ABORT_EP3_IN_BITS 0x00000040u
#define USB_EP_ABORT_EP3_IN_MSB 6u
#define USB_EP_ABORT_EP3_IN_LSB 6u
#define USB_EP_ABORT_EP3_IN_ACCESS "RW"
#define USB_EP_ABORT_EP2_OUT_RESET 0x0u
#define USB_EP_ABORT_EP2_OUT_BITS 0x00000020u
#define USB_EP_ABORT_EP2_OUT_MSB 5u
#define USB_EP_ABORT_EP2_OUT_LSB 5u
#define USB_EP_ABORT_EP2_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP2_IN_RESET 0x0u
#define USB_EP_ABORT_EP2_IN_BITS 0x00000010u
#define USB_EP_ABORT_EP2_IN_MSB 4u
#define USB_EP_ABORT_EP2_IN_LSB 4u
#define USB_EP_ABORT_EP2_IN_ACCESS "RW"
#define USB_EP_ABORT_EP1_OUT_RESET 0x0u
#define USB_EP_ABORT_EP1_OUT_BITS 0x00000008u
#define USB_EP_ABORT_EP1_OUT_MSB 3u
#define USB_EP_ABORT_EP1_OUT_LSB 3u
#define USB_EP_ABORT_EP1_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP1_IN_RESET 0x0u
#define USB_EP_ABORT_EP1_IN_BITS 0x00000004u
#define USB_EP_ABORT_EP1_IN_MSB 2u
#define USB_EP_ABORT_EP1_IN_LSB 2u
#define USB_EP_ABORT_EP1_IN_ACCESS "RW"
#define USB_EP_ABORT_EP0_OUT_RESET 0x0u
#define USB_EP_ABORT_EP0_OUT_BITS 0x00000002u
#define USB_EP_ABORT_EP0_OUT_MSB 1u
#define USB_EP_ABORT_EP0_OUT_LSB 1u
#define USB_EP_ABORT_EP0_OUT_ACCESS "RW"
#define USB_EP_ABORT_EP0_IN_RESET 0x0u
#define USB_EP_ABORT_EP0_IN_BITS 0x00000001u
#define USB_EP_ABORT_EP0_IN_MSB 0u
#define USB_EP_ABORT_EP0_IN_LSB 0u
#define USB_EP_ABORT_EP0_IN_ACCESS "RW"
#define USB_EP_ABORT_DONE_OFFSET 0x00000064u
#define USB_EP_ABORT_DONE_BITS 0xffffffffu
#define USB_EP_ABORT_DONE_RESET 0x00000000u
#define USB_EP_ABORT_DONE_EP15_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP15_OUT_BITS 0x80000000u
#define USB_EP_ABORT_DONE_EP15_OUT_MSB 31u
#define USB_EP_ABORT_DONE_EP15_OUT_LSB 31u
#define USB_EP_ABORT_DONE_EP15_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP15_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP15_IN_BITS 0x40000000u
#define USB_EP_ABORT_DONE_EP15_IN_MSB 30u
#define USB_EP_ABORT_DONE_EP15_IN_LSB 30u
#define USB_EP_ABORT_DONE_EP15_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP14_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP14_OUT_BITS 0x20000000u
#define USB_EP_ABORT_DONE_EP14_OUT_MSB 29u
#define USB_EP_ABORT_DONE_EP14_OUT_LSB 29u
#define USB_EP_ABORT_DONE_EP14_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP14_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP14_IN_BITS 0x10000000u
#define USB_EP_ABORT_DONE_EP14_IN_MSB 28u
#define USB_EP_ABORT_DONE_EP14_IN_LSB 28u
#define USB_EP_ABORT_DONE_EP14_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP13_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP13_OUT_BITS 0x08000000u
#define USB_EP_ABORT_DONE_EP13_OUT_MSB 27u
#define USB_EP_ABORT_DONE_EP13_OUT_LSB 27u
#define USB_EP_ABORT_DONE_EP13_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP13_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP13_IN_BITS 0x04000000u
#define USB_EP_ABORT_DONE_EP13_IN_MSB 26u
#define USB_EP_ABORT_DONE_EP13_IN_LSB 26u
#define USB_EP_ABORT_DONE_EP13_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP12_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP12_OUT_BITS 0x02000000u
#define USB_EP_ABORT_DONE_EP12_OUT_MSB 25u
#define USB_EP_ABORT_DONE_EP12_OUT_LSB 25u
#define USB_EP_ABORT_DONE_EP12_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP12_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP12_IN_BITS 0x01000000u
#define USB_EP_ABORT_DONE_EP12_IN_MSB 24u
#define USB_EP_ABORT_DONE_EP12_IN_LSB 24u
#define USB_EP_ABORT_DONE_EP12_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP11_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP11_OUT_BITS 0x00800000u
#define USB_EP_ABORT_DONE_EP11_OUT_MSB 23u
#define USB_EP_ABORT_DONE_EP11_OUT_LSB 23u
#define USB_EP_ABORT_DONE_EP11_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP11_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP11_IN_BITS 0x00400000u
#define USB_EP_ABORT_DONE_EP11_IN_MSB 22u
#define USB_EP_ABORT_DONE_EP11_IN_LSB 22u
#define USB_EP_ABORT_DONE_EP11_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP10_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP10_OUT_BITS 0x00200000u
#define USB_EP_ABORT_DONE_EP10_OUT_MSB 21u
#define USB_EP_ABORT_DONE_EP10_OUT_LSB 21u
#define USB_EP_ABORT_DONE_EP10_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP10_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP10_IN_BITS 0x00100000u
#define USB_EP_ABORT_DONE_EP10_IN_MSB 20u
#define USB_EP_ABORT_DONE_EP10_IN_LSB 20u
#define USB_EP_ABORT_DONE_EP10_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP9_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP9_OUT_BITS 0x00080000u
#define USB_EP_ABORT_DONE_EP9_OUT_MSB 19u
#define USB_EP_ABORT_DONE_EP9_OUT_LSB 19u
#define USB_EP_ABORT_DONE_EP9_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP9_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP9_IN_BITS 0x00040000u
#define USB_EP_ABORT_DONE_EP9_IN_MSB 18u
#define USB_EP_ABORT_DONE_EP9_IN_LSB 18u
#define USB_EP_ABORT_DONE_EP9_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP8_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP8_OUT_BITS 0x00020000u
#define USB_EP_ABORT_DONE_EP8_OUT_MSB 17u
#define USB_EP_ABORT_DONE_EP8_OUT_LSB 17u
#define USB_EP_ABORT_DONE_EP8_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP8_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP8_IN_BITS 0x00010000u
#define USB_EP_ABORT_DONE_EP8_IN_MSB 16u
#define USB_EP_ABORT_DONE_EP8_IN_LSB 16u
#define USB_EP_ABORT_DONE_EP8_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP7_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP7_OUT_BITS 0x00008000u
#define USB_EP_ABORT_DONE_EP7_OUT_MSB 15u
#define USB_EP_ABORT_DONE_EP7_OUT_LSB 15u
#define USB_EP_ABORT_DONE_EP7_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP7_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP7_IN_BITS 0x00004000u
#define USB_EP_ABORT_DONE_EP7_IN_MSB 14u
#define USB_EP_ABORT_DONE_EP7_IN_LSB 14u
#define USB_EP_ABORT_DONE_EP7_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP6_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP6_OUT_BITS 0x00002000u
#define USB_EP_ABORT_DONE_EP6_OUT_MSB 13u
#define USB_EP_ABORT_DONE_EP6_OUT_LSB 13u
#define USB_EP_ABORT_DONE_EP6_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP6_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP6_IN_BITS 0x00001000u
#define USB_EP_ABORT_DONE_EP6_IN_MSB 12u
#define USB_EP_ABORT_DONE_EP6_IN_LSB 12u
#define USB_EP_ABORT_DONE_EP6_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP5_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP5_OUT_BITS 0x00000800u
#define USB_EP_ABORT_DONE_EP5_OUT_MSB 11u
#define USB_EP_ABORT_DONE_EP5_OUT_LSB 11u
#define USB_EP_ABORT_DONE_EP5_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP5_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP5_IN_BITS 0x00000400u
#define USB_EP_ABORT_DONE_EP5_IN_MSB 10u
#define USB_EP_ABORT_DONE_EP5_IN_LSB 10u
#define USB_EP_ABORT_DONE_EP5_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP4_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP4_OUT_BITS 0x00000200u
#define USB_EP_ABORT_DONE_EP4_OUT_MSB 9u
#define USB_EP_ABORT_DONE_EP4_OUT_LSB 9u
#define USB_EP_ABORT_DONE_EP4_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP4_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP4_IN_BITS 0x00000100u
#define USB_EP_ABORT_DONE_EP4_IN_MSB 8u
#define USB_EP_ABORT_DONE_EP4_IN_LSB 8u
#define USB_EP_ABORT_DONE_EP4_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP3_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP3_OUT_BITS 0x00000080u
#define USB_EP_ABORT_DONE_EP3_OUT_MSB 7u
#define USB_EP_ABORT_DONE_EP3_OUT_LSB 7u
#define USB_EP_ABORT_DONE_EP3_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP3_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP3_IN_BITS 0x00000040u
#define USB_EP_ABORT_DONE_EP3_IN_MSB 6u
#define USB_EP_ABORT_DONE_EP3_IN_LSB 6u
#define USB_EP_ABORT_DONE_EP3_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP2_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP2_OUT_BITS 0x00000020u
#define USB_EP_ABORT_DONE_EP2_OUT_MSB 5u
#define USB_EP_ABORT_DONE_EP2_OUT_LSB 5u
#define USB_EP_ABORT_DONE_EP2_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP2_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP2_IN_BITS 0x00000010u
#define USB_EP_ABORT_DONE_EP2_IN_MSB 4u
#define USB_EP_ABORT_DONE_EP2_IN_LSB 4u
#define USB_EP_ABORT_DONE_EP2_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP1_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP1_OUT_BITS 0x00000008u
#define USB_EP_ABORT_DONE_EP1_OUT_MSB 3u
#define USB_EP_ABORT_DONE_EP1_OUT_LSB 3u
#define USB_EP_ABORT_DONE_EP1_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP1_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP1_IN_BITS 0x00000004u
#define USB_EP_ABORT_DONE_EP1_IN_MSB 2u
#define USB_EP_ABORT_DONE_EP1_IN_LSB 2u
#define USB_EP_ABORT_DONE_EP1_IN_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP0_OUT_RESET 0x0u
#define USB_EP_ABORT_DONE_EP0_OUT_BITS 0x00000002u
#define USB_EP_ABORT_DONE_EP0_OUT_MSB 1u
#define USB_EP_ABORT_DONE_EP0_OUT_LSB 1u
#define USB_EP_ABORT_DONE_EP0_OUT_ACCESS "WC"
#define USB_EP_ABORT_DONE_EP0_IN_RESET 0x0u
#define USB_EP_ABORT_DONE_EP0_IN_BITS 0x00000001u
#define USB_EP_ABORT_DONE_EP0_IN_MSB 0u
#define USB_EP_ABORT_DONE_EP0_IN_LSB 0u
#define USB_EP_ABORT_DONE_EP0_IN_ACCESS "WC"
#define USB_EP_STALL_ARM_OFFSET 0x00000068u
#define USB_EP_STALL_ARM_BITS 0x00000003u
#define USB_EP_STALL_ARM_RESET 0x00000000u
#define USB_EP_STALL_ARM_EP0_OUT_RESET 0x0u
#define USB_EP_STALL_ARM_EP0_OUT_BITS 0x00000002u
#define USB_EP_STALL_ARM_EP0_OUT_MSB 1u
#define USB_EP_STALL_ARM_EP0_OUT_LSB 1u
#define USB_EP_STALL_ARM_EP0_OUT_ACCESS "RW"
#define USB_EP_STALL_ARM_EP0_IN_RESET 0x0u
#define USB_EP_STALL_ARM_EP0_IN_BITS 0x00000001u
#define USB_EP_STALL_ARM_EP0_IN_MSB 0u
#define USB_EP_STALL_ARM_EP0_IN_LSB 0u
#define USB_EP_STALL_ARM_EP0_IN_ACCESS "RW"
#define USB_NAK_POLL_OFFSET 0x0000006cu
#define USB_NAK_POLL_BITS 0xffffffffu
#define USB_NAK_POLL_RESET 0x00100010u
#define USB_NAK_POLL_RETRY_COUNT_HI_RESET 0x0u
#define USB_NAK_POLL_RETRY_COUNT_HI_BITS 0xf0000000u
#define USB_NAK_POLL_RETRY_COUNT_HI_MSB 31u
#define USB_NAK_POLL_RETRY_COUNT_HI_LSB 28u
#define USB_NAK_POLL_RETRY_COUNT_HI_ACCESS "RO"
#define USB_NAK_POLL_EPX_STOPPED_ON_NAK_RESET 0x0u
#define USB_NAK_POLL_EPX_STOPPED_ON_NAK_BITS 0x08000000u
#define USB_NAK_POLL_EPX_STOPPED_ON_NAK_MSB 27u
#define USB_NAK_POLL_EPX_STOPPED_ON_NAK_LSB 27u
#define USB_NAK_POLL_EPX_STOPPED_ON_NAK_ACCESS "WC"
#define USB_NAK_POLL_STOP_EPX_ON_NAK_RESET 0x0u
#define USB_NAK_POLL_STOP_EPX_ON_NAK_BITS 0x04000000u
#define USB_NAK_POLL_STOP_EPX_ON_NAK_MSB 26u
#define USB_NAK_POLL_STOP_EPX_ON_NAK_LSB 26u
#define USB_NAK_POLL_STOP_EPX_ON_NAK_ACCESS "RW"
#define USB_NAK_POLL_DELAY_FS_RESET 0x010u
#define USB_NAK_POLL_DELAY_FS_BITS 0x03ff0000u
#define USB_NAK_POLL_DELAY_FS_MSB 25u
#define USB_NAK_POLL_DELAY_FS_LSB 16u
#define USB_NAK_POLL_DELAY_FS_ACCESS "RW"
#define USB_NAK_POLL_RETRY_COUNT_LO_RESET 0x00u
#define USB_NAK_POLL_RETRY_COUNT_LO_BITS 0x0000fc00u
#define USB_NAK_POLL_RETRY_COUNT_LO_MSB 15u
#define USB_NAK_POLL_RETRY_COUNT_LO_LSB 10u
#define USB_NAK_POLL_RETRY_COUNT_LO_ACCESS "RO"
#define USB_NAK_POLL_DELAY_LS_RESET 0x010u
#define USB_NAK_POLL_DELAY_LS_BITS 0x000003ffu
#define USB_NAK_POLL_DELAY_LS_MSB 9u
#define USB_NAK_POLL_DELAY_LS_LSB 0u
#define USB_NAK_POLL_DELAY_LS_ACCESS "RW"
#define USB_EP_STATUS_STALL_NAK_OFFSET 0x00000070u
#define USB_EP_STATUS_STALL_NAK_BITS 0xffffffffu
#define USB_EP_STATUS_STALL_NAK_RESET 0x00000000u
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_BITS 0x80000000u
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_MSB 31u
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_LSB 31u
#define USB_EP_STATUS_STALL_NAK_EP15_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP15_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP15_IN_BITS 0x40000000u
#define USB_EP_STATUS_STALL_NAK_EP15_IN_MSB 30u
#define USB_EP_STATUS_STALL_NAK_EP15_IN_LSB 30u
#define USB_EP_STATUS_STALL_NAK_EP15_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_BITS 0x20000000u
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_MSB 29u
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_LSB 29u
#define USB_EP_STATUS_STALL_NAK_EP14_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP14_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP14_IN_BITS 0x10000000u
#define USB_EP_STATUS_STALL_NAK_EP14_IN_MSB 28u
#define USB_EP_STATUS_STALL_NAK_EP14_IN_LSB 28u
#define USB_EP_STATUS_STALL_NAK_EP14_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_BITS 0x08000000u
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_MSB 27u
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_LSB 27u
#define USB_EP_STATUS_STALL_NAK_EP13_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP13_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP13_IN_BITS 0x04000000u
#define USB_EP_STATUS_STALL_NAK_EP13_IN_MSB 26u
#define USB_EP_STATUS_STALL_NAK_EP13_IN_LSB 26u
#define USB_EP_STATUS_STALL_NAK_EP13_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_BITS 0x02000000u
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_MSB 25u
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_LSB 25u
#define USB_EP_STATUS_STALL_NAK_EP12_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP12_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP12_IN_BITS 0x01000000u
#define USB_EP_STATUS_STALL_NAK_EP12_IN_MSB 24u
#define USB_EP_STATUS_STALL_NAK_EP12_IN_LSB 24u
#define USB_EP_STATUS_STALL_NAK_EP12_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_BITS 0x00800000u
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_MSB 23u
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_LSB 23u
#define USB_EP_STATUS_STALL_NAK_EP11_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP11_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP11_IN_BITS 0x00400000u
#define USB_EP_STATUS_STALL_NAK_EP11_IN_MSB 22u
#define USB_EP_STATUS_STALL_NAK_EP11_IN_LSB 22u
#define USB_EP_STATUS_STALL_NAK_EP11_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_BITS 0x00200000u
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_MSB 21u
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_LSB 21u
#define USB_EP_STATUS_STALL_NAK_EP10_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP10_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP10_IN_BITS 0x00100000u
#define USB_EP_STATUS_STALL_NAK_EP10_IN_MSB 20u
#define USB_EP_STATUS_STALL_NAK_EP10_IN_LSB 20u
#define USB_EP_STATUS_STALL_NAK_EP10_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP9_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP9_OUT_BITS 0x00080000u
#define USB_EP_STATUS_STALL_NAK_EP9_OUT_MSB 19u
#define USB_EP_STATUS_STALL_NAK_EP9_OUT_LSB 19u
#define USB_EP_STATUS_STALL_NAK_EP9_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP9_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP9_IN_BITS 0x00040000u
#define USB_EP_STATUS_STALL_NAK_EP9_IN_MSB 18u
#define USB_EP_STATUS_STALL_NAK_EP9_IN_LSB 18u
#define USB_EP_STATUS_STALL_NAK_EP9_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP8_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP8_OUT_BITS 0x00020000u
#define USB_EP_STATUS_STALL_NAK_EP8_OUT_MSB 17u
#define USB_EP_STATUS_STALL_NAK_EP8_OUT_LSB 17u
#define USB_EP_STATUS_STALL_NAK_EP8_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP8_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP8_IN_BITS 0x00010000u
#define USB_EP_STATUS_STALL_NAK_EP8_IN_MSB 16u
#define USB_EP_STATUS_STALL_NAK_EP8_IN_LSB 16u
#define USB_EP_STATUS_STALL_NAK_EP8_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_BITS 0x00008000u
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_MSB 15u
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_LSB 15u
#define USB_EP_STATUS_STALL_NAK_EP7_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP7_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP7_IN_BITS 0x00004000u
#define USB_EP_STATUS_STALL_NAK_EP7_IN_MSB 14u
#define USB_EP_STATUS_STALL_NAK_EP7_IN_LSB 14u
#define USB_EP_STATUS_STALL_NAK_EP7_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_BITS 0x00002000u
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_MSB 13u
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_LSB 13u
#define USB_EP_STATUS_STALL_NAK_EP6_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP6_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP6_IN_BITS 0x00001000u
#define USB_EP_STATUS_STALL_NAK_EP6_IN_MSB 12u
#define USB_EP_STATUS_STALL_NAK_EP6_IN_LSB 12u
#define USB_EP_STATUS_STALL_NAK_EP6_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_BITS 0x00000800u
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_MSB 11u
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_LSB 11u
#define USB_EP_STATUS_STALL_NAK_EP5_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP5_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP5_IN_BITS 0x00000400u
#define USB_EP_STATUS_STALL_NAK_EP5_IN_MSB 10u
#define USB_EP_STATUS_STALL_NAK_EP5_IN_LSB 10u
#define USB_EP_STATUS_STALL_NAK_EP5_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_BITS 0x00000200u
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_MSB 9u
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_LSB 9u
#define USB_EP_STATUS_STALL_NAK_EP4_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP4_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP4_IN_BITS 0x00000100u
#define USB_EP_STATUS_STALL_NAK_EP4_IN_MSB 8u
#define USB_EP_STATUS_STALL_NAK_EP4_IN_LSB 8u
#define USB_EP_STATUS_STALL_NAK_EP4_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_BITS 0x00000080u
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_MSB 7u
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_LSB 7u
#define USB_EP_STATUS_STALL_NAK_EP3_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP3_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP3_IN_BITS 0x00000040u
#define USB_EP_STATUS_STALL_NAK_EP3_IN_MSB 6u
#define USB_EP_STATUS_STALL_NAK_EP3_IN_LSB 6u
#define USB_EP_STATUS_STALL_NAK_EP3_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_BITS 0x00000020u
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_MSB 5u
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_LSB 5u
#define USB_EP_STATUS_STALL_NAK_EP2_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP2_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP2_IN_BITS 0x00000010u
#define USB_EP_STATUS_STALL_NAK_EP2_IN_MSB 4u
#define USB_EP_STATUS_STALL_NAK_EP2_IN_LSB 4u
#define USB_EP_STATUS_STALL_NAK_EP2_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_BITS 0x00000008u
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_MSB 3u
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_LSB 3u
#define USB_EP_STATUS_STALL_NAK_EP1_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP1_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP1_IN_BITS 0x00000004u
#define USB_EP_STATUS_STALL_NAK_EP1_IN_MSB 2u
#define USB_EP_STATUS_STALL_NAK_EP1_IN_LSB 2u
#define USB_EP_STATUS_STALL_NAK_EP1_IN_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_BITS 0x00000002u
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_MSB 1u
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_LSB 1u
#define USB_EP_STATUS_STALL_NAK_EP0_OUT_ACCESS "WC"
#define USB_EP_STATUS_STALL_NAK_EP0_IN_RESET 0x0u
#define USB_EP_STATUS_STALL_NAK_EP0_IN_BITS 0x00000001u
#define USB_EP_STATUS_STALL_NAK_EP0_IN_MSB 0u
#define USB_EP_STATUS_STALL_NAK_EP0_IN_LSB 0u
#define USB_EP_STATUS_STALL_NAK_EP0_IN_ACCESS "WC"
#define USB_USB_MUXING_OFFSET 0x00000074u
#define USB_USB_MUXING_BITS 0x8000001fu
#define USB_USB_MUXING_RESET 0x00000001u
#define USB_USB_MUXING_SWAP_DPDM_RESET 0x0u
#define USB_USB_MUXING_SWAP_DPDM_BITS 0x80000000u
#define USB_USB_MUXING_SWAP_DPDM_MSB 31u
#define USB_USB_MUXING_SWAP_DPDM_LSB 31u
#define USB_USB_MUXING_SWAP_DPDM_ACCESS "RW"
#define USB_USB_MUXING_USBPHY_AS_GPIO_RESET 0x0u
#define USB_USB_MUXING_USBPHY_AS_GPIO_BITS 0x00000010u
#define USB_USB_MUXING_USBPHY_AS_GPIO_MSB 4u
#define USB_USB_MUXING_USBPHY_AS_GPIO_LSB 4u
#define USB_USB_MUXING_USBPHY_AS_GPIO_ACCESS "RW"
#define USB_USB_MUXING_SOFTCON_RESET 0x0u
#define USB_USB_MUXING_SOFTCON_BITS 0x00000008u
#define USB_USB_MUXING_SOFTCON_MSB 3u
#define USB_USB_MUXING_SOFTCON_LSB 3u
#define USB_USB_MUXING_SOFTCON_ACCESS "RW"
#define USB_USB_MUXING_TO_DIGITAL_PAD_RESET 0x0u
#define USB_USB_MUXING_TO_DIGITAL_PAD_BITS 0x00000004u
#define USB_USB_MUXING_TO_DIGITAL_PAD_MSB 2u
#define USB_USB_MUXING_TO_DIGITAL_PAD_LSB 2u
#define USB_USB_MUXING_TO_DIGITAL_PAD_ACCESS "RW"
#define USB_USB_MUXING_TO_EXTPHY_RESET 0x0u
#define USB_USB_MUXING_TO_EXTPHY_BITS 0x00000002u
#define USB_USB_MUXING_TO_EXTPHY_MSB 1u
#define USB_USB_MUXING_TO_EXTPHY_LSB 1u
#define USB_USB_MUXING_TO_EXTPHY_ACCESS "RW"
#define USB_USB_MUXING_TO_PHY_RESET 0x1u
#define USB_USB_MUXING_TO_PHY_BITS 0x00000001u
#define USB_USB_MUXING_TO_PHY_MSB 0u
#define USB_USB_MUXING_TO_PHY_LSB 0u
#define USB_USB_MUXING_TO_PHY_ACCESS "RW"
