gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define USB_USB_PWR_OFFSET 0x00000078u
#define USB_USB_PWR_BITS 0x0000003fu
#define USB_USB_PWR_RESET 0x00000000u
#define USB_USB_PWR_OVERCURR_DETECT_EN_RESET 0x0u
#define USB_USB_PWR_OVERCURR_DETECT_EN_BITS 0x00000020u
#define USB_USB_PWR_OVERCURR_DETECT_EN_MSB 5u
#define USB_USB_PWR_OVERCURR_DETECT_EN_LSB 5u
#define USB_USB_PWR_OVERCURR_DETECT_EN_ACCESS "RW"
#define USB_USB_PWR_OVERCURR_DETECT_RESET 0x0u
#define USB_USB_PWR_OVERCURR_DETECT_BITS 0x00000010u
#define USB_USB_PWR_OVERCURR_DETECT_MSB 4u
#define USB_USB_PWR_OVERCURR_DETECT_LSB 4u
#define USB_USB_PWR_OVERCURR_DETECT_ACCESS "RW"
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_RESET 0x0u
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_BITS 0x00000008u
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_MSB 3u
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_LSB 3u
#define USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_ACCESS "RW"
#define USB_USB_PWR_VBUS_DETECT_RESET 0x0u
#define USB_USB_PWR_VBUS_DETECT_BITS 0x00000004u
#define USB_USB_PWR_VBUS_DETECT_MSB 2u
#define USB_USB_PWR_VBUS_DETECT_LSB 2u
#define USB_USB_PWR_VBUS_DETECT_ACCESS "RW"
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_RESET 0x0u
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_BITS 0x00000002u
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_MSB 1u
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_LSB 1u
#define USB_USB_PWR_VBUS_EN_OVERRIDE_EN_ACCESS "RW"
#define USB_USB_PWR_VBUS_EN_RESET 0x0u
#define USB_USB_PWR_VBUS_EN_BITS 0x00000001u
#define USB_USB_PWR_VBUS_EN_MSB 0u
#define USB_USB_PWR_VBUS_EN_LSB 0u
#define USB_USB_PWR_VBUS_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OFFSET 0x0000007cu
#define USB_USBPHY_DIRECT_BITS 0x03ffff77u
#define USB_USBPHY_DIRECT_RESET 0x00000000u
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_BITS 0x02000000u
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_MSB 25u
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_LSB 25u
#define USB_USBPHY_DIRECT_RX_DM_OVERRIDE_ACCESS "RW"
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_BITS 0x01000000u
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_MSB 24u
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_LSB 24u
#define USB_USBPHY_DIRECT_RX_DP_OVERRIDE_ACCESS "RW"
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_BITS 0x00800000u
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_MSB 23u
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_LSB 23u
#define USB_USBPHY_DIRECT_RX_DD_OVERRIDE_ACCESS "RW"
#define USB_USBPHY_DIRECT_DM_OVV_RESET 0x0u
#define USB_USBPHY_DIRECT_DM_OVV_BITS 0x00400000u
#define USB_USBPHY_DIRECT_DM_OVV_MSB 22u
#define USB_USBPHY_DIRECT_DM_OVV_LSB 22u
#define USB_USBPHY_DIRECT_DM_OVV_ACCESS "RO"
#define USB_USBPHY_DIRECT_DP_OVV_RESET 0x0u
#define USB_USBPHY_DIRECT_DP_OVV_BITS 0x00200000u
#define USB_USBPHY_DIRECT_DP_OVV_MSB 21u
#define USB_USBPHY_DIRECT_DP_OVV_LSB 21u
#define USB_USBPHY_DIRECT_DP_OVV_ACCESS "RO"
#define USB_USBPHY_DIRECT_DM_OVCN_RESET 0x0u
#define USB_USBPHY_DIRECT_DM_OVCN_BITS 0x00100000u
#define USB_USBPHY_DIRECT_DM_OVCN_MSB 20u
#define USB_USBPHY_DIRECT_DM_OVCN_LSB 20u
#define USB_USBPHY_DIRECT_DM_OVCN_ACCESS "RO"
#define USB_USBPHY_DIRECT_DP_OVCN_RESET 0x0u
#define USB_USBPHY_DIRECT_DP_OVCN_BITS 0x00080000u
#define USB_USBPHY_DIRECT_DP_OVCN_MSB 19u
#define USB_USBPHY_DIRECT_DP_OVCN_LSB 19u
#define USB_USBPHY_DIRECT_DP_OVCN_ACCESS "RO"
#define USB_USBPHY_DIRECT_RX_DM_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_DM_BITS 0x00040000u
#define USB_USBPHY_DIRECT_RX_DM_MSB 18u
#define USB_USBPHY_DIRECT_RX_DM_LSB 18u
#define USB_USBPHY_DIRECT_RX_DM_ACCESS "RO"
#define USB_USBPHY_DIRECT_RX_DP_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_DP_BITS 0x00020000u
#define USB_USBPHY_DIRECT_RX_DP_MSB 17u
#define USB_USBPHY_DIRECT_RX_DP_LSB 17u
#define USB_USBPHY_DIRECT_RX_DP_ACCESS "RO"
#define USB_USBPHY_DIRECT_RX_DD_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_DD_BITS 0x00010000u
#define USB_USBPHY_DIRECT_RX_DD_MSB 16u
#define USB_USBPHY_DIRECT_RX_DD_LSB 16u
#define USB_USBPHY_DIRECT_RX_DD_ACCESS "RO"
#define USB_USBPHY_DIRECT_TX_DIFFMODE_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_DIFFMODE_BITS 0x00008000u
#define USB_USBPHY_DIRECT_TX_DIFFMODE_MSB 15u
#define USB_USBPHY_DIRECT_TX_DIFFMODE_LSB 15u
#define USB_USBPHY_DIRECT_TX_DIFFMODE_ACCESS "RW"
#define USB_USBPHY_DIRECT_TX_FSSLEW_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_FSSLEW_BITS 0x00004000u
#define USB_USBPHY_DIRECT_TX_FSSLEW_MSB 14u
#define USB_USBPHY_DIRECT_TX_FSSLEW_LSB 14u
#define USB_USBPHY_DIRECT_TX_FSSLEW_ACCESS "RW"
#define USB_USBPHY_DIRECT_TX_PD_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_PD_BITS 0x00002000u
#define USB_USBPHY_DIRECT_TX_PD_MSB 13u
#define USB_USBPHY_DIRECT_TX_PD_LSB 13u
#define USB_USBPHY_DIRECT_TX_PD_ACCESS "RW"
#define USB_USBPHY_DIRECT_RX_PD_RESET 0x0u
#define USB_USBPHY_DIRECT_RX_PD_BITS 0x00001000u
#define USB_USBPHY_DIRECT_RX_PD_MSB 12u
#define USB_USBPHY_DIRECT_RX_PD_LSB 12u
#define USB_USBPHY_DIRECT_RX_PD_ACCESS "RW"
#define USB_USBPHY_DIRECT_TX_DM_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_DM_BITS 0x00000800u
#define USB_USBPHY_DIRECT_TX_DM_MSB 11u
#define USB_USBPHY_DIRECT_TX_DM_LSB 11u
#define USB_USBPHY_DIRECT_TX_DM_ACCESS "RW"
#define USB_USBPHY_DIRECT_TX_DP_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_DP_BITS 0x00000400u
#define USB_USBPHY_DIRECT_TX_DP_MSB 10u
#define USB_USBPHY_DIRECT_TX_DP_LSB 10u
#define USB_USBPHY_DIRECT_TX_DP_ACCESS "RW"
#define USB_USBPHY_DIRECT_TX_DM_OE_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_DM_OE_BITS 0x00000200u
#define USB_USBPHY_DIRECT_TX_DM_OE_MSB 9u
#define USB_USBPHY_DIRECT_TX_DM_OE_LSB 9u
#define USB_USBPHY_DIRECT_TX_DM_OE_ACCESS "RW"
#define USB_USBPHY_DIRECT_TX_DP_OE_RESET 0x0u
#define USB_USBPHY_DIRECT_TX_DP_OE_BITS 0x00000100u
#define USB_USBPHY_DIRECT_TX_DP_OE_MSB 8u
#define USB_USBPHY_DIRECT_TX_DP_OE_LSB 8u
#define USB_USBPHY_DIRECT_TX_DP_OE_ACCESS "RW"
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_BITS 0x00000040u
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_MSB 6u
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_LSB 6u
#define USB_USBPHY_DIRECT_DM_PULLDN_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_BITS 0x00000020u
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_MSB 5u
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_LSB 5u
#define USB_USBPHY_DIRECT_DM_PULLUP_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_RESET 0x0u
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_BITS 0x00000010u
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_MSB 4u
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_LSB 4u
#define USB_USBPHY_DIRECT_DM_PULLUP_HISEL_ACCESS "RW"
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_BITS 0x00000004u
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_MSB 2u
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_LSB 2u
#define USB_USBPHY_DIRECT_DP_PULLDN_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_BITS 0x00000002u
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_MSB 1u
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_LSB 1u
#define USB_USBPHY_DIRECT_DP_PULLUP_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_RESET 0x0u
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_BITS 0x00000001u
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_MSB 0u
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_LSB 0u
#define USB_USBPHY_DIRECT_DP_PULLUP_HISEL_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_OFFSET 0x00000080u
#define USB_USBPHY_DIRECT_OVERRIDE_BITS 0x00079fffu
#define USB_USBPHY_DIRECT_OVERRIDE_RESET 0x00000000u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_BITS 0x00040000u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_MSB 18u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_LSB 18u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_BITS 0x00020000u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_MSB 17u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_LSB 17u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_BITS 0x00010000u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_MSB 16u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_LSB 16u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_BITS 0x00008000u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_MSB 15u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_LSB 15u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_BITS 0x00001000u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_MSB 12u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_LSB 12u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_BITS 0x00000800u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_MSB 11u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_LSB 11u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_BITS 0x00000400u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_MSB 10u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_LSB 10u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_BITS 0x00000200u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_MSB 9u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_LSB 9u
#define USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_BITS 0x00000100u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_MSB 8u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_LSB 8u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_BITS 0x00000080u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_MSB 7u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_LSB 7u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_BITS 0x00000040u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_MSB 6u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_LSB 6u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_BITS 0x00000020u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_MSB 5u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_LSB 5u
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_BITS 0x00000010u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_MSB 4u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_LSB 4u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_BITS 0x00000008u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_MSB 3u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_LSB 3u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_BITS 0x00000004u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_MSB 2u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_LSB 2u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_BITS 0x00000002u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_MSB 1u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_LSB 1u
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_RESET 0x0u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_BITS 0x00000001u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_MSB 0u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_LSB 0u
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_ACCESS "RW"
#define USB_USBPHY_TRIM_OFFSET 0x00000084u
#define USB_USBPHY_TRIM_BITS 0x00001f1fu
#define USB_USBPHY_TRIM_RESET 0x00001f1fu
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_RESET 0x1fu
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_BITS 0x00001f00u
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_MSB 12u
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_LSB 8u
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_ACCESS "RW"
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_RESET 0x1fu
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_BITS 0x0000001fu
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_MSB 4u
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_LSB 0u
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_ACCESS "RW"
#define USB_LINESTATE_TUNING_OFFSET 0x00000088u
#define USB_LINESTATE_TUNING_BITS 0x00000fffu
#define USB_LINESTATE_TUNING_RESET 0x000000f8u
#define USB_LINESTATE_TUNING_SPARE_FIX_RESET 0x0u
#define USB_LINESTATE_TUNING_SPARE_FIX_BITS 0x00000f00u
#define USB_LINESTATE_TUNING_SPARE_FIX_MSB 11u
#define USB_LINESTATE_TUNING_SPARE_FIX_LSB 8u
#define USB_LINESTATE_TUNING_SPARE_FIX_ACCESS "RW"
#define USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_RESET 0x1u
#define USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_BITS 0x00000080u
#define USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_MSB 7u
#define USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_LSB 7u
#define USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_ACCESS "RW"
#define USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_RESET 0x1u
#define USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_BITS 0x00000040u
#define USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_MSB 6u
#define USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_LSB 6u
#define USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_ACCESS "RW"
#define USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_RESET 0x1u
#define USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_BITS 0x00000020u
#define USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_MSB 5u
#define USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_LSB 5u
#define USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_ACCESS "RW"
#define USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_RESET 0x1u
#define USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_BITS 0x00000010u
#define USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_MSB 4u
#define USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_LSB 4u
#define USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_ACCESS "RW"
#define USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_RESET 0x1u
#define USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_BITS 0x00000008u
#define USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_MSB 3u
#define USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_LSB 3u
#define USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_ACCESS "RW"
#define USB_LINESTATE_TUNING_MULTI_HUB_FIX_RESET 0x0u
#define USB_LINESTATE_TUNING_MULTI_HUB_FIX_BITS 0x00000004u
#define USB_LINESTATE_TUNING_MULTI_HUB_FIX_MSB 2u
#define USB_LINESTATE_TUNING_MULTI_HUB_FIX_LSB 2u
#define USB_LINESTATE_TUNING_MULTI_HUB_FIX_ACCESS "RW"
#define USB_LINESTATE_TUNING_LINESTATE_DELAY_RESET 0x0u
#define USB_LINESTATE_TUNING_LINESTATE_DELAY_BITS 0x00000002u
#define USB_LINESTATE_TUNING_LINESTATE_DELAY_MSB 1u
#define USB_LINESTATE_TUNING_LINESTATE_DELAY_LSB 1u
#define USB_LINESTATE_TUNING_LINESTATE_DELAY_ACCESS "RW"
#define USB_LINESTATE_TUNING_RCV_DELAY_RESET 0x0u
#define USB_LINESTATE_TUNING_RCV_DELAY_BITS 0x00000001u
#define USB_LINESTATE_TUNING_RCV_DELAY_MSB 0u
#define USB_LINESTATE_TUNING_RCV_DELAY_LSB 0u
#define USB_LINESTATE_TUNING_RCV_DELAY_ACCESS "RW"
#define USB_INTR_OFFSET 0x0000008cu
#define USB_INTR_BITS 0x00ffffffu
#define USB_INTR_RESET 0x00000000u
#define USB_INTR_EPX_STOPPED_ON_NAK_RESET 0x0u
#define USB_INTR_EPX_STOPPED_ON_NAK_BITS 0x00800000u
#define USB_INTR_EPX_STOPPED_ON_NAK_MSB 23u
#define USB_INTR_EPX_STOPPED_ON_NAK_LSB 23u
#define USB_INTR_EPX_STOPPED_ON_NAK_ACCESS "RO"
#define USB_INTR_DEV_SM_WATCHDOG_FIRED_RESET 0x0u
#define USB_INTR_DEV_SM_WATCHDOG_FIRED_BITS 0x00400000u
#define USB_INTR_DEV_SM_WATCHDOG_FIRED_MSB 22u
#define USB_INTR_DEV_SM_WATCHDOG_FIRED_LSB 22u
#define USB_INTR_DEV_SM_WATCHDOG_FIRED_ACCESS "RO"
#define USB_INTR_ENDPOINT_ERROR_RESET 0x0u
#define USB_INTR_ENDPOINT_ERROR_BITS 0x00200000u
#define USB_INTR_ENDPOINT_ERROR_MSB 21u
#define USB_INTR_ENDPOINT_ERROR_LSB 21u
#define USB_INTR_ENDPOINT_ERROR_ACCESS "RO"
#define USB_INTR_RX_SHORT_PACKET_RESET 0x0u
#define USB_INTR_RX_SHORT_PACKET_BITS 0x00100000u
#define USB_INTR_RX_SHORT_PACKET_MSB 20u
#define USB_INTR_RX_SHORT_PACKET_LSB 20u
#define USB_INTR_RX_SHORT_PACKET_ACCESS "RO"
#define USB_INTR_EP_STALL_NAK_RESET 0x0u
#define USB_INTR_EP_STALL_NAK_BITS 0x00080000u
#define USB_INTR_EP_STALL_NAK_MSB 19u
#define USB_INTR_EP_STALL_NAK_LSB 19u
#define USB_INTR_EP_STALL_NAK_ACCESS "RO"
#define USB_INTR_ABORT_DONE_RESET 0x0u
#define USB_INTR_ABORT_DONE_BITS 0x00040000u
#define USB_INTR_ABORT_DONE_MSB 18u
#define USB_INTR_ABORT_DONE_LSB 18u
#define USB_INTR_ABORT_DONE_ACCESS "RO"
#define USB_INTR_DEV_SOF_RESET 0x0u
#define USB_INTR_DEV_SOF_BITS 0x00020000u
#define USB_INTR_DEV_SOF_MSB 17u
#define USB_INTR_DEV_SOF_LSB 17u
#define USB_INTR_DEV_SOF_ACCESS "RO"
#define USB_INTR_SETUP_REQ_RESET 0x0u
#define USB_INTR_SETUP_REQ_BITS 0x00010000u
#define USB_INTR_SETUP_REQ_MSB 16u
#define USB_INTR_SETUP_REQ_LSB 16u
#define USB_INTR_SETUP_REQ_ACCESS "RO"
#define USB_INTR_DEV_RESUME_FROM_HOST_RESET 0x0u
#define USB_INTR_DEV_RESUME_FROM_HOST_BITS 0x00008000u
#define USB_INTR_DEV_RESUME_FROM_HOST_MSB 15u
#define USB_INTR_DEV_RESUME_FROM_HOST_LSB 15u
#define USB_INTR_DEV_RESUME_FROM_HOST_ACCESS "RO"
#define USB_INTR_DEV_SUSPEND_RESET 0x0u
#define USB_INTR_DEV_SUSPEND_BITS 0x00004000u
#define USB_INTR_DEV_SUSPEND_MSB 14u
#define USB_INTR_DEV_SUSPEND_LSB 14u
#define USB_INTR_DEV_SUSPEND_ACCESS "RO"
#define USB_INTR_DEV_CONN_DIS_RESET 0x0u
#define USB_INTR_DEV_CONN_DIS_BITS 0x00002000u
#define USB_INTR_DEV_CONN_DIS_MSB 13u
#define USB_INTR_DEV_CONN_DIS_LSB 13u
#define USB_INTR_DEV_CONN_DIS_ACCESS "RO"
#define USB_INTR_BUS_RESET_RESET 0x0u
#define USB_INTR_BUS_RESET_BITS 0x00001000u
#define USB_INTR_BUS_RESET_MSB 12u
#define USB_INTR_BUS_RESET_LSB 12u
#define USB_INTR_BUS_RESET_ACCESS "RO"
#define USB_INTR_VBUS_DETECT_RESET 0x0u
#define USB_INTR_VBUS_DETECT_BITS 0x00000800u
#define USB_INTR_VBUS_DETECT_MSB 11u
#define USB_INTR_VBUS_DETECT_LSB 11u
#define USB_INTR_VBUS_DETECT_ACCESS "RO"
#define USB_INTR_STALL_RESET 0x0u
#define USB_INTR_STALL_BITS 0x00000400u
#define USB_INTR_STALL_MSB 10u
#define USB_INTR_STALL_LSB 10u
#define USB_INTR_STALL_ACCESS "RO"
#define USB_INTR_ERROR_CRC_RESET 0x0u
#define USB_INTR_ERROR_CRC_BITS 0x00000200u
#define USB_INTR_ERROR_CRC_MSB 9u
#define USB_INTR_ERROR_CRC_LSB 9u
#define USB_INTR_ERROR_CRC_ACCESS "RO"
#define USB_INTR_ERROR_BIT_STUFF_RESET 0x0u
#define USB_INTR_ERROR_BIT_STUFF_BITS 0x00000100u
#define USB_INTR_ERROR_BIT_STUFF_MSB 8u
#define USB_INTR_ERROR_BIT_STUFF_LSB 8u
#define USB_INTR_ERROR_BIT_STUFF_ACCESS "RO"
#define USB_INTR_ERROR_RX_OVERFLOW_RESET 0x0u
#define USB_INTR_ERROR_RX_OVERFLOW_BITS 0x00000080u
#define USB_INTR_ERROR_RX_OVERFLOW_MSB 7u
#define USB_INTR_ERROR_RX_OVERFLOW_LSB 7u
#define USB_INTR_ERROR_RX_OVERFLOW_ACCESS "RO"
#define USB_INTR_ERROR_RX_TIMEOUT_RESET 0x0u
#define USB_INTR_ERROR_RX_TIMEOUT_BITS 0x00000040u
#define USB_INTR_ERROR_RX_TIMEOUT_MSB 6u
#define USB_INTR_ERROR_RX_TIMEOUT_LSB 6u
#define USB_INTR_ERROR_RX_TIMEOUT_ACCESS "RO"
#define USB_INTR_ERROR_DATA_SEQ_RESET 0x0u
#define USB_INTR_ERROR_DATA_SEQ_BITS 0x00000020u
#define USB_INTR_ERROR_DATA_SEQ_MSB 5u
#define USB_INTR_ERROR_DATA_SEQ_LSB 5u
#define USB_INTR_ERROR_DATA_SEQ_ACCESS "RO"
#define USB_INTR_BUFF_STATUS_RESET 0x0u
#define USB_INTR_BUFF_STATUS_BITS 0x00000010u
#define USB_INTR_BUFF_STATUS_MSB 4u
#define USB_INTR_BUFF_STATUS_LSB 4u
#define USB_INTR_BUFF_STATUS_ACCESS "RO"
#define USB_INTR_TRANS_COMPLETE_RESET 0x0u
#define USB_INTR_TRANS_COMPLETE_BITS 0x00000008u
#define USB_INTR_TRANS_COMPLETE_MSB 3u
#define USB_INTR_TRANS_COMPLETE_LSB 3u
#define USB_INTR_TRANS_COMPLETE_ACCESS "RO"
#define USB_INTR_HOST_SOF_RESET 0x0u
#define USB_INTR_HOST_SOF_BITS 0x00000004u
#define USB_INTR_HOST_SOF_MSB 2u
#define USB_INTR_HOST_SOF_LSB 2u
#define USB_INTR_HOST_SOF_ACCESS "RO"
#define USB_INTR_HOST_RESUME_RESET 0x0u
#define USB_INTR_HOST_RESUME_BITS 0x00000002u
#define USB_INTR_HOST_RESUME_MSB 1u
#define USB_INTR_HOST_RESUME_LSB 1u
#define USB_INTR_HOST_RESUME_ACCESS "RO"
#define USB_INTR_HOST_CONN_DIS_RESET 0x0u
#define USB_INTR_HOST_CONN_DIS_BITS 0x00000001u
#define USB_INTR_HOST_CONN_DIS_MSB 0u
#define USB_INTR_HOST_CONN_DIS_LSB 0u
#define USB_INTR_HOST_CONN_DIS_ACCESS "RO"
#define USB_INTE_OFFSET 0x00000090u
#define USB_INTE_BITS 0x00ffffffu
#define USB_INTE_RESET 0x00000000u
#define USB_INTE_EPX_STOPPED_ON_NAK_RESET 0x0u
#define USB_INTE_EPX_STOPPED_ON_NAK_BITS 0x00800000u
#define USB_INTE_EPX_STOPPED_ON_NAK_MSB 23u
#define USB_INTE_EPX_STOPPED_ON_NAK_LSB 23u
#define USB_INTE_EPX_STOPPED_ON_NAK_ACCESS "RW"
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_RESET 0x0u
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_BITS 0x00400000u
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_MSB 22u
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_LSB 22u
#define USB_INTE_DEV_SM_WATCHDOG_FIRED_ACCESS "RW"
#define USB_INTE_ENDPOINT_ERROR_RESET 0x0u
#define USB_INTE_ENDPOINT_ERROR_BITS 0x00200000u
#define USB_INTE_ENDPOINT_ERROR_MSB 21u
#define USB_INTE_ENDPOINT_ERROR_LSB 21u
#define USB_INTE_ENDPOINT_ERROR_ACCESS "RW"
#define USB_INTE_RX_SHORT_PACKET_RESET 0x0u
#define USB_INTE_RX_SHORT_PACKET_BITS 0x00100000u
#define USB_INTE_RX_SHORT_PACKET_MSB 20u
#define USB_INTE_RX_SHORT_PACKET_LSB 20u
#define USB_INTE_RX_SHORT_PACKET_ACCESS "RW"
#define USB_INTE_EP_STALL_NAK_RESET 0x0u
#define USB_INTE_EP_STALL_NAK_BITS 0x00080000u
#define USB_INTE_EP_STALL_NAK_MSB 19u
#define USB_INTE_EP_STALL_NAK_LSB 19u
#define USB_INTE_EP_STALL_NAK_ACCESS "RW"
#define USB_INTE_ABORT_DONE_RESET 0x0u
#define USB_INTE_ABORT_DONE_BITS 0x00040000u
#define USB_INTE_ABORT_DONE_MSB 18u
#define USB_INTE_ABORT_DONE_LSB 18u
#define USB_INTE_ABORT_DONE_ACCESS "RW"
#define USB_INTE_DEV_SOF_RESET 0x0u
#define USB_INTE_DEV_SOF_BITS 0x00020000u
#define USB_INTE_DEV_SOF_MSB 17u
#define USB_INTE_DEV_SOF_LSB 17u
#define USB_INTE_DEV_SOF_ACCESS "RW"
#define USB_INTE_SETUP_REQ_RESET 0x0u
#define USB_INTE_SETUP_REQ_BITS 0x00010000u
#define USB_INTE_SETUP_REQ_MSB 16u
#define USB_INTE_SETUP_REQ_LSB 16u
#define USB_INTE_SETUP_REQ_ACCESS "RW"
#define USB_INTE_DEV_RESUME_FROM_HOST_RESET 0x0u
#define USB_INTE_DEV_RESUME_FROM_HOST_BITS 0x00008000u
#define USB_INTE_DEV_RESUME_FROM_HOST_MSB 15u
#define USB_INTE_DEV_RESUME_FROM_HOST_LSB 15u
#define USB_INTE_DEV_RESUME_FROM_HOST_ACCESS "RW"
#define USB_INTE_DEV_SUSPEND_RESET 0x0u
#define USB_INTE_DEV_SUSPEND_BITS 0x00004000u
#define USB_INTE_DEV_SUSPEND_MSB 14u
#define USB_INTE_DEV_SUSPEND_LSB 14u
#define USB_INTE_DEV_SUSPEND_ACCESS "RW"
#define USB_INTE_DEV_CONN_DIS_RESET 0x0u
