gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define USB_INTE_DEV_CONN_DIS_BITS 0x00002000u
#define USB_INTE_DEV_CONN_DIS_MSB 13u
#define USB_INTE_DEV_CONN_DIS_LSB 13u
#define USB_INTE_DEV_CONN_DIS_ACCESS "RW"
#define USB_INTE_BUS_RESET_RESET 0x0u
#define USB_INTE_BUS_RESET_BITS 0x00001000u
#define USB_INTE_BUS_RESET_MSB 12u
#define USB_INTE_BUS_RESET_LSB 12u
#define USB_INTE_BUS_RESET_ACCESS "RW"
#define USB_INTE_VBUS_DETECT_RESET 0x0u
#define USB_INTE_VBUS_DETECT_BITS 0x00000800u
#define USB_INTE_VBUS_DETECT_MSB 11u
#define USB_INTE_VBUS_DETECT_LSB 11u
#define USB_INTE_VBUS_DETECT_ACCESS "RW"
#define USB_INTE_STALL_RESET 0x0u
#define USB_INTE_STALL_BITS 0x00000400u
#define USB_INTE_STALL_MSB 10u
#define USB_INTE_STALL_LSB 10u
#define USB_INTE_STALL_ACCESS "RW"
#define USB_INTE_ERROR_CRC_RESET 0x0u
#define USB_INTE_ERROR_CRC_BITS 0x00000200u
#define USB_INTE_ERROR_CRC_MSB 9u
#define USB_INTE_ERROR_CRC_LSB 9u
#define USB_INTE_ERROR_CRC_ACCESS "RW"
#define USB_INTE_ERROR_BIT_STUFF_RESET 0x0u
#define USB_INTE_ERROR_BIT_STUFF_BITS 0x00000100u
#define USB_INTE_ERROR_BIT_STUFF_MSB 8u
#define USB_INTE_ERROR_BIT_STUFF_LSB 8u
#define USB_INTE_ERROR_BIT_STUFF_ACCESS "RW"
#define USB_INTE_ERROR_RX_OVERFLOW_RESET 0x0u
#define USB_INTE_ERROR_RX_OVERFLOW_BITS 0x00000080u
#define USB_INTE_ERROR_RX_OVERFLOW_MSB 7u
#define USB_INTE_ERROR_RX_OVERFLOW_LSB 7u
#define USB_INTE_ERROR_RX_OVERFLOW_ACCESS "RW"
#define USB_INTE_ERROR_RX_TIMEOUT_RESET 0x0u
#define USB_INTE_ERROR_RX_TIMEOUT_BITS 0x00000040u
#define USB_INTE_ERROR_RX_TIMEOUT_MSB 6u
#define USB_INTE_ERROR_RX_TIMEOUT_LSB 6u
#define USB_INTE_ERROR_RX_TIMEOUT_ACCESS "RW"
#define USB_INTE_ERROR_DATA_SEQ_RESET 0x0u
#define USB_INTE_ERROR_DATA_SEQ_BITS 0x00000020u
#define USB_INTE_ERROR_DATA_SEQ_MSB 5u
#define USB_INTE_ERROR_DATA_SEQ_LSB 5u
#define USB_INTE_ERROR_DATA_SEQ_ACCESS "RW"
#define USB_INTE_BUFF_STATUS_RESET 0x0u
#define USB_INTE_BUFF_STATUS_BITS 0x00000010u
#define USB_INTE_BUFF_STATUS_MSB 4u
#define USB_INTE_BUFF_STATUS_LSB 4u
#define USB_INTE_BUFF_STATUS_ACCESS "RW"
#define USB_INTE_TRANS_COMPLETE_RESET 0x0u
#define USB_INTE_TRANS_COMPLETE_BITS 0x00000008u
#define USB_INTE_TRANS_COMPLETE_MSB 3u
#define USB_INTE_TRANS_COMPLETE_LSB 3u
#define USB_INTE_TRANS_COMPLETE_ACCESS "RW"
#define USB_INTE_HOST_SOF_RESET 0x0u
#define USB_INTE_HOST_SOF_BITS 0x00000004u
#define USB_INTE_HOST_SOF_MSB 2u
#define USB_INTE_HOST_SOF_LSB 2u
#define USB_INTE_HOST_SOF_ACCESS "RW"
#define USB_INTE_HOST_RESUME_RESET 0x0u
#define USB_INTE_HOST_RESUME_BITS 0x00000002u
#define USB_INTE_HOST_RESUME_MSB 1u
#define USB_INTE_HOST_RESUME_LSB 1u
#define USB_INTE_HOST_RESUME_ACCESS "RW"
#define USB_INTE_HOST_CONN_DIS_RESET 0x0u
#define USB_INTE_HOST_CONN_DIS_BITS 0x00000001u
#define USB_INTE_HOST_CONN_DIS_MSB 0u
#define USB_INTE_HOST_CONN_DIS_LSB 0u
#define USB_INTE_HOST_CONN_DIS_ACCESS "RW"
#define USB_INTF_OFFSET 0x00000094u
#define USB_INTF_BITS 0x00ffffffu
#define USB_INTF_RESET 0x00000000u
#define USB_INTF_EPX_STOPPED_ON_NAK_RESET 0x0u
#define USB_INTF_EPX_STOPPED_ON_NAK_BITS 0x00800000u
#define USB_INTF_EPX_STOPPED_ON_NAK_MSB 23u
#define USB_INTF_EPX_STOPPED_ON_NAK_LSB 23u
#define USB_INTF_EPX_STOPPED_ON_NAK_ACCESS "RW"
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_RESET 0x0u
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_BITS 0x00400000u
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_MSB 22u
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_LSB 22u
#define USB_INTF_DEV_SM_WATCHDOG_FIRED_ACCESS "RW"
#define USB_INTF_ENDPOINT_ERROR_RESET 0x0u
#define USB_INTF_ENDPOINT_ERROR_BITS 0x00200000u
#define USB_INTF_ENDPOINT_ERROR_MSB 21u
#define USB_INTF_ENDPOINT_ERROR_LSB 21u
#define USB_INTF_ENDPOINT_ERROR_ACCESS "RW"
#define USB_INTF_RX_SHORT_PACKET_RESET 0x0u
#define USB_INTF_RX_SHORT_PACKET_BITS 0x00100000u
#define USB_INTF_RX_SHORT_PACKET_MSB 20u
#define USB_INTF_RX_SHORT_PACKET_LSB 20u
#define USB_INTF_RX_SHORT_PACKET_ACCESS "RW"
#define USB_INTF_EP_STALL_NAK_RESET 0x0u
#define USB_INTF_EP_STALL_NAK_BITS 0x00080000u
#define USB_INTF_EP_STALL_NAK_MSB 19u
#define USB_INTF_EP_STALL_NAK_LSB 19u
#define USB_INTF_EP_STALL_NAK_ACCESS "RW"
#define USB_INTF_ABORT_DONE_RESET 0x0u
#define USB_INTF_ABORT_DONE_BITS 0x00040000u
#define USB_INTF_ABORT_DONE_MSB 18u
#define USB_INTF_ABORT_DONE_LSB 18u
#define USB_INTF_ABORT_DONE_ACCESS "RW"
#define USB_INTF_DEV_SOF_RESET 0x0u
#define USB_INTF_DEV_SOF_BITS 0x00020000u
#define USB_INTF_DEV_SOF_MSB 17u
#define USB_INTF_DEV_SOF_LSB 17u
#define USB_INTF_DEV_SOF_ACCESS "RW"
#define USB_INTF_SETUP_REQ_RESET 0x0u
#define USB_INTF_SETUP_REQ_BITS 0x00010000u
#define USB_INTF_SETUP_REQ_MSB 16u
#define USB_INTF_SETUP_REQ_LSB 16u
#define USB_INTF_SETUP_REQ_ACCESS "RW"
#define USB_INTF_DEV_RESUME_FROM_HOST_RESET 0x0u
#define USB_INTF_DEV_RESUME_FROM_HOST_BITS 0x00008000u
#define USB_INTF_DEV_RESUME_FROM_HOST_MSB 15u
#define USB_INTF_DEV_RESUME_FROM_HOST_LSB 15u
#define USB_INTF_DEV_RESUME_FROM_HOST_ACCESS "RW"
#define USB_INTF_DEV_SUSPEND_RESET 0x0u
#define USB_INTF_DEV_SUSPEND_BITS 0x00004000u
#define USB_INTF_DEV_SUSPEND_MSB 14u
#define USB_INTF_DEV_SUSPEND_LSB 14u
#define USB_INTF_DEV_SUSPEND_ACCESS "RW"
#define USB_INTF_DEV_CONN_DIS_RESET 0x0u
#define USB_INTF_DEV_CONN_DIS_BITS 0x00002000u
#define USB_INTF_DEV_CONN_DIS_MSB 13u
#define USB_INTF_DEV_CONN_DIS_LSB 13u
#define USB_INTF_DEV_CONN_DIS_ACCESS "RW"
#define USB_INTF_BUS_RESET_RESET 0x0u
#define USB_INTF_BUS_RESET_BITS 0x00001000u
#define USB_INTF_BUS_RESET_MSB 12u
#define USB_INTF_BUS_RESET_LSB 12u
#define USB_INTF_BUS_RESET_ACCESS "RW"
#define USB_INTF_VBUS_DETECT_RESET 0x0u
#define USB_INTF_VBUS_DETECT_BITS 0x00000800u
#define USB_INTF_VBUS_DETECT_MSB 11u
#define USB_INTF_VBUS_DETECT_LSB 11u
#define USB_INTF_VBUS_DETECT_ACCESS "RW"
#define USB_INTF_STALL_RESET 0x0u
#define USB_INTF_STALL_BITS 0x00000400u
#define USB_INTF_STALL_MSB 10u
#define USB_INTF_STALL_LSB 10u
#define USB_INTF_STALL_ACCESS "RW"
#define USB_INTF_ERROR_CRC_RESET 0x0u
#define USB_INTF_ERROR_CRC_BITS 0x00000200u
#define USB_INTF_ERROR_CRC_MSB 9u
#define USB_INTF_ERROR_CRC_LSB 9u
#define USB_INTF_ERROR_CRC_ACCESS "RW"
#define USB_INTF_ERROR_BIT_STUFF_RESET 0x0u
#define USB_INTF_ERROR_BIT_STUFF_BITS 0x00000100u
#define USB_INTF_ERROR_BIT_STUFF_MSB 8u
#define USB_INTF_ERROR_BIT_STUFF_LSB 8u
#define USB_INTF_ERROR_BIT_STUFF_ACCESS "RW"
#define USB_INTF_ERROR_RX_OVERFLOW_RESET 0x0u
#define USB_INTF_ERROR_RX_OVERFLOW_BITS 0x00000080u
#define USB_INTF_ERROR_RX_OVERFLOW_MSB 7u
#define USB_INTF_ERROR_RX_OVERFLOW_LSB 7u
#define USB_INTF_ERROR_RX_OVERFLOW_ACCESS "RW"
#define USB_INTF_ERROR_RX_TIMEOUT_RESET 0x0u
#define USB_INTF_ERROR_RX_TIMEOUT_BITS 0x00000040u
#define USB_INTF_ERROR_RX_TIMEOUT_MSB 6u
#define USB_INTF_ERROR_RX_TIMEOUT_LSB 6u
#define USB_INTF_ERROR_RX_TIMEOUT_ACCESS "RW"
#define USB_INTF_ERROR_DATA_SEQ_RESET 0x0u
#define USB_INTF_ERROR_DATA_SEQ_BITS 0x00000020u
#define USB_INTF_ERROR_DATA_SEQ_MSB 5u
#define USB_INTF_ERROR_DATA_SEQ_LSB 5u
#define USB_INTF_ERROR_DATA_SEQ_ACCESS "RW"
#define USB_INTF_BUFF_STATUS_RESET 0x0u
#define USB_INTF_BUFF_STATUS_BITS 0x00000010u
#define USB_INTF_BUFF_STATUS_MSB 4u
#define USB_INTF_BUFF_STATUS_LSB 4u
#define USB_INTF_BUFF_STATUS_ACCESS "RW"
#define USB_INTF_TRANS_COMPLETE_RESET 0x0u
#define USB_INTF_TRANS_COMPLETE_BITS 0x00000008u
#define USB_INTF_TRANS_COMPLETE_MSB 3u
#define USB_INTF_TRANS_COMPLETE_LSB 3u
#define USB_INTF_TRANS_COMPLETE_ACCESS "RW"
#define USB_INTF_HOST_SOF_RESET 0x0u
#define USB_INTF_HOST_SOF_BITS 0x00000004u
#define USB_INTF_HOST_SOF_MSB 2u
#define USB_INTF_HOST_SOF_LSB 2u
#define USB_INTF_HOST_SOF_ACCESS "RW"
#define USB_INTF_HOST_RESUME_RESET 0x0u
#define USB_INTF_HOST_RESUME_BITS 0x00000002u
#define USB_INTF_HOST_RESUME_MSB 1u
#define USB_INTF_HOST_RESUME_LSB 1u
#define USB_INTF_HOST_RESUME_ACCESS "RW"
#define USB_INTF_HOST_CONN_DIS_RESET 0x0u
#define USB_INTF_HOST_CONN_DIS_BITS 0x00000001u
#define USB_INTF_HOST_CONN_DIS_MSB 0u
#define USB_INTF_HOST_CONN_DIS_LSB 0u
#define USB_INTF_HOST_CONN_DIS_ACCESS "RW"
#define USB_INTS_OFFSET 0x00000098u
#define USB_INTS_BITS 0x00ffffffu
#define USB_INTS_RESET 0x00000000u
#define USB_INTS_EPX_STOPPED_ON_NAK_RESET 0x0u
#define USB_INTS_EPX_STOPPED_ON_NAK_BITS 0x00800000u
#define USB_INTS_EPX_STOPPED_ON_NAK_MSB 23u
#define USB_INTS_EPX_STOPPED_ON_NAK_LSB 23u
#define USB_INTS_EPX_STOPPED_ON_NAK_ACCESS "RO"
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_RESET 0x0u
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_BITS 0x00400000u
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_MSB 22u
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_LSB 22u
#define USB_INTS_DEV_SM_WATCHDOG_FIRED_ACCESS "RO"
#define USB_INTS_ENDPOINT_ERROR_RESET 0x0u
#define USB_INTS_ENDPOINT_ERROR_BITS 0x00200000u
#define USB_INTS_ENDPOINT_ERROR_MSB 21u
#define USB_INTS_ENDPOINT_ERROR_LSB 21u
#define USB_INTS_ENDPOINT_ERROR_ACCESS "RO"
#define USB_INTS_RX_SHORT_PACKET_RESET 0x0u
#define USB_INTS_RX_SHORT_PACKET_BITS 0x00100000u
#define USB_INTS_RX_SHORT_PACKET_MSB 20u
#define USB_INTS_RX_SHORT_PACKET_LSB 20u
#define USB_INTS_RX_SHORT_PACKET_ACCESS "RO"
#define USB_INTS_EP_STALL_NAK_RESET 0x0u
#define USB_INTS_EP_STALL_NAK_BITS 0x00080000u
#define USB_INTS_EP_STALL_NAK_MSB 19u
#define USB_INTS_EP_STALL_NAK_LSB 19u
#define USB_INTS_EP_STALL_NAK_ACCESS "RO"
#define USB_INTS_ABORT_DONE_RESET 0x0u
#define USB_INTS_ABORT_DONE_BITS 0x00040000u
#define USB_INTS_ABORT_DONE_MSB 18u
#define USB_INTS_ABORT_DONE_LSB 18u
#define USB_INTS_ABORT_DONE_ACCESS "RO"
#define USB_INTS_DEV_SOF_RESET 0x0u
#define USB_INTS_DEV_SOF_BITS 0x00020000u
#define USB_INTS_DEV_SOF_MSB 17u
#define USB_INTS_DEV_SOF_LSB 17u
#define USB_INTS_DEV_SOF_ACCESS "RO"
#define USB_INTS_SETUP_REQ_RESET 0x0u
#define USB_INTS_SETUP_REQ_BITS 0x00010000u
#define USB_INTS_SETUP_REQ_MSB 16u
#define USB_INTS_SETUP_REQ_LSB 16u
#define USB_INTS_SETUP_REQ_ACCESS "RO"
#define USB_INTS_DEV_RESUME_FROM_HOST_RESET 0x0u
#define USB_INTS_DEV_RESUME_FROM_HOST_BITS 0x00008000u
#define USB_INTS_DEV_RESUME_FROM_HOST_MSB 15u
#define USB_INTS_DEV_RESUME_FROM_HOST_LSB 15u
#define USB_INTS_DEV_RESUME_FROM_HOST_ACCESS "RO"
#define USB_INTS_DEV_SUSPEND_RESET 0x0u
#define USB_INTS_DEV_SUSPEND_BITS 0x00004000u
#define USB_INTS_DEV_SUSPEND_MSB 14u
#define USB_INTS_DEV_SUSPEND_LSB 14u
#define USB_INTS_DEV_SUSPEND_ACCESS "RO"
#define USB_INTS_DEV_CONN_DIS_RESET 0x0u
#define USB_INTS_DEV_CONN_DIS_BITS 0x00002000u
#define USB_INTS_DEV_CONN_DIS_MSB 13u
#define USB_INTS_DEV_CONN_DIS_LSB 13u
#define USB_INTS_DEV_CONN_DIS_ACCESS "RO"
#define USB_INTS_BUS_RESET_RESET 0x0u
#define USB_INTS_BUS_RESET_BITS 0x00001000u
#define USB_INTS_BUS_RESET_MSB 12u
#define USB_INTS_BUS_RESET_LSB 12u
#define USB_INTS_BUS_RESET_ACCESS "RO"
#define USB_INTS_VBUS_DETECT_RESET 0x0u
#define USB_INTS_VBUS_DETECT_BITS 0x00000800u
#define USB_INTS_VBUS_DETECT_MSB 11u
#define USB_INTS_VBUS_DETECT_LSB 11u
#define USB_INTS_VBUS_DETECT_ACCESS "RO"
#define USB_INTS_STALL_RESET 0x0u
#define USB_INTS_STALL_BITS 0x00000400u
#define USB_INTS_STALL_MSB 10u
#define USB_INTS_STALL_LSB 10u
#define USB_INTS_STALL_ACCESS "RO"
#define USB_INTS_ERROR_CRC_RESET 0x0u
#define USB_INTS_ERROR_CRC_BITS 0x00000200u
#define USB_INTS_ERROR_CRC_MSB 9u
#define USB_INTS_ERROR_CRC_LSB 9u
#define USB_INTS_ERROR_CRC_ACCESS "RO"
#define USB_INTS_ERROR_BIT_STUFF_RESET 0x0u
#define USB_INTS_ERROR_BIT_STUFF_BITS 0x00000100u
#define USB_INTS_ERROR_BIT_STUFF_MSB 8u
#define USB_INTS_ERROR_BIT_STUFF_LSB 8u
#define USB_INTS_ERROR_BIT_STUFF_ACCESS "RO"
#define USB_INTS_ERROR_RX_OVERFLOW_RESET 0x0u
#define USB_INTS_ERROR_RX_OVERFLOW_BITS 0x00000080u
#define USB_INTS_ERROR_RX_OVERFLOW_MSB 7u
#define USB_INTS_ERROR_RX_OVERFLOW_LSB 7u
#define USB_INTS_ERROR_RX_OVERFLOW_ACCESS "RO"
#define USB_INTS_ERROR_RX_TIMEOUT_RESET 0x0u
#define USB_INTS_ERROR_RX_TIMEOUT_BITS 0x00000040u
#define USB_INTS_ERROR_RX_TIMEOUT_MSB 6u
#define USB_INTS_ERROR_RX_TIMEOUT_LSB 6u
#define USB_INTS_ERROR_RX_TIMEOUT_ACCESS "RO"
#define USB_INTS_ERROR_DATA_SEQ_RESET 0x0u
#define USB_INTS_ERROR_DATA_SEQ_BITS 0x00000020u
#define USB_INTS_ERROR_DATA_SEQ_MSB 5u
#define USB_INTS_ERROR_DATA_SEQ_LSB 5u
#define USB_INTS_ERROR_DATA_SEQ_ACCESS "RO"
#define USB_INTS_BUFF_STATUS_RESET 0x0u
#define USB_INTS_BUFF_STATUS_BITS 0x00000010u
#define USB_INTS_BUFF_STATUS_MSB 4u
#define USB_INTS_BUFF_STATUS_LSB 4u
#define USB_INTS_BUFF_STATUS_ACCESS "RO"
#define USB_INTS_TRANS_COMPLETE_RESET 0x0u
#define USB_INTS_TRANS_COMPLETE_BITS 0x00000008u
#define USB_INTS_TRANS_COMPLETE_MSB 3u
#define USB_INTS_TRANS_COMPLETE_LSB 3u
#define USB_INTS_TRANS_COMPLETE_ACCESS "RO"
#define USB_INTS_HOST_SOF_RESET 0x0u
#define USB_INTS_HOST_SOF_BITS 0x00000004u
#define USB_INTS_HOST_SOF_MSB 2u
#define USB_INTS_HOST_SOF_LSB 2u
#define USB_INTS_HOST_SOF_ACCESS "RO"
#define USB_INTS_HOST_RESUME_RESET 0x0u
#define USB_INTS_HOST_RESUME_BITS 0x00000002u
#define USB_INTS_HOST_RESUME_MSB 1u
#define USB_INTS_HOST_RESUME_LSB 1u
#define USB_INTS_HOST_RESUME_ACCESS "RO"
#define USB_INTS_HOST_CONN_DIS_RESET 0x0u
#define USB_INTS_HOST_CONN_DIS_BITS 0x00000001u
#define USB_INTS_HOST_CONN_DIS_MSB 0u
#define USB_INTS_HOST_CONN_DIS_LSB 0u
#define USB_INTS_HOST_CONN_DIS_ACCESS "RO"
#define USB_SOF_TIMESTAMP_RAW_OFFSET 0x00000100u
#define USB_SOF_TIMESTAMP_RAW_BITS 0x001fffffu
#define USB_SOF_TIMESTAMP_RAW_RESET 0x00000000u
#define USB_SOF_TIMESTAMP_RAW_MSB 20u
#define USB_SOF_TIMESTAMP_RAW_LSB 0u
#define USB_SOF_TIMESTAMP_RAW_ACCESS "RO"
#define USB_SOF_TIMESTAMP_LAST_OFFSET 0x00000104u
#define USB_SOF_TIMESTAMP_LAST_BITS 0x001fffffu
#define USB_SOF_TIMESTAMP_LAST_RESET 0x00000000u
#define USB_SOF_TIMESTAMP_LAST_MSB 20u
#define USB_SOF_TIMESTAMP_LAST_LSB 0u
#define USB_SOF_TIMESTAMP_LAST_ACCESS "RO"
#define USB_SM_STATE_OFFSET 0x00000108u
#define USB_SM_STATE_BITS 0x00000fffu
#define USB_SM_STATE_RESET 0x00000000u
#define USB_SM_STATE_RX_DASM_RESET 0x0u
#define USB_SM_STATE_RX_DASM_BITS 0x00000f00u
#define USB_SM_STATE_RX_DASM_MSB 11u
#define USB_SM_STATE_RX_DASM_LSB 8u
#define USB_SM_STATE_RX_DASM_ACCESS "RO"
#define USB_SM_STATE_BC_STATE_RESET 0x0u
#define USB_SM_STATE_BC_STATE_BITS 0x000000e0u
#define USB_SM_STATE_BC_STATE_MSB 7u
#define USB_SM_STATE_BC_STATE_LSB 5u
#define USB_SM_STATE_BC_STATE_ACCESS "RO"
#define USB_SM_STATE_STATE_RESET 0x00u
#define USB_SM_STATE_STATE_BITS 0x0000001fu
#define USB_SM_STATE_STATE_MSB 4u
#define USB_SM_STATE_STATE_LSB 0u
#define USB_SM_STATE_STATE_ACCESS "RO"
#define USB_EP_TX_ERROR_OFFSET 0x0000010cu
#define USB_EP_TX_ERROR_BITS 0xffffffffu
#define USB_EP_TX_ERROR_RESET 0x00000000u
#define USB_EP_TX_ERROR_EP15_RESET 0x0u
#define USB_EP_TX_ERROR_EP15_BITS 0xc0000000u
#define USB_EP_TX_ERROR_EP15_MSB 31u
#define USB_EP_TX_ERROR_EP15_LSB 30u
#define USB_EP_TX_ERROR_EP15_ACCESS "WC"
#define USB_EP_TX_ERROR_EP14_RESET 0x0u
#define USB_EP_TX_ERROR_EP14_BITS 0x30000000u
#define USB_EP_TX_ERROR_EP14_MSB 29u
#define USB_EP_TX_ERROR_EP14_LSB 28u
#define USB_EP_TX_ERROR_EP14_ACCESS "WC"
#define USB_EP_TX_ERROR_EP13_RESET 0x0u
#define USB_EP_TX_ERROR_EP13_BITS 0x0c000000u
#define USB_EP_TX_ERROR_EP13_MSB 27u
#define USB_EP_TX_ERROR_EP13_LSB 26u
#define USB_EP_TX_ERROR_EP13_ACCESS "WC"
#define USB_EP_TX_ERROR_EP12_RESET 0x0u
#define USB_EP_TX_ERROR_EP12_BITS 0x03000000u
#define USB_EP_TX_ERROR_EP12_MSB 25u
#define USB_EP_TX_ERROR_EP12_LSB 24u
#define USB_EP_TX_ERROR_EP12_ACCESS "WC"
#define USB_EP_TX_ERROR_EP11_RESET 0x0u
#define USB_EP_TX_ERROR_EP11_BITS 0x00c00000u
#define USB_EP_TX_ERROR_EP11_MSB 23u
#define USB_EP_TX_ERROR_EP11_LSB 22u
#define USB_EP_TX_ERROR_EP11_ACCESS "WC"
#define USB_EP_TX_ERROR_EP10_RESET 0x0u
#define USB_EP_TX_ERROR_EP10_BITS 0x00300000u
#define USB_EP_TX_ERROR_EP10_MSB 21u
#define USB_EP_TX_ERROR_EP10_LSB 20u
#define USB_EP_TX_ERROR_EP10_ACCESS "WC"
#define USB_EP_TX_ERROR_EP9_RESET 0x0u
#define USB_EP_TX_ERROR_EP9_BITS 0x000c0000u
#define USB_EP_TX_ERROR_EP9_MSB 19u
#define USB_EP_TX_ERROR_EP9_LSB 18u
#define USB_EP_TX_ERROR_EP9_ACCESS "WC"
#define USB_EP_TX_ERROR_EP8_RESET 0x0u
#define USB_EP_TX_ERROR_EP8_BITS 0x00030000u
#define USB_EP_TX_ERROR_EP8_MSB 17u
#define USB_EP_TX_ERROR_EP8_LSB 16u
#define USB_EP_TX_ERROR_EP8_ACCESS "WC"
#define USB_EP_TX_ERROR_EP7_RESET 0x0u
#define USB_EP_TX_ERROR_EP7_BITS 0x0000c000u
#define USB_EP_TX_ERROR_EP7_MSB 15u
#define USB_EP_TX_ERROR_EP7_LSB 14u
#define USB_EP_TX_ERROR_EP7_ACCESS "WC"
#define USB_EP_TX_ERROR_EP6_RESET 0x0u
#define USB_EP_TX_ERROR_EP6_BITS 0x00003000u
#define USB_EP_TX_ERROR_EP6_MSB 13u
#define USB_EP_TX_ERROR_EP6_LSB 12u
#define USB_EP_TX_ERROR_EP6_ACCESS "WC"
#define USB_EP_TX_ERROR_EP5_RESET 0x0u
#define USB_EP_TX_ERROR_EP5_BITS 0x00000c00u
#define USB_EP_TX_ERROR_EP5_MSB 11u
#define USB_EP_TX_ERROR_EP5_LSB 10u
#define USB_EP_TX_ERROR_EP5_ACCESS "WC"
#define USB_EP_TX_ERROR_EP4_RESET 0x0u
#define USB_EP_TX_ERROR_EP4_BITS 0x00000300u
#define USB_EP_TX_ERROR_EP4_MSB 9u
#define USB_EP_TX_ERROR_EP4_LSB 8u
#define USB_EP_TX_ERROR_EP4_ACCESS "WC"
#define USB_EP_TX_ERROR_EP3_RESET 0x0u
#define USB_EP_TX_ERROR_EP3_BITS 0x000000c0u
#define USB_EP_TX_ERROR_EP3_MSB 7u
#define USB_EP_TX_ERROR_EP3_LSB 6u
#define USB_EP_TX_ERROR_EP3_ACCESS "WC"
#define USB_EP_TX_ERROR_EP2_RESET 0x0u
#define USB_EP_TX_ERROR_EP2_BITS 0x00000030u
#define USB_EP_TX_ERROR_EP2_MSB 5u
#define USB_EP_TX_ERROR_EP2_LSB 4u
#define USB_EP_TX_ERROR_EP2_ACCESS "WC"
#define USB_EP_TX_ERROR_EP1_RESET 0x0u
#define USB_EP_TX_ERROR_EP1_BITS 0x0000000cu
#define USB_EP_TX_ERROR_EP1_MSB 3u
#define USB_EP_TX_ERROR_EP1_LSB 2u
#define USB_EP_TX_ERROR_EP1_ACCESS "WC"
#define USB_EP_TX_ERROR_EP0_RESET 0x0u
#define USB_EP_TX_ERROR_EP0_BITS 0x00000003u
#define USB_EP_TX_ERROR_EP0_MSB 1u
#define USB_EP_TX_ERROR_EP0_LSB 0u
#define USB_EP_TX_ERROR_EP0_ACCESS "WC"
#define USB_EP_RX_ERROR_OFFSET 0x00000110u
#define USB_EP_RX_ERROR_BITS 0xffffffffu
#define USB_EP_RX_ERROR_RESET 0x00000000u
#define USB_EP_RX_ERROR_EP15_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP15_SEQ_BITS 0x80000000u
#define USB_EP_RX_ERROR_EP15_SEQ_MSB 31u
#define USB_EP_RX_ERROR_EP15_SEQ_LSB 31u
#define USB_EP_RX_ERROR_EP15_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP15_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP15_TRANSACTION_BITS 0x40000000u
#define USB_EP_RX_ERROR_EP15_TRANSACTION_MSB 30u
#define USB_EP_RX_ERROR_EP15_TRANSACTION_LSB 30u
#define USB_EP_RX_ERROR_EP15_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP14_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP14_SEQ_BITS 0x20000000u
#define USB_EP_RX_ERROR_EP14_SEQ_MSB 29u
#define USB_EP_RX_ERROR_EP14_SEQ_LSB 29u
#define USB_EP_RX_ERROR_EP14_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP14_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP14_TRANSACTION_BITS 0x10000000u
#define USB_EP_RX_ERROR_EP14_TRANSACTION_MSB 28u
#define USB_EP_RX_ERROR_EP14_TRANSACTION_LSB 28u
#define USB_EP_RX_ERROR_EP14_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP13_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP13_SEQ_BITS 0x08000000u
#define USB_EP_RX_ERROR_EP13_SEQ_MSB 27u
#define USB_EP_RX_ERROR_EP13_SEQ_LSB 27u
#define USB_EP_RX_ERROR_EP13_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP13_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP13_TRANSACTION_BITS 0x04000000u
#define USB_EP_RX_ERROR_EP13_TRANSACTION_MSB 26u
#define USB_EP_RX_ERROR_EP13_TRANSACTION_LSB 26u
#define USB_EP_RX_ERROR_EP13_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP12_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP12_SEQ_BITS 0x02000000u
#define USB_EP_RX_ERROR_EP12_SEQ_MSB 25u
#define USB_EP_RX_ERROR_EP12_SEQ_LSB 25u
#define USB_EP_RX_ERROR_EP12_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP12_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP12_TRANSACTION_BITS 0x01000000u
#define USB_EP_RX_ERROR_EP12_TRANSACTION_MSB 24u
#define USB_EP_RX_ERROR_EP12_TRANSACTION_LSB 24u
#define USB_EP_RX_ERROR_EP12_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP11_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP11_SEQ_BITS 0x00800000u
#define USB_EP_RX_ERROR_EP11_SEQ_MSB 23u
#define USB_EP_RX_ERROR_EP11_SEQ_LSB 23u
#define USB_EP_RX_ERROR_EP11_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP11_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP11_TRANSACTION_BITS 0x00400000u
#define USB_EP_RX_ERROR_EP11_TRANSACTION_MSB 22u
#define USB_EP_RX_ERROR_EP11_TRANSACTION_LSB 22u
#define USB_EP_RX_ERROR_EP11_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP10_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP10_SEQ_BITS 0x00200000u
#define USB_EP_RX_ERROR_EP10_SEQ_MSB 21u
#define USB_EP_RX_ERROR_EP10_SEQ_LSB 21u
#define USB_EP_RX_ERROR_EP10_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP10_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP10_TRANSACTION_BITS 0x00100000u
#define USB_EP_RX_ERROR_EP10_TRANSACTION_MSB 20u
#define USB_EP_RX_ERROR_EP10_TRANSACTION_LSB 20u
#define USB_EP_RX_ERROR_EP10_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP9_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP9_SEQ_BITS 0x00080000u
#define USB_EP_RX_ERROR_EP9_SEQ_MSB 19u
#define USB_EP_RX_ERROR_EP9_SEQ_LSB 19u
#define USB_EP_RX_ERROR_EP9_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP9_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP9_TRANSACTION_BITS 0x00040000u
#define USB_EP_RX_ERROR_EP9_TRANSACTION_MSB 18u
#define USB_EP_RX_ERROR_EP9_TRANSACTION_LSB 18u
#define USB_EP_RX_ERROR_EP9_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP8_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP8_SEQ_BITS 0x00020000u
#define USB_EP_RX_ERROR_EP8_SEQ_MSB 17u
#define USB_EP_RX_ERROR_EP8_SEQ_LSB 17u
#define USB_EP_RX_ERROR_EP8_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP8_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP8_TRANSACTION_BITS 0x00010000u
#define USB_EP_RX_ERROR_EP8_TRANSACTION_MSB 16u
#define USB_EP_RX_ERROR_EP8_TRANSACTION_LSB 16u
#define USB_EP_RX_ERROR_EP8_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP7_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP7_SEQ_BITS 0x00008000u
#define USB_EP_RX_ERROR_EP7_SEQ_MSB 15u
#define USB_EP_RX_ERROR_EP7_SEQ_LSB 15u
#define USB_EP_RX_ERROR_EP7_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP7_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP7_TRANSACTION_BITS 0x00004000u
#define USB_EP_RX_ERROR_EP7_TRANSACTION_MSB 14u
#define USB_EP_RX_ERROR_EP7_TRANSACTION_LSB 14u
#define USB_EP_RX_ERROR_EP7_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP6_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP6_SEQ_BITS 0x00002000u
#define USB_EP_RX_ERROR_EP6_SEQ_MSB 13u
#define USB_EP_RX_ERROR_EP6_SEQ_LSB 13u
#define USB_EP_RX_ERROR_EP6_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP6_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP6_TRANSACTION_BITS 0x00001000u
#define USB_EP_RX_ERROR_EP6_TRANSACTION_MSB 12u
#define USB_EP_RX_ERROR_EP6_TRANSACTION_LSB 12u
#define USB_EP_RX_ERROR_EP6_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP5_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP5_SEQ_BITS 0x00000800u
#define USB_EP_RX_ERROR_EP5_SEQ_MSB 11u
#define USB_EP_RX_ERROR_EP5_SEQ_LSB 11u
#define USB_EP_RX_ERROR_EP5_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP5_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP5_TRANSACTION_BITS 0x00000400u
#define USB_EP_RX_ERROR_EP5_TRANSACTION_MSB 10u
#define USB_EP_RX_ERROR_EP5_TRANSACTION_LSB 10u
#define USB_EP_RX_ERROR_EP5_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP4_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP4_SEQ_BITS 0x00000200u
#define USB_EP_RX_ERROR_EP4_SEQ_MSB 9u
#define USB_EP_RX_ERROR_EP4_SEQ_LSB 9u
#define USB_EP_RX_ERROR_EP4_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP4_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP4_TRANSACTION_BITS 0x00000100u
#define USB_EP_RX_ERROR_EP4_TRANSACTION_MSB 8u
#define USB_EP_RX_ERROR_EP4_TRANSACTION_LSB 8u
#define USB_EP_RX_ERROR_EP4_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP3_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP3_SEQ_BITS 0x00000080u
#define USB_EP_RX_ERROR_EP3_SEQ_MSB 7u
#define USB_EP_RX_ERROR_EP3_SEQ_LSB 7u
#define USB_EP_RX_ERROR_EP3_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP3_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP3_TRANSACTION_BITS 0x00000040u
#define USB_EP_RX_ERROR_EP3_TRANSACTION_MSB 6u
#define USB_EP_RX_ERROR_EP3_TRANSACTION_LSB 6u
#define USB_EP_RX_ERROR_EP3_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP2_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP2_SEQ_BITS 0x00000020u
#define USB_EP_RX_ERROR_EP2_SEQ_MSB 5u
