gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
#define USB_EP_RX_ERROR_EP2_SEQ_LSB 5u
#define USB_EP_RX_ERROR_EP2_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP2_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP2_TRANSACTION_BITS 0x00000010u
#define USB_EP_RX_ERROR_EP2_TRANSACTION_MSB 4u
#define USB_EP_RX_ERROR_EP2_TRANSACTION_LSB 4u
#define USB_EP_RX_ERROR_EP2_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP1_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP1_SEQ_BITS 0x00000008u
#define USB_EP_RX_ERROR_EP1_SEQ_MSB 3u
#define USB_EP_RX_ERROR_EP1_SEQ_LSB 3u
#define USB_EP_RX_ERROR_EP1_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP1_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP1_TRANSACTION_BITS 0x00000004u
#define USB_EP_RX_ERROR_EP1_TRANSACTION_MSB 2u
#define USB_EP_RX_ERROR_EP1_TRANSACTION_LSB 2u
#define USB_EP_RX_ERROR_EP1_TRANSACTION_ACCESS "WC"
#define USB_EP_RX_ERROR_EP0_SEQ_RESET 0x0u
#define USB_EP_RX_ERROR_EP0_SEQ_BITS 0x00000002u
#define USB_EP_RX_ERROR_EP0_SEQ_MSB 1u
#define USB_EP_RX_ERROR_EP0_SEQ_LSB 1u
#define USB_EP_RX_ERROR_EP0_SEQ_ACCESS "WC"
#define USB_EP_RX_ERROR_EP0_TRANSACTION_RESET 0x0u
#define USB_EP_RX_ERROR_EP0_TRANSACTION_BITS 0x00000001u
#define USB_EP_RX_ERROR_EP0_TRANSACTION_MSB 0u
#define USB_EP_RX_ERROR_EP0_TRANSACTION_LSB 0u
#define USB_EP_RX_ERROR_EP0_TRANSACTION_ACCESS "WC"
#define USB_DEV_SM_WATCHDOG_OFFSET 0x00000114u
#define USB_DEV_SM_WATCHDOG_BITS 0x001fffffu
#define USB_DEV_SM_WATCHDOG_RESET 0x00000000u
#define USB_DEV_SM_WATCHDOG_FIRED_RESET 0x0u
#define USB_DEV_SM_WATCHDOG_FIRED_BITS 0x00100000u
#define USB_DEV_SM_WATCHDOG_FIRED_MSB 20u
#define USB_DEV_SM_WATCHDOG_FIRED_LSB 20u
#define USB_DEV_SM_WATCHDOG_FIRED_ACCESS "WC"
#define USB_DEV_SM_WATCHDOG_RESET_RESET 0x0u
#define USB_DEV_SM_WATCHDOG_RESET_BITS 0x00080000u
#define USB_DEV_SM_WATCHDOG_RESET_MSB 19u
#define USB_DEV_SM_WATCHDOG_RESET_LSB 19u
#define USB_DEV_SM_WATCHDOG_RESET_ACCESS "RW"
#define USB_DEV_SM_WATCHDOG_ENABLE_RESET 0x0u
#define USB_DEV_SM_WATCHDOG_ENABLE_BITS 0x00040000u
#define USB_DEV_SM_WATCHDOG_ENABLE_MSB 18u
#define USB_DEV_SM_WATCHDOG_ENABLE_LSB 18u
#define USB_DEV_SM_WATCHDOG_ENABLE_ACCESS "RW"
#define USB_DEV_SM_WATCHDOG_LIMIT_RESET 0x00000u
#define USB_DEV_SM_WATCHDOG_LIMIT_BITS 0x0003ffffu
#define USB_DEV_SM_WATCHDOG_LIMIT_MSB 17u
#define USB_DEV_SM_WATCHDOG_LIMIT_LSB 0u
#define USB_DEV_SM_WATCHDOG_LIMIT_ACCESS "RW"
#define USB_NUM_ENDPOINTS 16
#define USB_MAX_ENDPOINTS USB_NUM_ENDPOINTS
#define USB_HOST_INTERRUPT_ENDPOINTS (USB_NUM_ENDPOINTS - 1)
#define USB_BUF_CTRL_FULL 0x00008000u
#define USB_BUF_CTRL_LAST 0x00004000u
#define USB_BUF_CTRL_DATA0_PID 0x00000000u
#define USB_BUF_CTRL_DATA1_PID 0x00002000u
#define USB_BUF_CTRL_SEL 0x00001000u
#define USB_BUF_CTRL_STALL 0x00000800u
#define USB_BUF_CTRL_AVAIL 0x00000400u
#define USB_BUF_CTRL_LEN_MASK 0x000003FFu
#define USB_BUF_CTRL_LEN_LSB 0
#define EP_CTRL_ENABLE_BITS (1u << 31u)
#define EP_CTRL_DOUBLE_BUFFERED_BITS (1u << 30)
#define EP_CTRL_INTERRUPT_PER_BUFFER (1u << 29)
#define EP_CTRL_INTERRUPT_PER_DOUBLE_BUFFER (1u << 28)
#define EP_CTRL_INTERRUPT_ON_NAK (1u << 16)
#define EP_CTRL_INTERRUPT_ON_STALL (1u << 17)
#define EP_CTRL_BUFFER_TYPE_LSB 26u
#define EP_CTRL_HOST_INTERRUPT_INTERVAL_LSB 16u
#define USB_DPRAM_SIZE 4096u
#define USB_DPRAM_MAX USB_DPRAM_SIZE
#define USB_MAX_ISO_PACKET_SIZE 1023
#define USB_MAX_PACKET_SIZE 64
typedef struct {
    volatile uint8_t setup_packet[8];
    struct usb_device_dpram_ep_ctrl {
        io_rw_32 in;
        io_rw_32 out;
    } ep_ctrl[16 - 1];
    struct usb_device_dpram_ep_buf_ctrl {
        io_rw_32 in;
        io_rw_32 out;
    } ep_buf_ctrl[16];
    uint8_t ep0_buf_a[0x40];
    uint8_t ep0_buf_b[0x40];
    uint8_t epx_data[4096u - 0x180];
} usb_device_dpram_t;
_Static_assert(sizeof(usb_device_dpram_t) == 4096u, "");
_Static_assert(__builtin_offsetof (usb_device_dpram_t, epx_data) == 0x180, "");
typedef struct {
    volatile uint8_t setup_packet[8];
    struct usb_host_dpram_ep_ctrl {
        io_rw_32 ctrl;
        io_rw_32 spare;
    } int_ep_ctrl[(16 - 1)];
    io_rw_32 epx_buf_ctrl;
    io_rw_32 _spare0;
    struct usb_host_dpram_ep_buf_ctrl {
        io_rw_32 ctrl;
        io_rw_32 spare;
    } int_ep_buffer_ctrl[(16 - 1)];
    io_rw_32 epx_ctrl;
    uint8_t _spare1[124];
    uint8_t epx_data[4096u - 0x180];
} usb_host_dpram_t;
_Static_assert(sizeof(usb_host_dpram_t) == 4096u, "");
_Static_assert(__builtin_offsetof (usb_host_dpram_t, epx_data) == 0x180, "");
static usb_device_dpram_t * const usb_dpram = (usb_device_dpram_t *)USBCTRL_DPRAM_BASE; // ORIGINAL: #define usb_dpram ((usb_device_dpram_t *)USBCTRL_DPRAM_BASE)
static usb_host_dpram_t * const usbh_dpram = (usb_host_dpram_t *)USBCTRL_DPRAM_BASE; // ORIGINAL: #define usbh_dpram ((usb_host_dpram_t *)USBCTRL_DPRAM_BASE)
_Static_assert( (16 - 1) == 15, "");
#define _HARDWARE_STRUCTS_TRNG_H 
#define _HARDWARE_REGS_TRNG_H 
#define TRNG_RNG_IMR_OFFSET 0x00000100u
#define TRNG_RNG_IMR_BITS 0xffffffffu
#define TRNG_RNG_IMR_RESET 0x0000000fu
#define TRNG_RNG_IMR_RESERVED_RESET 0x0000000u
#define TRNG_RNG_IMR_RESERVED_BITS 0xfffffff0u
#define TRNG_RNG_IMR_RESERVED_MSB 31u
#define TRNG_RNG_IMR_RESERVED_LSB 4u
#define TRNG_RNG_IMR_RESERVED_ACCESS "RO"
#define TRNG_RNG_IMR_VN_ERR_INT_MASK_RESET 0x1u
#define TRNG_RNG_IMR_VN_ERR_INT_MASK_BITS 0x00000008u
#define TRNG_RNG_IMR_VN_ERR_INT_MASK_MSB 3u
#define TRNG_RNG_IMR_VN_ERR_INT_MASK_LSB 3u
#define TRNG_RNG_IMR_VN_ERR_INT_MASK_ACCESS "RW"
#define TRNG_RNG_IMR_CRNGT_ERR_INT_MASK_RESET 0x1u
#define TRNG_RNG_IMR_CRNGT_ERR_INT_MASK_BITS 0x00000004u
#define TRNG_RNG_IMR_CRNGT_ERR_INT_MASK_MSB 2u
#define TRNG_RNG_IMR_CRNGT_ERR_INT_MASK_LSB 2u
#define TRNG_RNG_IMR_CRNGT_ERR_INT_MASK_ACCESS "RW"
#define TRNG_RNG_IMR_AUTOCORR_ERR_INT_MASK_RESET 0x1u
#define TRNG_RNG_IMR_AUTOCORR_ERR_INT_MASK_BITS 0x00000002u
#define TRNG_RNG_IMR_AUTOCORR_ERR_INT_MASK_MSB 1u
#define TRNG_RNG_IMR_AUTOCORR_ERR_INT_MASK_LSB 1u
#define TRNG_RNG_IMR_AUTOCORR_ERR_INT_MASK_ACCESS "RW"
#define TRNG_RNG_IMR_EHR_VALID_INT_MASK_RESET 0x1u
#define TRNG_RNG_IMR_EHR_VALID_INT_MASK_BITS 0x00000001u
#define TRNG_RNG_IMR_EHR_VALID_INT_MASK_MSB 0u
#define TRNG_RNG_IMR_EHR_VALID_INT_MASK_LSB 0u
#define TRNG_RNG_IMR_EHR_VALID_INT_MASK_ACCESS "RW"
#define TRNG_RNG_ISR_OFFSET 0x00000104u
#define TRNG_RNG_ISR_BITS 0xffffffffu
#define TRNG_RNG_ISR_RESET 0x00000000u
#define TRNG_RNG_ISR_RESERVED_RESET 0x0000000u
#define TRNG_RNG_ISR_RESERVED_BITS 0xfffffff0u
#define TRNG_RNG_ISR_RESERVED_MSB 31u
#define TRNG_RNG_ISR_RESERVED_LSB 4u
#define TRNG_RNG_ISR_RESERVED_ACCESS "RO"
#define TRNG_RNG_ISR_VN_ERR_RESET 0x0u
#define TRNG_RNG_ISR_VN_ERR_BITS 0x00000008u
#define TRNG_RNG_ISR_VN_ERR_MSB 3u
#define TRNG_RNG_ISR_VN_ERR_LSB 3u
#define TRNG_RNG_ISR_VN_ERR_ACCESS "RO"
#define TRNG_RNG_ISR_CRNGT_ERR_RESET 0x0u
#define TRNG_RNG_ISR_CRNGT_ERR_BITS 0x00000004u
#define TRNG_RNG_ISR_CRNGT_ERR_MSB 2u
#define TRNG_RNG_ISR_CRNGT_ERR_LSB 2u
#define TRNG_RNG_ISR_CRNGT_ERR_ACCESS "RO"
#define TRNG_RNG_ISR_AUTOCORR_ERR_RESET 0x0u
#define TRNG_RNG_ISR_AUTOCORR_ERR_BITS 0x00000002u
#define TRNG_RNG_ISR_AUTOCORR_ERR_MSB 1u
#define TRNG_RNG_ISR_AUTOCORR_ERR_LSB 1u
#define TRNG_RNG_ISR_AUTOCORR_ERR_ACCESS "RO"
#define TRNG_RNG_ISR_EHR_VALID_RESET 0x0u
#define TRNG_RNG_ISR_EHR_VALID_BITS 0x00000001u
#define TRNG_RNG_ISR_EHR_VALID_MSB 0u
#define TRNG_RNG_ISR_EHR_VALID_LSB 0u
#define TRNG_RNG_ISR_EHR_VALID_ACCESS "RO"
#define TRNG_RNG_ICR_OFFSET 0x00000108u
#define TRNG_RNG_ICR_BITS 0xffffffffu
#define TRNG_RNG_ICR_RESET 0x00000000u
#define TRNG_RNG_ICR_RESERVED_RESET 0x0000000u
#define TRNG_RNG_ICR_RESERVED_BITS 0xfffffff0u
#define TRNG_RNG_ICR_RESERVED_MSB 31u
#define TRNG_RNG_ICR_RESERVED_LSB 4u
#define TRNG_RNG_ICR_RESERVED_ACCESS "RO"
#define TRNG_RNG_ICR_VN_ERR_RESET 0x0u
#define TRNG_RNG_ICR_VN_ERR_BITS 0x00000008u
#define TRNG_RNG_ICR_VN_ERR_MSB 3u
#define TRNG_RNG_ICR_VN_ERR_LSB 3u
#define TRNG_RNG_ICR_VN_ERR_ACCESS "RW"
#define TRNG_RNG_ICR_CRNGT_ERR_RESET 0x0u
#define TRNG_RNG_ICR_CRNGT_ERR_BITS 0x00000004u
#define TRNG_RNG_ICR_CRNGT_ERR_MSB 2u
#define TRNG_RNG_ICR_CRNGT_ERR_LSB 2u
#define TRNG_RNG_ICR_CRNGT_ERR_ACCESS "RW"
#define TRNG_RNG_ICR_AUTOCORR_ERR_RESET 0x0u
#define TRNG_RNG_ICR_AUTOCORR_ERR_BITS 0x00000002u
#define TRNG_RNG_ICR_AUTOCORR_ERR_MSB 1u
#define TRNG_RNG_ICR_AUTOCORR_ERR_LSB 1u
#define TRNG_RNG_ICR_AUTOCORR_ERR_ACCESS "RW"
#define TRNG_RNG_ICR_EHR_VALID_RESET 0x0u
#define TRNG_RNG_ICR_EHR_VALID_BITS 0x00000001u
#define TRNG_RNG_ICR_EHR_VALID_MSB 0u
#define TRNG_RNG_ICR_EHR_VALID_LSB 0u
#define TRNG_RNG_ICR_EHR_VALID_ACCESS "RW"
#define TRNG_TRNG_CONFIG_OFFSET 0x0000010cu
#define TRNG_TRNG_CONFIG_BITS 0xffffffffu
#define TRNG_TRNG_CONFIG_RESET 0x00000000u
#define TRNG_TRNG_CONFIG_RESERVED_RESET 0x00000000u
#define TRNG_TRNG_CONFIG_RESERVED_BITS 0xfffffffcu
#define TRNG_TRNG_CONFIG_RESERVED_MSB 31u
#define TRNG_TRNG_CONFIG_RESERVED_LSB 2u
#define TRNG_TRNG_CONFIG_RESERVED_ACCESS "RO"
#define TRNG_TRNG_CONFIG_RND_SRC_SEL_RESET 0x0u
#define TRNG_TRNG_CONFIG_RND_SRC_SEL_BITS 0x00000003u
#define TRNG_TRNG_CONFIG_RND_SRC_SEL_MSB 1u
#define TRNG_TRNG_CONFIG_RND_SRC_SEL_LSB 0u
#define TRNG_TRNG_CONFIG_RND_SRC_SEL_ACCESS "RW"
#define TRNG_TRNG_VALID_OFFSET 0x00000110u
#define TRNG_TRNG_VALID_BITS 0xffffffffu
#define TRNG_TRNG_VALID_RESET 0x00000000u
#define TRNG_TRNG_VALID_RESERVED_RESET 0x00000000u
#define TRNG_TRNG_VALID_RESERVED_BITS 0xfffffffeu
#define TRNG_TRNG_VALID_RESERVED_MSB 31u
#define TRNG_TRNG_VALID_RESERVED_LSB 1u
#define TRNG_TRNG_VALID_RESERVED_ACCESS "RO"
#define TRNG_TRNG_VALID_EHR_VALID_RESET 0x0u
#define TRNG_TRNG_VALID_EHR_VALID_BITS 0x00000001u
#define TRNG_TRNG_VALID_EHR_VALID_MSB 0u
#define TRNG_TRNG_VALID_EHR_VALID_LSB 0u
#define TRNG_TRNG_VALID_EHR_VALID_ACCESS "RO"
#define TRNG_EHR_DATA0_OFFSET 0x00000114u
#define TRNG_EHR_DATA0_BITS 0xffffffffu
#define TRNG_EHR_DATA0_RESET 0x00000000u
#define TRNG_EHR_DATA0_MSB 31u
#define TRNG_EHR_DATA0_LSB 0u
#define TRNG_EHR_DATA0_ACCESS "RO"
#define TRNG_EHR_DATA1_OFFSET 0x00000118u
#define TRNG_EHR_DATA1_BITS 0xffffffffu
#define TRNG_EHR_DATA1_RESET 0x00000000u
#define TRNG_EHR_DATA1_MSB 31u
#define TRNG_EHR_DATA1_LSB 0u
#define TRNG_EHR_DATA1_ACCESS "RO"
#define TRNG_EHR_DATA2_OFFSET 0x0000011cu
#define TRNG_EHR_DATA2_BITS 0xffffffffu
#define TRNG_EHR_DATA2_RESET 0x00000000u
#define TRNG_EHR_DATA2_MSB 31u
#define TRNG_EHR_DATA2_LSB 0u
#define TRNG_EHR_DATA2_ACCESS "RO"
#define TRNG_EHR_DATA3_OFFSET 0x00000120u
#define TRNG_EHR_DATA3_BITS 0xffffffffu
#define TRNG_EHR_DATA3_RESET 0x00000000u
#define TRNG_EHR_DATA3_MSB 31u
#define TRNG_EHR_DATA3_LSB 0u
#define TRNG_EHR_DATA3_ACCESS "RO"
#define TRNG_EHR_DATA4_OFFSET 0x00000124u
#define TRNG_EHR_DATA4_BITS 0xffffffffu
#define TRNG_EHR_DATA4_RESET 0x00000000u
#define TRNG_EHR_DATA4_MSB 31u
#define TRNG_EHR_DATA4_LSB 0u
#define TRNG_EHR_DATA4_ACCESS "RO"
#define TRNG_EHR_DATA5_OFFSET 0x00000128u
#define TRNG_EHR_DATA5_BITS 0xffffffffu
#define TRNG_EHR_DATA5_RESET 0x00000000u
#define TRNG_EHR_DATA5_MSB 31u
#define TRNG_EHR_DATA5_LSB 0u
#define TRNG_EHR_DATA5_ACCESS "RO"
#define TRNG_RND_SOURCE_ENABLE_OFFSET 0x0000012cu
#define TRNG_RND_SOURCE_ENABLE_BITS 0xffffffffu
#define TRNG_RND_SOURCE_ENABLE_RESET 0x00000000u
#define TRNG_RND_SOURCE_ENABLE_RESERVED_RESET 0x00000000u
#define TRNG_RND_SOURCE_ENABLE_RESERVED_BITS 0xfffffffeu
#define TRNG_RND_SOURCE_ENABLE_RESERVED_MSB 31u
#define TRNG_RND_SOURCE_ENABLE_RESERVED_LSB 1u
#define TRNG_RND_SOURCE_ENABLE_RESERVED_ACCESS "RO"
#define TRNG_RND_SOURCE_ENABLE_RND_SRC_EN_RESET 0x0u
#define TRNG_RND_SOURCE_ENABLE_RND_SRC_EN_BITS 0x00000001u
#define TRNG_RND_SOURCE_ENABLE_RND_SRC_EN_MSB 0u
#define TRNG_RND_SOURCE_ENABLE_RND_SRC_EN_LSB 0u
#define TRNG_RND_SOURCE_ENABLE_RND_SRC_EN_ACCESS "RW"
#define TRNG_SAMPLE_CNT1_OFFSET 0x00000130u
#define TRNG_SAMPLE_CNT1_BITS 0xffffffffu
#define TRNG_SAMPLE_CNT1_RESET 0x0000ffffu
#define TRNG_SAMPLE_CNT1_SAMPLE_CNTR1_RESET 0x0000ffffu
#define TRNG_SAMPLE_CNT1_SAMPLE_CNTR1_BITS 0xffffffffu
#define TRNG_SAMPLE_CNT1_SAMPLE_CNTR1_MSB 31u
#define TRNG_SAMPLE_CNT1_SAMPLE_CNTR1_LSB 0u
#define TRNG_SAMPLE_CNT1_SAMPLE_CNTR1_ACCESS "RW"
#define TRNG_AUTOCORR_STATISTIC_OFFSET 0x00000134u
#define TRNG_AUTOCORR_STATISTIC_BITS 0xffffffffu
#define TRNG_AUTOCORR_STATISTIC_RESET 0x00000000u
#define TRNG_AUTOCORR_STATISTIC_RESERVED_RESET 0x000u
#define TRNG_AUTOCORR_STATISTIC_RESERVED_BITS 0xffc00000u
#define TRNG_AUTOCORR_STATISTIC_RESERVED_MSB 31u
#define TRNG_AUTOCORR_STATISTIC_RESERVED_LSB 22u
#define TRNG_AUTOCORR_STATISTIC_RESERVED_ACCESS "RO"
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_FAILS_RESET 0x00u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_FAILS_BITS 0x003fc000u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_FAILS_MSB 21u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_FAILS_LSB 14u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_FAILS_ACCESS "RW"
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_TRYS_RESET 0x0000u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_TRYS_BITS 0x00003fffu
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_TRYS_MSB 13u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_TRYS_LSB 0u
#define TRNG_AUTOCORR_STATISTIC_AUTOCORR_TRYS_ACCESS "RW"
#define TRNG_TRNG_DEBUG_CONTROL_OFFSET 0x00000138u
#define TRNG_TRNG_DEBUG_CONTROL_BITS 0x0000000fu
#define TRNG_TRNG_DEBUG_CONTROL_RESET 0x00000000u
#define TRNG_TRNG_DEBUG_CONTROL_AUTO_CORRELATE_BYPASS_RESET 0x0u
#define TRNG_TRNG_DEBUG_CONTROL_AUTO_CORRELATE_BYPASS_BITS 0x00000008u
#define TRNG_TRNG_DEBUG_CONTROL_AUTO_CORRELATE_BYPASS_MSB 3u
#define TRNG_TRNG_DEBUG_CONTROL_AUTO_CORRELATE_BYPASS_LSB 3u
#define TRNG_TRNG_DEBUG_CONTROL_AUTO_CORRELATE_BYPASS_ACCESS "RW"
#define TRNG_TRNG_DEBUG_CONTROL_TRNG_CRNGT_BYPASS_RESET 0x0u
#define TRNG_TRNG_DEBUG_CONTROL_TRNG_CRNGT_BYPASS_BITS 0x00000004u
#define TRNG_TRNG_DEBUG_CONTROL_TRNG_CRNGT_BYPASS_MSB 2u
#define TRNG_TRNG_DEBUG_CONTROL_TRNG_CRNGT_BYPASS_LSB 2u
#define TRNG_TRNG_DEBUG_CONTROL_TRNG_CRNGT_BYPASS_ACCESS "RW"
#define TRNG_TRNG_DEBUG_CONTROL_VNC_BYPASS_RESET 0x0u
#define TRNG_TRNG_DEBUG_CONTROL_VNC_BYPASS_BITS 0x00000002u
#define TRNG_TRNG_DEBUG_CONTROL_VNC_BYPASS_MSB 1u
#define TRNG_TRNG_DEBUG_CONTROL_VNC_BYPASS_LSB 1u
#define TRNG_TRNG_DEBUG_CONTROL_VNC_BYPASS_ACCESS "RW"
#define TRNG_TRNG_DEBUG_CONTROL_RESERVED_RESET 0x0u
#define TRNG_TRNG_DEBUG_CONTROL_RESERVED_BITS 0x00000001u
#define TRNG_TRNG_DEBUG_CONTROL_RESERVED_MSB 0u
#define TRNG_TRNG_DEBUG_CONTROL_RESERVED_LSB 0u
#define TRNG_TRNG_DEBUG_CONTROL_RESERVED_ACCESS "RO"
#define TRNG_TRNG_SW_RESET_OFFSET 0x00000140u
#define TRNG_TRNG_SW_RESET_BITS 0xffffffffu
#define TRNG_TRNG_SW_RESET_RESET 0x00000000u
#define TRNG_TRNG_SW_RESET_RESERVED_RESET 0x00000000u
#define TRNG_TRNG_SW_RESET_RESERVED_BITS 0xfffffffeu
#define TRNG_TRNG_SW_RESET_RESERVED_MSB 31u
#define TRNG_TRNG_SW_RESET_RESERVED_LSB 1u
#define TRNG_TRNG_SW_RESET_RESERVED_ACCESS "RO"
#define TRNG_TRNG_SW_RESET_TRNG_SW_RESET_RESET 0x0u
#define TRNG_TRNG_SW_RESET_TRNG_SW_RESET_BITS 0x00000001u
#define TRNG_TRNG_SW_RESET_TRNG_SW_RESET_MSB 0u
#define TRNG_TRNG_SW_RESET_TRNG_SW_RESET_LSB 0u
#define TRNG_TRNG_SW_RESET_TRNG_SW_RESET_ACCESS "RW"
#define TRNG_RNG_DEBUG_EN_INPUT_OFFSET 0x000001b4u
#define TRNG_RNG_DEBUG_EN_INPUT_BITS 0xffffffffu
#define TRNG_RNG_DEBUG_EN_INPUT_RESET 0x00000000u
#define TRNG_RNG_DEBUG_EN_INPUT_RESERVED_RESET 0x00000000u
#define TRNG_RNG_DEBUG_EN_INPUT_RESERVED_BITS 0xfffffffeu
#define TRNG_RNG_DEBUG_EN_INPUT_RESERVED_MSB 31u
#define TRNG_RNG_DEBUG_EN_INPUT_RESERVED_LSB 1u
#define TRNG_RNG_DEBUG_EN_INPUT_RESERVED_ACCESS "RO"
#define TRNG_RNG_DEBUG_EN_INPUT_RNG_DEBUG_EN_RESET 0x0u
#define TRNG_RNG_DEBUG_EN_INPUT_RNG_DEBUG_EN_BITS 0x00000001u
#define TRNG_RNG_DEBUG_EN_INPUT_RNG_DEBUG_EN_MSB 0u
#define TRNG_RNG_DEBUG_EN_INPUT_RNG_DEBUG_EN_LSB 0u
#define TRNG_RNG_DEBUG_EN_INPUT_RNG_DEBUG_EN_ACCESS "RW"
#define TRNG_TRNG_BUSY_OFFSET 0x000001b8u
#define TRNG_TRNG_BUSY_BITS 0xffffffffu
#define TRNG_TRNG_BUSY_RESET 0x00000000u
#define TRNG_TRNG_BUSY_RESERVED_RESET 0x00000000u
#define TRNG_TRNG_BUSY_RESERVED_BITS 0xfffffffeu
#define TRNG_TRNG_BUSY_RESERVED_MSB 31u
#define TRNG_TRNG_BUSY_RESERVED_LSB 1u
#define TRNG_TRNG_BUSY_RESERVED_ACCESS "RO"
#define TRNG_TRNG_BUSY_TRNG_BUSY_RESET 0x0u
#define TRNG_TRNG_BUSY_TRNG_BUSY_BITS 0x00000001u
#define TRNG_TRNG_BUSY_TRNG_BUSY_MSB 0u
#define TRNG_TRNG_BUSY_TRNG_BUSY_LSB 0u
#define TRNG_TRNG_BUSY_TRNG_BUSY_ACCESS "RO"
#define TRNG_RST_BITS_COUNTER_OFFSET 0x000001bcu
#define TRNG_RST_BITS_COUNTER_BITS 0xffffffffu
#define TRNG_RST_BITS_COUNTER_RESET 0x00000000u
#define TRNG_RST_BITS_COUNTER_RESERVED_RESET 0x00000000u
#define TRNG_RST_BITS_COUNTER_RESERVED_BITS 0xfffffffeu
#define TRNG_RST_BITS_COUNTER_RESERVED_MSB 31u
#define TRNG_RST_BITS_COUNTER_RESERVED_LSB 1u
#define TRNG_RST_BITS_COUNTER_RESERVED_ACCESS "RO"
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_RESET 0x0u
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_BITS 0x00000001u
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_MSB 0u
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_LSB 0u
#define TRNG_RST_BITS_COUNTER_RST_BITS_COUNTER_ACCESS "RW"
#define TRNG_RNG_VERSION_OFFSET 0x000001c0u
#define TRNG_RNG_VERSION_BITS 0xffffffffu
#define TRNG_RNG_VERSION_RESET 0x00000000u
#define TRNG_RNG_VERSION_RESERVED_RESET 0x000000u
#define TRNG_RNG_VERSION_RESERVED_BITS 0xffffff00u
#define TRNG_RNG_VERSION_RESERVED_MSB 31u
#define TRNG_RNG_VERSION_RESERVED_LSB 8u
#define TRNG_RNG_VERSION_RESERVED_ACCESS "RO"
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_RESET 0x0u
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_BITS 0x00000080u
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_MSB 7u
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_LSB 7u
#define TRNG_RNG_VERSION_RNG_USE_5_SBOXES_ACCESS "RO"
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_RESET 0x0u
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_BITS 0x00000040u
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_MSB 6u
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_LSB 6u
#define TRNG_RNG_VERSION_RESEEDING_EXISTS_ACCESS "RO"
#define TRNG_RNG_VERSION_KAT_EXISTS_RESET 0x0u
#define TRNG_RNG_VERSION_KAT_EXISTS_BITS 0x00000020u
#define TRNG_RNG_VERSION_KAT_EXISTS_MSB 5u
#define TRNG_RNG_VERSION_KAT_EXISTS_LSB 5u
#define TRNG_RNG_VERSION_KAT_EXISTS_ACCESS "RO"
#define TRNG_RNG_VERSION_PRNG_EXISTS_RESET 0x0u
#define TRNG_RNG_VERSION_PRNG_EXISTS_BITS 0x00000010u
#define TRNG_RNG_VERSION_PRNG_EXISTS_MSB 4u
#define TRNG_RNG_VERSION_PRNG_EXISTS_LSB 4u
#define TRNG_RNG_VERSION_PRNG_EXISTS_ACCESS "RO"
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_RESET 0x0u
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_BITS 0x00000008u
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_MSB 3u
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_LSB 3u
#define TRNG_RNG_VERSION_TRNG_TESTS_BYPASS_EN_ACCESS "RO"
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_RESET 0x0u
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_BITS 0x00000004u
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_MSB 2u
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_LSB 2u
#define TRNG_RNG_VERSION_AUTOCORR_EXISTS_ACCESS "RO"
#define TRNG_RNG_VERSION_CRNGT_EXISTS_RESET 0x0u
#define TRNG_RNG_VERSION_CRNGT_EXISTS_BITS 0x00000002u
#define TRNG_RNG_VERSION_CRNGT_EXISTS_MSB 1u
#define TRNG_RNG_VERSION_CRNGT_EXISTS_LSB 1u
#define TRNG_RNG_VERSION_CRNGT_EXISTS_ACCESS "RO"
#define TRNG_RNG_VERSION_EHR_WIDTH_192_RESET 0x0u
#define TRNG_RNG_VERSION_EHR_WIDTH_192_BITS 0x00000001u
#define TRNG_RNG_VERSION_EHR_WIDTH_192_MSB 0u
#define TRNG_RNG_VERSION_EHR_WIDTH_192_LSB 0u
#define TRNG_RNG_VERSION_EHR_WIDTH_192_ACCESS "RO"
#define TRNG_RNG_BIST_CNTR_0_OFFSET 0x000001e0u
#define TRNG_RNG_BIST_CNTR_0_BITS 0xffffffffu
#define TRNG_RNG_BIST_CNTR_0_RESET 0x00000000u
#define TRNG_RNG_BIST_CNTR_0_RESERVED_RESET 0x000u
#define TRNG_RNG_BIST_CNTR_0_RESERVED_BITS 0xffc00000u
#define TRNG_RNG_BIST_CNTR_0_RESERVED_MSB 31u
#define TRNG_RNG_BIST_CNTR_0_RESERVED_LSB 22u
#define TRNG_RNG_BIST_CNTR_0_RESERVED_ACCESS "RO"
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_RESET 0x000000u
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_BITS 0x003fffffu
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_MSB 21u
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_LSB 0u
#define TRNG_RNG_BIST_CNTR_0_ROSC_CNTR_VAL_ACCESS "RO"
#define TRNG_RNG_BIST_CNTR_1_OFFSET 0x000001e4u
#define TRNG_RNG_BIST_CNTR_1_BITS 0xffffffffu
#define TRNG_RNG_BIST_CNTR_1_RESET 0x00000000u
#define TRNG_RNG_BIST_CNTR_1_RESERVED_RESET 0x000u
#define TRNG_RNG_BIST_CNTR_1_RESERVED_BITS 0xffc00000u
#define TRNG_RNG_BIST_CNTR_1_RESERVED_MSB 31u
#define TRNG_RNG_BIST_CNTR_1_RESERVED_LSB 22u
#define TRNG_RNG_BIST_CNTR_1_RESERVED_ACCESS "RO"
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_RESET 0x000000u
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_BITS 0x003fffffu
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_MSB 21u
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_LSB 0u
#define TRNG_RNG_BIST_CNTR_1_ROSC_CNTR_VAL_ACCESS "RO"
#define TRNG_RNG_BIST_CNTR_2_OFFSET 0x000001e8u
#define TRNG_RNG_BIST_CNTR_2_BITS 0xffffffffu
#define TRNG_RNG_BIST_CNTR_2_RESET 0x00000000u
#define TRNG_RNG_BIST_CNTR_2_RESERVED_RESET 0x000u
#define TRNG_RNG_BIST_CNTR_2_RESERVED_BITS 0xffc00000u
#define TRNG_RNG_BIST_CNTR_2_RESERVED_MSB 31u
#define TRNG_RNG_BIST_CNTR_2_RESERVED_LSB 22u
#define TRNG_RNG_BIST_CNTR_2_RESERVED_ACCESS "RO"
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_RESET 0x000000u
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_BITS 0x003fffffu
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_MSB 21u
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_LSB 0u
#define TRNG_RNG_BIST_CNTR_2_ROSC_CNTR_VAL_ACCESS "RO"
typedef struct {
   
    io_rw_32 rng_imr;
   
