gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_ro_32 rng_isr;
   
    io_rw_32 rng_icr;
   
    io_rw_32 trng_config;
   
    io_ro_32 trng_valid;
   
    io_ro_32 ehr_data[6];
   
    io_rw_32 rnd_source_enable;
   
    io_rw_32 sample_cnt1;
   
    io_rw_32 autocorr_statistic;
   
    io_rw_32 trng_debug_control;
    uint32_t _pad0;
   
    io_rw_32 trng_sw_reset;
    uint32_t _pad1[28];
   
    io_rw_32 rng_debug_en_input;
   
    io_ro_32 trng_busy;
   
    io_rw_32 rst_bits_counter;
   
    io_ro_32 rng_version;
    uint32_t _pad2[7];
   
    io_ro_32 rng_bist_cntr[3];
} trng_hw_t;
static trng_hw_t * const trng_hw = (trng_hw_t *)(TRNG_BASE + TRNG_RNG_IMR_OFFSET); // ORIGINAL: #define trng_hw ((trng_hw_t *)(TRNG_BASE + TRNG_RNG_IMR_OFFSET))
_Static_assert(sizeof (trng_hw_t) == 0x00ec, "");
#define _HARDWARE_STRUCTS_TMDS_ENCODE_H 
typedef struct {
   
    io_rw_32 tmds_ctrl;
   
    io_wo_32 tmds_wdata;
   
    io_ro_32 tmds_peek_single;
   
    io_ro_32 tmds_pop_single;
   
    io_ro_32 tmds_peek_double_l0;
   
    io_ro_32 tmds_pop_double_l0;
   
    io_ro_32 tmds_peek_double_l1;
   
    io_ro_32 tmds_pop_double_l1;
   
    io_ro_32 tmds_peek_double_l2;
   
    io_ro_32 tmds_pop_double_l2;
} tmds_encode_hw_t;
static tmds_encode_hw_t * const tmds_encode_hw = (tmds_encode_hw_t *)(SIO_BASE + SIO_TMDS_CTRL_OFFSET); // ORIGINAL: #define tmds_encode_hw ((tmds_encode_hw_t *)(SIO_BASE + SIO_TMDS_CTRL_OFFSET))
static tmds_encode_hw_t * const tmds_encode_ns_hw = (tmds_encode_hw_t *)(SIO_NONSEC_BASE + SIO_TMDS_CTRL_OFFSET); // ORIGINAL: #define tmds_encode_ns_hw ((tmds_encode_hw_t *)(SIO_NONSEC_BASE + SIO_TMDS_CTRL_OFFSET))
_Static_assert(sizeof (tmds_encode_hw_t) == 0x0028, "");
static __typeof__(pads_bank0_hw) const padsbank0_hw = pads_bank0_hw; // ORIGINAL: #define padsbank0_hw pads_bank0_hw
#define _HARDWARE_STRUCTS_USB_H 
typedef struct {
   
    io_rw_32 dev_addr_ctrl;
   
    io_rw_32 int_ep_addr_ctrl[15];
   
    io_rw_32 main_ctrl;
   
    io_wo_32 sof_wr;
   
    io_ro_32 sof_rd;
   
    io_rw_32 sie_ctrl;
   
    io_rw_32 sie_status;
   
    io_rw_32 int_ep_ctrl;
   
    io_rw_32 buf_status;
   
    io_ro_32 buf_cpu_should_handle;
   
    io_rw_32 abort;
   
    io_rw_32 abort_done;
   
    io_rw_32 ep_stall_arm;
   
    io_rw_32 nak_poll;
   
    io_rw_32 ep_nak_stall_status;
   
    io_rw_32 muxing;
   
    io_rw_32 pwr;
   
    io_rw_32 phy_direct;
   
    io_rw_32 phy_direct_override;
   
    io_rw_32 phy_trim;
   
    io_rw_32 linestate_tuning;
   
    io_ro_32 intr;
   
    io_rw_32 inte;
   
    io_rw_32 intf;
   
    io_ro_32 ints;
    uint32_t _pad0[25];
   
    io_ro_32 sof_timestamp_raw;
   
    io_ro_32 sof_timestamp_last;
   
    io_ro_32 sm_state;
   
    io_rw_32 ep_tx_error;
   
    io_rw_32 ep_rx_error;
   
    io_rw_32 dev_sm_watchdog;
} usb_hw_t;
static usb_hw_t * const usb_hw = (usb_hw_t *)USBCTRL_REGS_BASE; // ORIGINAL: #define usb_hw ((usb_hw_t *)USBCTRL_REGS_BASE)
_Static_assert(sizeof (usb_hw_t) == 0x0118, "");
static __typeof__(io_bank0_hw) const iobank0_hw = io_bank0_hw; // ORIGINAL: #define iobank0_hw io_bank0_hw
#define _HARDWARE_STRUCTS_TBMAN_H 
#define _HARDWARE_REGS_TBMAN_H 
#define TBMAN_PLATFORM_OFFSET 0x00000000u
#define TBMAN_PLATFORM_BITS 0x00000007u
#define TBMAN_PLATFORM_RESET 0x00000001u
#define TBMAN_PLATFORM_HDLSIM_RESET 0x0u
#define TBMAN_PLATFORM_HDLSIM_BITS 0x00000004u
#define TBMAN_PLATFORM_HDLSIM_MSB 2u
#define TBMAN_PLATFORM_HDLSIM_LSB 2u
#define TBMAN_PLATFORM_HDLSIM_ACCESS "RO"
#define TBMAN_PLATFORM_FPGA_RESET 0x0u
#define TBMAN_PLATFORM_FPGA_BITS 0x00000002u
#define TBMAN_PLATFORM_FPGA_MSB 1u
#define TBMAN_PLATFORM_FPGA_LSB 1u
#define TBMAN_PLATFORM_FPGA_ACCESS "RO"
#define TBMAN_PLATFORM_ASIC_RESET 0x1u
#define TBMAN_PLATFORM_ASIC_BITS 0x00000001u
#define TBMAN_PLATFORM_ASIC_MSB 0u
#define TBMAN_PLATFORM_ASIC_LSB 0u
#define TBMAN_PLATFORM_ASIC_ACCESS "RO"
typedef struct {
   
    io_ro_32 platform;
} tbman_hw_t;
static tbman_hw_t * const tbman_hw = (tbman_hw_t *)TBMAN_BASE; // ORIGINAL: #define tbman_hw ((tbman_hw_t *)TBMAN_BASE)
_Static_assert(sizeof (tbman_hw_t) == 0x0004, "");
#define _HARDWARE_STRUCTS_SYSTICK_H 
typedef struct {
   
    io_rw_32 csr;
   
    io_rw_32 rvr;
   
    io_rw_32 cvr;
   
    io_ro_32 calib;
} systick_hw_t;
static systick_hw_t * const systick_hw = (systick_hw_t *)(PPB_BASE + M33_SYST_CSR_OFFSET); // ORIGINAL: #define systick_hw ((systick_hw_t *)(PPB_BASE + M33_SYST_CSR_OFFSET))
static systick_hw_t * const systick_ns_hw = (systick_hw_t *)(PPB_NONSEC_BASE + M33_SYST_CSR_OFFSET); // ORIGINAL: #define systick_ns_hw ((systick_hw_t *)(PPB_NONSEC_BASE + M33_SYST_CSR_OFFSET))
_Static_assert(sizeof (systick_hw_t) == 0x0010, "");
#define _HARDWARE_STRUCTS_GLITCH_DETECTOR_H 
#define _HARDWARE_REGS_GLITCH_DETECTOR_H 
#define GLITCH_DETECTOR_ARM_OFFSET 0x00000000u
#define GLITCH_DETECTOR_ARM_BITS 0x0000ffffu
#define GLITCH_DETECTOR_ARM_RESET 0x00005badu
#define GLITCH_DETECTOR_ARM_MSB 15u
#define GLITCH_DETECTOR_ARM_LSB 0u
#define GLITCH_DETECTOR_ARM_ACCESS "RW"
#define GLITCH_DETECTOR_ARM_VALUE_NO 0x5badu
#define GLITCH_DETECTOR_ARM_VALUE_YES 0x0000u
#define GLITCH_DETECTOR_DISARM_OFFSET 0x00000004u
#define GLITCH_DETECTOR_DISARM_BITS 0x0000ffffu
#define GLITCH_DETECTOR_DISARM_RESET 0x00000000u
#define GLITCH_DETECTOR_DISARM_MSB 15u
#define GLITCH_DETECTOR_DISARM_LSB 0u
#define GLITCH_DETECTOR_DISARM_ACCESS "RW"
#define GLITCH_DETECTOR_DISARM_VALUE_NO 0x0000u
#define GLITCH_DETECTOR_DISARM_VALUE_YES 0xdcafu
#define GLITCH_DETECTOR_SENSITIVITY_OFFSET 0x00000008u
#define GLITCH_DETECTOR_SENSITIVITY_BITS 0xff00ffffu
#define GLITCH_DETECTOR_SENSITIVITY_RESET 0x00000000u
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_RESET 0x00u
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_BITS 0xff000000u
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_MSB 31u
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_LSB 24u
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_VALUE_YES 0x00u
#define GLITCH_DETECTOR_SENSITIVITY_DEFAULT_VALUE_NO 0xdeu
#define GLITCH_DETECTOR_SENSITIVITY_DET3_INV_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_INV_BITS 0x0000c000u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_INV_MSB 15u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_INV_LSB 14u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_INV_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET2_INV_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_INV_BITS 0x00003000u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_INV_MSB 13u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_INV_LSB 12u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_INV_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET1_INV_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_INV_BITS 0x00000c00u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_INV_MSB 11u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_INV_LSB 10u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_INV_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET0_INV_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_INV_BITS 0x00000300u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_INV_MSB 9u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_INV_LSB 8u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_INV_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET3_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_BITS 0x000000c0u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_MSB 7u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_LSB 6u
#define GLITCH_DETECTOR_SENSITIVITY_DET3_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET2_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_BITS 0x00000030u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_MSB 5u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_LSB 4u
#define GLITCH_DETECTOR_SENSITIVITY_DET2_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET1_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_BITS 0x0000000cu
#define GLITCH_DETECTOR_SENSITIVITY_DET1_MSB 3u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_LSB 2u
#define GLITCH_DETECTOR_SENSITIVITY_DET1_ACCESS "RW"
#define GLITCH_DETECTOR_SENSITIVITY_DET0_RESET 0x0u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_BITS 0x00000003u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_MSB 1u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_LSB 0u
#define GLITCH_DETECTOR_SENSITIVITY_DET0_ACCESS "RW"
#define GLITCH_DETECTOR_LOCK_OFFSET 0x0000000cu
#define GLITCH_DETECTOR_LOCK_BITS 0x000000ffu
#define GLITCH_DETECTOR_LOCK_RESET 0x00000000u
#define GLITCH_DETECTOR_LOCK_MSB 7u
#define GLITCH_DETECTOR_LOCK_LSB 0u
#define GLITCH_DETECTOR_LOCK_ACCESS "RW"
#define GLITCH_DETECTOR_TRIG_STATUS_OFFSET 0x00000010u
#define GLITCH_DETECTOR_TRIG_STATUS_BITS 0x0000000fu
#define GLITCH_DETECTOR_TRIG_STATUS_RESET 0x00000000u
#define GLITCH_DETECTOR_TRIG_STATUS_DET3_RESET 0x0u
#define GLITCH_DETECTOR_TRIG_STATUS_DET3_BITS 0x00000008u
#define GLITCH_DETECTOR_TRIG_STATUS_DET3_MSB 3u
#define GLITCH_DETECTOR_TRIG_STATUS_DET3_LSB 3u
#define GLITCH_DETECTOR_TRIG_STATUS_DET3_ACCESS "WC"
#define GLITCH_DETECTOR_TRIG_STATUS_DET2_RESET 0x0u
#define GLITCH_DETECTOR_TRIG_STATUS_DET2_BITS 0x00000004u
#define GLITCH_DETECTOR_TRIG_STATUS_DET2_MSB 2u
#define GLITCH_DETECTOR_TRIG_STATUS_DET2_LSB 2u
#define GLITCH_DETECTOR_TRIG_STATUS_DET2_ACCESS "WC"
#define GLITCH_DETECTOR_TRIG_STATUS_DET1_RESET 0x0u
#define GLITCH_DETECTOR_TRIG_STATUS_DET1_BITS 0x00000002u
#define GLITCH_DETECTOR_TRIG_STATUS_DET1_MSB 1u
#define GLITCH_DETECTOR_TRIG_STATUS_DET1_LSB 1u
#define GLITCH_DETECTOR_TRIG_STATUS_DET1_ACCESS "WC"
#define GLITCH_DETECTOR_TRIG_STATUS_DET0_RESET 0x0u
#define GLITCH_DETECTOR_TRIG_STATUS_DET0_BITS 0x00000001u
#define GLITCH_DETECTOR_TRIG_STATUS_DET0_MSB 0u
#define GLITCH_DETECTOR_TRIG_STATUS_DET0_LSB 0u
#define GLITCH_DETECTOR_TRIG_STATUS_DET0_ACCESS "WC"
#define GLITCH_DETECTOR_TRIG_FORCE_OFFSET 0x00000014u
#define GLITCH_DETECTOR_TRIG_FORCE_BITS 0x0000000fu
#define GLITCH_DETECTOR_TRIG_FORCE_RESET 0x00000000u
#define GLITCH_DETECTOR_TRIG_FORCE_MSB 3u
#define GLITCH_DETECTOR_TRIG_FORCE_LSB 0u
#define GLITCH_DETECTOR_TRIG_FORCE_ACCESS "SC"
typedef struct {
   
    io_rw_32 arm;
   
    io_rw_32 disarm;
   
    io_rw_32 sensitivity;
   
    io_rw_32 lock;
   
    io_rw_32 trig_status;
   
    io_wo_32 trig_force;
} glitch_detector_hw_t;
static glitch_detector_hw_t * const glitch_detector_hw = (glitch_detector_hw_t *)GLITCH_DETECTOR_BASE; // ORIGINAL: #define glitch_detector_hw ((glitch_detector_hw_t *)GLITCH_DETECTOR_BASE)
_Static_assert(sizeof (glitch_detector_hw_t) == 0x0018, "");
#define _HARDWARE_STRUCTS_CORESIGHT_TRACE_H 
#define _HARDWARE_REGS_CORESIGHT_TRACE_H 
#define CORESIGHT_TRACE_CTRL_STATUS_OFFSET 0x00000000u
#define CORESIGHT_TRACE_CTRL_STATUS_BITS 0x00000003u
#define CORESIGHT_TRACE_CTRL_STATUS_RESET 0x00000001u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_OVERFLOW_RESET 0x0u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_OVERFLOW_BITS 0x00000002u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_OVERFLOW_MSB 1u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_OVERFLOW_LSB 1u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_OVERFLOW_ACCESS "RW"
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_FLUSH_RESET 0x1u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_FLUSH_BITS 0x00000001u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_FLUSH_MSB 0u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_FLUSH_LSB 0u
#define CORESIGHT_TRACE_CTRL_STATUS_TRACE_CAPTURE_FIFO_FLUSH_ACCESS "RW"
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_OFFSET 0x00000004u
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_BITS 0xffffffffu
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_RESET 0x00000000u
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_RDATA_RESET 0x00000000u
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_RDATA_BITS 0xffffffffu
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_RDATA_MSB 31u
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_RDATA_LSB 0u
#define CORESIGHT_TRACE_TRACE_CAPTURE_FIFO_RDATA_ACCESS "RF"
typedef struct {
   
