gonzalolarralde/CPicoSDK/Sources/_CPicoSDK_pimoroni_pico_plus2_rp2350/include/CPicoSDK_pimoroni_pico_plus2_rp2350.h
    io_rw_32 ctrl_status;
   
    io_ro_32 trace_capture_fifo;
} coresight_trace_hw_t;
static coresight_trace_hw_t * const coresight_trace_hw = (coresight_trace_hw_t *)CORESIGHT_TRACE_BASE; // ORIGINAL: #define coresight_trace_hw ((coresight_trace_hw_t *)CORESIGHT_TRACE_BASE)
_Static_assert(sizeof (coresight_trace_hw_t) == 0x0008, "");
#define _HARDWARE_STRUCTS_HSTX_FIFO_H 
#define _HARDWARE_REGS_HSTX_FIFO_H 
#define HSTX_FIFO_STAT_OFFSET 0x00000000u
#define HSTX_FIFO_STAT_BITS 0x000007ffu
#define HSTX_FIFO_STAT_RESET 0x00000000u
#define HSTX_FIFO_STAT_WOF_RESET 0x0u
#define HSTX_FIFO_STAT_WOF_BITS 0x00000400u
#define HSTX_FIFO_STAT_WOF_MSB 10u
#define HSTX_FIFO_STAT_WOF_LSB 10u
#define HSTX_FIFO_STAT_WOF_ACCESS "WC"
#define HSTX_FIFO_STAT_EMPTY_RESET "-"
#define HSTX_FIFO_STAT_EMPTY_BITS 0x00000200u
#define HSTX_FIFO_STAT_EMPTY_MSB 9u
#define HSTX_FIFO_STAT_EMPTY_LSB 9u
#define HSTX_FIFO_STAT_EMPTY_ACCESS "RO"
#define HSTX_FIFO_STAT_FULL_RESET "-"
#define HSTX_FIFO_STAT_FULL_BITS 0x00000100u
#define HSTX_FIFO_STAT_FULL_MSB 8u
#define HSTX_FIFO_STAT_FULL_LSB 8u
#define HSTX_FIFO_STAT_FULL_ACCESS "RO"
#define HSTX_FIFO_STAT_LEVEL_RESET 0x00u
#define HSTX_FIFO_STAT_LEVEL_BITS 0x000000ffu
#define HSTX_FIFO_STAT_LEVEL_MSB 7u
#define HSTX_FIFO_STAT_LEVEL_LSB 0u
#define HSTX_FIFO_STAT_LEVEL_ACCESS "RO"
#define HSTX_FIFO_FIFO_OFFSET 0x00000004u
#define HSTX_FIFO_FIFO_BITS 0xffffffffu
#define HSTX_FIFO_FIFO_RESET 0x00000000u
#define HSTX_FIFO_FIFO_MSB 31u
#define HSTX_FIFO_FIFO_LSB 0u
#define HSTX_FIFO_FIFO_ACCESS "WF"
typedef struct {
   
    io_rw_32 stat;
   
    io_wo_32 fifo;
} hstx_fifo_hw_t;
static hstx_fifo_hw_t * const hstx_fifo_hw = (hstx_fifo_hw_t *)HSTX_FIFO_BASE; // ORIGINAL: #define hstx_fifo_hw ((hstx_fifo_hw_t *)HSTX_FIFO_BASE)
_Static_assert(sizeof (hstx_fifo_hw_t) == 0x0008, "");
